Repository: centreon/centreon-archived
Catalog: lang/*/LC_MESSAGES/help.po
Languages: pt_pt

source: This option determines whether or not Monitoring Engine will periodically check the "freshness" of host checks. Enabling this option is useful for helping to ensure that passive host checks are received in a timely manner. If the check results is found to be not fresh, Monitoring Engine will force an active check of the host or service by executing the command specified by in the host or service definition. This option is enabled by default.
pt_pt: Essa opção determina se o mecanismo de gerenciamento verificará periodicamente o "frescor" das verificações de convidado. Habilitar essa opção é muito útil para garantir que as verificações passivas de convidados sejam recebidas em tempo hábil. Se os resultados da verificação forem inválidos, o mecanismo de monitoramento forçará um controle ativo do host ou serviço, executando o comando especificado pelo host ou pela definição de serviço. Esta opção está ativada por padrão.

source: This setting determines how often (in seconds) Monitoring Engine will periodically check the "freshness" of host check results. If you have disabled host freshness checking (with the check_host_freshness option), this option has no effect.
pt_pt: Esse parâmetro determina a frequência (em segundos) que o mecanismo de monitoramento verificará periodicamente a atualização dos resultados das verificações de convidado. Se você desativou a verificação de verificação legal do host (com a opção check_host_freshness), essa opção não tem efeito.

source: This option determines the number of seconds Monitoring Engine will add to any host or services freshness threshold it automatically calculates (e.g. those not specified explicitly by the user).
pt_pt: Isso determina o número de segundos que o mecanismo de monitoramento irá adicionar como atualização calcula automaticamente limiar qu`il para todos os hosts ou serviços (por exemplo, aqueles que não n`ont explicitamente especificado pelo l`utilisateur).

source: This option allows you to specify what kind of date/time format Monitoring Engine should use in the web interface and date/time macros.
pt_pt: Essa opção permite especificar o formato de data / hora que o mecanismo de gerenciamento usará na interface da Web e nas macros de data / hora.

source: This is the email address for the administrator of the local machine (i.e. the one that Monitoring Engine is running on). This value can be used in notification commands by using the $ADMINEMAIL$ macro.
pt_pt: Este é o endereço de e-mail do administrador local da máquina (aquele em que o mecanismo de supervisão é executado). Esse valor pode ser usado em comandos de notificação com a macro $ ADMINEMAIL $.

source: This is the pager number (or pager email gateway) for the administrator of the local machine (i.e. the one that Monitoring Engine is running on). The pager number/address can be used in notification commands by using the $ADMINPAGER$ macro.
pt_pt: Este é o número do pager (ou o gateway do pager-email) do administrador da máquina local (aquele em que o mecanismo de supervisão é executado). O número ou o endereço do pager pode ser usado nos comandos de notificação graças à macro $ ADMINPAGER $.

source: This option allows you to specify illegal characters that cannot be used in host names, service descriptions, or names of other object types. Monitoring Engine will allow you to use most characters in object definitions, but I recommend not using the characters set by default. Doing may give you problems in the web interface, notification commands, etc.
pt_pt: Esta opção permite que você especifique quais caracteres ilegais não podem ser usados ​​em nomes de host, descrições de serviço ou nomes de outros tipos de objetos. O mecanismo de supervisão permitirá a maioria dos caracteres nas definições de objetos, mas eu recomendo que você não use os caracteres padrão. Isso expõe a problemas na interface da Web, solicita notificações e assim por diante.

source: This option allows you to specify illegal characters that should be stripped from macros before being used in notifications, event handlers, and other commands. This DOES NOT affect macros used in service or host check commands. Some of these characters are interpreted by the shell (i.e. the backtick) and can lead to security problems.
pt_pt: Essa opção permite que você especifique caracteres ilegais que precisarão ser removidos das macros antes de serem usados ​​em notificações, tratamento de eventos e outros comandos. Isso não afeta as macros usadas nos comandos de verificação de serviço e host. Alguns desses caracteres são interpretados pelo terminal (por exemplo, o sotaque grave) e podem levar a problemas de segurança.

source: This option determines whether or not various directives in your object definitions will be processed as regular expressions. More information on how this works can be found in Monitoring Engine section on object tricks. This option is disabled by default.
pt_pt: Esta opção determina se as configurações nas suas definições de objeto serão tratadas como expressões regulares. Mais informações sobre a operação podem ser encontradas na documentação do mecanismo de supervisão na seção de dicas e truques dos objetos. Esta opção está desativada por padrão.

source: If you've enabled regular expression matching of various object directives using the use_regexp_matching option, this option will determine when object directives are treated as regular expressions. If this option is disabled (the default), directives will only be treated as regular expressions if they contain *, ?, +, or \.. If this option is enabled, all appropriate directives will be treated as regular expression.
pt_pt: Se você tiver ativado a correspondência de expressões regulares, essa opção determinará quando os parâmetros serão tratados como expressões regulares. Se esta opção estiver desabilitada (padrão), os parâmetros serão tratados como regexps apenas se eles contiverem um *,? ,, ou \ Se esta opção for ativada, todos os parâmetros serão tratados como expressões regulares.

source: This option controls what (if any) data gets sent to the event broker and, in turn, to any loaded event broker module. Centreon relies heavily on the broker and needs this value to be set as -1.
pt_pt: Esta opção controla que os dados (se múltiplos) serão enviados para o agente de eventos e, em seguida, carregados no módulo do agente de eventos. O Centreon depende muito do broker e precisa que esse valor seja definido como -1.

source: This directive is used to specify an event broker module that should by loaded by Monitoring Engine at startup. Use multiple directives if you want to load more than one module. Arguments that should be passed to the module at startup are separated from the module path by a space.
pt_pt: Esse parâmetro é usado para especificar o módulo do agente de eventos para que ele seja carregado ao iniciar o mecanismo de supervisão. Muitos desses mesmos parâmetros podem ser usados ​​se você quiser carregar mais de um. Os argumentos passados ​​para o módulo serão separados por um espaço.

source: This option determines whether or not Monitoring Engine will execute predictive checks of hosts that are being depended upon (as defined in host dependencies) for a particular host when it changes state. Predictive checks help ensure that the dependency logic is as accurate as possible. This option is enabled by default.
pt_pt: Essa opção determina se o mecanismo de monitoramento executará ou não controles preditivos em hosts dependentes (conforme definido nas dependências do host) de um host específico quando esse host mudar de estado. Os controles preditivos ajudam a garantir que a lógica de dependência seja a mais precisa possível. Esta opção está ativada por padrão.

source: This option determines whether or not Monitoring Engine will execute predictive checks of services that are being depended upon (as defined in service dependencies) for a particular service when it changes state. Predictive checks help ensure that the dependency logic is as accurate as possible. More information on how predictive checks work can be found here. This option is enabled by default.
pt_pt: Essa opção determina se o mecanismo de monitoramento executará ou não controles preditivos em serviços dependentes (conforme definido nas dependências de serviço) para um serviço específico quando esse serviço mudar de estado. Os controles preditivos ajudam a garantir que a lógica de dependência seja a mais precisa possível. Mais informações sobre a operação dos controles preditivos podem ser encontradas na documentação do mecanismo de supervisão. Esta opção está ativada por padrão.

source: This option determines the maximum amount of time (in seconds) that the state of a previous host check is considered current. Cached host states (from host checks that were performed more recently than the time specified by this value) can improve host check performance immensely. Too high of a value for this option may result in (temporarily) inaccurate host states, while a low value may result in a performance hit for host checks. Use a value of 0 if you want to disable host check caching.
pt_pt: Esta opção determina o tempo máximo (em segundos) para o estado de um controle de host anterior a ser considerado atual. O cache de estados do host (do ponto de vista de verificações de host que foram executadas mais recentemente do que o tempo especificado por este valor) pode melhorar drasticamente o desempenho das verificações de convidado. Um valor que é muito alto para essa opção pode resultar em estados de host (temporariamente) incorretos, enquanto um valor que é muito baixo resultará em colapso de desempenho para verificações de host. Use o valor 0 para desativar o cache de controle do host.

source: This option determines the maximum amount of time (in seconds) that the state of a previous service check is considered current. Cached service states (from service checks that were performed more recently than the time specified by this value) can improve service check performance when a lot of service dependencies are used. Too high of a value for this option may result in inaccuracies in the service dependency logic. Use a value of 0 if you want to disable service check caching.
pt_pt: Esta opção define o tempo máximo (em segundos) para o estado de uma verificação de serviço anterior a ser considerada atual. A tampa d`état serviço (Para o controlo de serviço efectuadas antecipadamente de l`intervalle especificada por este valor) pode melhorar o desempenho dos controlos quando um número significativo de dependências de serviço é utilizada. Um valor que é muito alto para essa opção resultará em uma falta de precisão na lógica de dependência de serviço. Defina esse valor como 0 se você deseja desativar o cache de controle de serviço.

source: This option determines whether or not the Monitoring Engine daemon will take several shortcuts to improve performance. These shortcuts result in the loss of a few features, but larger installations will likely see a lot of benefit from doing so. This option is disabled by default.
pt_pt: Esta opção determina se o mecanismo de monitoramento usará atalhos diferentes para melhorar o desempenho. Esses atalhos perdem alguns recursos, mas trazem grandes ganhos em grandes ambientes. Esta opção está desativada por padrão.

source: This option determines whether or not Monitoring Engine will free memory in child processes when they are fork()ed off from the main process. By default, Monitoring Engine frees memory. However, if the use_large_installation_tweaks option is enabled, it will not. By defining this option in your configuration file, you are able to override things to get the behavior you want.
pt_pt: Essa opção determina se o mecanismo de monitoramento liberará memória usada pelos processos filhos quando eles chegarem ao final do processamento. Por padrão, o mecanismo de gerenciamento libera a memória. No entanto, se a opção use_large_installation_tweaks estiver ativada, ela somente será bifurcada. Ao declarar essa opção no seu ficheiro de configuração, você tem a opção de alterar esse comportamento.

source: This option determines whether or not Monitoring Engine will fork() child processes twice when it executes host and service checks. By default, Monitoring Engine fork()s twice. However, if the use_large_installation_tweaks option is enabled, it will only fork() once. By defining this option in your configuration file, you are able to override things to get the behavior you want.
pt_pt: Essa opção determina se o mecanismo de monitoramento deve duplicar seu processo ou não duplicar os processos filhos quando executar verificações de host e serviço. Por padrão, o mecanismo de gerenciamento de garfos duplica. No entanto, se a opção use_large_installation_tweaks estiver ativada, ela somente será bifurcada. Ao declarar essa opção no seu ficheiro de configuração, você tem a opção de alterar esse comportamento.

source: This option determines whether or not the Monitoring Engine daemon will make all standard macros available as environment variables to your check, notification, event hander, etc. commands. In large Monitoring Engine installations this can be problematic because it takes additional memory and (more importantly) CPU to compute the values of all macros and make them available to the environment. This option is enabled by default.
pt_pt: Esta opção determina se o daemon do supervisor engine pode considerar todas as macros padrão como variáveis ​​de ambiente para seus controles, notificações, acionador de eventos e assim por diante. Comandos. Em ambientes muito grandes, isso pode ser problemático porque a memória adicional e o uso da CPU são úteis para converter essas macros em variáveis ​​de ambiente. Esta opção está ativada por padrão.

source: Only works with Centreon Engine (>= 1.3). For better performance, set this to 'No'. But it is safer to leave it to 'Default' ('Yes'), for a few native plugins could trigger a monitoring crash.
pt_pt: Esta opção, compatível apenas com uma versão do Centreon Engine> = 1.3, permite separar os processos filhos do processo principal. É melhor deixar essa opção em "Padrão".

source: This option determines where Monitoring Engine should write debugging information. What (if any) information is written is determined by the debug_level and debug_verbosity options. You can have Monitoring Engine automaticaly rotate the debug file when it reaches a certain size by using the max_debug_file_size option.
pt_pt: Esta opção determina se o mecanismo de gerenciamento pode gravar informações de depuração. A precisão das informações que o mecanismo de supervisão grava depende das opções debug_level e debug_verbosity. Você pode gerenciar automaticamente a rotação do ficheiro de depuração com base em seu tamanho usando a opção max_debug_file_size.

source: This option determines the maximum size (in bytes) of the debug file. If the file grows larger than this size, it will be renamed with a .old extension. If a file already exists with a .old extension it will automatically be deleted. This helps ensure your disk space usage doesn't get out of control when debugging Monitoring Engine.
pt_pt: Esta opção determina o tamanho máximo (em bytes) do ficheiro de depuração.Se o ficheiro exceder o tamanho especificado, ele será renomeado com uma extensão .old. Se o ficheiro .old já existir, ele será automaticamente excluído. Essa opção permite manter um controle sobre o espaço em disco que o mecanismo de gerenciamento executa quando está no modo de depuração.

source: This option allows dumping core in case a segmentation fault occurs. Warning: Make sure that server has sufficient disk space for these dumps (ulimit). This option is discarded when using Centreon Engine.
pt_pt: Esta opção permite a criação de um ficheiro de depuração se ocorrer um erro de segmentação. Aviso: Certifique-se de que o servidor tenha espaço em disco suficiente para esses ficheiros (ulimit). Essa opção não pode ser usada com o planejador do Centreon Engine.

source: This option determines how much debugging information Monitoring Engine should write to the debug_file. By default the verbosity is set to level 1.
pt_pt: Essa opção determina a quantidade de informações de depuração que o mecanismo de gerenciamento deve gravar no ficheiro de depuração. Por padrão, o detalhamento é definido como 1.

source: This option determines what type of information Monitoring Engine should write to the debug_file.
pt_pt: Essa opção determina o tipo de informação que o mecanismo de gerenciamento deve gravar no ficheiro de depuração.

source: Description or name used to identify this configuration set.
pt_pt: Descrição ou nome usado para identificar essa configuração.

source: Specify whether this configuration is currently active or not. This way you can test different configuration sets for one monitoring node.
pt_pt: Especifica se esta configuração está atualmente ativa ou não. Dessa forma, você pode testar diferentes configurações para um único nó de supervisão.

source: Choose the Monitoring Engine server instance this configuration is defined for.
pt_pt: Escolha a instância do mecanismo de monitoramento que é definido para essa configuração.

source: Enable the possibility to log pid information in engine log file (option only for Centreon Engine)
pt_pt: Permite a capacidade de registrar o PID do processo no log de eventos do mecanismo de supervisor. Esta opção só funciona para o motor Centreon.

source: This option enable or disable compatibility mode to use check result path.
pt_pt: Essa opção torna o mecanismo do Mecanismo Centreon compatível com módulos de terceiros, como MKLiveStatus e Mod_Gearman.

source: Define a short name for this dependency.
pt_pt: Define um nome curto para essa dependência.

source: Define a description for this dependency for easier identification and differentiation.
pt_pt: Define uma descrição para essa dependência para identificá-la e diferenciá-la com mais facilidade.

source: This directive indicates whether or not the dependency inherits dependencies of the host that is being depended upon (also referred to as the master host). In other words, if the master host is dependent upon other hosts and any one of those dependencies fail, this dependency will also fail.
pt_pt: Essa variável indica se a dependência herda dependências do host do qual dependemos (também chamado de host mestre). Em outras palavras, se o host mestre for dependente de vários outros hosts e uma dessas dependências falhar, essa dependência também falhará.

source: Ignored by Centreon Engine.
pt_pt: Ignorado pelo Centreon Engine.

source: This directive is used to specify the criteria that determine when the dependent host should not be actively checked. If the master host is in one of the failure states we specify, the dependent host will not be actively checked. If you specify None as an option, the execution dependency will never fail and the dependent host will always be actively checked (if other conditions allow for it to be).
pt_pt: Essa variável é usada para especificar os critérios que determinam quando o host dependente não deve ser controlado ativamente. Se o host principal estiver em um estado de erro que especificamos, o host dependente não será controlado ativamente. Se a opção especificada for "Nenhum", a execução da dependência nunca falhará e o host dependente será sempre controlado ativamente (se outras condições permitirem que ele seja).

source: This directive is used to define the criteria that determine when notifications for the dependent host should not be sent out. If the master host is in one of the failure states we specify, notifications for the dependent host will not be sent to contacts. If you specify None as an option, the notification dependency will never fail and notifications for the dependent host will always be sent out.
pt_pt: Essa variável é usada para definir os critérios que determinam quando as notificações para o host dependente não devem ser enviadas. Se o host mestre estiver em um dos estados de erro que especificamos, as notificações para o host dependente não serão enviadas para os contactos. Se você não especificar nenhuma opção, a execução da dependência nunca falhará e o host dependente será sempre controlado ativamente (se outras condições permitirem que ele esteja).

source: This directive is used to identify the short name(s) of the host(s) that is being depended upon (also referred to as the master host).
pt_pt: Esse parâmetro é usado para identificar o (s) nome (s) abreviado (s) do (s) host (s) dependente (s) (também chamado de host mestre).

source: This directive is used to identify the short name(s) of the hostgroup(s) that is being depended upon (also referred to as the master host). The hostgroup_name may be used instead of, or in addition to, the host_name directive.
pt_pt: Este parâmetro é usado para identificar o (s) nome (s) abreviado (s) de grupos de hosts dependentes (também chamado de host mestre). O parâmetro hostgroup_name pode ser usado no lugar ou em conjunto com a variável host_name.

source: This directive is used to identify the dependent host(s).
pt_pt: Esse parâmetro é usado para identificar o host ou os hosts dependentes.

source: This directive is used to identify the short name(s) of the dependent hostgroup(s). The dependent_hostgroup_name may be used instead of, or in addition to, the dependent_host_name directive.
pt_pt: Esse parâmetro é usado para identificar os nomes abreviados dos grupos de hosts dependentes. O parâmetro dependent_hostgroup_name pode ser usado no lugar ou em conjunto com a variável dependent_host_name.

source: This directive is used to specify the short name of the time period during which this dependency is valid. If this directive is not specified, the dependency is considered to be valid during all times.
pt_pt: Essa diretiva é usada para especificar o nome abreviado do período durante o qual as dependências são válidas. Se esta diretiva não for especificada, a dependência é considerada válida o tempo todo.

source: This directive is used to identify the description of the dependent service.
pt_pt: Essa variável é usada para identificar a descrição de um serviço dependente.

source: Compatible with Centreon Broker only.
pt_pt: Compatível apenas com o Centreon Broker.

source: Define a short name for this category. It will be displayed with this name in the ACL configuration.
pt_pt: Define um nome curto para esta categoria. Ele será exibido com esse nome na configuração do ACL.

source: Use this field for a longer description of this category.
pt_pt: Use este campo para uma descrição mais longa desta categoria.

source: Select the hosts that this category is linked to.
pt_pt: Selecione os hosts para vincular a esta categoria.

source: Select the host templates that this category is linked to.
pt_pt: Selecione os modelos de host para vincular a esta categoria.

source: Whether this category is a severity. Severities appear on the monitoring consoles.
pt_pt: Se a categoria for uma criticidade, ela aparecerá no Console de Supervisão em Tempo Real.

source: Severity level, must be a number. The items displayed will be sorted in ascending order. Thus the lowest severity is considered than the highest priority.
pt_pt: Nível de gravidade, deve ser um número. Os itens exibidos serão classificados em ordem crescente. Assim, a criticidade mais baixa é considerada de alta prioridade.

source: Icon for this severity.
pt_pt: Ícone para severidade

source: Whether or not this category is enabled.
pt_pt: Esta categoria está ativa.

source: Comment regarding this category.
pt_pt: Comentários sobre esta categoria.
