Repository: centreon/centreon-archived
Catalog: lang/*/LC_MESSAGES/help.po
Languages: pt_pt

source: The linked contacts define a list of contacts that should be included in this group. This definition is an alternative way to specifying the contact groups in contact definitions.
pt_pt: Os contactos vinculados definem uma lista de contactos que devem ser incluídos nesse grupo. Essa definição é uma maneira alternativa de especificar grupos de contactos nas definições de contacto.

source: Refers to the ACL groups this contact group is linked to. This parameter is mandatory if you are not an administrator.
pt_pt: Refere-se aos grupos de acesso aos quais este grupo de contactos está vinculado. Este parâmetro é obrigatório se você não for um administrador.

source: This optional directive can be used to include contacts from other "sub" contact groups in this contact group. Specify a list of other contact groups whose members should be included in this group.
pt_pt: Essa diretiva opcional pode ser usada para incluir contactos de outros grupos de contacto "abaixo" nesse grupo de contactos. Especifica uma lista com outros grupos de contactos cujos membros devem ser incluídos nesse grupo.

source: Generate a light database for traps.
pt_pt: Gera um pequeno base de dados (SQLite) contendo a definição de traps SNMP para coletores de monitoramento remoto.

source: Push database to poller.
pt_pt: Envie o base de dados para o coletor

source: Send restart or reload signal to centreontrapd.
pt_pt: Envie um sinal de reinicialização ou recarregamento para centerontrapd

source: Poller to interact with.
pt_pt: Coletor remoto no qual executar as operações.

source: Category filter for flux in output
pt_pt: Filtra os dados recebidos por categoria de fluxo de entrada.

source: When enabled, the broker engine will check whether or not the replication is up to date before attempting to update data.
pt_pt: Se ativado, o Centreon Broker verificará o status da replicação do MySQL antes de inserir os dados.

source: File for external commands
pt_pt: Ficheiro de comando externo

source: The higher the buffer size is, the best compression. This however increase data streaming latency. Use with caution.
pt_pt: Quanto maior o tamanho do cache, melhor a compactação. Isso, no entanto, aumenta a latência de transmissão de dados. Use com cuidado.

source: Whether or not Broker should create entries in the index_data table. This process should be done by Centreon and this option should only be enabled by advanced users knowing what they're doing
pt_pt: Ativa ou desativa a inserção de dados na tabela "index_data". Este processo é normalmente feito pelo Centreon e a modificação desta opção deve ser feita conscientemente.

source: The Unix socket used to communicate with rrdcached. This is a global option, go to Administration > Options > RRDTool to modify it.
pt_pt: Caminho do soquete Unix para se comunicar com o processo RRDCacheD. Esta opção é definida globalmente no menu "Administração> Opções> RRDTool".

source: The TCP port used to communicate with rrdcached. This is a global option, go to Administration > Options > RRDTool to modify it.
pt_pt: Porta de conexão para se comunicar com o processo RRDCacheD. Esta opção é definida globalmente no menu "Administração> Opções> RRDTool".

source: It should be enabled to control whether or not Centreon Broker should insert performance data in the data_bin table.
pt_pt: Deve ser ativado para o módulo do Centreon Broker inserir dados desempenho do base de dados na tabela "data_bin".

source: Used for identifying the poller
pt_pt: Usado para identificar o coletor

source: IP address of the poller
pt_pt: Endereço IP do coletor

source: Whether the poller is local
pt_pt: Se o coletor é local

source: Main poller
pt_pt: Coletor principal

source: SSH port of the remote poller
pt_pt: Porta SSH do coletor remoto

source: Monitoring engine
pt_pt: Motor de supervisão

source: Path of init script of the scheduler
pt_pt: Iniciar caminho do script do agendador

source: Path of init script of centreontrapd
pt_pt: Inicie o caminho do script do processo centreontrapd

source: Path of binary of the scheduler
pt_pt: O caminho binário do agendador

source: Path of stats binary of the scheduler
pt_pt: Caminho do binário estatístico do agendador

source: Perfdata script
pt_pt: Script para dados de desempenho

source: Path of the configuration file for Centreon Broker
pt_pt: Caminho para o ficheiro de configuração do Centreon Broker

source: Path with modules for Centreon Broker
pt_pt: Caminho para os Módulos do Broker Centreon

source: Path with Centreon Connector binaries
pt_pt: Caminho para os conectores do Centreon

source: Enable or disable poller
pt_pt: Ativar ou desativar o coletor

source: Centreontrapd init script to restart process on poller.
pt_pt: Script de inicialização do processo Centreontrapd para reiniciá-lo no coletor.

source: Light databases will be stored in the specified directory. They are used for synchronizing trap definitions on pollers.
pt_pt: Bancos de dados reduzidos são salvos em um diretório dedicado. Eles são usados ​​para sincronizar a configuração de traps SNMP para um coletor remoto.

source: Those commands can be executed at the end of the file generation generation/restart process. Do not specify macros in the commands, for they will not be replaced. Make sure to have sufficient rights for the Apache user to run these commands.
pt_pt: Esses comandos são executados no final da geração da configuração de supervisão e após o reinício do mecanismo de coleta. Não especifique macros após este comando porque elas não serão sobrescritas. Verifique se os direitos de execução são suficientes para o utilizador "apache".

source: Short description of the poller
pt_pt: Breve descrição do coletor

source: The name of the recurrent downtime rule.
pt_pt: O nome da regra de tempo de inatividade recorrente.

source: Description of the downtime
pt_pt: Descrição do tempo de parada

source: Option to enable or disable this downtime
pt_pt: Opção para ativar e desativar o tempo de parada

source: This field give the possibility to configure the frequency of this downtime.
pt_pt: Este campo oferece a possibilidade de configurar a frequência deste tempo de parada.

source: This field give you the possibility to select all hosts implied by this downtime
pt_pt: Este campo lhe dá a possibilidade de selecionar todos os hosts implicados por este tempo de inatividade

source: This field give you the possibility to select all hostgroups and all hosts contained into the selected hostgroups implied by this downtime
pt_pt: Esse campo oferece a possibilidade de escolher todos os grupos de hosts e todos os hosts contidos no grupo de hosts selecionado envolvidos por esse tempo de parada

source: This field give you the possibility to select all services implied by this downtime
pt_pt: Este campo lhe dá a oportunidade de escolher todos os serviços envolvidos por este tempo de parada

source: This field give you the possibility to select all servicegroups and all services contained into the servicegroups implied by this downtime
pt_pt: Esse campo oferece a oportunidade de escolher todos os grupos de serviços e serviços contidos no grupo de serviços selecionado envolvido nesse tempo de inatividade

source: Select the poller you would like to interact with.
pt_pt: Selecione um coletor com o qual você deseja interagir.

source: Generates configuration files and stores them in centreon/filesGeneration directory.
pt_pt: Gera ficheiros de configuração e os armazena no diretório centreon/filesGeneration.

source: Runs the scheduler debug mode.
pt_pt: Inicie o modo de depuração do agendador.

source: Copies the generated files into the scheduler's configuration folder.
pt_pt: Copie os ficheiros gerados no diretório de configuração do planejador.

source: Restart the scheduler: Restart, Reload or External Command.
pt_pt: Método de atualização de configuração: Reiniciar, Recarregar ou Comando Externo.

source: Run the commands that are defined in the poller configuration page (Configuration > Centreon > Poller > Post-Restart command).
pt_pt: Executa o comando definido na configuração do coletor (Configuração> Centreon> Poller> comando Post-Restart).
