Repository: centreon/centreon-archived
Catalog: lang/*/LC_MESSAGES/help.po
Languages: pt_pt

source: Database name.
pt_pt: Nome do base de dados

source: Database user.
pt_pt: Conta de utilizador para se conectar ao base de dados

source: Enable TLS encryption.
pt_pt: Permite a criptografia de dados por meio do protocolo TLS.

source: Enable caching
pt_pt: Ativa Cache

source: Enable negotiation option (use only for version of Centren Broker >= 2.5)
pt_pt: Ative a negociação automática de protocolo entre os módulos do Centreon Broker (Centreon Broker deve ser versão> = 2.5).

source: Enable or not configuration messages logging.
pt_pt: Ativa ou desativa eventos de configuração no log.

source: Enable or not data stream compression.
pt_pt: Ativar ou desativar a compactação do fluxo de dados.

source: Enable or not debug messages logging.
pt_pt: Ativa ou desativa eventos de depuração no log.

source: Enable or not error messages logging.
pt_pt: Ativa ou desativa eventos de erro no log.

source: Enable or not informational messages logging.
pt_pt: Ativa ou desativa eventos de informações no log.

source: File where Centreon Broker statistics will be stored
pt_pt: Ficheiro no qual os dados estatísticos de operação do módulo Centreon Broker serão armazenados.

source: File where correlation state will be stored during correlation engine restart
pt_pt: Ficheiro de retenção de dados de correlação que será usado ao reiniciar o mecanismo de monitoramento.

source: For a file logger this is the path to the file. For a standard logger, one of 'stdout' or 'stderr'.
pt_pt: Caminho para o log de eventos. Para visualizar eventos na saída padrão, selecione "stdout" ou "stderr".

source: How much messages must be logged.
pt_pt: Quantas mensagens devem ser registradas no log de eventos.

source: IP address or hostname of the database server.
pt_pt: Endereço IP ou FQDN para acessar o servidor do base de dados.

source: IP address or hostname of the host to connect to (leave blank for listening mode).
pt_pt: Endereço IP ou FQDN para conectar (deixe em branco para listar o módulo nesta porta).

source: Interval in seconds before change status of resources from a disconnected poller
pt_pt: Intervalo em segundos antes de alterar o status dos recursos supervisionados pelo coletor desconectado.

source: Interval in seconds before delete data from deleted pollers.
pt_pt: O intervalo em segundos antes de excluir dados relacionados aos coletores excluídos.

source: Interval length in seconds.
pt_pt: Unidade de tempo de referência (em segundos).

source: It should be enabled to control whether or not Centreon Broker should insert performance data in the data_bin table.
pt_pt: Ele deve ser ativado para controlar se o Centreon Broker deve ou não inserir dados de desempenho na tabela data_bin.

source: Maximum size in bytes.
pt_pt: Tamanho máximo em bytes.

source: Name of the input or output object that will act as failover.
pt_pt: O nome do objeto que será usado para o failover quando a conexão remota definida aqui for interrompida.

source: Password of database user.
pt_pt: Palavra-passe associada à conta de acesso ao base de dados.

source: Path to the correlation file which holds host, services, dependencies and parenting definitions.
pt_pt: Caminho para o ficheiro de correlação que contém a definição de dependências de host, serviços e relacionamentos de host físico.

source: Path to the file.
pt_pt: Caminho para o ficheiro.

source: Port on which the DB server listens
pt_pt: Porto de conexão ao base de dados

source: Port to listen on (empty host) or to connect to (with host filled).
pt_pt: Porta na qual ouvir (no caso de nenhum endereço remoto ter sido inserido) ou para conectar (se um endereço remoto tiver sido inserido).

source: Private key file path when TLS encryption is used.
pt_pt: Caminho do ficheiro de chave privada quando a criptografia TLS é usada.

source: Public certificate file path when TLS encryption is used.
pt_pt: Caminho do ficheiro de certificado público quando a criptografia TLS é usada.

source: RRD file directory, for example /var/lib/centreon/metrics
pt_pt: Caminho para os bancos de dados de desempenho do RRD, por exemplo, / var / lib / centreon / metrics

source: RRD file directory, for example /var/lib/centreon/status
pt_pt: Caminho de acesso aos bancos de dados de status do RRD, por exemplo, / var / lib / centreon / status

source: RRD storage duration in seconds.
pt_pt: Tempo de retenção em minutos para armazenar dados em bancos de dados de RRD.

source: Ranges from 0 (no compression) to 9 (best compression). Default is -1 (zlib compression)
pt_pt: Nível de compactação do fluxo de dados: 0 (sem compactação) a 9 (melhor compactação). Padrão -1 (compactação zlib padrão).

source: Serialization protocol.
pt_pt: Protocolo de serialização de dados

source: Target DBMS.
pt_pt: Tipo de base de dados.

source: The TCP port used to communicate with rrdcached. This is a global option, go to Administration > Options > RRDTool to modify it.
pt_pt: Porta de conexão para se comunicar com o processo RRDCacheD. Esta opção é definida globalmente no menu "Administração> Opções> RRDTool".

source: The Unix socket used to communicate with rrdcached. This is a global option, go to Administration > Options > RRDTool to modify it.
pt_pt: Caminho do soquete Unix para se comunicar com o processo RRDCacheD. Esta opção é definida globalmente no menu "Administração> Opções> RRDTool".

source: The higher the buffer size is, the best compression. This however increase data streaming latency. Use with caution.
pt_pt: Quanto maior o espaço de memória alocado para compactação, melhor será o mecanismo de compactação. No entanto, os dados são enviados quando o limite de cache é atingido, o que pode adicionar um pouco de latência antes de enviar os dados. Use com cuidado.

source: The interval between check if some metrics must be rebuild. The default value is 300s
pt_pt: O intervalo de tempo entre dois módulos do Centreon Broker RRD é verificado para recuperar as diretrizes de reconstrução do gráfico de desempenho. Por padrão, esse valor é definido como 300s.

source: The maximum queries per transaction before commit.
pt_pt: Número máximo de solicitações por transação antes da validação de confirmação.

source: The maximum size of log file.
pt_pt: Tamanho máximo do ficheiro de log do módulo.

source: The passive mode is for the secondary Centreon Broker.
pt_pt: Caminho para os módulos do Centreon Broker

source: The transaction timeout before running commit.
pt_pt: Designa o tempo máximo de uma transação antes de validar a inserção dos dados (commit).

source: This allows the retention to work even if the socket is listening
pt_pt: Permite que você mantenha dados até que uma conexão de entrada os recupere.

source: This can be used to disable graph update and therefore reduce I/O
pt_pt: Essa opção pode ser usada para desativar a atualização de gráficos de desempenho para reduzir a E / S de disco.

source: Time in seconds to wait before launching failover.
pt_pt: Tempo em segundos a aguardar antes de ativar o failover.

source: Time in seconds to wait between each connection attempt.
pt_pt: Tempo de espera em segundos entre cada tentativa de conexão.

source: Trusted CA's certificate.
pt_pt: Certificado CA (certificado de uma autoridade de certificação)

source: When enabled, the broker engine will check whether or not the replication is up to date before attempting to update data.
pt_pt: Permite que o módulo Centreon Broker verifique o status da replicação do MySQL (se implementada) antes de tentar inserir dados no base de dados.

source: Whether or not Broker should create entries in the index_data table. This process should be done by Centreon and this option should only be enabled by advanced users knowing what they\'re doing
pt_pt: Ativa ou desativa a inserção de dados na tabela "index_data". Este processo é normalmente feito pelo Centreon e a modificação desta opção deve ser feita conscientemente.

source: Enable Perfdata synchronisation between poller and Central Server operated by Centcore
pt_pt: Permite a sincronização de dados de desempenho entre os coletores e o servidor central, operados pelo Centcore.

source: Enable Monitoring Engine Logs synchronisation between poller and Central Server operated by Centcore
pt_pt: Permite a sincronização de logs do planejador entre os coletores e o servidor central, operados pelo Centcore.

source: Timeout value in seconds. Used for freeing Centcore when it's stuck because of blocking pipe files or SSH connections.
pt_pt: Tempo máximo em segundos antes do processo centcore recuperação de falhas de dados estatísticos módulos Centreon Broker via conexão SSH (aparece se o tubo está bloqueado estatísticas).

source: Enable Centreon Broker statistics collection into the central server in order to reduce the network load generated by Centcore. Be carefull: broker statistics will not be available into Home > Broker statistics.
pt_pt: Ativa ou desativa a recuperação dos dados estatísticos do módulo do Centreon Broker de coletores remotos. Atenção, a recuperação dos dados pelo processo centcore pode gerar uma sobrecarga na rede caso o processo não consiga recuperar o ficheiro devido a uma má configuração do módulo Centreon Broker. Se a opção estiver desativada, os dados estatísticos não estarão visíveis no menu dedicado.

source: Name of configuration
pt_pt: Nome da configuração

source: Short description of configuration
pt_pt: Breve descrição da configuração

source: Enable LDAP authentication
pt_pt: Ativar autenticação LDAP

source: Whether or not the password should be stored in database
pt_pt: A palavra-passe deve ser armazenada no base de dados ou não?

source: Can connect with LDAP without import
pt_pt: Permite que os utilizadors se conectem à interface do Centreon sem importar contas. A configuração do servidor LDAP deve ser válida e o utilizador deve corresponder aos critérios de pesquisa definidos.

source: The contact template for auto imported user.<br/>This template is applied for Monitoring Engine contact configuration and ACLs
pt_pt: O modelo de contacto para utilizadors automáticos importados. <br/> Este modelo é aplicado para configurar os contactos do agendador e para as ACLs.

source: Use the DNS service for get LDAP host
pt_pt: Usa o serviço DNS para obter hosts LDAP

source: Enable SSL connection
pt_pt: Ativar conexão SSL

source: Enable TLS connection
pt_pt: Ativar conexão TLS

source: Set the domain for search the service
pt_pt: Configurar o domínio para pesquisa de serviço

source: Search size limit
pt_pt: Limite do número de objetos exibidos durante a pesquisa.

source: Search timeout
pt_pt: Duração máxima da pesquisa antes de parar.

source: Ldap server. Failover will take place if multiple servers are defined.<br/>If TLS is enabled, make sure to configure the certificate requirements on the ldap.conf file and restart your web server.
pt_pt: Servidor LDAP. O failover assume se tivermos vários servidores definidos <br/>. Se o TLS estiver ativado, configure os requisitos de certificação no ficheiro ldap.conf e reinicie o servidor da web.

source: User DN for connect to LDAP in read only
pt_pt: Utilizador DN para conexão somente leitura para LDAP.

source: Password for connect to LDAP in read only
pt_pt: Palavra-passe para a conexão LDAP somente leitura.

source: The version protocol for connect to LDAP<br/>Use version 3 for Active Directory
pt_pt: Versão do protocolo para conexão com o servidor LDAP <br/> Usando a versão 3 para um servidor Active Directory

source: Template for LDAP attribute
pt_pt: Selecione um modelo de servidor LDAP. Os atributos de pesquisa serão pré-preenchidos por padrão.

source: The base DN for search users
pt_pt: O base de dados DN de pesquisa de utilizador

source: The base DN for search groups
pt_pt: O base de dados DN da pesquisa de grupo

source: The LDAP search filter for users<br/>Use %s in filter. The %s will replaced by login in autologin or * in LDAP import
pt_pt: O filtro de pesquisa LDAP para utilizadors <br/> Use %s no filtro. O %s será substituído pelo login no login automático ou * na importação LDAP

source: The LDAP search filter for groups<br/>Use %s in filter. The %s will replaced by group name in autologin or * in contactgroup field
pt_pt: O filtro de pesquisa do LDAP para grupos <br/> Use %s no filtro. O %s será substituído pelo nome do grupo em autologin ou * no campo de grupo de contacto

source: The login attribute<br/>In Centreon : Alias / Login
pt_pt: O atributo de login <br/> no Centreon: Alias ​​/ Login

source: The group attribute for user
pt_pt: O atributo de grupo para o utilizador

source: The user name<br/>In Centreon : Full Name
pt_pt: Atributo LDAP que define o nome do utilizador <br/> Padrão: Nome completo

source: The user firstname<br/>In Centreon : givenname
pt_pt: Atributo LDAP que define o primeiro nome do utilizador <br/> Padrão: givenname

source: The user lastname<br/>In Centreon : sn
pt_pt: Atributo LDAP que define o nome do utilizador <br/> Padrão: sn

source: The user email<br/>In Centreon : Email
pt_pt: Atributo LDAP que define o endereço de email do utilizador <br/> Padrão: Email

source: The user pager<br/>In Centreon : Pager
pt_pt: Atributo LDAP que define o número de telefone do utilizador <br/> Padrão: Pager

source: The group name<br/>In Centreon : Contact Group Name
pt_pt: O nome do grupo <br/> No Centreon: Nome do Grupo de Contacto

source: The LDAP attribute for relation between group and user
pt_pt: O atributo LDAP para o relacionamento entre grupo e utilizador

source: Knowledge database name.
pt_pt: Nome do base de dados da base de conhecimento.

source: Knowledge database user.
pt_pt: Conta de utilizador para se conectar ao base de dados da base de conhecimento

source: Knowledge database password.
pt_pt: Palavra-passe da conta do utilizador

source: Knowledge database host.
pt_pt: Endereço do base de dados.

source: Knowledge database prefix.
pt_pt: Prefixo das tabelas no base de dados.

source: Knowledge wiki url. Exemple: http://wiki/mywiki
pt_pt: URL para acessar o wiki. Nenhum exemplo http: // <CENTREON_IP> / mywiki

source: Wiki account with delete right.
pt_pt: Conta de administrador da base de conhecimento com direitos para excluir artigos.

source: Wiki account password.
pt_pt: Palavra-passe para a conta do administrador da base de conhecimento.

source: Directory of log files.
pt_pt: Diretório de ficheiros de log.

source: Enables authentication debug.
pt_pt: Permite a depuração da autenticação do utilizador.

source: Enables Monitoring Engine import debug.
pt_pt: Permite a depuração da importação do mecanismo de supervisão.

source: Enables RRDTool debug.
pt_pt: Permite a depuração do RRDTool.

source: Enables LDAP user import debug.
pt_pt: Permite a depuração da importação do utilizador LDAP.

source: Enables SQL debug.
pt_pt: Ative a depuração do SQL.

source: Enables Centcore debug.
pt_pt: Ative a depuração do Centcore

source: Enables Centstorage debug.
pt_pt: Ative a depuração do Centstorage.

source: Enables Centreontrapd debug.
pt_pt: Permite a depuração do processo centreontrapd.

source: Enables Centstorage Engine.
pt_pt: Ative o motor Centstorage.

source: Enables resource's insertion in index_data.
pt_pt: Ativar a inserção de recursos em index_data

source: Path to RRDTool database for graphs of metrics.
pt_pt: Caminho do base de dados do RRDTool para gráficos e métricas.

source: Path to RRDTool database for graphs of status.
pt_pt: Caminho do base de dados do RRDTool para gráficos de status.

source: Path to RRDTool database for graphs of monitoring engine stats.
pt_pt: Caminho do base de dados do RRDTool para gráficos de estatísticas do mecanismo de supervisão.

source: RRDTool database size (in days).
pt_pt: Tamanho do base de dados do RRDTool (em dias).

source: Duration of retention regarding performance data stored in database. 0 means that no retention will be applied.
pt_pt: Período de retenção para dados de desempenho armazenados no base de dados. 0 significa que nenhuma retenção foi aplicada.

source: Duration of retention regarding downtimes stored in database. 0 means that no retention will be applied.
pt_pt: Período de retenção para tempos de parada armazenados no base de dados. 0 significa que nenhuma retenção foi aplicada.

source: Duration of retention regarding comments stored in database. 0 means that no retention will be applied.
pt_pt: Período de retenção para comentários armazenados no base de dados. 0 significa que nenhuma retenção foi aplicada.

source: Enables RRDTool auto purge system.
pt_pt: Ativa a limpeza automática do RRDTool.

source: Centstorage will check for data to purge every now and then.
pt_pt: O Centstorage verificará os dados a serem removidos periodicamente.

source: Storage Type.
pt_pt: Tipo de armazenamento.

source: Dumps data into another file.
pt_pt: Salva os dados em outro ficheiro.

source: Dump file.
pt_pt: Ficheiro de backup.

source: Archives logs of monitoring engine.
pt_pt: Arquive logs dos mecanismos de supervisão.

source: Retention duration of logs. 0 means that no retention will be applied.
pt_pt: Tempo de retenção do log. 0 significa que nenhuma retenção foi aplicada.

source: Retention duration of reporting data. 0 means that no retention will be applied.
pt_pt: Duração de retenção dos dados de relatório. 0 significa que nenhuma retenção foi aplicada.

source: Enable/Disable logging of all modifications in Centreon
pt_pt: Ativar / desativar o registro de todas as alterações de configuração do Centreon.

source: Enable Backup process
pt_pt: Ativar o processo de backup

source: Backup configuration files (MySQL, Apache, PHP, SNMP, centreon, centreon-engine, centreon-broker)
pt_pt: Ativar backup de ficheiros de configuração (MySQL, Apache, PHP, SNMP, Centreon, Centreon-Engine, Centreon-Broker)

source: Backup centreon database
pt_pt: Ativar backup do base de dados `centreon`

source: Backup centreon_storage database
pt_pt: Habilite o backup do base de dados `centreon_storage`

source: Backup type for centreon_storage database : mysqldump or LVM snapshot (need available space on MySQL LVM)
pt_pt: Método de backup para o base de dados `centreon_storage ': mysqldump ou instantâneo LVM (o espaço não alocado deve estar disponível no base de dados de hospedagem LVM)

source: Full backup period
pt_pt: Período para backups de tipo completo

source: Partial backup period (available on partitioned tables)
pt_pt: Período para backups de tipo parcial (disponível no caso em que as tabelas são particionadas)

source: Directory where backups will be stored
pt_pt: Diretório onde os backups são armazenados

source: Temporary directory used by backup process
pt_pt: Diretório temporário usado para o processo de backup

source: Backup retention (in days)
pt_pt: Duração de retenção dos backups antes da exclusão (expressa em dias)

source: MySQL configuration file path (i.e. /etc/my.cnf.d/centreon.cnf)
pt_pt: Caminho para o ficheiro de configuração do MySQL (por exemplo, /etc/my.cnf.d/centreon.cnf)

source: Use SCP to copy backup on remote host
pt_pt: Usa o protocolo SCP para terceirizar backups

source: Remote user used by SCP
pt_pt: Utilizador para acessar o armazenamento remoto para copiar backups

source: Remote host to copy by SCP
pt_pt: Endereço de armazenamento remoto para copiar backups

source: Remote directory to copy by SCP
pt_pt: Diretório de armazenamento remoto para copiar backups

source: Application directory of Centreon.
pt_pt: Diretório de instalação de software Centreon.

source: Centreon Web URI.
pt_pt: Acesse o URI na interface Centeron.

source: Default number of displayed elements in listing pages.
pt_pt: O número global de objetos exibidos por padrão para páginas.

source: Default number of displayed elements in monitoring consoles.
pt_pt: O número de itens exibidos por padrão para páginas de monitoramento de host e serviço.

source: Number of performance graphs displayed per page.
pt_pt: Número de gráficos de desempenho a serem exibidos por página.

source: The number elements loaded in async select.
pt_pt: O número de elementos carregados por padrão nas listas de seleção.

source: Life duration of sessions.
pt_pt: Tempo de expiração em minutos de sessões de utilizadors conectados ao Centreon.

source: Refresh interval.
pt_pt: Intervalo de atualização geral de objetos.

source: Refresh interval used for statistics (top counters).
pt_pt: Intervalo de atualização usado para estatísticas de estado de host e serviço (tabelas na parte superior das páginas).

source: Refresh interval used in monitoring consoles.
pt_pt: Intervalo de atualização usado nas páginas de supervisão.

source: First refresh delay for statistics (top counters).
pt_pt: Atualize o tempo das estatísticas do estado do host e do serviço ao acessar pela primeira vez a página (tabelas na parte superior das páginas).

source: First refresh delay for monitoring.
pt_pt: Atualize o tempo dos dados de supervisão ao acessar pela primeira vez a página.

source: CSS theme.
pt_pt: O tema CSS padrão que será aplicado à interface da Web do Centreon.

source: Default sort in monitoring consoles.
pt_pt: Classificação padrão para páginas de monitoramento de host e serviço.

source: Default order in monitoring consoles.
pt_pt: Ordem de classificação padrão para páginas de monitoramento de serviço e host.

source: Enables Autologin.
pt_pt: Permite que os utilizadors se conectem à interface do Centreon automaticamente usando o token predefinido na configuração de sua conta.

source: Displays Autologin shortcut.
pt_pt: Exibe o ícone de atalho de conexão automática na interface abaixo do estado geral da tabela de supervisão.

source: Default host and contact timezone.
pt_pt: fuso horário padrão para hosts e contactos.

source: Whether SSO authentication is enabled. SSO feature have only to be enabled in a secured and dedicated environment for SSO. Direct access to Centreon UI from users have to be disabled.
pt_pt: Ativar autenticação via SSO. Essa opção deve ser ativada em um ambiente seguro dedicado à autenticação de SSO. O acesso direto à interface da Web do Centreon para os utilizadors deve estar desativado.

source: Authentication can be solely based on SSO or it can work with both SSO and local authentication systems.
pt_pt: A autenticação pode ser baseada somente no SSO ou pode funcionar tanto com o SSO quanto com um sistema de autenticação local.

source: IP/DNS of trusted clients. Use coma as delimiter in case of multiple clients.
pt_pt: Clientes confiáveis ​​de IP / DNS. Use vírgulas como separador para vários clientes

source: IP/DNS of blacklist clients. Use coma as delimiter in case of multiple clients.
pt_pt: IP/DNS de clientes da lista negra. Use vírgula como delimitador no caso de vários clientes.

source: The header variable that will be used as login. i.e: $_SERVER['HTTP_AUTH_USER']
pt_pt: A variável de cabeçalho que será usada como login. exemplo: $_SERVER['HTTP_AUTH_USER']

source: The pattern to search for in the username. If i want to remove the domain of the email: /@.*/
pt_pt: Padrão de pesquisa racional para o utilizador. Por exemplo, para remover o domínio de um endereço de e-mail: /@.*/

source: The string to replace.
pt_pt: Cadeia de substituição
