Repository: centreon/centreon-archived
Catalog: lang/*/LC_MESSAGES/help.po
Languages: pt_pt

source: This options determines which directory Monitoring Engine will use to temporarily store host and service check results before they are processed. This directory should not be used to store any other files, as Monitoring Engine will periodically clean this directory of old file. Make sure that only a single instance of Monitoring Engine has access to the check result path. If multiple instances of Monitoring Engine have their check result path set to the same directory, you will run into problems with check results being processed (incorrectly) by the wrong instance of Monitoring Engine!
pt_pt: Essa opção determina qual diretório o mecanismo de gerenciamento usará para armazenar temporariamente os resultados do controle. Este diretório não deve armazenar outros ficheiros, porque o mecanismo de supervisão exclui o conteúdo desse diretório repetidamente. Certifique-se de que apenas uma instância do mecanismo de supervisão tenha acesso ao diretório de resultados. Se várias instâncias do mecanismo de monitoramento tiverem seu diretório de resultados, configure o mesmo local, você terá problemas com os resultados das verificações sendo processadas (erroneamente) em comparação com a instância incorreta do mecanismo de supervisão!

source: This options determines the maximum age in seconds that Monitoring Engine will consider check result files found in the check_result_path directory to be valid. Check result files that are older that this threshold will be deleted by Monitoring Engine and the check results they contain will not be processed. By using a value of zero (0) with this option, Monitoring Engine will process all check result files.
pt_pt: Essa opção determina o tempo máximo em segundos que o mecanismo de gerenciamento pode considerar localizar informações de resultado de controle no diretório de armazenamento de resultados. Os resultados que excedam esse limite de tempo serão excluídos pelo mecanismo de supervisão e não poderão mais ser usados. Usando o valor zero (0) para essa opção, o mecanismo de monitoramento explorará cada ficheiro de controle.

source: This is used to set the effective user that the Monitoring Engine process should run as. After initial program startup and before starting to monitor anything, Monitoring Engine will drop its effective privileges and run as this user. You may specify either a username or a UID.
pt_pt: Esse parâmetro determina qual utilizador iniciará o processo do mecanismo de monitoramento. Depois de iniciar o programa e antes de qualquer supervisão, o mecanismo de supervisão abandonará seus privilégios efetivos e começará com este utilizador. Você pode fornecer um nome de utilizador ou um UID.

source: This is used to set the effective group that the Monitoring Engine process should run as. After initial program startup and before starting to monitor anything, Monitoring Engine will drop its effective privileges and run as this group. You may specify either a groupname or a GID.
pt_pt: Essa configuração determina qual grupo iniciará o processo do mecanismo de monitoramento. Depois de iniciar o programa e antes de qualquer supervisão, o mecanismo de supervisão abandonará seus privilégios efetivos e iniciará com este grupo. Você pode dar um nome de grupo ou um GID.

source: This option determines whether or not Monitoring Engine will send out notifications when it initially (re)starts. If this option is disabled, Monitoring Engine will not send out notifications for any host or service. Note: If you have state retention enabled, Monitoring Engine will ignore this setting when it (re)starts and use the last known setting for this option (as stored in the state retention file), unless you disable the use_retained_program_state option. If you want to change this option when state retention is active (and the use_retained_program_state is enabled), you'll have to use the appropriate external command or change it via the web interface. Notifications are enabled by default.
pt_pt: Esta opção define se o mecanismo de gerenciamento envia ou não notificações quando (re) é iniciado. Se esta opção estiver desativada, o mecanismo de gerenciamento não enviará notificações para nenhum host ou serviço. Nota: Se a retenção de estado estiver ativada, o mecanismo de gerenciamento irá ignorar esse parâmetro quando (re) iniciar e usar o último valor conhecido desse parâmetro (conforme armazenado no ficheiro de log de estado), a menos que A opção use_retained_program_state está desativada. Se você quiser alterar essa opção quando a retenção de estado estiver ativada (e use_retained_program_state estiver ativa), será necessário usar o comando externo apropriado ou alterá-lo por meio da interface da web. As notificações estão ativadas por padrão.

source: This option determines whether or not Monitoring Engine will execute service checks when it initially (re)starts. If this option is disabled, Monitoring Engine will not actively execute any service checks and will remain in a sort of "sleep" mode (it can still accept passive checks unless you've disabled them). This option is most often used when configuring backup monitoring servers, as described in the documentation on redundancy, or when setting up a distributed monitoring environment. Note: If you have state retention enabled, Monitoring Engine will ignore this setting when it (re)starts and use the last known setting for this option (as stored in the state retention file), unless you disable the use_retained_program_state option. If you want to change this option when state retention is active (and the use_retained_program_state is enabled), you'll have to use the appropriate external command or change it via the web interface. Service checks are enabled by default.
pt_pt: Esta opção determina se o mecanismo de supervisor executa verificações de serviço quando (re) é iniciado. Se essa opção estiver desabilitada, o mecanismo de gerenciamento não executará nenhuma verificação de serviço e permanecerá em estado de suspensão (continuará a aceitar verificações passivas, a menos que estejam desabilitadas). Essa opção é usada com mais frequência para fazer backup da configuração dos servidores de monitoramento, conforme descrito na documentação de redundância ou para a configuração do ambiente de monitoramento distribuído. Nota: Se a retenção de estado estiver ativada, o mecanismo de gerenciamento irá ignorar esse parâmetro quando (re) iniciar e usar o último valor conhecido desse parâmetro (conforme armazenado no ficheiro de retenção de estado), a menos que A opção use_retained_program_state está desativada. Se você quiser alterar essa opção quando a retenção de estado estiver ativa (e use_retained_program_state estiver ativa), será necessário usar o comando externo apropriado ou alterá-lo por meio da interface da web. As verificações de serviço estão ativadas por padrão.

source: This option determines whether or not Monitoring Engine will execute host checks when it initially (re)starts. If this option is disabled, Monitoring Engine will not actively execute any host checks and will remain in a sort of "sleep" mode (it can still accept passive checks unless you've disabled them). This option is most often used when configuring backup monitoring servers, as described in the documentation on redundancy, or when setting up a distributed monitoring environment. Note: If you have state retention enabled, Monitoring Engine will ignore this setting when it (re)starts and use the last known setting for this option (as stored in the state retention file), unless you disable the use_retained_program_state option. If you want to change this option when state retention is active (and the use_retained_program_state is enabled), you'll have to use the appropriate external command or change it via the web interface. Host checks are enabled by default.
pt_pt: Esta opção determina se o mecanismo de supervisor executa as verificações de host quando (re) é iniciado. Se esta opção estiver desativada, o mecanismo de monitoramento não executará nenhuma verificação de host e permanecerá em estado de suspensão (ele continuará aceitando verificações passivas, a menos que estejam desativadas). Essa opção é usada com mais frequência para fazer backup da configuração dos servidores de monitoramento, conforme descrito na documentação de redundância ou para a configuração do ambiente de monitoramento distribuído. Nota: Se a retenção de estado estiver ativada, o mecanismo de gerenciamento irá ignorar esse parâmetro quando (re) iniciar e usar o último valor conhecido desse parâmetro (conforme armazenado no ficheiro de log de estado), a menos que A opção use_retained_program_state está desativada. Para alterar essa opção quando a retenção de estado estiver ativa (e use_retained_program_state estiver ativa), será necessário usar o comando externo apropriado ou alterá-lo por meio da interface da web. As verificações de host estão ativadas por padrão.

source: This option determines whether or not Monitoring Engine will accept passive service checks when it initially (re)starts. If this option is disabled, Monitoring Engine will not accept any passive service checks. Note: If you have state retention enabled, Monitoring Engine will ignore this setting when it (re)starts and use the last known setting for this option (as stored in the state retention file), unless you disable the use_retained_program_state option. If you want to change this option when state retention is active (and the use_retained_program_state is enabled), you'll have to use the appropriate external command or change it via the web interface. Option is enabled by default.
pt_pt: Essa opção determina se o mecanismo de monitoramento aceita ou não as verificações passivas quando (re) é iniciado. Se esta opção estiver desativada, o mecanismo de monitoramento não executará nenhuma verificação de serviço passivo. Nota: Se a retenção de estado estiver ativada, o mecanismo de gerenciamento irá ignorar esse parâmetro quando (re) iniciar e usar o último valor conhecido desse parâmetro (conforme armazenado no ficheiro de retenção de estado), a menos que A opção use_retained_program_state está desativada. Se você quiser alterar essa opção quando a retenção de estado estiver ativa (e use_retained_program_state estiver ativa), será necessário usar o comando externo apropriado ou alterá-lo por meio da interface da web. A opção está ativada por padrão.

source: This option determines whether or not Monitoring Engine will accept passive host checks when it initially (re)starts. If this option is disabled, Monitoring Engine will not accept any passive host checks. Note: If you have state retention enabled, Monitoring Engine will ignore this setting when it (re)starts and use the last known setting for this option (as stored in the state retention file), unless you disable the use_retained_program_state option. If you want to change this option when state retention is active (and the use_retained_program_state is enabled), you'll have to use the appropriate external command or change it via the web interface. Option is enabled by default.
pt_pt: Esta opção determina se o mecanismo de gerenciamento aceita ou não as verificações de host passivas quando (re) é iniciado. Se esta opção estiver desativada, o mecanismo de supervisor não aceita nenhuma verificação de convidado passivo. Nota: Se a retenção de estado estiver ativada, o mecanismo de gerenciamento irá ignorar esse parâmetro quando (re) iniciar e usar o último valor conhecido desse parâmetro (conforme armazenado no ficheiro de retenção de estado), a menos que A opção use_retained_program_state está desativada. Se você quiser alterar essa opção quando a retenção de estado estiver ativa (e use_retained_program_state estiver ativa), será necessário usar o comando externo apropriado ou alterá-lo por meio da interface da web. A opção está ativada por padrão.

source: This option determines whether or not Monitoring Engine will run event handlers when it initially (re)starts. If this option is disabled, Monitoring Engine will not run any host or service event handlers. Note: If you have state retention enabled, Monitoring Engine will ignore this setting when it (re)starts and use the last known setting for this option (as stored in the state retention file), unless you disable the use_retained_program_state option. If you want to change this option when state retention is active (and the use_retained_program_state is enabled), you'll have to use the appropriate external command or change it via the web interface. Option is enabled by default.
pt_pt: Essa opção determina se o mecanismo de gerenciamento usa ou não manipuladores de eventos quando (re) é iniciado. Se essa opção estiver desabilitada, o mecanismo de gerenciamento não usará nenhum manipulador de evento de host ou serviço. Nota: Se a retenção de estado estiver ativada, o sistema de monitoramento irá ignorar esse parâmetro quando (re) iniciar e usar o último valor conhecido desse parâmetro (conforme armazenado no ficheiro de retenção de estado), a menos que A opção use_retained_program_state está desativada. Para alterar essa opção quando a retenção de estado estiver ativa (e use_retained_program_state estiver ativa), será necessário usar o comando externo apropriado ou alterá-lo por meio da interface da web. A opção está ativada por padrão.

source: This is the rotation method that you would like Monitoring Engine to use for your log file.
pt_pt: O método de rotação que você deseja que o mecanismo de gerenciamento use para seus ficheiros de log.

source: This is the directory where Monitoring Engine should place log files that have been rotated. This option is ignored if you choose to not use the log rotation functionality.
pt_pt: Esse é o diretório em que o mecanismo de gerenciamento deve salvar os ficheiros de log que foram girados. Esta opção é ignorada se você não ativou a rotação de log.

source: This option determines whether or not Monitoring Engine will check the command file for commands that should be executed. This option must be enabled if you plan on using Centreon to issue commands via the web interface.
pt_pt: Essa opção determina se o mecanismo de gerenciamento verifica ou não o ficheiro de comando para os comandos que precisam ser executados. Essa opção deve ser ativada se você quiser que o Centreon execute comandos por meio da interface da web.

source: If you specify a number with an "s" appended to it (i.e. 30s), this is the number of seconds to wait between external command checks. If you leave off the "s", this is the number of "time units" to wait between external command checks. Unless you've changed the interval_length value (as defined below) from the default value of 60, this number will mean minutes. By setting this value to -1, Monitoring Engine will check for external commands as often as possible. Each time Monitoring Engine checks for external commands it will read and process all commands present in the command file before continuing on with its other duties.
pt_pt: Se você especificar um número seguido por um "s" (por exemplo, 30s), este será o intervalo em segundos entre as verificações dos comandos externos. Se você não colocar "s", será um número de "unidades de tempo" a aguardar entre verificações de controle externas. A menos que você tenha alterado o valor "interval_length" (como definido abaixo) do valor padrão de 60, esse número expressa minutos. Ao definir este valor como -1, o mecanismo de monitoramento monitorará os comandos externos sempre que possível. Sempre que o mecanismo de verificação verificar comandos externos, ele lerá e executará todos os comandos no ficheiro de comando antes de prosseguir para as próximas tarefas.

source: This is the file that Monitoring Engine will check for external commands to process. Centreon writes commands to this file. The external command file is implemented as a named pipe (FIFO), which is created when Monitoring Engine starts and removed when it shuts down. If the file exists when Monitoring Engine starts, the Monitoring Engine process will terminate with an error message.
pt_pt: Este é o ficheiro de comando externo que pode ser executado pelo mecanismo de monitoramento. Centreon salva os comandos neste ficheiro. O ficheiro de comando externo é organizado como um pipe nomeado (FIFO), que é criado quando o mecanismo de gerenciamento é iniciado e depois é excluído quando ele é interrompido. Se o ficheiro já existir quando o mecanismo do supervisor for iniciado, o mecanismo do supervisor parará com uma mensagem de erro.

source: This is an advanced feature. This option determines how many buffer slots Monitoring Engine will reserve for caching external commands that have been read from the external command file by a worker thread, but have not yet been processed by the main thread of the Monitoring Engine daemon. This option essentially determines how many commands can be buffered. For installations where you process a large number of passive checks (e.g. distributed setups), you may need to increase this number. You should consider using MRTG to graph Monitoring Engine' usage of external command buffers.
pt_pt: Esta é uma função avançada. Isso determina o número de buffers reservados pelo motor de supervisor para o cache de comandos externos lidos pelo processo de trabalho de ler o ficheiro de comando externo, mas ainda não n`ont foi lida pelo d`arrière processo plano principal do motor de supervisão. Esta opção determina principalmente o número de comandos que podem ser armazenados em buffer. Para instalações em que há um grande número de verificações passivas (por exemplo, ambientes distribuídos), esse número deve ser aumentado. Deve-se considerar o uso do MRTG para gerar um gráfico para usar buffers de comando externos.

source: This option specifies the location of the lock file that Monitoring Engine should create when it runs as a daemon. This file contains the process id (PID) number of the running Monitoring Engine process.
pt_pt: Esta opção especifica o local do ficheiro de bloqueio que será criado quando o mecanismo de gerenciamento for iniciado como um daemon. Este ficheiro contém o ID do processo (PID) do mecanismo de supervisão em execução.

source: This option determines whether or not Monitoring Engine will retain state information for hosts and services between program restarts. If you enable this option, you should supply a value for the state_retention_file variable. When enabled, Monitoring Engine will save all state information for hosts and service before it shuts down (or restarts) and will read in previously saved state information when it starts up again. Option is enabled by default.
pt_pt: Essa opção determina se o mecanismo de gerenciamento se lembra ou não do status dos hosts e serviços entre as reinicializações do programa. Se a opção estiver ativada, o valor de state_retention_file deve ser configurado. Neste caso, o sistema de monitoramento salva todas as informações de status dos hosts e serviços antes de parar (ou reiniciar) e relê-lo quando ele é iniciado novamente. A opção está ativa por padrão.

source: This is the file that Monitoring Engine will use for storing status, downtime, and comment information before it shuts down. When Monitoring Engine is restarted it will use the information stored in this file for setting the initial states of services and hosts before it starts monitoring anything. In order to make Monitoring Engine retain state information between program restarts, you must enable the retain_state_information option.
pt_pt: Esse é o ficheiro que o Monitoring Engine usará para armazenar informações de status, tempo de inatividade e comentários antes de ser encerrado. Quando o Monitoring Engine for reiniciado, ele usará as informações armazenadas nesse ficheiro para definir os estados iniciais de serviços e hosts antes de começar a monitorar qualquer coisa. Para tornar o Monitoring Engine reter informações de estado entre as reinicializações do programa, você deve ativar a opção retain_state_information.

source: This setting determines how often (in minutes) that Monitoring Engine will automatically save retention data during normal operation. If you set this value to 0, Monitoring Engine will not save retention data at regular intervals, but it will still save retention data before shutting down or restarting. If you have disabled state retention (with the retain_state_information option), this option has no effect.
pt_pt: Esse parâmetro define a frequência (em minutos) que o mecanismo de gerenciamento salvará automaticamente os dados de retenção durante a operação normal. Se o valor for 0, o mecanismo de monitoramento não registrará os dados de retenção em intervalos regulares, mas apenas antes de parar ou reiniciar. Se a retenção de estado estiver desativada (com a opção retain_state_information), esse parâmetro não terá efeito.

source: This setting determines whether or not Monitoring Engine will set various program-wide state variables based on the values saved in the retention file. Some of these program-wide state variables that are normally saved across program restarts if state retention is enabled include the enable_notifications, enable_flap_detection, enable_event_handlers, execute_service_checks, and accept_passive_service_checks options. If you do not have state retention enabled, this option has no effect. This option is enabled by default.
pt_pt: Essa opção determina se o mecanismo de gerenciamento define várias variáveis ​​globais com base nos valores no ficheiro de retenção. As opções enable_notifications enable_flap_detection, enable_event_handlers, execute_service_checks e accept_passive_service_checks estão entre essas variáveis ​​globais e são normalmente mantidas entre reinicia o programa se o d`état retenção é ativado. Se a retenção de estado não estiver ativa, essa opção não terá efeito. Esta opção está ativada por padrão.

source: This setting determines whether or not Monitoring Engine will retain scheduling info (next check times) for hosts and services when it restarts. If you are adding a large number (or percentage) of hosts and services, I would recommend disabling this option when you first restart Monitoring Engine, as it can adversely skew the spread of initial checks. Otherwise you will probably want to leave it enabled.
pt_pt: Essa configuração determina se o mecanismo de gerenciamento armazena o planejamento (tempos de verificação futuros) para hosts e serviços quando ele é reiniciado. Se você adicionar um grande número (ou porcentagem) de hosts ou serviços, é recomendável desativar essa opção na primeira reinicialização do mecanismo de monitoramento, pois isso pode limitar significativamente o tempo das primeiras verificações. Além disso, será necessário deixar esta opção ativada.

source: This is an advanced feature. You'll need to read the Centreon Engine source code to use this option effectively. These options determine which service attributes are NOT retained across program restarts. By default, all host and service attributes are retained.
pt_pt: Este é um recurso avançado. Você precisará ler o código-fonte do Centreon Engine para usar essa opção com eficiência. Essas opções definem quais atributos de serviço NÃO serão retidos quando o mecanismo for reiniciado. Por padrão, todos os atributos são recuperados.
