Repository: centreon/centreon-archived
Catalog: lang/*/LC_MESSAGES/help.po
Languages: pt_pt

source: Define the number of "time units" to wait before sending out the first problem notification when this service enters a non-OK state. With the default time unit of 60s, this number will mean multiples of 1 minute. If you set this value to 0, monitoring engine will start sending out notifications immediately.
pt_pt: Configure o número de "unidades de tempo" para aguardar antes de enviar a primeira notificação de problema quando este serviço entrar em um estado não OK. Com a unidade padrão de 60, esse número representa múltiplos de 1 minuto. Se você definir esse valor como 0, o mecanismo de monitoramento começará a enviar notificações imediatamente.

source: If this option is enabled, use host's notification parameters instead of service or from template of service parameters inherited
pt_pt: Se essa opção for ativada, as configurações de notificação usadas serão as do host, e não as definidas no nível do modelo de serviço ou serviço.

source: Specify one or multiple host templates, that should be linked to this template. A service, that uses this service template, will complete the missing host relation and result in a full service definition.
pt_pt: Especifica um ou mais modelos de host, que devem ser vinculados a esse modelo. Um serviço que usa esse modelo de serviço concluirá o relacionamento do host ausente e resultará em uma definição de serviço completo.

source: Specify the host(s) that this service "runs" on or is associated with.
pt_pt: Especifica que este serviço "é executado" ou está associado ao (s) host (s).

source: Specify the hostgroup(s) that this service "runs" on or is associated with. One or more hostgroup(s) may be used instead of, or in addition to, specifying hosts.
pt_pt: Especifica que este serviço "é executado" ou está associado ao (s) grupo (s) de hosts. Um ou mais grupos de hosts podem ser usados ​​no lugar de, ou além de, especificar hosts.

source: This directive is used to identify the short name(s) of the servicegroup(s) that the service belongs to. This directive may be used as an alternative to using the members directive in servicegroup definitions.
pt_pt: Essa diretiva é usada para identificar o nome abreviado do grupo de serviço ao qual o serviço pertence. Essa diretiva pode ser usada como uma alternativa usando o parâmetro de membro das definições do grupo de serviços.

source: Specify the relation of known SNMP traps to state changes of this service.
pt_pt: Especifica o relacionamento de escalações de SNMP conhecidas com a mudança de estado deste serviço.

source: This directive determines whether or not checks for the service will be "obsessed" over. When enabled the obsess over service command will be executed after every check of this service.
pt_pt: Esta diretriz determina se as verificações para o serviço serão mais "insistentes" ou não. Quando ativado, o comando será executado após cada verificação deste serviço.

source: This directive is used to determine whether or not freshness checks are enabled for this service. When enabled monitoring engine will trigger an active check when last passive result is older than the value defined in the threshold. By default freshness checks are enabled.
pt_pt: Esta diretiva é usada para determinar se as verificações de frieza estão ativadas ou não para este serviço. Quando ativado, o mecanismo de verificação acionará uma verificação ativa se o resultado da última verificação passiva for mais antigo que o valor limite definido. Por padrão, as verificações de atualização estão ativadas.

source: This directive is used to specify the freshness threshold (in seconds) for this service. If you set this directive to a value of 0, monitoring engine will determine a freshness threshold to use automatically.
pt_pt: Essa diretiva é usada para especificar o limite de atualização (em segundos) para esse serviço. Se você definir essa diretiva para um valor de 0, o mecanismo de verificação determinará um limite de frieza para usar automaticamente.

source: This directive is used to determine whether or not flap detection is enabled for this service. A service is marked as flapping when frequent state changes occur.
pt_pt: Este tópico é usado para ativar ou desativar a detecção de oscilação para este serviço. Um serviço é marcado oscilando quando seu estado muda com freqüência.

source: Specify the low state change threshold used in flap detection for this service. A service with a state change rate below this threshold is marked normal. By setting the value to 0, the program-wide value will be used.
pt_pt: Especifique o limite baixo da taxa de alteração usada na detecção de estado para este serviço. Um serviço com uma taxa de alteração de estado abaixo desse limite é marcado como normal. Ao definir o valor como 0, o valor será usado em todo o programa.

source: Specify the high state change threshold used in flap detection for this service. A service with a state change rate above or equal to this threshold is marked as flapping. By setting the value to 0, the program-wide value will be used.
pt_pt: Especifique o limite de detecção alto de mudança de estado para este serviço. Um serviço com uma taxa maior ou igual a esse limite é marcado como flapping. Ao definir o valor como 0, o valor será usado em todo o programa.

source: Specify whether or not the processing of performance data is enabled for this service.
pt_pt: Especifique se o processamento de dados de desempenho está ativado ou não para este serviço.

source: Specify whether or not status-related information about the service is retained across program restarts. This is only useful if you have enabled state retention using the retain_state_information directive.
pt_pt: Especifique se as informações de status no serviço serão ou não retidas depois que o programa for reiniciado. Isso só é útil se você tiver ativado a retenção de estado usando a diretiva "retain_state_information".

source: Specify whether or not non-status information about the service is retained across program restarts. This is only useful if you have enabled state retention using the retain_state_information directive.
pt_pt: Determina se o estado dos serviços é armazenado entre duas reinicializações. Esta opção só é útil se você ativar a opção retain_state_information.

source: Define which service states "stalking" is enabled for.
pt_pt: Determina se o rastreamento preciso de alterações de estado está ativado.

source: This directive is used to determine whether or not the event handler for this service is enabled.
pt_pt: Essa configuração permite ativar ou desativar o manipulador de eventos para esse serviço.

source: This directive is used to specify the command that should be run whenever a change in the state of the service is detected (i.e. whenever it changes to non-OK or recovers).
pt_pt: Esse parâmetro é usado para especificar um comando que precisará ser iniciado quando uma alteração de estado de serviço for detectada (quando o serviço for alterado de estado não OK para recuperação).

source: Specify a duration of acknowledgement for this service or service depending to this template. If you leave it blank, no timeout will be set.
pt_pt: Especifique uma duração máxima antes de limpar a confirmação de confirmações para esses serviços ou os serviços herdados deste modelo. Deixe em branco para não especificar uma duração máxima.

source: The optional definition of a graph template will be used as default graph template for this service.
pt_pt: A definição opcional de um modelo gráfico será usada como o modelo gráfico padrão para este serviço.

source: Select the categories this service should be linked to. Categories are used for finer control in service ACL definitions.
pt_pt: Selecione a categoria na qual este serviço deve estar localizado. Categorias podem ser usadas para refinar as ACLs de um serviço.

source: Define an optional URL that can be used to provide more information about the service. Any valid URL can be used. This can be very useful if you want to make detailed information on the service, emergency contact methods, etc. available to other support staff.
pt_pt: Defina um endereço da Web que possa ser usado para fornecer mais informações sobre o serviço. Qualquer endereço da web válido pode ser usado. Esta opção pode ser muito útil se você quiser adicionar informações detalhadas ao serviço, procedimento e pessoas a serem contatadas em caso de emergência, etc.

source: Define an optional string of notes pertaining to the service.
pt_pt: Especifica uma nota informativa opcional anexada ao serviço.

source: Define an optional URL that can be used to provide more actions to be performed on the service. You will see the link to the action URL in the service details.
pt_pt: Define uma URL opcional que fornece ações adicionais no serviço. Você pode ver um link para o URL nos detalhes do serviço.

source: Define the image that should be associated with this service here. This image will be displayed in the various places. The image will look best if it is 40x40 pixels in size.
pt_pt: Aqui define a imagem que deve ser associada ao serviço. A imagem será exibida em diferentes lugares. A imagem terá uma melhor renderização se seu tamanho for 40x40 pixels.

source: Macros are used as object-specific variables/properties, which can be referenced in commands and extended infos. A Macro named TECHCONTACT can be referenced as $_SERVICETECHCONTACT$.
pt_pt: As macros são usadas como variáveis ​​/ propriedades específicas, que podem ser usadas em comandos e informações adicionais. Uma macro denominada TECHCONTACT pode ser referenciada como $ _SERVICETECHCONTACT $.

source: This directive is used to define an alternate name that should be displayed in the web interface for this service. If not specified, this defaults to the value you specify as service description.
pt_pt: Essa configuração permite que você defina um nome diferente que será exibido na interface da web para esse serviço. Se você não especificar nada, será o nome definido na descrição de serviço que será exibida.

source: This directive is used to determine what service states the flap detection logic will use for this service.
pt_pt: Este parâmetro é usado para determinar quais estados a detecção de oscilações será ativada para este serviço.

source: By default monitoring engine will assume that all services are in OK states when it starts. You can override the initial state for a service by using this directive.
pt_pt: Por padrão, o planejador considera que todos os serviços estão em um estado OK quando é iniciado. Você pode substituir esse comportamento usando essa diretiva.

source: The command name is used to identify and display this command in contact, host and service definitions.
pt_pt: O nome do comando é usado para identificar e exibir o comando nas definições de um contacto, um host e um serviço.

source: The command line specifies the real command line which is actually executed by Monitoring engine. Before execution, all valid macros are replaced with their respective values. To use the dollar sign ($) on the command line, you have to escape it with another dollar sign ($$). A semicolon (;) is used as separator for config file comments and must be worked around by setting a $USER$ macro to a semicolon and then referencing it here in place of the semicolon. If you want to pass arguments to commands during runtime, you can use $ARGn$ macros in the command line.
pt_pt: A linha de comando descreve o comando que será executado pelo mecanismo de monitoramento. Antes da execução deste comando pelo agendador, as macros corretamente definidas serão substituídas por seus valores associados. Para usar o símbolo '$' como um personagem, ele deve ser protegido por outro símbolo '$' ('$$'). Um ponto e vírgula (';') é um caractere especial usado como um separador na configuração do planejador. Para usar um ponto-e-vírgula, uma macro do tipo $ USER $ deve ser criada e conter esse caractere. É possível usar macros $ ARGn $, $ USERn $ ou macros customizadas na linha de comando.

source: If your command requires shell features like pipes, redirections, globbing etc. check this box. If you are using Monitoring Engine this option cannot be disabled. Note that commands that require shell are slowing down the poller server.
pt_pt: Se o seu comando requer funções de shell, como pipes, redirecionamentos, curingas, etc., marque esta caixa. Se você usar o Nagios, esta opção não pode ser desativada. Observe que os comandos que exigem o shell tornam o servidor de coleta mais lento.

source: The argument example defined here will be displayed together with the command selection and help in providing a hint of how to parametrize the command for execution.
pt_pt: O exemplo do argumento definido aqui será exibido ao selecionar o comando e fornece ajuda sobre as opções a serem definidas para a execução do comando.

source: Define the type of the command. The type will be used to show the command only in the relevant sections.
pt_pt: Defina o tipo do comando. O tipo será usado para exibir o comando apenas nas seções apropriadas.

source: The optional definition of a graph template will be used as default graph template, when no other is specified.
pt_pt: A definição opcional de um modelo de gráfico será usada como o modelo de gráfico padrão, quando nenhum outro será especificado.

source: The argument description provided here will be displayed instead of the technical names like ARGn.
pt_pt: A descrição do argumento fornecida aqui será exibida em vez do nome técnico, como ARGn.

source: The macro description provided here will be displayed instead of the technical name.
pt_pt: A descrição da macro inserida aqui será exibida em vez de seu nome técnico.

source: Comments regarding the command.
pt_pt: Comentários sobre o pedido

source: Connectors are run in background and execute specific commands without the need to execute a binary, thus enhancing performance. This feature is available in Centreon Engine (>= 1.3)
pt_pt: Os conectores são lançados em segundo plano e executam comandos específicos sem usar um binário, o que melhora o desempenho. Este recurso está disponível com o motor Centreon (> = 1,3)

source: Name used for identification of this meta service.
pt_pt: Nome usado para identificar este serviço meta.

source: Optional format string used for displaying the status of this meta service. The variable '%d' may be used and will be replaced by the calculated value.
pt_pt: String de formato opcional usada para exibir o status deste serviço meta. A variável '%d' pode ser usada e será substituída pelo valor calculado.

source: Absolute value for warning level (low threshold).
pt_pt: Valor absoluto para o nível de aviso (limite baixo).

source: Absolute value for critical level (low threshold).
pt_pt: Valor absoluto para o nível crítico (limite baixo).

source: Function to be applied to calculate the meta service status.
pt_pt: Função a ser aplicada para calcular o status do serviço meta.

source: Data source type of the meta service.
pt_pt: Fonte de dados usados ​​para o serviço meta

source: Selection mode for services to be considered for this meta service. In service list mode, mark selected services in the options on meta service list. In SQL matching mode, specify a search string to be used in an SQL query.
pt_pt: Como selecionar os serviços para vincular ao meta-serviço. A primeira opção permite selecionar manualmente os serviços, enquanto o segundo irá integrar todos os serviços selecionados pela consulta SQL (definir a string de pesquisa SQL).

source: Search string to be used in a SQL LIKE query for service selection.
pt_pt: Cadeia de pesquisa para usar na consulta do tipo SQL LIKE para selecionar um serviço.

source: Select the metric to measure for meta service status.
pt_pt: Selecione a métrica para medir o status do meta-serviço.

source: Specify the time period during which the meta service status is measured.
pt_pt: Especifica o período de tempo durante o qual o status do serviço meta é medido.

source: Define the number of times that Centreon will retry the service check command if it returns any state other than an OK state. Setting this value to 1 will cause Centreon to generate an alert without retrying the service check again.
pt_pt: Define o número de vezes que o Centreon tentará novamente o comando de controle de serviço se ele retornar um estado diferente de OK. Defina esse valor como 1 e o Centreon gerará um alerta sem tentar novamente para verificar o serviço novamente.

source: Define the number of minutes between regularly scheduled checks of the meta service. "Regular" checks are those that occur when the service is in an OK state or when the service is in a non-OK state, but has already been rechecked max check attempts number of times.
pt_pt: Define o número de minutos entre verificações regulares do serviço meta. cheques "regular" são aquelas que ocorrem quando o serviço está em um estado OK ou quando o serviço estiver em um estado não-OK, mas já foi checado número máximo de tentativas.

source: Define the number of minutes to wait before scheduling a re-check for this service after a non-OK state was detected. Once the service has been retried max check attempts times without a change in its status, it will revert to being scheduled at its "normal" check interval rate.
pt_pt: Define o número de minutos a aguardar antes de agendar uma nova verificação para este serviço depois que um status não OK for detectado. Uma vez que o serviço tenha sido verificado novamente para o número máximo de tentativas sem uma mudança no status, ele voltará a ser agendado no intervalo de verificação "normal".

source: Specify whether or not notifications for this meta service are enabled.
pt_pt: Especifica se as notificações para este serviço meta estão ativadas ou não.

source: This is a list of contact groups that should be notified whenever there are problems (or recoveries) with this service.
pt_pt: Esta é uma lista de grupos de contactos que devem ser notificados quando houver problemas (ou retornarem ao normal) com este serviço.

source: Define the number of minutes to wait before re-notifying a contact that this service is still in a non-OK condition. A value of 0 disables re-notifications of contacts about problems for this service - only one problem notification will be sent out.
pt_pt: Define o intervalo em minutos antes de notificar um contacto novamente se o serviço ainda estiver em um estado não OK. Um valor de 0 desabilita o envio de várias notificações - uma única notificação será enviada sobre o problema.

source: Define the states of the service for which notifications should be sent out. If you do not specify any notification options, Centreon will assume that you want notifications to be sent out for all possible states.
pt_pt: Define os estados de serviço para os quais as notificações devem ser enviadas. Se você não especificar nenhuma dessas opções de notificação, o Centreon assumirá que você deseja enviar notificações para todos os relatórios.

source: The alias is a longer name or description for the vendor/manufacturer.
pt_pt: Alias ​​é um nome longo ou uma descrição para o fornecedor / fabricante.

source: The name is used to identify the vendor/manufacturer with a short name.
pt_pt: O nome é usado para identificar o fornecedor / fabricante com um nome curto.

source: Use this for an optional description or comments about the vendor/manufacturer.
pt_pt: Use isso como uma descrição ou comentário opcional sobre o fornecedor / fabricante.

source: Select the service templates this category should be linked to. Every service based on the selected templates will be automatically linked with this category.
pt_pt: Seleciona os modelos de serviço aos quais esta categoria deve ser vinculada. Cada serviço baseado nos modelos selecionados será vinculado automaticamente a essa categoria.

source: This directive is used to define a short name used to identify the host group.
pt_pt: Essa diretiva é usada para definir um nome abreviado usado para identificar o grupo de hosts.

source: This directive is used to define is a longer name or description used to identify the host group. It is provided in order to allow you to more easily identify a particular host group.
pt_pt: Esta diretiva é usada para definir um nome longo ou uma descrição que identifica o grupo de hosts. Destina-se a ajudá-lo a identificar um grupo específico de hosts com mais facilidade.

source: This is a list of hosts that should be included in this group. This directive may be used as an alternative to (or in addition to) the hostgroups directive in host definitions.
pt_pt: Esta é a lista de hosts que devem ser incluídos neste grupo. Essa diretiva pode ser usada como uma alternativa para (ou além de) a diretiva de grupos de host na definição de hosts.

source: This optional directive can be used to include hosts from other host groups in this host group.
pt_pt: Essa diretiva opcional pode ser usada para incluir hosts de outros grupos de hosts nesse grupo de hosts.

source: Define an optional string of notes pertaining to the host group.
pt_pt: Define uma sequência opcional relevante para o grupo de hosts.

source: Define an optional URL that can be used to provide more information about the host group. Any valid URL can be used. This can be very useful if you want to make detailed information on the host group, emergency contact methods, etc. available to other support staff.
pt_pt: Define um URL opcional que pode ser usado para fornecer mais informações sobre o grupo de hosts. Qualquer URL válido pode ser usado. Isso pode ser muito útil se você quiser fornecer informações detalhadas sobre o grupo de hosts, métodos de contacto de emergência, etc. Disponível para outras pessoas na equipe de suporte.

source: Define an optional URL that can be used to provide more actions to be performed on the host group. You will see the link to the action URL in the host group details.
pt_pt: Define uma URL opcional que pode ser usada para fornecer mais ações para serem executadas no grupo de hosts. Você verá o link para o URL de ação nos detalhes do grupo de hosts.

source: Define the image that should be associated with this host group here. This image will be displayed in the various places. The image will look best if it is 40x40 pixels in size.
pt_pt: Defina aqui a imagem que deve ser associada ao grupo de hosts. Esta imagem será exibida em diferentes lugares. A imagem terá uma renderização melhor se for um tamanho de 40x40 pixels.

source: Define an image that should be associated with this host group in the statusmap CGI in monitoring engine. You can choose a JPEG, PNG, and GIF image. The GD2 image format is preferred, as other image formats must be converted first when the statusmap image is generated. The image will look best if it is 40x40 pixels in size.
pt_pt: Define uma imagem que deve ser associada ao grupo de hosts no CGI do statusmap no mecanismo de monitoramento. Você pode escolher uma imagem nos formatos JPEG, PNG e GIF. O GD2 é preferido porque outros formatos de imagem precisarão ser convertidos antes que o statusmap seja gerado. A imagem terá uma renderização melhor se tiver um tamanho de 40x40 pixels.

source: RRD retention duration of all the services that are in this host group. If service is in multiple host groups, the highest retention value will be used.
pt_pt: Comprimento da retenção de dados em ficheiros RRD para todos os serviços relacionados ao grupo de hosts. No caso de um serviço pertencer a mais de um grupo de hosts, o maior tempo de retenção será aplicado.

source: Comments on this host group.
pt_pt: Comentários do grupo de hosts.

source: Whether this host group is enabled.
pt_pt: Disponibilidade do grupo de convidados.
