Repository: centreon/centreon-archived
Catalog: lang/*/LC_MESSAGES/help.po
Languages: pt_pt

source: This is an advanced feature. You'll need to read the Centreon Engine source code to use this option effectively. These options determine which host attributes are NOT retained across program restarts. By default, all host and service attributes are retained.
pt_pt: Este é um recurso avançado. Você precisará ler o código-fonte do Centreon Engine para usar essa opção com eficiência. Essas opções definem quais atributos do host NÃO serão retidos quando o mecanismo for reiniciado. Por padrão, todos os atributos são recuperados.

source: This is an advanced feature. You'll need to read the Centreon Engine source code to use this option effectively. These options determine which service process attributes are NOT retained across program restarts. By default, all host and service attributes are retained.
pt_pt: Este é um recurso avançado. Você precisará ler o código-fonte do Centreon Engine para usar essa opção com eficiência. Essas opções tornam possível definir quais processos relacionados ao serviço (manipulador de eventos, manipulador obsessivo, flapping, etc.) NÃO serão mantidos quando o mecanismo for reiniciado. Por padrão, todos os processos são recuperados.

source: This is an advanced feature. You'll need to read the Centreon Engine source code to use this option effectively. These options determine which host process attributes are NOT retained across program restarts. By default, all host and service attributes are retained.
pt_pt: Este é um recurso avançado. Você precisará ler o código-fonte do Centreon Engine para usar essa opção com eficiência. Essas opções determinam quais atributos do processo do host NÃO são retidos nas reinicializações do programa. Por padrão, todos os atributos de host e serviço são mantidos.

source: This is an advanced feature. You'll need to read the Centreon Engine source code to use this option effectively. These options determine which service contact attributes are NOT retained across program restarts. By default, all host and service attributes are retained.
pt_pt: Este é um recurso avançado. Você precisará ler o código-fonte do Centreon Engine para usar essa opção com eficiência. Essas opções definem quais atributos do contacto NÃO serão retidos quando o mecanismo for reiniciado. Por padrão, todos os atributos são recuperados.

source: This is an advanced feature. You'll need to read the Centreon Engine source code to use this option effectively. These options determine which host contact attributes are NOT retained across program restarts. By default, all host and service attributes are retained.
pt_pt: Este é um recurso avançado. Você precisará ler o código-fonte do Centreon Engine para usar essa opção com eficiência. Essas opções definem quais processos relacionados ao contacto NÃO serão retidos quando o mecanismo for reiniciado. Por padrão, todos os atributos são recuperados.

source: This option determines whether messages are logged to the syslog facility on your local host.
pt_pt: Esta opção determina se as mensagens são salvas no ficheiro syslog do seu host local.

source: This option determines whether or not notification messages are logged. If you have a lot of contacts or regular service failures your log file will grow relatively quickly. Use this option to keep contact notifications from being logged.
pt_pt: Esta opção determina se as mensagens de notificação são registradas ou não. Se você tiver muitos contactos ou muitos serviços com erro, seu ficheiro de log crescerá com relativa rapidez. Use essa opção para registrar essas notificações.

source: This option determines whether or not service check retries are logged. Service check retries occur when a service check results in a non-OK state, but you have configured Monitoring Engine to retry the service more than once before responding to the error. Services in this situation are considered to be in "soft" states. Logging service check retries is mostly useful when attempting to debug Monitoring Engine or test out service event handlers.
pt_pt: Esta opção determina se as tentativas repetidas de controlar um serviço são registradas. Tentativas ocorrer serviço lorsqu`un retorna um estado não-OK, mas você definir o motor de supervisor para tentar d`une mais tempo antes de considerar isso como um erro. Os serviços nesta situação são considerados em estado suave. As tentativas de controle de log permitem depurar o mecanismo de monitoramento ou testar o manipulador de eventos.

source: This option determines whether or not host check retries are logged. Logging host check retries is mostly useful when attempting to debug Monitoring Engine or test out host event handlers.
pt_pt: Esta opção determina se as tentativas repetidas de controlar um host são registradas. As tentativas de controle de log permitem depurar o mecanismo de monitoramento ou testar o manipulador de eventos.

source: This option determines whether or not service and host event handlers are logged. Event handlers are optional commands that can be run whenever a service or hosts changes state. Logging event handlers is most useful when debugging Monitoring Engine or first trying out your event handler scripts.
pt_pt: Essa opção determina se o tratamento de eventos relacionado a hosts ou serviços é registrado. Manipuladores de eventos são comandos opcionais que podem ser iniciados quando um estado de host ou serviço é alterado. O log de gerenciamento de eventos é usado para depurar o mecanismo de monitoramento ou para testar scripts de gerenciamento de eventos.

source: This option determines whether or not Monitoring Engine will force all initial host and service states to be logged, even if they result in an OK state. Initial service and host states are normally only logged when there is a problem on the first check. This option is disabled by default. Enabling it is useful if you are using an application that scans the log file to determine long-term state statistics for services and hosts. This option must be enabled to use reporting with Centreon.
pt_pt: Essa variável determina se o mecanismo de monitoramento forçará todos os estados iniciais do host e do serviço a serem registrados, mesmo que seu estado seja OK. Os estados iniciais são normalmente registrados somente se houver um problema durante a primeira verificação. Essa opção pode ser útil se você estiver usando um aplicativo de terceiros que lê o log de estatísticas de longo prazo para hosts e serviços. Esta opção deve estar ativada para usar relatórios com o Centreon.

source: This option determines whether or not Monitoring Engine will log external commands that it receives from the external command file. This option is enabled by default.
pt_pt: Esta opção determina se o mecanismo de gerenciamento registra comandos externos recebidos pelo ficheiro de comando externo. Esta opção está ativada por padrão.

source: This option determines whether or not Monitoring Engine will log passive host and service checks that it receives from the external command file. This option is enabled by default. If you are setting up a distributed monitoring environment or plan on handling a large number of passive checks on a regular basis, you may wish to disable this option so your log file doesn't get too large.
pt_pt: Essa variável determina se o mecanismo de gerenciamento registrará os comandos externos recebidos por meio do ficheiro de comandos externo. Esta opção está ativada por padrão. Se você estiver configurando um ambiente distribuído ou processando um grande número de verificações passivas regularmente, poderá desativar essa opção para evitar que o ficheiro de log seja muito grande.

source: This option allows you to specify a host event handler command that is to be run for every host state change. The global event handler is executed immediately prior to the event handler that you have optionally specified in each host definition. The maximum amount of time that this command can run is controlled by the event_handler_timeout option.
pt_pt: Essa opção permite especificar um manipulador de eventos que é chamado sempre que um estado do host é alterado. O gerenciador de eventos global é executado logo antes do manipulador de eventos que você especificou opcionalmente na definição do host. O tempo máximo de execução deste comando é determinado pela variável event_handler_timeout.

source: This option allows you to specify a service event handler command that is to be run for every service state change. The global event handler is executed immediately prior to the event handler that you have optionally specified in each service definition. The maximum amount of time that this command can run is controlled by the event_handler_timeout option.
pt_pt: Essa opção permite especificar um manipulador de eventos que é chamado sempre que um estado altera um serviço. O manipulador de eventos global é executado imediatamente antes do manipulador de eventos que você especificou opcionalmente na definição de serviço. O tempo máximo de execução deste comando é determinado pela variável event_handler_timeout.

source: This is the number of seconds that Monitoring Engine will sleep before checking to see if the next service or host check in the scheduling queue should be executed. Note that Monitoring Engine will only sleep after it "catches up" with queued service checks that have fallen behind.
pt_pt: Esse é o número de segundos que o mecanismo de supervisor adormecerá antes de verificar se a próxima verificação de serviço ou host na fila deve ser executada. Observe que o mecanismo de supervisão só vai adormecer depois de limpar as verificações de serviço atrasadas na fila.

source: This option allows you to specify the maximum number of service checks that can be run in parallel at any given time. Specifying a value of 1 for this variable essentially prevents any service checks from being run in parallel. Specifying a value of 0 (the default) does not place any restrictions on the number of concurrent checks. You'll have to modify this value based on the system resources you have available on the machine that runs Monitoring Engine, as it directly affects the maximum load that will be imposed on the system (processor utilization, memory, etc.).
pt_pt: Esta opção permite especificar o número máximo de verificações de serviço que podem ser executadas em paralelo em um determinado momento. Um valor de 1 impede a paralelização. Um valor de 0 (padrão) não impõe nenhuma restrição no número de verificações simultâneas. Você ajustará esse valor de acordo com os recursos da máquina que executa o mecanismo de supervisor, pois isso afeta diretamente a carga do sistema (processador, memória, etc.).

source: This option determines the maximum number of minutes from when Monitoring Engine starts that all hosts (that are scheduled to be regularly checked) are checked. This option will automatically adjust the host inter-check delay method (if necessary) to ensure that the initial checks of all hosts occur within the timeframe you specify. In general, this option will not have an effect on host check scheduling if scheduling information is being retained using the use_retained_scheduling_info option. Default value is 30 (minutes).
pt_pt: Essa opção determina o número máximo de minutos entre iniciar o mecanismo de monitoramento e verificar todos os hosts (que devem ser verificados regularmente). Essa opção ajusta automaticamente a política de atraso entre as verificações de host (se necessário) para garantir que as verificações iniciais de todos os hosts ocorram dentro do intervalo de tempo especificado. Em geral, essa opção não tem efeito no agendamento de verificações de host se as informações de agendamento forem retidas usando a opção use_retained_scheduling_info. O valor padrão é 30 (minutos).

source: This option determines the maximum number of minutes from when Monitoring Engine starts that all services (that are scheduled to be regularly checked) are checked. This option will automatically adjust the service inter-check delay method (if necessary) to ensure that the initial checks of all services occur within the timeframe you specify. In general, this option will not have an effect on service check scheduling if scheduling information is being retained using the use_retained_scheduling_info option. Default value is 30 (minutes).
pt_pt: Essa opção determina o número máximo de minutos entre iniciar o mecanismo de monitoramento e verificar todos os serviços (que devem ser verificados regularmente). Essa opção ajusta automaticamente a política de atraso entre verificações de serviço (se necessário) para garantir que as verificações iniciais de todos os serviços ocorram dentro do intervalo de tempo especificado. Em geral, essa opção não tem efeito no cronograma de verificações de serviço se as informações de cronograma forem retidas usando a opção use_retained_scheduling_info. O valor padrão é 30 (minutos).

source: This option determines how service checks are interleaved. Interleaving allows for a more even distribution of service checks, reduced load on remote hosts, and faster overall detection of host problems. By default this value is set to s (smart) for automatic calculation of the interleave factor. Don't change unless you have a specific reason to change it. Setting this value to a number greater than or equal to 1 specifies the interleave factor to use. A value of 1 is equivalent to not interleaving the service checks.
pt_pt: Esta opção determina como os controles de serviços são intercalados. O entrelaçamento permite uma melhor distribuição de controles de serviço, reduz a carga em hosts remotos e acelera a detecção de problemas de host. Por padrão, esse valor é definido como s (inteligente) para o cálculo automático do fator de intercalação. Não altere esse valor, a menos que você tenha uma razão especial para isso. Configurar esse valor para um número maior ou igual a 1 especifica o fator de intercalação a ser usado. Um valor de 1 é equivalente a não intercalar as verificações de serviço.

source: This option allows you to control how service checks are initially "spread out" in the event queue. Enter "s" for using a "smart" delay calculation (the default), which will cause Monitoring Engine to calculate an average check interval and spread initial checks of all services out over that interval, thereby helping to eliminate CPU load spikes. Using no delay ("n") is generally not recommended, as it will cause all service checks to be scheduled for execution at the same time. This means that you will generally have large CPU spikes when the services are all executed in parallel. Use a "d" for a "dumb" delay of 1 second between service checks or supply a fixed value of x.xx seconds for the inter-check delay.
pt_pt: Esta opção controla como as verificações de serviço são inicialmente "distribuídas" na fila. Digite "s" para um cálculo de atraso "inteligente" (padrão), o mecanismo de supervisão calculará um intervalo de tempo médio entre as verificações e distribuirá as verificações iniciais dos serviços nesse intervalo, o que ajuda a eliminar os picos de carga da CPU. O valor sem atraso ("n") geralmente não é recomendado, pois ele programa todas as verificações de serviço ao mesmo tempo. Isso significa que os picos de consumo da CPU são geralmente importantes quando as verificações de serviço são executadas em paralelo. Insira o valor "d" para um atraso padrão de 1 segundo entre as verificações de serviço ou forneça um valor fixo de x.xx segundos para o atraso entre as verificações.

source: This option allows you to control how host checks are initially "spread out" in the event queue. Enter "s" for using a "smart" delay calculation (the default), which will cause Monitoring Engine to calculate an average check interval and spread initial checks of all hosts out over that interval, thereby helping to eliminate CPU load spikes. Using no delay ("n") is generally not recommended, as it will cause all host checks to be scheduled for execution at the same time. This means that you will generally have large CPU spikes when the hosts are all executed in parallel. Use a "d" for a "dumb" delay of 1 second between host checks or supply a fixed value of x.xx seconds for the inter-check delay.
pt_pt: Essa opção controla como as verificações de host são inicialmente "distribuídas" na fila. Digite "s" para um cálculo de atraso "inteligente" (padrão), o mecanismo de supervisão calculará um intervalo de tempo médio entre verificações e distribuirá as verificações iniciais dos hosts nesse intervalo, o que ajuda a eliminar os picos de carga da CPU. O valor sem atraso ("n") geralmente não é recomendado porque ele programa todas as verificações de host ao mesmo tempo. Isso significa que os picos de consumo da CPU geralmente são grandes quando as verificações de host estão sendo executadas em paralelo. Insira o valor "d" para um atraso padrão de 1 segundo entre as verificações de serviço ou forneça um valor fixo de x.xx segundos para o atraso entre as verificações.

source: This option allows you to control the frequency in seconds of check result "reaper" events. "Reaper" events process the results from host and service checks that have finished executing. These events constitute the core of the monitoring logic in Monitoring Engine.
pt_pt: Esta opção permite controlar a frequência de consolidação de eventos em segundos. A consolidação de eventos processa os resultados das verificações de host e serviço concluídas. Esses eventos formam o coração da lógica de supervisão do mecanismo de supervisão.

source: This option determines whether or not Monitoring Engine will translate DOWN/UNREACHABLE passive host check results to their "correct" state from the viewpoint of the local Monitoring Engine instance. This can be very useful in distributed and failover monitoring installations. Option is disabled by default.
pt_pt: Isso determina se o resultado motor de monitoramento ou não os estados indisponíveis / inacessíveis d`Hote os resultados da auditoria em um "corrigido" viu l`instance local, o mecanismo de monitoramento. Isso pode ser muito útil em ambientes distribuídos ou redundantes. Esta opção está desativada por padrão.

source: This option determines whether or not Monitoring Engine will treat passive host checks as HARD states or SOFT states. By default, a passive host check result will put a host into a HARD state type. This option is disabled by default.
pt_pt: Essa opção determina se o mecanismo de monitoramento considera as verificações de host passivas como HARD ou SOFT. Por padrão, o resultado de uma verificação de host passiva resulta em um status HARD. Esta opção está desativada por padrão.

source: This option determines whether or not Monitoring Engine will attempt to automatically reschedule active host and service checks to "smooth" them out over time. This can help to balance the load on the monitoring server, as it will attempt to keep the time between consecutive checks consistent, at the expense of executing checks on a more rigid schedule.<br><b>Warning:</b> this is an experimental feature and may be removed in future versions. Enabling this option can degrade performance - rather than increase it - if used improperly!
pt_pt: Essa opção determina se o mecanismo de monitoramento tenta ou não reagendar automaticamente as verificações de host e serviço ativas para "espalhá-las" ao longo do tempo. Isso pode ajudar a equilibrar a carga no servidor de monitoramento, pois ele tentará manter o tempo entre verificações consecutivas consistentes, em detrimento da realização das verificações de acordo com um cronograma apertado. <br> <b> Aviso: </ b> esse recurso é experimental e pode ser removido em versões futuras. Ativar esta opção pode degradar o desempenho - em vez de aumentá-lo - é mal utilizado!

source: This option determines how often Monitoring Engine will attempt to automatically reschedule checks. This option only has an effect if the auto_reschedule_checks option is enabled. Default is 30 seconds.
pt_pt: Essa opção determina com que frequência o mecanismo de monitoramento tentará reprogramar automaticamente as verificações. Essa opção tem efeito somente se a opção auto_reschedule_checks estiver ativada. Padrão para 30 segundos.

source: This option determines the "window" of time that Monitoring Engine will look at when automatically rescheduling checks. Only host and service checks that occur in the next X seconds (determined by this variable) will be rescheduled. This option only has an effect if the auto_reschedule_checks option is enabled. Default is 180 seconds (3 minutes).
pt_pt: Essa opção determina a "janela" de horas na qual o mecanismo de gerenciamento reprograma automaticamente as verificações. Somente as verificações de host e serviço que ocorrerem nos próximos N segundos (determinadas por essa variável) serão reprogramadas. Esta opção só tem efeito se a opção auto_reschedule_checks estiver ativada. O valor padrão é de 180 segundos (3 minutos).

source: Monitoring Engine tries to be smart about how and when it checks the status of hosts. By default this option is disabled and will allow Monitoring Engine to make some smarter decisions and check hosts a bit faster. Enabling this option will increase the amount of time required to check hosts, but may improve reliability a bit. Unless you have problems with Monitoring Engine not recognizing that a host recovered, I would suggest not enabling this option.
pt_pt: O mecanismo de monitoramento tenta ser inteligente sobre como e quando verificar o status dos hosts. Por padrão, esta opção está desativada e permitirá que o mecanismo de monitoramento tome melhores decisões e verifique os hosts mais rapidamente. Ativar essa opção aumenta o tempo necessário para verificar hosts, mas também pode melhorar a confiabilidade. Esta opção não deve ser ativada, a menos que o mecanismo de supervisor tenha dificuldade em detectar um retorno normal para um host.

source: This option determines whether or not Monitoring Engine will try and detect hosts and services that are "flapping". Flapping occurs when a host or service changes between states too frequently, resulting in a barrage of notifications being sent out. When Monitoring Engine detects that a host or service is flapping, it will temporarily suppress notifications for that host/service until it stops flapping. Flap detection is very experimental at this point, so use this feature with caution! More information on how flap detection and handling works can be found here. Note: If you have state retention enabled, Monitoring Engine will ignore this setting when it (re)starts and use the last known setting for this option (as stored in the state retention file), unless you disable the use_retained_program_state option. This option is disabled by default.
pt_pt: Esta opção determina se o mecanismo de monitoramento tentará detectar hosts e serviços que estão "oscilando". Oscilação é quando um host ou serviço muda de estado com muita freqüência, causando uma grande quantidade de notificações enviadas. Quando o mecanismo de gerenciamento detecta que um host ou serviço está oscilando, ele remove temporariamente as notificações para esse host / serviço até que ele pare a varredura. A detecção de oscilação é muito experimental neste momento, então use esta função cuidadosamente! Para mais informações sobre a detecção de oscilação e ações podem ser encontradas na documentação do mecanismo de supervisão. Nota: Se a retenção de estado estiver ativa, o mecanismo de gerenciamento irá ignorar esse parâmetro no (re) start e usar seu último valor conhecido para essa opção (conforme armazenado no ficheiro de retenção de estado), a menos que você desabilite a opção use_retained_program_state. Esta opção está desativada por padrão.
