Repository: centreon/centreon-archived
Catalog: lang/*/LC_MESSAGES/help.po
Languages: pt_pt

source: Define a short name to identify the time period.
pt_pt: Define um nome curto para identificar o período de tempo.

source: Use the alias as a longer name or description to identify the time period.
pt_pt: Use o alias como nome ou descrição longa para identificar o período de tempo.

source: The weekday directives are comma-delimited lists of time ranges that are "valid" times for a particular day of the week. Each time range is in the form of HH:MM-HH:MM, where hours are specified on a 24 hour clock. For example, 00:15-24:00 means 12:15am in the morning for this day until 12:00am midnight (a 23 hour, 45 minute total time range). If you wish to exclude an entire day from the timeperiod, simply do not include it in the timeperiod definition.
pt_pt: As definições de períodos de tempo diários são intervalos de tempo válidos correspondentes a um dia específico da semana. Cada intervalo é da forma HH: MM-HH: MM, onde os horários são especificados em um relógio de 24 horas. Por exemplo, o período 00: 15-24: 00 significa 00:15 da manhã até a meia-noite (um período de 23 horas e 45 minutos). Para excluir um dia inteiro, simplesmente não o inclua na definição do período.

source: You can specify several different types of exceptions to the standard rotating weekday schedule. Exceptions can take a number of different forms including single days of a specific or generic month, single weekdays in a month, or single calendar dates. You can also specify a range of days/dates and even specify skip intervals to obtain functionality described by "every 3 days between these dates". Weekdays and different types of exceptions all have different levels of precedence, so it is important to understand how they can affect each other.
pt_pt: É possível especificar diferentes tipos de inclusão no período de tempo. Essas inclusões sobrecarregarão a definição do (s) dia (s) do período clássico. Essas definições podem assumir várias formas diferentes, como um intervalo de tempo para um dia específico, o primeiro dia de cada mês, a cada três dias para um período específico. É importante verificar as sobreposições de inclusão para evitar surpresas.

source: This directive is used to specify other timeperiod used as a timeperiod model.
pt_pt: Esta diretiva é usada para adicionar períodos de tempo adicionais.

source: This directive is used to specify other timeperiod definitions whose time ranges should be excluded from this timeperiod.
pt_pt: Esta diretiva é usada para especificar outros períodos de tempo que devem ser excluídos deste período de tempo.

source: Enter the trap name as specified in the MIB file and send by the SNMP master agent.
pt_pt: Digite o nome da armadilha conforme especificado no ficheiro MIB e enviado pelo agente SNMP.

source: Enter the full numeric object identifier (OID) starting with .1.3.6 (.iso.org.dod).
pt_pt: Digite o identificador numérico completo do objeto (OID) começando com .1.3.6 (.iso.org.dod).

source: Choose a vendor from the list. The vendor must have been created beforehand.
pt_pt: Escolha um provedor na lista. O fornecedor deve ter sido criado antecipadamente.

source: Switch the submission of trap results to monitoring engine on or off.
pt_pt: Ativa ou desativa o envio de traps para o mecanismo do supervisor.

source: Enter the status message to be submitted to monitoring engine. The original trap message will be placed into the entered string at the position of the variable $*.
pt_pt: Digite a mensagem de status para enviar para o mecanismo de supervisão. O conteúdo do "Trap" original será inserido na mensagem inserida anteriormente, em vez da variável $ *.

source: Choose the service state to be submitted to monitoring engine together with the status message. This simple mode can be used if each trap can be mapped to exactly 1 monitoring engine status.
pt_pt: Escolha o status do serviço que será enviado ao mecanismo de supervisão com a mensagem de status. Este modo simples pode ser usado se cada armadilha puder ser associada com exatamente um estado do mecanismo de supervisão.

source: Severities are defined in the service category object.
pt_pt: Criticalidades são definidas no nível da categoria de objeto.

source: Enable advanced matching mode for cases where a trap relates to multiple monitoring engine states and the trap message has to be parsed.
pt_pt: Ativa o modo de pesquisa avançada nos casos em que uma interceptação é conectada a vários mecanismos de supervisor e a mensagem de interceptação foi analisada.

source: Define one or multiple regular expressions to match against the trap message and map it to the related monitoring engine service state. Use <a href='http://perldoc.perl.org/perlre.html'>perlre</a> for the format and place the expression between two slashes.
pt_pt: Defina uma ou mais expressões regulares para corresponder a mensagem de interceptação e o mapa ao estado de serviço do mecanismo de monitoramento relacionado. Use <a href=`http://perldoc.perl.org/perlre.html`> perlre </a> para o formato e coloque a expressão entre duas barras.

source: Choose whether or not the associated service should be actively rechecked after submission of this trap.
pt_pt: Define se é necessário ou não controlar ativamente o serviço depois de receber um trap SNMP.

source: Choose whether or not a special command should be run by centreontrapd when this trap was received.
pt_pt: Se um comando especial deve ou não ser executado pelo processo centreontrapd quando um trap SNMP é recebido.

source: Define the command to execute by centreontrapd's trap handler. The command must be located in the PATH of the centreontrapd user.
pt_pt: Define o comando executado pelo gerenciador de eventos do processo centreontrapd. Este comando deve executar um binário disponível no PATH do utilizador centrontrapd.

source: Comment to describe per example the situation in which this trap will be send. Additionally the format and the parameters of the trap can be described.
pt_pt: Comentário para dar mais precisão na definição do trap SNMP, por exemplo, indicando os parâmetros contidos.

source: Enable/Disable routing definition
pt_pt: Ativa / desativa o roteamento de traps SNMP

source: Routing definition to choose host(s)
pt_pt: Regra de roteamento para selecionar o host final no qual encaminhar o trap SNMP

source: Permits to filter services of host(s). Skip if service_description not equals to the value set.
pt_pt: Filtra por serviço. Não execute a ação se o campo "service_description" não for igual ao valor definido.

source: PREEXEC commands are executed after 'routing' and before 'matching', 'actions'
pt_pt: Os comandos PREEXEC são executados após os comandos de roteamento e antes das regras correspondentes (REGEXP no status) e das regras de ação.

source: Whether or not traps will be inserted into database. Disabled by default
pt_pt: Permite registrar no base de dados cada captura SNMP recebida. Esta opção está desativada por padrão.

source: Minimum delay necessary for a trap to be processed after another one
pt_pt: Tempo mínimo necessário entre o processamento de 2 traps SNMP.

source: Whether execution interval will be applied to identical OIDs or identical OIDs and hosts
pt_pt: O intervalo de execução será aplicado para OIDs ou OIDs / pares de host

source: Defines the trap execution method
pt_pt: Define o método de processamento ao receber o trap SNMP

source: Skip trap if host or service is in downtime when centreontrapd proceeds. 'History' option is more accurate but needs more powers. The option works only with centreon-broker AND central mode.
pt_pt: Não executa o processamento associado à definição de interceptação SNMP, se o serviço associado for tempo de inatividade. Caso o método "Historized" seja selecionado, o processo centreontrapd se conectará ao base de dados para recuperar essas informações. Esta opção só funciona para o processamento de traps SNMP no servidor central Centreon com o módulo Centreon Broker.

source: Regexp for removing or change some characters in output message (Example: s/\|/-/g).
pt_pt: Expressão racional permitindo modificar certos caracteres do status detalhado (saída). Exemplo: s / \ | / - / g

source: Submit or not the status to the monitoring engine, related to the rules
pt_pt: Transmitir ou não o status para o mecanismo de supervisão de acordo com os parâmetros inseridos nas regras

source: Maximum execution time of trap processing. This includes Preexec commands, submit command and special command
pt_pt: Tempo máximo de execução do processo de processamento de interceptação SNMP. Este tempo inclui comandos PREEXEC, enviando o resultado e executando comandos especiais.

source: Custom Perl code. Will be executed with no change (security issue. Need to set centreontrapd secure_mode to '1')
pt_pt: Código Perl personalizado. Ele será executado sem alteração (opção de segurança). Requer definir a opção "secure_mode" como 1 na configuração do processo centreontrapd.

source: Choose a service from the list. The service must have been created beforehand.
pt_pt: Escolha um serviço da lista. O serviço deve ter sido criado antecipadamente.

source: Choose a service template from the list. The service template must have been created beforehand.
pt_pt: Selecione um modelo de serviço na lista. Esse modelo de serviço deve primeiro ter sido criado.

source: Choose the update mode for the below field: incremental adds the selected values, replacement overwrites the original values.
pt_pt: Escolha o método de atualização para os campos abaixo: incremental (adiciona valores selecionados), substituir (sobrescreve os valores originais).

source: The host name defined here is used in host group and service definitions to reference this particular host.
pt_pt: O nome do host definido aqui é usado na definição do grupo de hosts e um serviço para se referir a esse host específico.

source: The alias is used to define a longer name or description for the host.
pt_pt: Alias ​​é usado para definir um nome longo ou uma descrição para o host.

source: Define the address of the host here. Normally, this should be an IP address, but a FQDN can be used to identify the host instead. If DNS services are not reachable a FQDN could cause problems.
pt_pt: Defina o endereço do host aqui. Normalmente, isso deve ser um endereço IP, mas um nome FQDN pode ser usado para identificar o host. Se os serviços DNS não estiverem acessíveis, um nome FQDN poderá causar problemas.

source: The SNMP community and version specified here can be referenced in the check command by using the $_HOSTSNMPCOMMUNITY$ and $_HOSTSNMPVERSION$ macros.
pt_pt: A comunidade SNMP e a versão especificada aqui podem ser referenciadas nos comandos de controle usando as macros $ _HOSTSNMPCOMMUNITY $ e $ _HOSTSNMPVERSION $.

source: In a distributed monitoring environment, the monitoring node (central or satellite) for this host can be specified here.
pt_pt: Em um ambiente de supervisão distribuída, o nó de supervisão (central ou satélite) para este host pode ser especificado aqui.

source: Define the timezone of the host's location.
pt_pt: Define o fuso horário para a localização do host.

source: This is where you specify the template that you want to inherit properties/variables from. Inherited properties doesn't need to be specified again. "Local" object variables always take precedence over variables defined in the template object. Objects can inherit properties/variables from multiple levels of template objects. When defining multiple sources, the first template specified takes precedence over the later one, in the case where a property is defined in both.
pt_pt: Isso permite que você adicione modelos de host para herdar propriedades / variáveis ​​deles. Propriedades herdadas não devem ser redefinidas. De fato, propriedades / variáveis ​​definidas localmente neste objeto sobrescreverão propriedades / variáveis ​​predefinidas em modelos vinculados. Objetos podem herdar propriedades de vários níveis de modelos. Ao definir vários modelos e no caso em que a mesma propriedade é definida em vários locais, a prioridade será dada àquela do primeiro modelo vinculado.

source: By enabling this option, the services linked to the template will be created independent of the template and attached to this service.
pt_pt: Ao ativar essa opção, os serviços serão criados e vinculados a esse host com base nos modelos de serviço relacionados ao modelo.

source: This directive is used to specify the time period during which active checks of this host can be executed.
pt_pt: Este parâmetro é usado para especificar o período de tempo durante o qual os serviços ativos podem ser executados para este host.

source: Specify the command that should be used to check if the host is up or down. Typically, this command would try and ping the host to see if it is "alive". On a non-OK state monitoring engine will assume the host is down. A blank argument disables active checks for the host status and Monitoring Engine will always assume the host is up. This is useful if you are monitoring printers or other devices that are frequently turned off.
pt_pt: Essa variável é usada para identificar o nome abreviado do comando a ser usado para controlar se o host responde ou não. Normalmente, esse comando tentará fazer ping no host para ver se ele está ativo. Para um estado não OK, o mecanismo de supervisão achará que o host não está acessível. Se você deixar essa variável vazia, esse host não será controlado ativamente. Assim, o mecanismo de monitoramento certamente assumirá que esse host responde (pode ser indicado no estado PENDENTE na interface da web). Isso é muito útil se você supervisionar impressoras ou equipamentos que estão freqüentemente desligados.

source: Specify the parameters for the selected check command here. The format is: !ARG1!ARG2!...ARGn
pt_pt: Especifica as configurações do comando de controle selecionado. O formato é:! ARG1! ARG2! ... ARGn

source: Define the number of times that monitoring engine will retry the host check command if it returns any non-OK state. Setting this value to 1 will cause monitoring engine to generate an alert immediately. Note: If you do not want to check the status of the host, you must still set this to a minimum value of 1. To bypass the host check, just leave the check command option blank.
pt_pt: Define o número de vezes que o planejador executará novamente o comando de controle do host, se o estado retornado não for OK. A escolha do valor 1 força o agendador a gerar uma notificação imediatamente. Nota: Se você não quer controlar o estado l`hôte, você ainda precisa escolher um maior ou igual a 1. Para contornar o l`hôte controle, não definir comando de controle.

source: Define the number of "time units" between regularly scheduled checks of the host. With the default time unit of 60s, this number will mean multiples of 1 minute.
pt_pt: Define o número de "unidade de tempo" entre as verificações agendadas programadas do host. Com a unidade padrão de 60s, esse número significará um múltiplo de 1 minuto.

source: Define the number of "time units" to wait before scheduling a re-check for this host after a non-UP state was detected. With the default time unit of 60s, this number will mean multiples of 1 minute. Once the host has been retried max_check_attempts times without a change in its status, it will revert to being scheduled at its "normal" check interval rate.
pt_pt: Define o número de "unidades de tempo" a decorrer antes de programar um novo controle para esse host depois que um estado indisponível foi detectado. Com a unidade padrão de 60s, esse número será um múltiplo de 1 minuto. Se o status do host for o mesmo após ser reprogramado quantas vezes forem especificadas na opção max_check_attempts, o intervalo de controle será revertido para o definido na opção de intervalo de verificação.

source: Enable or disable active checks (either regularly scheduled or on-demand) of this host here. By default active host checks are enabled.
pt_pt: Ativa ou desativa controles ativos (mesmo controles regulares ou sob demanda) neste host. Por padrão, os controles de host ativos estão habilitados.

source: Enable or disable passive checks here. When disabled submitted states will be not accepted.
pt_pt: Ativar ou desativar verificações passivas. Quando a opção é desativada, os estados enviados não serão aceitos.

source: Specify whether or not notifications for this host are enabled.
pt_pt: Especifica se as notificações para este host estão ativadas ou não.

source: When enabled, the contact definition will not override the definitions on template levels, it will be appended instead.
pt_pt: Quando habilitado, a definição de contactos adicionais não substitui as definições dos modelos, ele será concluído.

source: When enabled, the contactgroup definition will not override the definitions on template levels, it will be appended instead.
pt_pt: Quando ativada, a definição de grupos adicionais de contactos não substitui as definições dos modelos, ela será concluída.

source: This is a list of contacts that should be notified whenever there are problems (or recoveries) with this host. Useful if you want notifications to go to just a few people and don't want to configure contact groups. You must specify at least one contact or contact group in each host definition (or indirectly through its template).
pt_pt: Esta é a lista de contactos que devem ser notificados sempre que houver um problema (ou recuperação) com esse host. Útil se você quiser notificações para apenas algumas pessoas e não quiser configurar grupos de contactos. Você deve especificar pelo menos um contacto ou grupo de contactos em cada definição de host (ou indiretamente por meio de seu modelo).

source: When enabled, the contact group definition will not override the definitions on template levels, it will be appended instead.
pt_pt: Quando ativada, a definição de grupos adicionais de contactos não substitui as definições dos modelos, ela será concluída.

source: This is a list of contact groups that should be notified whenever there are problems (or recoveries) with this host. You must specify at least one contact or contact group in each host definition.
pt_pt: Esta é a lista de grupos de contactos que devem ser notificados toda vez que houver um problema (ou recuperação) com esse host. Você deve especificar pelo menos um contacto ou grupo de contactos em cada definição de host.

source: Define the number of "time units" to wait before re-notifying a contact that this host is still down or unreachable. With the default time unit of 60s, this number will mean multiples of 1 minute. A value of 0 disables re-notifications of contacts about problems for this host - only one problem notification will be sent out.
pt_pt: Define o número de "unidades de tempo" para passar antes de notificar um contacto novamente sobre o estado indisponível ou inacessível desse host. Com a unidade padrão de 60s, esse número será um múltiplo de 1 minuto. Um valor de 0 desativa a notificação de contacto sobre os problemas desse host - uma única notificação será enviada quando um problema for detectado.

source: Specify the time period during which notifications of events for this host can be sent out to contacts. If a state change occurs during a time which is not covered by the time period, no notifications will be sent out.
pt_pt: Especifica os períodos de tempo durante os quais as notificações de eventos devem ser enviadas aos contactos. Se uma alteração de estado ocorrer de cada vez fora desse período de tempo, nenhuma notificação será enviada.

source: Define the states of the host for which notifications should be sent out. If you specify None as an option, no host notifications will be sent out. If you do not specify any notification options, monitoring engine will assume that you want notifications to be sent out for all possible states.
pt_pt: Define os estados do host para os quais as notificações serão enviadas. Se você selecionar a opção "Nenhum", nenhuma notificação será enviada para os hosts. Se você não definir nenhuma das opções, o agendador assumirá que você deseja que as notificações sejam enviadas para todos os estados possíveis.

source: Define the number of "time units" to wait before sending out the first problem notification when this host enters a non-UP state. With the default time unit of 60s, this number will mean multiples of 1 minute. If you set this value to 0, monitoring engine will start sending out notifications immediately.
pt_pt: Define o número de unidades de tempo a decorrer antes de enviar a primeira notificação de um problema no host, resultando em um estado não OK. Com a unidade padrão de 60s, esse número será um múltiplo de 1 minuto. Se esse valor for 0, o planejador enviará uma notificação assim que o problema aparecer.

source: Define the number of "time units" to wait before sending out the recovery notification when this host enters a non-UP state. The default time unit is 0 (this number will mean multiples of 1 minute). If you set this value to 0, monitoring engine will start sending out notifications immediately.
pt_pt: Define o número de "unidades de tempo" que devem decorrer antes de enviar a primeira notificação sobre recuperação devido a um estado de problema. Com a unidade padrão de 60s, esse número significará um múltiplo de 1 minuto. Se o valor especificado for 0, a notificação será enviada imediatamente.

source: Define the hostgroup(s) that this host belongs to. This directive may be used as an alternative to (or in addition to) defining the members in hostgroup definitions.
pt_pt: Define o grupo de hosts ao qual este host pertence. Esta opção pode ser usada como uma alternativa (ou suplemento) à escolha de membros feita nas definições de grupos de hosts.

source: Define categories in which this host belongs to. You can add this later by editing the host or the category you want to add it to.
pt_pt: Define as categorias às quais esse host pertence. Você pode adicionar isso mais tarde editando o host ou a categoria à qual deseja adicioná-lo.
