Repository: centreon/centreon-archived
Catalog: lang/*/LC_MESSAGES/help.po
Languages: pt_pt

source: This option enable a strict mode for the management of parent links between hosts on different pollers. Some hosts can have a parent link between them even if they are not monitored by the same poller. Select yes if you want to block the UI in order to oblige user to let host with a declared relation on the same poller. if you select No, during the generation process, relation will be broken and not generated but kept with Centreon Broker Correlation module.
pt_pt: Ativar essa opção permite, ao configurar os relacionamentos do kernel do host, forçar o utilizador a monitorar ambos os elementos (hosts pai e filho) no mesmo coletor de supervisão. Alguns hosts não são supervisionados pelo mesmo coletor e o relacionamento pode ser gerenciado pelo módulo do Centreon Broker por meio do módulo de correlação. Assim, a relação clássica de parentesco será removida da configuração enviada para o mecanismo, mas estará presente no ficheiro de correlação do Centreon Broker.

source: Centreon Support email: this email is uses in the Centreon footer in order to have a quick link in order to open an issue to your help desk.
pt_pt: Endereço de email da sua empresa. Esse endereço será exibido na parte inferior de cada página, permitindo que seus utilizadors entrem em contacto com você rapidamente.

source: Used protocol to join proxy.
pt_pt: Protocolo usado para o proxy da web.

source: URL of the proxy.
pt_pt: URL ou endereço IP do proxy web.

source: Port of the proxy.
pt_pt: Porta de conexão do proxy.

source: If this option is enable, the downtimes and acknowledgments will be displayed on metric chart.<br><b>Warning</b> : This option can slow down the display of chart.
pt_pt: Se esta opção estiver habilitada, os períodos de tempo de parada e de reconhecimento estarão visíveis nos gráficos. <br> <b> Aviso </ b>: Esta opção pode retardar o carregamento de gráficos.

source: If this option is enable, the comments will be displayed on status chart.<br><b>Warning</b> : This option can slow down the display of chart.
pt_pt: Se esta opção estiver habilitada, os períodos de tempo de paradas e confirmações serão visíveis nos gráficos que representam o estado do serviço. <br> <b> Aviso </ b>: Esta opção pode retardar o carregamento dos gráficos.

source: Default monitoring engine.
pt_pt: Mecanismo de supervisão padrão

source: Directory where images are stored.
pt_pt: Diretório onde as imagens são armazenadas.

source: Directory where check plugins are stored.
pt_pt: Diretório onde estão armazenados os probes de supervisão (plugin).

source: This is the number of seconds per "unit interval" used for timing in the scheduling queue, re-notifications, etc. "Units intervals" are used in the object configuration file to determine how often to run a service check, how often to re-notify a contact, etc. The default value for this is set to 60, which means that a "unit value" of 1 in the object configuration file will mean 60 seconds (1 minute).
pt_pt: Intervalo de tempo de referência em segundos usado para agendar verificações, notificações. O valor padrão é 60s (1 min), portanto, em todos os formulários, o intervalo de tempo da unidade será de 60 segundos (1 minuto).

source: Broker module used by Centreon.
pt_pt: Módulo intermediário usado pelo Centreon.

source: Init script for broker daemon.
pt_pt: Script de inicialização do broker.

source: Mailer binary with complete path.
pt_pt: Caminho completo do executável de envio de emails.

source: Maximum number of hosts to show in the Tactical Overview page.
pt_pt: Número máximo de hosts exibidos na página de visão geral.

source: Maximum number of services to show in the Tactical Overview page.
pt_pt: Número máximo de serviços exibidos na página de visão geral.

source: Refresh interval used in the Tactical Overview page.
pt_pt: Intervalo de atualização usado na página Visão geral da tática.

source: [Sticky] option is enabled by default.
pt_pt: Habilita essa opção padrão no formulário. Esta opção permite que você mantenha a confirmação em caso de mudança de status não OK.

source: [Notify] option is enabled by default.
pt_pt: Habilita essa opção padrão no formulário. Esta opção gera uma notificação que será enviada aos contactos vinculados ao objeto.

source: [Persistent] option is enabled by default.
pt_pt: Habilita essa opção padrão no formulário. Essa opção é usada para reposicionar o horário de parada se o mecanismo do supervisor for reiniciado.

source: [Acknowledge services attached to hosts] option is enabled by default.
pt_pt: Habilita essa opção padrão no formulário. Esta opção permite que você execute todos os serviços relacionados ao host.

source: [Force Active Checks] option is enabled by default.
pt_pt: Habilita essa opção padrão no formulário. Esta opção é usada para reprogramar uma verificação de serviço após a confirmação.

source: Fixed.
pt_pt: Habilita essa opção padrão no formulário. Esta opção permite programar um tempo de parada fixo.

source: [Set downtimes on services attached to hosts] option is enbaled by default.
pt_pt: Habilita essa opção padrão no formulário. Esta opção permite programar um horário de parada para os serviços relacionados ao host.

source: Default duration of scheduled downtimes.
pt_pt: Duração padrão dos horários de encerramento programados.

source: When enabled, notification messages are displayed when new alerts arise in the monitoring consoles.
pt_pt: Quando a opção está ativada, as mensagens de notificação são exibidas quando um novo alerta é exibido no Real Time Management Console.

source: When enabled, "Host Up" notification messages will be displayed.
pt_pt: Se essa opção estiver ativada, uma janela pop-up aparecerá para sinalizar um host em um status "Para cima".

source: When enabled, "Host Down" notification messages will be displayed.
pt_pt: Se esta opção estiver habilitada, uma janela pop-up aparecerá para sinalizar um host em estado inacessível.

source: When enabled, "Host Unreachable" notification messages will be displayed.
pt_pt: Se essa opção estiver ativada, uma janela pop-up aparecerá para sinalizar um host em um status desconhecido.

source: When enabled, "Service OK" notification messages will be displayed.
pt_pt: Se esta opção estiver habilitada, uma janela pop-up aparecerá para sinalizar um serviço em um status OK.

source: When enabled, "Service Warning" notification messages will be displayed.
pt_pt: Se esta opção estiver habilitada, uma janela pop-up aparecerá para sinalizar um serviço em um status "Aviso".

source: When enabled, "Service Critical" notification messages will be displayed.
pt_pt: Se essa opção estiver ativada, uma janela pop-up aparecerá para sinalizar um serviço em um status "Crítico".

source: When enabled, "Service Unknown" notification messages will be displayed.
pt_pt: Se esta opção estiver habilitada, uma janela pop-up aparecerá para sinalizar um serviço em um status desconhecido.

source: RRDTOOL binary complete path.
pt_pt: O caminho completo do executável do RRDTool.

source: RRDTool version.
pt_pt: Versão do RRDTool.

source: Font style of titles.
pt_pt: Estilo dos títulos das fontes.

source: Font size of titles.
pt_pt: Tamanho da fonte dos títulos.

source: Font style of units.
pt_pt: Estilo de polícia das unidades.

source: Font size of units.
pt_pt: Tamanho da fonte das unidades.

source: Font style of X-axis and Y-axis.
pt_pt: Estilo de fonte do eixo X e Y

source: Font size of X-axis and Y-axis.
pt_pt: Tamanho da fonte do eixo X e Y

source: Font style of captions.
pt_pt: Estilo de fonte de legendas.

source: Font size of captions.
pt_pt: Tamanho da fonte da legenda.

source: Font style of watermarks.
pt_pt: Estilo de fonte de marcas d'água.

source: Font size of watermarks.
pt_pt: Tamanho da fonte das marcas d'água.

source: Enable the rrdcached for Centreon. This option is valid only with Centreon Broker
pt_pt: Ative o RRDCached para o Centreon. Essa opção é usada apenas com o Centreon Broker.

source: Port for communicating with rrdcached
pt_pt: Porta de comunicação com RRDCached

source: The absolute path to unix socket for communicating with rrdcached
pt_pt: O caminho do soquete Unix para se comunicar com o RRDCached

source: Name of resource rule.
pt_pt: Nome da regra de recurso.

source: Description of resource rule.
pt_pt: Descrição da regra de recursos.

source: Implied ACL groups.
pt_pt: Grupos de acesso vinculados.

source: Enable or disable the ACL resource rule.
pt_pt: Ativa ou desativa a regra de acesso a recursos.

source: Comments regarding this resource rule.
pt_pt: Comente sobre essa regra de recurso.

source: Hosts that will be displayed to users. Services that belong to these hosts will also be visible.
pt_pt: Hosts que serão exibidos aos utilizadors. Os serviços que pertencem a esses hosts também estarão visíveis.

source: Host groups that will be displayed to users. Hosts that belong to these host groups will also be visible.
pt_pt: Grupos de hosts que serão exibidos para os utilizadors. Os hóspedes que pertencem a esses grupos de hosts também estarão visíveis.

source: Excluding hosts from the selected host groups will hide them from users.
pt_pt: A exclusão de hosts de grupos de hosts permite que eles sejam ocultados dos utilizadors.

source: Service groups that will be displayed to users. Services that belong to these service groups will also be visible.
pt_pt: Grupos de serviços que serão exibidos aos utilizadors. Os serviços pertencentes a esses grupos de serviços também estarão visíveis.

source: Meta services that will be displayed to users.
pt_pt: Meta-serviços que serão exibidos aos utilizadors.

source: Will only display resources that are monitored by these pollers. When blank, no filter is applied.
pt_pt: Apenas os recursos supervisionados por esses coletores serão exibidos. Quando nada é selecionado, nenhum filtro é aplicado.

source: Will only display hosts that belong to these host categories. When blank, no filter is applied.
pt_pt: Só mostrará os hosts que pertencem a essas categorias de host. Quando nada é selecionado, nenhum filtro é aplicado.

source: Will only display services that belong to these service categories. When blank, no filter is applied.
pt_pt: Só mostrará serviços que pertencem a essas categorias de serviço. Quando nada é selecionado, nenhum filtro é aplicado.

source: Name of action rule.
pt_pt: Nome da regra de acesso.

source: Description of action rule.
pt_pt: Descrição da regra de acesso.

source: The monitoring overview will be displayed at the top of all pages.
pt_pt: A visão geral do status de hosts e serviços será exibida em todas as páginas como tabelas.

source: The monitoring poller status overview will be displayed at the top of all pages.
pt_pt: A visão geral do status dos coletores será exibida em todas as páginas como tabelas.

source: The poller filter will be available to users in the monitoring consoles.
pt_pt: O filtro de seleção de coletores estará disponível para os utilizadors nas páginas "Supervisão -> Hosts" e "Supervisão -> Serviços".

source: Allows users to stop the monitoring systems.
pt_pt: Permite que os utilizadors parem o mecanismo de monitoramento na interface.

source: Allows users to restart the monitoring systems.
pt_pt: Permite que os utilizadors reiniciem o mecanismo de monitoramento na interface.

source: Allows users to enable or disable notifications.
pt_pt: Permite que os utilizadors ativem ou desativem notificações.

source: Allows users to enable or disable service checks.
pt_pt: Permite que os utilizadors ativem ou desativem os controles de serviço.

source: Allows users to enable or disable passive service checks.
pt_pt: Permite que os utilizadors habilitem ou desabilitem verificações passivas de serviço.

source: Allows users to enable or disable host checks.
pt_pt: Permite que os utilizadors ativem ou desativem controles de host.

source: Allows users to enable or disable passive host checks.
pt_pt: Permite que os utilizadors ativem ou desativem controles passivos para hosts.

source: Allows users to enable or disable event handlers.
pt_pt: Permite que os utilizadors ativem ou desativem o manipulador de eventos.

source: Allows users to enable or disable flap detection.
pt_pt: Permite que os utilizadors ativem ou desativem a detecção de serviços de flapping.

source: Allows users to enable or disable obsessive service checks.
pt_pt: Permite que os utilizadors habilitem ou desabilitem a execução do comando OCSP (Post Service Control Command).

source: Allows users to enable or disable obsessive host checks.
pt_pt: Permite que os utilizadors habilitem ou desabilitem o OCHP (Host Control Post Command).

source: Allows users to enable or disable performance data processing.
pt_pt: Permite que os utilizadors habilitem ou desabilitem o processamento de dados de desempenho.

source: Allows users to enable or disable checks of a service.
pt_pt: Permite que os utilizadors ativem ou desativem o controle de um serviço.

source: Allows users to enable or disable notifications of a service.
pt_pt: Permite que os utilizadors ativem ou desativem a notificação de um serviço.

source: Allows users to acknowledge a service.
pt_pt: Permite que os utilizadors adicionem uma confirmação para um serviço.

source: Allows users to remove an acknowledgement from a service.
pt_pt: Permite que os utilizadors cancelem o reconhecimento de um serviço.

source: Allows users to re-schedule next check of a service.
pt_pt: Permite que os utilizadors reprograme o próximo controle de um serviço.

source: Allows users to re-schedule next check of a service by placing its priority to the top.
pt_pt: Permite que os utilizadors reprogramem o próximo controle de um serviço, priorizando a execução do serviço no topo da fila de execução.

source: Allows users to schedule downtime on a service.
pt_pt: Permite que os utilizadors programem um horário de desligamento para um serviço.

source: Allows users to add or delete a comment of a service.
pt_pt: Permite que os utilizadors adicionem ou removam comentários de um serviço.

source: Allows users to enable or disable the event handler processing of a service.
pt_pt: Permite que os utilizadors habilitem ou desabilitem o manipulador de eventos para um manipulador de eventos.

source: Allows users to enable or disable flap detection of a service.
pt_pt: Permite que os utilizadors ativem ou desativem a detecção de bagagem para um serviço (flapping).

source: Allows users to enable or disable passive checks of a service.
pt_pt: Permite que os utilizadors ativem ou desativem o monitoramento passivo de um serviço.

source: Allows users to submit result to a service.
pt_pt: Permite que os utilizadors enviem um resultado para um serviço.

source: Allows users to enable or disable checks of a host.
pt_pt: Permite que os utilizadors ativem ou desativem controles para um host.

source: Allows users to enable or disable notifications of a host.
pt_pt: Permite que os utilizadors ativem ou desativem a notificação de um host.

source: Allows users to acknowledge a host.
pt_pt: Permite que os utilizadors adicionem uma confirmação para um host.

source: Allows users to remove an acknowledgement from a host.
pt_pt: Permite que os utilizadors limpem a confirmação de um host.

source: Allows users to re-schedule next check of a host.
pt_pt: Permite que os utilizadors reprogradem o controle de um host.

source: Allows users to re-schedule next check of a host by placing its priority to the top.
pt_pt: Permite aos utilizadors reprogramar o próximo controle de um host, priorizando a execução do host no topo da fila de execução.

source: Allows users to schedule downtime on a host.
pt_pt: Permite que os utilizadors programem um horário de desligamento para um host.

source: Allows users to add or delete a comment of a host.
pt_pt: Permite que os utilizadors adicionem ou removam comentários para um host.

source: Allows users to enable or disable the event handler processing of a host.
pt_pt: Permite que os utilizadors habilitem ou desabilitem o manipulador de eventos para um evento.

source: Allows users to enable or disable flap detection of a host.
pt_pt: Permite que os utilizadors ativem ou desativem a detecção de bagagem para um host (flapping).

source: Allows users to enable or disable all service checks of a host.
pt_pt: Permite que os utilizadors ativem ou desativem todos os serviços em um host.

source: Allows users to enable or disable service notifications of a host.
pt_pt: Permite que os utilizadors ativem ou desativem notificações de serviço de um host.

source: Allows users to submit result to a host.
pt_pt: Permite que os utilizadors enviem um resultado para um host.

source: Enable or disable the ACL action rule.
pt_pt: Ativa ou desativa a regra de acesso.

source: Name of menu rule.
pt_pt: Nome da regra de menu.

source: Alias of menu rule.
pt_pt: Alias ​​da regra nos menus.

source: Enable or disable the ACL menu rule.
pt_pt: Ativar ou desativar a regra de acesso ao menu.

source: Comments regarding this menu rule.
pt_pt: Comentário da regra de acesso aos menus.

source: Name of access group.
pt_pt: Nome do grupo de acesso.

source: Alias of access group.
pt_pt: Alias ​​do grupo de acesso.

source: Implied users.
pt_pt: Utilizadors relacionados.

source: Implied user groups.
pt_pt: Grupos de utilizadors relacionados.

source: Enable or disable the access group.
pt_pt: Ativar ou desativar o grupo de acesso.

source: ACL resource rules that are linked to the access group.
pt_pt: Acesse regras para os recursos que serão vinculados a esse grupo.

source: ACL menu rules that are linked to the access group.
pt_pt: Acesse regras para os menus que serão vinculados a este grupo.

source: ACL action rules that are linked to the access group.
pt_pt: Regras de acesso referentes às ações que serão vinculadas a este grupo.

source: Enter a new name for the image.
pt_pt: Digite um novo nome para a imagem.

source: Enter an already existing or a new directory to add the uploads to it. A non-existent directory name will be created first.
pt_pt: Digite o nome de uma pasta existente ou uma nova pasta para adicionar as imagens enviadas. Um diretório que não existe será criado primeiro.

source: Select a local file to upload. You can upload jpg, png, gif and gd2 files. Multiple images can be uploaded together inside archives like zip, tar, tar.gz or tar.bz2.
pt_pt: Selecione um ficheiro local para enviar. Você pode enviar um ficheiro do tipo jpg, png, gif e gd2. Múltiplas imagens podem ser enviadas dentro de um ficheiro do tipo zip, tar, tar.gz ou tar.bz2.

source: Destination directory.
pt_pt: Diretório de destino.

source: Images.
pt_pt: Imagens

source: Name of graph template.
pt_pt: Nome do modelo de gráfico.

source: Vertical Label (Y-axis).
pt_pt: Rótulo Vertical (Eixo Y).

source: Width of grid.
pt_pt: Largura da grade.

source: Height of grid.
pt_pt: Altura da grade.

source: Lower limit of grid.
pt_pt: Limite baixo da grade.

source: Upper limit of grid.
pt_pt: Limite alto da grade.

source: Base value.
pt_pt: Valor base.

source: Enables component split.
pt_pt: Ativar separação de componentes.

source: Enables auto scale of graph.
pt_pt: Ative a escala automática do gráfico.

source: Set as default graph template.
pt_pt: Modelo de gráfico padrão.

source: Comments regarding the graph template.
pt_pt: Comentário do modelo de gráfico.

source: Name of virtual metric.
pt_pt: Nome da métrica virtual.

source: Host / Service Data Source.
pt_pt: Fonte de dados de host / serviço.

source: DEF Type.
pt_pt: Tipo do DEF.

source: RPN (Reverse Polish Notation) Function *.
pt_pt: Função NPI (Notação Polonesa Reversa) *.

source: Metric unit.
pt_pt: Unidade da métrica.

source: Warning threshold.
pt_pt: Aviso de limite.

source: Critical threshold.
pt_pt: Limite Crítico.

source: Hides curve and legend.
pt_pt: Ocultar curvas e legendas.

source: Comments regarding the virtual metric.
pt_pt: Comente a métrica virtual.

source: Name of curve template.
pt_pt: Nome do modelo da curva.

source: It is possible to define a specific service for the data source.
pt_pt: É possível definir um serviço específico para a fonte de dados.

source: Must be the display name of the metric. Refer to the check plugin for more information.
pt_pt: Deve ser o nome da métrica. Consulte a sonda para mais informações.

source: Enables graph stacking.
pt_pt: Ativar o empilhamento de gráficos.

source: Display order.
pt_pt: Ordem de exibição.

source: Inverted curve (with negative values).
pt_pt: Curva invertida (com valores negativos).

source: Curve thickness.
pt_pt: Espessura da curva.

source: Curve line color.
pt_pt: Cor da curva.

source: Curve area color.
pt_pt: Cor da área de preenchimento da curva.

source: Curve transparency.
pt_pt: Transparência da curva.

source: Enables area filling.
pt_pt: Ativar preenchimento

source: Legend Name.
pt_pt: Nome da legenda.

source: Displays the legend only, thus hiding the curve.
pt_pt: Exibe apenas a legenda, ocultando a curva.

source: Number of line breaks after the legend.
pt_pt: Número de novas linhas após a legenda.

source: Prints maximum value.
pt_pt: Exibe o valor máximo.

source: Prints minimum value.
pt_pt: Exibe o valor mínimo.

source: Rounds the value.
pt_pt: Arredonda o valor.

source: Prints average value.
pt_pt: Exibe o valor médio.

source: Prints last Value.
pt_pt: Exibe o último valor.

source: Print total value.
pt_pt: Exibe o valor total.

source: Comments regarding the curve template.
pt_pt: Comente sobre o modelo de curva.

source: This is the file that Monitoring Engine uses to store the current status, comment, and downtime information. This file is deleted every time Monitoring Engine stops and recreated when it starts.
pt_pt: Este é o ficheiro que o Mecanismo de Supervisão usa para armazenar os status atuais, comentários e informações de tempo de parada. Esse ficheiro é excluído toda vez que o Mecanismo de Supervisão é interrompido e, em seguida, é recriado quando é reiniciado.

source: Combined with the aggregate_status_updates option, this option determines the frequency (in seconds!) that Nagios will periodically dump program, host, and service status data. If you are not using aggregated status data updates, this option has no effect. The minimum update interval is 2 seconds.
pt_pt: Combinada com a opção aggregate_status_updates, essa opção determina a frequência (em segundos) que o mecanismo de monitoramento periodicamente liberará os dados do programa, do host e do estado de serviço. Se você não usar atualizações de status cumulativas, essa opção não terá efeito. O intervalo mínimo é de 2 segundos.

source: Location (path and filename) where Monitoring Engine should create its main log file.
pt_pt: Local (caminho e nome do ficheiro) onde o Mecanismo de Supervisão deve criar seu ficheiro de log principal.

source: Directory where Centreon will export Monitoring Engine object configuration files to. Monitoring Engine will parse all .cfg files in this directory.
pt_pt: Diretório em que o Centreon exportará os ficheiros de configuração relacionados aos objetos do Mecanismo de Supervisão. Isso irá verificar todos os ficheiros .cfg neste diretório.

source: This is a temporary file that Monitoring Engine periodically creates and uses when updating comment data, status data, etc. The file is deleted when it is no longer needed.
pt_pt: Esse é um ficheiro temporário que o mecanismo de supervisão cria periodicamente durante a atualização de comentários, status e assim por diante. Este ficheiro é excluído quando não é mais necessário.
