Repository: centreon/centreon-archived
Catalog: lang/*/LC_MESSAGES/help.po
Languages: pt_pt

source: Parent hosts are typically routers, switches, firewalls, etc. that lie between the monitoring host and a remote hosts. A router, switch, etc. which is closest to the remote host is considered to be that host\'s "parent". If this host is on the same network segment as the host doing the monitoring (without any intermediate routers, etc.) the host is considered to be on the local network and will not have a parent host. Leave this value blank if the host does not have a parent host (i.e. it is on the same segment as the Monitoring Engine host). The order in which you specify parent hosts has no effect on how things are monitored. Note that notification features based on host inheritance will not work if the hosts are not monitored by the same poller.
pt_pt: Os hosts pai são tipicamente roteadores, switches, firewalls e assim por diante. que estão localizados entre o host supervisionado e o servidor de supervisão. O elemento de rede que está mais próximo do elemento supervisionado é considerado seu pai. Se este equipamento estiver localizado no mesmo segmento de rede que o host supervisionado, ele não será considerado seu pai. A ideia é descrever todos os links físicos entre dispositivos localizados entre o servidor de coleta e o host supervisionado. Para cada equipamento intermediário, será necessário supervisioná-lo e informar seus pais. No caso em que existem vários links físicos para alcançar o equipamento a ser supervisionado, é necessário informar o último para indicar ao mecanismo de coleta que existe um caminho para alcançar o elemento. Relacionamentos pai permitem que você desabilite a supervisão de itens por trás do equipamento em um status "Abaixo". Assim, o console irá destacar o equipamento \ "Down \" e considerar seu filho como inacessível. Todos os hosts devem ser supervisionados pelo mesmo coletor de supervisão para explicar as relações de parentesco.

source: Instead of specifying the parent hosts in the child's parent definition, it's possible to do it the other way round and specify all child hosts in the parent's definition.
pt_pt: Em vez de especificar os hosts pai na definição dos relacionamentos pai, você pode fazer isso na outra direção e especificar todos os filhos na definição pai.

source: Specify one or more templates of services that should be linked to this host's template. A host deployed from this host's template will benefit all services themselves based from services' templates previously linked.
pt_pt: Especifique um ou mais modelos de serviços que devem ser vinculados ao modelo desse host. Um host implantado a partir do modelo deste host beneficiará todos os serviços com base nos modelos de serviços vinculados anteriormente.

source: This directive determines whether or not checks for this host will be "obsessed" over. When enabled the obsess over host command will be executed after every check of this host.
pt_pt: Este parâmetro determina se os comandos de reversão de controle serão ativados. Quando habilitado, o comando de check-up do host será executado após cada verificação desta máquina.

source: This directive is used to determine whether or not freshness checks are enabled for this host. When enabled monitoring engine will trigger an active check when last passive result is older than the value defined in the threshold. By default freshness checks are enabled.
pt_pt: Essa opção é usada para determinar se os controles de atualização devem ou não ser ativados para esse host. Quando habilitado, o agendador acionará um controle ativo assim que a data do último resultado passivo recebido for obsoleta em relação ao valor limite definido. Os controles de frescura são ativados por padrão.

source: Specify the freshness threshold (in seconds) for this host. If you set this directive to a value of 0, monitoring engine will determine a freshness threshold to use automatically.
pt_pt: Especifica o limite de atualização (em segundos) para o estado do host. Se esta opção estiver definida como 0, o planejador determinará automaticamente um limite de atualização a ser usado.

source: This directive is used to determine whether or not flap detection is enabled for this host.
pt_pt: Esta diretiva é usada para determinar se a detecção de bagagem está ativada ou não para esse host.

source: This directive is used to specify the low state change threshold used in flap detection for this host. If you set this directive to a value of 0, the program-wide value will be used.
pt_pt: Essa diretiva é usada para especificar o estado de limite baixo usado na detecção de oscilação para esse host. Se você definir essa diretiva para um valor de 0, o valor será usado para o host inteiro.

source: This directive is used to specify the high state change threshold used in flap detection for this host. If you set this directive to a value of 0, the program-wide value will be used.
pt_pt: Essa diretiva é usada para especificar o estado de limite baixo usado na detecção de oscilação para esse host. Se você definir essa diretiva para um valor de 0, o valor será usado para o host inteiro.

source: This directive is used to determine whether or not the processing of performance data is enabled for this host.
pt_pt: Esta diretiva é usada para habilitar ou desabilitar o processamento de dados de desempenho para este host.

source: This directive is used to determine whether or not status-related information about the host is retained across program restarts. This is only useful if you have enabled the global state retention option.
pt_pt: Essa diretiva é usada para determinar se as informações de status do host são mantidas após cada reinicialização do programa. Isso só será útil se você tiver ativado a opção de retenção de estado global.

source: This directive is used to determine whether or not non-status information about the host is retained across program restarts. This is only useful if you have enabled state retention using the retain_state_information directive.
pt_pt: Essa diretiva é usada para determinar se as informações não relacionadas ao status do host são mantidas após cada reinicialização do programa. Isso só será útil se você tiver ativado a opção de retenção de estado global.

source: This directive determines which host states "stalking" is enabled for.
pt_pt: Esta diretiva é usada para atualizar o ficheiro de retenção no caso de a mensagem de saída mudar mesmo que o status do objeto permaneça o mesmo.

source: This directive is used to determine whether or not the event handler for this host is enabled.
pt_pt: Essa diretiva é usada para determinar se o manipulador de eventos desse host está ativado.

source: The event handler command is triggered whenever a change in the state of the host is detected, i.e. whenever it goes down or recovers.
pt_pt: O comando do manipulador de eventos é acionado sempre que uma alteração no estado do host é detectada, ou seja, quando falha ou é recuperada.

source: This parameters are passed to the event handler commands in the same way check command parameters are handled. The format is: !ARG1!ARG2!...ARGn
pt_pt: Esses parâmetros são passados ​​para o controle do manipulador de eventos da mesma maneira que os parâmetros do comando de controle são usados. O formato é o seguinte:! ARG1! ARG2! ... ARGn

source: Specify a duration of acknowledgement for this host or host depending to this template. If you leave it blank, no timeout will be set.
pt_pt: Especifique um tempo máximo antes de limpar a confirmação de confirmações para este host ou os hosts herdados deste modelo. Deixe em branco para não especificar uma duração máxima.

source: Define an optional URL that can be used to provide more information about the host. Any valid URL can be used. This can be very useful if you want to make detailed information on the host, emergency contact methods, etc. available to other support staff.
pt_pt: Define um URL opcional que pode ser usado para fornecer mais informações sobre o host. Qualquer URL válido pode ser usado. Isso pode ser muito útil se você quiser fornecer informações detalhadas sobre o host, contactos para procedimentos de emergência e assim por diante. para outras pessoas da equipe de suporte.

source: Define an optional string of notes pertaining to the host.
pt_pt: Define notas opcionais para este host.

source: Define an optional URL that can be used to provide more actions to be performed on the host. You will see the link to the action URL in the host details.
pt_pt: Defina uma URL opcional que possa ser usada para fornecer mais ações para executar no host. Você verá o link nos detalhes do host.

source: Define the image that should be associated with this host here. This image will be displayed in the various places. The image will look best if it is 40x40 pixels in size.
pt_pt: Defina a imagem que deve ser associada a esse host. Esta imagem será exibida em diferentes lugares. A imagem terá uma renderização melhor se for 40x40 pixels.

source: Define an optional string that is used in the alternative description of the icon image.
pt_pt: Define uma string opcional que será usada na descrição alternativa da imagem.

source: Define the VRML image that should be associated with this host. This image will be used as the texture map for the specified host in the 3D statuswrl CGI in monitoring engine.
pt_pt: Defina a imagem VRML que deve ser associada a este host. Esta imagem será usada como logotipo para o host especificado no status 3D do 3D do mecanismo de supervisão.

source: Define an image that should be associated with this host in the statusmap CGI in monitoring engine. You can choose a JPEG, PNG, and GIF image. The GD2 image format is preferred, as other image formats must be converted first when the statusmap image is generated. The image will look best if it is 40x40 pixels in size.
pt_pt: Define uma imagem que deve ser associada a esse host no CGI de statusmap no mecanismo de monitoramento. Você pode escolher uma imagem JPEG, PNG e GIF. O formato de imagem GD2 é preferível, pois outros formatos de imagem precisam ser convertidos primeiro quando a imagem do mapa de status é gerada. A imagem terá uma resolução melhor se tiver um tamanho de 40x40 pixels.

source: Geographical coordinates use by Centreon Map module to position element on map. Define "Latitude,Longitude", for example for Paris coordinates set "48.51,2.20"
pt_pt: Coordenadas geográficas usadas pelo módulo Centreon Map para posicionar os elementos. Expresso em "Latitude, Longitude", por exemplo, para as coordenadas de Paris, digite "48,51,2,20"

source: Define the coordinates to use when drawing the host in the statusmap CGI. Coordinates should be given in positive integers, as they correspond to physical pixels in the generated image. The origin for drawing (0,0) is in the upper left hand corner of the image and extends in the positive x direction (to the right) along the top of the image and in the positive y direction (down) along the left hand side of the image. For reference, the size of the icons drawn is usually about 40x40 pixels (text takes a little extra space). The coordinates you specify here are for the upper left hand corner of the host icon that is drawn. Note: Don't worry about what the maximum x and y coordinates that you can use are. The CGI will automatically calculate the maximum dimensions of the image it creates based on the largest x and y coordinates you specify.
pt_pt: Essa variável é usada para definir as coordenadas a serem usadas para o host no CGI do statusmap. As coordenadas devem ser dadas em inteiro positivo porque correspondem aos pixels na imagem gerada. O início do mapa (0,0) está no canto superior esquerdo da imagem e se estende para positivo na direção x (direita) a partir do topo da imagem e positivo na direção y. (embaixo) da borda esquerda da imagem. Para referência, o tamanho dos ícones é geralmente 40x40 pixels (o texto ocupa um pouco mais de espaço). As coordenadas especificadas aqui são para o canto superior esquerdo do ícone do host para depalavra-passer. Nota: Não se preocupe com o número máximo de coordenadas que você pode usar aqui. O CGI calculará automaticamente as dimensões máximas da imagem que cria com base nos maiores valores de x e y que você especificar.

source: Define the coordinates to use when drawing the host in the statuswrl CGI. Coordinates can be positive or negative real numbers. The origin for drawing is (0.0,0.0,0.0). For reference, the size of the host cubes drawn is 0.5 units on each side (text takes a little more space). The coordinates you specify here are used as the center of the host cube.
pt_pt: Defina as coordenadas a serem usadas ao depalavra-passer o host no CGI do statuswrl. Coordenadas podem ser números reais positivos ou negativos. A origem para o desenho é (0.0,0.0,0.0). Para referência, o tamanho dos cubos hospedeiros depalavra-passedos é de 0,5 unidades em cada lado (o texto ocupa um pouco mais de espaço). As coordenadas especificadas aqui são usadas como o centro do cubo do host.

source: Severity level use to sort issue in Monitoring menu.
pt_pt: Criticalidade, usada para classificar objetos no menu Supervisão.

source: This is required so that you can access your host after creation. Some selected resource groups may contain filter, thus still preventing you from seeing the new host. In this case, make sure to link your Host to a Host Category.
pt_pt: Essa configuração é necessária para acessar o host depois que ele é criado porque sua conta está sujeita a controles de acesso. Nesse caso, apenas as contas de administrador da Web do Centreon poderão visualizar e modificar esse host.

source: Macros are used as object-specific variables/properties, which can be referenced in commands and extended infos. Example: a macro named MACADDRESS can be referenced as $_HOSTMACADDRESS$.
pt_pt: As macros são usadas como variáveis ​​/ propriedades específicas, que podem ser usadas em comandos e informações adicionais. Exemplo: uma macro denominada MACADDRESS pode ser referenciada como $ _HOSTMACADDRESS $.

source: This directive is used to define an alternate name that should be displayed in the web interface for this host. If not specified, this defaults to the value you specify as host name.
pt_pt: Essa diretiva é usada para definir um nome alternativo que possa ser exibido na interface da web para esse host. Se não especificado, o nome do host será usado por padrão.

source: This directive is used to determine what host states the flap detection logic will use for this host.
pt_pt: Essa diretiva é usada para determinar qual estado de host a detecção de bagagem usará para esse host.

source: By default monitoring engine will assume that all hosts are in UP states when it starts. You can override the initial state for a host by using this directive.
pt_pt: Por padrão, o mecanismo de gerenciamento assumirá que todos os hosts estão no estado UP quando são iniciados. Você pode substituir o estado inicial de um host usando essa diretiva.

source: Name used for service in auto-deploy by template.
pt_pt: Nome usado para o serviço de auto-implantação por modelo.

source: Define the description of the service. It may contain spaces, dashes, and colons (semicolons, apostrophes, and quotation marks should be avoided). Services must have a unique description on a per host basis.
pt_pt: Define a descrição do serviço. Ele pode conter espaços, hífens e dois-pontos (ponto-e-vírgula, aspas simples e aspas devem ser evitados). Os serviços devem ter uma descrição única por host na qual eles são baseados.

source: This is where you specify the name of the template object that you want to inherit properties/variables from. Inherited properties doesn't need to be specified again. "Local" object variables always take precedence over variables defined in the template object. Objects can inherit properties/variables from multiple levels of template objects. When defining multiple sources, the first template specified takes precedence over the later one, in the case where a property is defined in both.
pt_pt: É aqui que você especifica o nome do modelo que deseja herdar de propriedades / variáveis. Propriedades herdadas não precisam ser especificadas novamente. Variáveis ​​"locais" sempre têm autoridade sobre as variáveis ​​definidas em um modelo. Objetos podem herdar propriedades / variáveis ​​de vários níveis de modelos. Ao definir várias origens, o primeiro modelo especificado tem autoridade sobre o último, no caso de uma propriedade ser configurada em ambos.

source: This directive is used to denote whether the service is "volatile". A volatile service resets its state to OK with every query. Services are normally not volatile.
pt_pt: Esta diretiva é usada para especificar se o serviço é "volátil". Um serviço volátil reconfigura seu estado para OK em todas as solicitações. Os serviços não são normalmente voláteis.

source: Specify the time period during which active checks of this service can be made.
pt_pt: Especifica o período de tempo que os controles ativos neste serviço serão feitos.

source: Specify the command that monitoring engine will run in order to check the status of the service.
pt_pt: Especifica o comando que o mecanismo de gerenciamento executará para verificar o status do serviço.

source: Specify the parameters for the selected check command here.
pt_pt: Especifica as configurações para o comando de monitoramento selecionado aqui.

source: Define the number of times that monitoring engine will retry the service check command if it returns any state other than an OK state. Setting this value to 1 will cause monitoring engine to generate an alert without retrying the service check again. (default value: 0)
pt_pt: Define o número de vezes que o mecanismo de monitoramento tentará novamente o comando de controle de serviço se ele retornar qualquer outro estado que não seja OK. Definir esse valor como 1 gerará um alerta sem tentar novamente. (padrão: 0)

source: Define the number of "time units" between regularly scheduled checks of the service. With the default time unit of 60s, this number will mean multiples of 1 minute. "Regular" checks are those that occur when the service is in an OK state or when the service is in a non-OK state, but has already been rechecked max_check_attempts number of times. (default value: 5)
pt_pt: Define o número de "unidade de tempo" entre verificações agendadas de serviço agendado. Com a unidade padrão de 60s, esse número significará um múltiplo de 1 minuto.

source: Define the number of "time units" to wait before scheduling a re-check for this service after a non-OK state was detected. With the default time unit of 60s, this number will mean multiples of 1 minute. Once the service has been retried max_check_attempts times without a change in its status, it will revert to being scheduled at its "normal" check interval rate. (default value: 1)
pt_pt: Define o número de "unidades de tempo" a decorrer antes de agendar um novo controle desse serviço depois que um estado indisponível foi detectado. Com a unidade padrão de 60s, esse número será um múltiplo de 1 minuto. Se o status desse serviço for idêntico após ser reprogramado quantas vezes forem especificadas na opção "Número de verificações antes da validação do status", o intervalo de controle será revertido para o definido na opção de intervalo de verificação.

source: Enable or disable active checks (either regularly scheduled or on-demand) of this service here. By default active service checks are enabled.
pt_pt: Ativa ou desativa as verificações ativas (mesmo verificações regulares ou sob demanda) desse serviço. Por padrão, as verificações de serviço ativas estão ativadas.

source: Specify whether or not notifications for this service are enabled.
pt_pt: Especifica se as notificações para este serviço estão ativadas ou não.

source: Specify whether or not the service will inherit host's contacts and contactgroups (if no contacts or contactgroups are defined for the service).
pt_pt: Indica se ou não o serviço irá herdar a definição de contactos e grupos l`hôte contactos (se não houver contactos ou grupos de contactos n`est definido para este serviço).

source: To fill
pt_pt: Para preencher

source: This is a list of contacts that should be notified whenever there are problems (or recoveries) with this service. Useful if you want notifications to go to just a few people and don't want to configure contact groups. You must specify at least one contact or contact group in each service definition (or indirectly through its template).
pt_pt: Esta é uma lista de contactos que devem ser notificados quando há problemas (ou retorna ao normal) com este serviço. Útil se você quiser enviar notificações para algumas pessoas e não quiser configurar grupos de contactos. Você deve especificar pelo menos um contacto ou grupo de contactos em cada definição de serviço (ou indiretamente por meio de seu modelo).

source: This is a list of contact groups that should be notified whenever there are problems (or recoveries) with this service. You must specify at least one contact or contact group in each service definition.
pt_pt: Esta é uma lista de grupos de contactos que devem ser notificados quando houver problemas (ou retornarem ao normal) com este serviço. Você deve especificar pelo menos um contacto ou grupo de contactos em cada definição de serviço.

source: Define the number of "time units" to wait before re-notifying a contact that this service is still in a warning or critical condition. With the default time unit of 60s, this number will mean multiples of 1 minute. A value of 0 disables re-notifications of contacts about problems for this service - only one problem notification will be sent out. (default value: 30)
pt_pt: Define o número de "unidades de tempo" para passar antes de notificar um contacto novamente sobre o status indisponível ou inacessível deste serviço. Com a unidade padrão de 60s, esse número será um múltiplo de 1 minuto. Um valor de 0 desativa a notificação de novos contactos sobre problemas com este serviço - uma única notificação será enviada quando um problema for detectado.

source: Specify the time period during which notifications of events for this service can be sent out to contacts. If a state change occurs during a time which is not covered by the time period, no notifications will be sent out.
pt_pt: Especifica o período durante o qual notificações de eventos para este serviço podem ser enviadas para contactos. Se ocorrer uma mudança de estado durante um período que não esteja coberto pelo período de tempo, nenhuma notificação será enviada.

source: Define the states of the service for which notifications should be sent out. If you specify None as an option, no service notifications will be sent out. If you do not specify any notification options, monitoring engine will assume that you want notifications to be sent out for all possible states.
pt_pt: Defina os estados de serviço para os quais as notificações devem ser enviadas. Se você não especificar nenhuma opção, nenhuma notificação será enviada. Se você não especificar as opções de notificação, o mecanismo de monitoramento assumirá que você deseja que as notificações sejam enviadas para todos os estados possíveis.
