Repository: centreon/centreon-archived
Catalog: lang/*/LC_MESSAGES/help.po
Languages: pt_pt

source: The full name is used to identify the contact in contact group definitions and in notifications.
pt_pt: O nome para exibição é usado para identificar o contacto na definição do grupo de contactos e nas notificações.

source: The alias is a short name used as login name in Centreon.
pt_pt: Alias ​​é o nome usado como login para o Centreon.

source: Specify the primary email address for the contact here. Additional (email) addresses can be defined under additional information of the contact. Depending on the notification command used, the email address can be used to send out email notifications.
pt_pt: Especifique aqui o primeiro endereço de email do contacto. Outros endereços podem ser definidos na seção de informações adicionais do contacto. Dependendo do comando de notificação usado, o endereço de e-mail pode ser usado para enviar e-mails de notificação.

source: Specify a pager number or an address at a pager gateway here. Any format is possible as long as it is supported by the notification command.
pt_pt: Especifique aqui um número de pager ou um endereço de gateway de pager. Qualquer formato é possível desde que seja suportado pelo comando de notificação.

source: Link the contact to the contactgroup(s) the user should belong to. This is an alternative way to specifying the members in contactgroup definitions.
pt_pt: Ligou o contacto ao (s) grupo (s) de contactos aos quais ele deveria pertencer. Esta é uma maneira alternativa de especificar os membros de um grupo de contactos.

source: Enable notification form for this user. If you select "no" , this contact will never be generated into configuration files.
pt_pt: Permite notificações para este utilizador. Se você selecionar "não", esse contacto nunca será gerado nos ficheiros de configuração.

source: Define the host states for which notifications can be sent out to this contact. If you specify None as an option, the contact will not receive any type of host notifications.
pt_pt: Define os estados dos hosts para os quais as notificações podem ser enviadas para esse contacto. Se você especificar "Nenhum" como uma opção, o contacto não receberá nenhum tipo de notificação para os hosts.

source: Specify the time period during which the contact can be notified about host problems or recoveries. You can think of this as an "on call" time for host notifications for the contact.
pt_pt: Especifica o período de tempo que o contacto pode ser notificado sobre problemas ou normalização de um host. Você pode imaginar isso como um "período de chamada" para as notificações de host desse contacto.

source: Define one or more commands used to notify the contact of a host problem or recovery. All notification commands are executed when the contact needs to be notified.
pt_pt: Defina um ou mais comandos usados ​​para notificar um contacto em busca de problemas ou retornos normais para um host. Todos os comandos de notificação são executados quando um contacto precisa ser notificado.

source: Define the service states for which notifications can be sent out to this contact. If you specify None as an option, the contact will not receive any type of service notifications.
pt_pt: Define os estados de serviço para os quais as notificações podem ser enviadas para esse contacto. Se a opção "Nenhum" for especificada, o contacto não receberá nenhum tipo de notificação para os serviços.

source: Specify the time period during which the contact can be notified about service problems or recoveries. You can think of this as an "on call" time for service notifications for the contact.
pt_pt: Especifica o período de tempo que o contacto pode ser notificado sobre problemas ou normalização de um serviço. Você pode imaginar isso como um "período de chamada" para notificações de serviço para esse contacto.

source: Define one ore more commands used to notify the contact of a service problem or recovery. All notification commands are executed when the contact needs to be notified.
pt_pt: Defina um ou mais comandos usados ​​para notificar um contacto em busca de problemas ou retornos normais para um serviço. Todos os comandos de notificação são executados quando um contacto precisa ser notificado.

source: Enter the LDAP Distinguished Name (DN) which identifies this user.
pt_pt: Digite o nome distinto do LDAP (DN) que identifica o utilizador.

source: LDAP groups of user, for informative purpose.
pt_pt: Grupos de utilizadors LDAP, para fins informativos.

source: Specify if the contact is allowed to login into centreon.
pt_pt: Especifica se o contacto pode se conectar ao Centreon.

source: Define the password for the centreon login here.
pt_pt: Defina aqui a palavra-passe para conectar-se ao Centreon.

source: Enter the password again.
pt_pt: Digite a palavra-passe novamente.

source: Define the default language for the user for the centreon front-end here.
pt_pt: Aqui você define o idioma padrão do utilizador para a interface Centreon.

source: Specify if the user has administrative permissions. Administrators are not restricted by access control list (ACL) settings.
pt_pt: Especifica se o utilizador possui direitos administrativos. Administradores não são restritos por Access Control Lists (ACLs).

source: Token used for autologin. Refer to the Centreon documentation to know more about its usage.
pt_pt: Token usado para conexão automática à interface. Consulte a documentação do Centreon para mais informações.

source: Specify the source for user credentials. Choose between Centreon and LDAP, whereas LDAP is only available when configured in Administration Options.
pt_pt: Especifica a origem das credenciais de login. Escolha entre Centreon e LDAP, embora o LDAP esteja disponível somente após configurá-lo no menu "Administração> Configurações".

source: Select the timezone, in which the user resides, from the list. The timezones are listed as time difference to Greenwich Mean Time (GMT) in hours.
pt_pt: Selecione na lista o fuso horário em que o utilizador mora. Os fusos horários são listados por hora da diferença do horário de Greenwich (GMT).

source: Allow this user to access to Centreon Rest API with its account.
pt_pt: Permitir que esta conta acesse a API REST do Centreon.

source: Addresses 1-6 are optional and used to define additional "addresses" for the contact. These addresses can be anything - cell phone numbers, instant messaging addresses, etc. - the format must be supported by your notification plugins.
pt_pt: Os endereços 1-6 são opcionais e usados ​​para definir "endereços" adicionais para o contacto. Esses endereços podem ser de qualquer tipo - número de telefone celular, endereço de mensagens instantâneas, etc. - O formato deve ser suportado pelos seus plugins de notificação.

source: This directive is used to determine whether or not the contact will receive notifications about host problems and recoveries.
pt_pt: Essa diretiva é usada para determinar se o contacto receberá ou não notificações sobre problemas ou normalização de um host.

source: This directive is used to determine whether or not the contact will receive notifications about service problems and recoveries.
pt_pt: Essa diretiva é usada para determinar se o contacto receberá ou não notificações sobre problemas ou retornará a um serviço normal.

source: This directive is used to determine whether or not the contact can submit external commands to monitoring engine from the CGIs.
pt_pt: Esta diretiva é usada para determinar se o contacto pode enviar comandos externos para o mecanismo de supervisão a partir dos CGIs.

source: This directive is used to determine whether or not status-related information about the contact is retained across program restarts. This is only useful if you have enabled state retention using the retain_state_information directive.
pt_pt: Essa variável é usada para determinar se as informações diferentes dos estados de contacto são retidas após o reinício do programa. Isso é útil apenas se você tiver ativado a retenção de estado usando a variável retain_state_information.

source: This directive is used to determine whether or not non-status information about the contact is retained across program restarts. This is only useful if you have enabled state retention using the retain_state_information directive.
pt_pt: Essa variável é usada para determinar se as informações diferentes dos estados de contacto são retidas após o reinício do programa. Isso é útil apenas se você tiver ativado a retenção de estado usando a variável retain_state_information.

source: ACL groups of user.
pt_pt: Grupo de utilizadors usado para configurar ACLs.

source: Enter a short name for the escalation to identify it.
pt_pt: Digite um nome curto para identificar a subida.

source: The alias is used to define a longer name or description for the escalation.
pt_pt: Alias ​​é usado para definir um nome longo ou uma descrição para escalada.

source: Enter a number that identifies the first notification for which this escalation is effective. For instance, if you set this value to 3, this escalation will only be used if the host is down or unreachable long enough for a third notification to go out.
pt_pt: Digite um número que identifique a primeira notificação para a qual a escalação está em vigor. Por enquanto, se você definir esse valor como 3, a escalação só será usada se o host estiver inativo ou inacessível por tempo suficiente para a terceira notificação ser enviada.

source: Enter a number that identifies the last notification for which this escalation is effective. For instance, if you set this value to 5, this escalation will not be used if more than five notifications are sent out for the host. Setting this value to 0 means to keep using this escalation entry forever (no matter how many notifications go out).
pt_pt: Digite um número que identifique a última notificação para a qual a escalação está em vigor. No momento, se você definir esse valor como 5, a escalação não será usada se mais de cinco notificações forem enviadas para esse host. Definir esse valor como 0 significa que você sempre precisa continuar subindo (independentemente de quantas notificações forem enviadas).

source: Select the interval at which notifications should be made while this escalation is valid. If you specify a value of 0 for the interval, Monitoring Engine will send the first notification when this escalation definition is valid, but will then prevent any more problem notifications from being sent out. Notifications are sent out again until the host or service recovers. This is useful if you want to stop having notifications sent out after a certain amount of time. Note: If multiple escalation entries overlap for one or more notification ranges, the smallest notification interval from all escalation entries is used.
pt_pt: Selecione a frequência com que as notificações devem ser feitas quando essa escalação for válida. Se você especificar um valor de 0 para este intervalo, o motor de verificação irá enviar a primeira notificação quando d`escalade definição será válida, mas, em seguida, parar l`envoi outras notificações. As notificações são enviadas até que o host ou serviço seja restabelecido. Isso é útil se você quiser parar de enviar notificações após um determinado período de tempo. Nota: Se várias entradas de escalonamento se sobrepuserem a um ou mais intervalos de notificação, o menor dos intervalos de notificação será usado.

source: Select the time period during which this escalation is valid. If no time period is specified, the escalation is considered to be valid during all times.
pt_pt: Selecione o período de tempo durante o qual a subida é válida. Se nenhum período for especificado, a subida é considerada válida o tempo todo.

source: Define the criteria that determine when the host escalation is used. The escalation is used only if the host is in one of the states specified in these options. If no options are specified in a host escalation, the escalation is considered to be valid during all host states.
pt_pt: Define os critérios que determinam quando a subida do host é usada. O escalonamento é usado apenas se o host estiver em um dos estados especificados nessas opções. Se nenhuma opção for especificada na subida do host, a subida é considerada válida para todos os estados do host.

source: Define the criteria that determine when the service escalation is used. The escalation is used only if the service is in one of the states specified in these options. If no options are specified in a service escalation, the escalation is considered to be valid during all service states.
pt_pt: Define os critérios que determinam quando o escalonamento de serviço é usado. O escalonamento é usado apenas se o serviço estiver em um dos estados especificados nessas opções. Se nenhuma opção for especificada no escalonamento de serviço, a escalação será considerada válida para todos os estados de serviço.

source: Select the contact group(s) that should be notified when the notification is escalated. You must specify at least one contact group in each escalation definition.
pt_pt: Selecione o (s) grupo (s) de contactos que devem ser notificados assim que a notificação for escalada. Você deve especificar pelo menos um grupo de contactos na definição de cada escalação.

source: Select the host(s) that the escalation should apply to or is associated with.
pt_pt: Selecione o (s) host (s) para o qual a subida deve ser aplicada ou associada.

source: Select the service(s) the escalation should apply to or is associated with.
pt_pt: Selecione o (s) serviço (s) para o qual a subida deve ser aplicada ou associada.

source: Select the hostgroup(s) that the escalation should apply to. The escalation will apply to all hosts that are members of the specified hostgroup(s).
pt_pt: Selecione o (s) grupo (s) de hosts para os quais a subida deve ser aplicada. A escalação será aplicada a todos os hosts que são membros do grupo de hosts especificado.

source: Select the service group(s) the escalation should apply to or is associated with. The escalation will apply to all services that are members of the specified service group(s).
pt_pt: Selecione o (s) grupo (s) de serviço para os quais a escalação deve ser aplicada. A escalação será aplicada a todos os membros do serviço do grupo de serviços especificado.

source: Select the meta service(s) the escalation should apply to or is associated with.
pt_pt: Selecione o serviço meta para o qual a subida deve ser aplicada ou associada.

source: Select contacts that should be notified whenever there are problems (or recoveries) with this host. Useful if you want notifications to go to just a few people and don't want to configure contact groups. You must specify at least one contact or contact group in each host escalation definition.
pt_pt: Selecione os utilizadors que podem ser notificados quando houver problemas (ou retornar ao normal) neste host. Essa opção é útil se você quiser notificar alguns utilizadors sem configurar grupos de utilizadors. Você deve especificar pelo menos um utilizador ou grupo de utilizadors para cada escalação de host.

source: Define a short name for the service group here. The short name will be used to display the service group in monitoring, views and reporting.
pt_pt: Aqui você define um nome curto para o grupo de serviços. Esse nome será usado para exibir o grupo de serviços na supervisão, visualizações e relatórios.

source: Define a longer name or description for the service group here.
pt_pt: Aqui você define um nome longo ou uma descrição para o grupo de serviços.

source: This is a list of host-bound services that should be included in this service group.
pt_pt: Esta é uma lista de serviços relacionados ao host que devem ser incluídos neste grupo de serviços.

source: This is a list of host group-bound services that should be included in this service group.
pt_pt: Esta é uma lista de serviços por grupo de hosts e deve ser incluída nesse grupo de serviços.

source: This is a list of service templates that should be included in this service group. Service template needs to be associated with a host template in order to show up here.
pt_pt: Esse campo é usado para selecionar modelos de serviço, portanto, serviços que herdam modelos selecionados serão automaticamente adicionados ao grupo de serviços. Apenas modelos de serviço vinculados a modelos de host são fornecidos nesse campo.

source: This optional directive can be used to include services from other "sub" service groups in this service group.
pt_pt: Esse parâmetro opcional pode ser usado para incluir serviços de outros grupos de serviços "sob" neste grupo de serviços.

source: This directive is used to define an optional string of notes pertaining to the service group. If you specify a note here, you will see it in the extended information CGI (when you are viewing information about the specified service group).
pt_pt: Essa opção é usada para ligar uma sequência opcional como uma observação sobre o grupo de serviços. Se você especificar uma nota aqui, ela ficará visível nas informações estendidas (quando você visualizar essas informações sobre o serviço de grupo em questão).

source: This directive is used to define an optional URL that can be used to provide more information about the service group. Any valid URL can be used. If you plan on using relative paths, the base path will be the same as what is used to access the CGIs (i.e. /cgi-bin/nagios/). This can be very useful if you want to make detailed information on the service group, emergency contact methods, etc. available to other support staff.
pt_pt: Define um URL opcional que pode ser usado para adicionar informações adicionais. Qualquer URL válido pode ser usado. Caso as URLs sejam relativas, elas serão baseadas no acesso CGI (isto é, / cgi-bin / nagios para o controlador Nagios). Isso pode ser muito útil para adicionar informações detalhadas sobre o grupo de serviços, métodos de contacto de backup, etc., disponíveis para outras pessoas de suporte.

source: This directive is used to define an optional URL that can be used to provide more actions to be performed on the service group. Any valid URL can be used. If you plan on using relative paths, the base path will be the same as what is used to access the CGIs (i.e. /cgi-bin/nagios/).
pt_pt: Essa opção é usada para definir uma URL opcional que pode ser usada para permitir que ações adicionais sejam executadas no grupo de serviços. Qualquer URL válido pode ser usado. Se você quiser usar caminhos relativos d, o caminho base será o mesmo usado para acessar CGIs (por exemplo: / cgi-bin / nagios /)

source: The name is used to identify the group with a short name.
pt_pt: Nome abreviado do grupo para identificá-lo rapidamente.

source: Select traps to be grouped. Execution will be sequential.
pt_pt: Selecione os traps SNMP que serão agrupados. O processamento associado a traps SNMP será sequencial.

source: This directive is used to identify the host(s) that the service that is being depended upon (also referred to as the master service) "runs" on or is associated with.
pt_pt: Essa variável é usada para identificar o host (ou hosts) do qual o serviço do qual depende (também chamado de serviço mestre) ao qual está associado está em execução.

source: This directive is used to identify the description of the service that is being depended upon (also referred to as the master service).
pt_pt: Essa variável é usada para identificar a descrição de um serviço do qual um depende (também chamado de serviço mestre).

source: This directive is used to identify the host(s) that the dependent service "runs" on or is associated with. Leaving this directive blank can be used to create "same host" dependencies.
pt_pt: Essa variável é usada para identificar o host (ou hosts) no qual o serviço dependente ao qual ele está associado está em execução. Deixar essa variável vazia pode ser uma solução para criar dependências no mesmo host.

source: This directive is used to identify the short name(s) of the hostgroup(s) that the service that is being depended upon (also referred to as the master service) "runs" on or is associated with. Multiple hostgroups should be separated by commas. The hostgroup_name may be used instead of, or in addition to, the host_name directive.
pt_pt: Esta variável é usada para identificar o (s) nome (s) abreviado (s) do (s) grupo (s) de hosts dos quais o serviço de que depende (também chamado de serviço mestre) com o qual está associado está sendo executado. Vários grupos de hosts podem ser separados por vírgulas. A variável hostgroup_name pode ser usada no lugar ou em conjunto com a variável host_name.

source: This directive is used to specify the short name (s) of the hostgroup(s) that the dependent service "runs" on or is associated with. The dependent_hostgroup may be used instead of, or in addition to, the dependent_host directive.
pt_pt: Essa variável é usada para identificar o (s) nome (s) abreviado (s) do (s) grupo (s) de hosts no qual o serviço dependente ao qual ele está associado está em execução. Vários grupos de hosts podem ser separados por vírgulas. A variável dependent_hostgroup pode ser usada no lugar ou em conjunto com a variável dependent_host.

source: This directive is used to identify the description of the service group that is being depended upon (also referred to as the master service group).
pt_pt: Essa diretiva é usada para identificar a descrição do grupo de serviço do qual um depende (também chamado de grupo de serviços mestre).

source: This directive is used to identify the description of the dependent service group.
pt_pt: Essa variável é usada para identificar a descrição de um grupo de serviços dependente.

source: This directive is used to identify the description of the meta service that is being depended upon (also referred to as the master meta service).
pt_pt: Essa diretiva é usada para identificar a descrição de um serviço meta do qual um depende (também chamado de meta-serviço mestre).

source: This directive is used to identify the description of the dependent meta service.
pt_pt: Essa diretiva é usada para identificar a descrição de um meta service dependente.

source: This directive is used to identify the description of the dependent host.
pt_pt: Esta diretiva é usada para identificar a descrição do host dependente.

source: Name which will be used for identifying the connector.
pt_pt: Nome que será usado para identificar o conector

source: A short description of the connector.
pt_pt: Breve descrição do conector

source: The connector binary that centreon-engine will launch.
pt_pt: Caminho para o conector que será executado pelo mecanismo de gerenciamento.

source: Whether or not the connector is enabled.
pt_pt: Conector ativado ou desativado

source: Choose a local MIB file containing SNMP trap definitions to upload and import. The file will be parsed with snmpttconvertmib.
pt_pt: Escolha um ficheiro MIB local contendo as definições de traps SNMP para enviar e importar. O ficheiro será percorrido pelo snmpttconvertmib.

source: The contact group name is a short name used to identify the contact group in other sections.
pt_pt: O nome do grupo de contactos é um nome abreviado usado para identificar o grupo de contactos nas outras seções.

source: The alias is a longer name or description used to identify the contact group.
pt_pt: Alias ​​é um nome longo ou uma descrição usada para identificar o grupo de contactos.
