Repository: centreon/centreon-archived
Catalog: lang/*/LC_MESSAGES/help.po
Languages: pt_pt

source: This option is used to set the low threshold for detection of service flapping. For more information read the Monitoring Engine section about flapping.
pt_pt: Esta opção permite que você especifique o limite inferior para detectar a oscilação de um serviço. Para mais informações, leia a seção Gerenciamento de Oscilação da documentação do mecanismo de supervisão.

source: This option is used to set the high threshold for detection of service flapping. For more information read the Monitoring Engine section about flapping.
pt_pt: Esta opção permite que você especifique o limite superior para detectar a oscilação de um serviço. Para mais informações, leia a seção Gerenciamento de Oscilação da documentação do mecanismo de supervisão.

source: This option is used to set the low threshold for detection of host flapping. For more information read the Monitoring Engine section about flapping.
pt_pt: Esta opção permite que você especifique o limite inferior para detectar a oscilação de um host. Para mais informações, leia a seção Gerenciamento de Oscilação da documentação do mecanismo de supervisão.

source: This option is used to set the high threshold for detection of host flapping. For more information read the Monitoring Engine section about flapping.
pt_pt: Esta opção permite que você especifique o limite superior para detectar a oscilação de um host. Para mais informações, leia a seção Gerenciamento de Oscilação da documentação do mecanismo de supervisão.

source: This option determines whether or not Monitoring Engine will use soft state information when checking host and service dependencies. Normally Monitoring Engine will only use the latest hard host or service state when checking dependencies. If you want it to use the latest state (regardless of whether its a soft or hard state type), enable this option.
pt_pt: Esta opção determina se o mecanismo de monitoramento usará informações de estado programável do serviço ao controlar as dependências do serviço. Normalmente, o mecanismo de monitoramento usa apenas o último estado difícil do serviço ao verificar dependências. Se você quiser usar o último estado (seja hard ou soft), ative esta opção.

source: This is the maximum number of seconds that Monitoring Engine will allow service checks to run. If checks exceed this limit, they are killed and a CRITICAL state is returned. A timeout error will also be logged. This option is meant to be used as a last ditch mechanism to kill off plugins which are misbehaving and not exiting in a timely manner. It should be set to something high (like 60 seconds or more), so that each service check normally finishes executing within this time limit. If a service check runs longer than this limit, Monitoring Engine will kill it off thinking it is a runaway processes.
pt_pt: Esse é o número máximo de segundos alocados pelo mecanismo de monitoramento para verificar um serviço. Se o cheque exceder esse tempo, ele será eliminado e um status CRITICAL será retornado. Um erro de tempo limite também é registrado no ficheiro de log. Esta opção destina-se a ser usada como último recurso para matar probes que se comportam mal e não são concluídas no tempo alocado. O valor deve ser alto o suficiente (algo como 60 segundos ou mais), para que cada verificação possa ser concluída antes dessa hora. Se uma verificação de serviço for além desse limite, o mecanismo de monitoramento irá eliminá-lo, pensando que é um processo com problemas.

source: This is the maximum number of seconds that Monitoring Engine will allow host checks to run. If checks exceed this limit, they are killed and a CRITICAL state is returned and the host will be assumed to be DOWN. A timeout error will also be logged. This option is meant to be used as a last ditch mechanism to kill off plugins which are misbehaving and not exiting in a timely manner. It should be set to something high (like 60 seconds or more), so that each host check normally finishes executing within this time limit. If a host check runs longer than this limit, Monitoring Engine will kill it off thinking it is a runaway processes.
pt_pt: Esse é o número máximo de segundos alocados pelo mecanismo de monitoramento para verificar um host. Se o cheque exceder esse tempo, ele será cancelado, um status CRITICAL será retornado e o host será considerado UNAVAILABLE. Um erro de tempo limite também é registrado no ficheiro de log. Esta opção destina-se a ser usada como último recurso para matar probes que se comportam mal e não são concluídas no tempo alocado. O valor deve ser alto o suficiente (algo como 60 segundos ou mais), para que cada verificação possa ser concluída antes dessa hora. Se uma verificação do host for além desse limite, o mecanismo de monitoramento irá eliminá-lo, pensando que é um processo com problemas.

source: This is the maximum number of seconds that Monitoring Engine will allow event handlers to be run. If an event handler exceeds this time limit it will be killed and a warning will be logged. This option is meant to be used as a last ditch mechanism to kill off commands which are misbehaving and not exiting in a timely manner. It should be set to something high (like 60 seconds or more), so that each event handler command normally finishes executing within this time limit. If an event handler runs longer than this limit, Monitoring Engine will kill it off thinking it is a runaway processes.
pt_pt: Esse é o número máximo de segundos alocados pelo mecanismo de monitoramento para executar manipuladores de eventos. Se um evento for processado após esse tempo limite, o evento será interrompido e um aviso será registrado no ficheiro de log. Esta opção deve ser usada como último recurso para matar pedidos que se comportam mal e que não terminam no tempo alocado. O valor deve ser alto o suficiente (algo como 60 segundos ou mais), para que cada manipulador de eventos possa ser concluído antes dessa hora. Se o processamento de eventos for além desse limite, o mecanismo de monitoramento irá eliminá-lo, pensando que é um processo com problemas.

source: This is the maximum number of seconds that Monitoring Engine will allow notification commands to be run. If a notification command exceeds this time limit it will be killed and a warning will be logged. This option is meant to be used as a last ditch mechanism to kill off commands which are misbehaving and not exiting in a timely manner. It should be set to something high (like 60 seconds or more), so that each notification command finishes executing within this time limit. If a notification command runs longer than this limit, Monitoring Engine will kill it off thinking it is a runaway processes.
pt_pt: Esse é o número máximo de segundos alocados pelo mecanismo de gerenciamento para executar comandos de notificação. Se um comando de notificação exceder esse tempo limite, ele será eliminado e um aviso será registrado no ficheiro de log. Esta opção deve ser usada como último recurso para matar pedidos que se comportam mal e que não terminam no tempo alocado. O valor deve ser alto o suficiente (algo como 60 segundos ou mais), para que cada comando de notificação possa ser concluído antes dessa hora. Se um comando de notificação for executado além desse limite, o mecanismo de monitoramento terminará, pensando que é um processo com problemas.

source: This is the maximum number of seconds that Monitoring Engine will allow an obsessive compulsive service processor command to be run. If a command exceeds this time limit it will be killed and a warning will be logged.
pt_pt: Este é o número máximo de segundos que o mecanismo de supervisor executará um comando Reordenar Controle de Serviço. Se um comando exceder esse limite, ele será eliminado e um alerta será registrado.

source: This is the maximum number of seconds that Monitoring Engine will allow an obsessive compulsive host processor command to be run. If a command exceeds this time limit it will be killed and a warning will be logged.
pt_pt: Esse é o número máximo de segundos que o mecanismo de monitoramento executará um comando de check-up do host. Se um comando exceder esse limite, ele será eliminado e um alerta será registrado no ficheiro de log.

source: This is the maximum number of seconds that Monitoring Engine will allow a host performance data processor command or service performance data processor command to be run. If a command exceeds this time limit it will be killed and a warning will be logged.
pt_pt: Este é o número máximo de segundos que o motor supervisor permitirá um desempenho de processamento de dados controle de host d`un ou d`un Serviço .Se um comando exceder esse limite, ele vai ser morto e um aviso será armazenado em o ficheiro de log.

source: This value determines whether or not Monitoring Engine will "obsess" over service checks results and run the obsessive compulsive service processor command you define. This option is useful for performing distributed monitoring. This option is disabled by default. If you're not doing distributed monitoring, don't enable this option.
pt_pt: Esse valor determina se o mecanismo de monitoramento rastreará os resultados das verificações de serviço e emitirá o comando de escalação de serviço que você definiu. Esta opção é útil para supervisão distribuída. Esta opção está desativada por padrão. Se você não estiver supervisionando distribuído, não ative essa opção.

source: This option allows you to specify a command to be run after every service check, which can be useful in distributed monitoring. This command is executed after any event handler or notification commands. The maximum amount of time that this command can run is controlled by the ocsp_timeout option. This command is only executed if the obsess_over_services option is enabled globally and if the obsess_over_service directive in the service definition is enabled.
pt_pt: Esta opção permite que você especifique um comando a ser executado logo após o controle de cada serviço, o que pode ser muito útil em um ambiente distribuído. Este comando é executado após cada comando do gerenciador de eventos ou notificações. O número máximo de vezes que este comando pode ser executado é controlado pela opção ocsp_timeout. Esse comando é executado apenas se a opção obsess_over_services estiver ativada globalmente e a diretiva obsess_over_service na definição de serviço estiver ativada.

source: This value determines whether or not Monitoring Engine will "obsess" over host checks results and run the obsessive compulsive host processor command you define. This option is useful for performing distributed monitoring. This option is disabled by default. If you're not doing distributed monitoring, don't enable this option.
pt_pt: Esse valor determina se o mecanismo de monitoramento irá remontar os resultados da verificação do host e iniciar o comando de verificação do host que você definiu. Esta opção é útil para supervisão distribuída. Esta opção está desativada por padrão. Se você não estiver supervisionando distribuído, não ative essa opção.

source: This option allows you to specify a command to be run after every host check, which can be useful in distributed monitoring. This command is executed after any event handler or notification commands. The maximum amount of time that this command can run is controlled by the ochp_timeout option. This command is only executed if the obsess_over_hosts option is enabled globally and if the obsess_over_host directive in the host definition is enabled.
pt_pt: Esta opção permite que você especifique um comando para executar logo após o controle de cada host, o que pode ser muito útil em um ambiente distribuído. Este comando é executado após cada comando do gerenciador de eventos ou notificações. O número máximo de vezes que este comando pode ser executado é controlado pela opção ochp_timeout. Esse comando é executado apenas se a opção obsess_over_hosts estiver ativada globalmente e a diretiva obsess_over_host na definição do host estiver ativada.

source: This value determines whether or not Monitoring Engine will process host and service check performance data. This option is disabled by default.
pt_pt: Esse valor determina se o mecanismo de monitoramento processará os dados de desempenho das verificações de host e serviço. Esta opção está ativada por padrão.

source: This option allows you to specify a command to be run after every host check to process host performance data that may be returned from the check. This command is only executed if the process_performance_data option is enabled globally and if the process_perf_data directive in the host definition is enabled.
pt_pt: Esta opção permite que você especifique um comando que será emitido após cada verificação de host para processar dados de desempenho que podem ser retornados após a verificação. Esse comando é executado apenas se a opção "process_performance_data" estiver ativada e se o parâmetro process_perf_data na definição do host também estiver configurado.

source: This option allows you to specify a command to be run after every service check to process service performance data that may be returned from the check. This command is only executed if the process_performance_data option is enabled globally and if the process_perf_data directive in the service definition is enabled.
pt_pt: Esta opção permite que você especifique um comando que será emitido após cada verificação de serviço para processar dados de desempenho que podem ser retornados após a verificação. Esse comando é executado apenas se a opção de processamento de dados de desempenho estiver ativada e o parâmetro process_perf_data estiver ativado na definição de serviço.

source: This option allows you to specify a file to which host performance data will be written after every host check. Data will be written to the performance file as specified by the host_perfdata_file_template option. Performance data is only written to this file if the process_performance_data option is enabled globally and if the process_perf_data directive in the host definition is enabled.
pt_pt: Esta opção permite que você especifique um ficheiro no qual os dados de desempenho serão gravados após cada verificação de host. Os dados serão gravados no ficheiro de desempenho conforme especificado pela opção host_perfdata_file_template. Os dados de desempenho será escrito para este ficheiro somente se l`option process_performance_data está habilitado globalmente e se a directiva process_perf_data está habilitado na definição de serviço.

source: This option allows you to specify a file to which service performance data will be written after every service check. Data will be written to the performance file as specified by the service_perfdata_file_template option. Performance data is only written to this file if the process_performance_data option is enabled globally and if the process_perf_data directive in the service definition is enabled.
pt_pt: Essa opção permite que você especifique um ficheiro no qual os dados de desempenho do serviço serão gravados após cada verificação de serviço. Os dados serão gravados no ficheiro de desempenho conforme especificado pela opção service_perfdata_file_template. Os dados de desempenho será escrito para este ficheiro somente se l`option process_performance_data está habilitado globalmente e se a directiva process_perf_data está habilitado na definição de serviço.

source: This option determines what (and how) data is written to the host performance data file. The template may contain macros, special characters (\t for tab, \r for carriage return, \n for newline) and plain text. A newline is automatically added after each write to the performance data file.
pt_pt: Essa opção determina quais (e como) os dados serão gravados no ficheiro de dados de desempenho do host. O modelo pode conter macros, caracteres especiais (\ t para uma guia, \ r para retornos de carro, \ n para uma nova linha) e texto. Uma nova linha é automaticamente adicionada após cada gravação no ficheiro de dados de desempenho.

source: This option determines what (and how) data is written to the service performance data file. The template may contain macros, special characters (\t for tab, \r for carriage return, \n for newline) and plain text. A newline is automatically added after each write to the performance data file.
pt_pt: Essa opção determina quais (e como) os dados serão gravados no ficheiro de dados de desempenho do serviço. O modelo pode conter macros, caracteres especiais (\ t para uma guia, \ r para retornos de carro, \ n para uma nova linha) e texto. Uma nova linha é automaticamente adicionada após cada gravação no ficheiro de dados de desempenho.

source: This option determines how the host performance data file is opened. Unless the file is a named pipe you'll probably want to use the default mode of append.
pt_pt: Esta opção determina como abrir o ficheiro de dados de desempenho do host. A menos que o ficheiro seja um pipe nomeado, o padrão é o modo Adicionar.

source: This option determines how the service performance data file is opened. Unless the file is a named pipe you'll probably want to use the default mode of append.
pt_pt: Esta opção determina como abrir o ficheiro de dados de desempenho do serviço. A menos que o ficheiro seja um pipe nomeado, o padrão é o modo Adicionar.

source: This option allows you to specify the interval (in seconds) at which the host performance data file is processed using the host performance data file processing command. A value of 0 indicates that the performance data file should not be processed at regular intervals.
pt_pt: Essa opção permite especificar o intervalo (em segundos) no qual o ficheiro de dados de desempenho do host será executado usando o comando de processamento do ficheiro de dados de desempenho do host. Um valor de 0 indicará que o ficheiro de dados de desempenho não será processado em intervalos regulares.

source: This option allows you to specify the interval (in seconds) at which the service performance data file is processed using the service performance data file processing command. A value of 0 indicates that the performance data file should not be processed at regular intervals.
pt_pt: Esta opção permite que você especifique o intervalo (em segundos) no qual o ficheiro de dados de desempenho do serviço será percorrido usando o comando de processamento do ficheiro de dados de desempenho do serviço. Um valor de 0 indicará que o ficheiro de dados de desempenho não será processado em intervalos regulares.

source: This option allows you to specify the command that should be executed to process the host performance data file.
pt_pt: Essa opção permite especificar o comando que precisará ser executado para processar o ficheiro de dados de desempenho do host.

source: This option allows you to specify the command that should be executed to process the service performance data file.
pt_pt: Essa opção permite especificar o comando que precisará ser executado para processar o ficheiro de dados de desempenho do serviço.

source: This option allows you to enable or disable checks for orphaned service checks. Orphaned service checks are checks which have been executed and have been removed from the event queue, but have not had any results reported in a long time. Since no results have come back in for the service, it is not rescheduled in the event queue. This can cause service checks to stop being executed. Normally it is very rare for this to happen - it might happen if an external user or process killed off the process that was being used to execute a service check. If this option is enabled and Monitoring Engine finds that results for a particular service check have not come back, it will log an error message and reschedule the service check. This option is enabled by default.
pt_pt: Esta opção permite ativar ou desativar a verificação de controles de serviço órfãos. Verificações de Serviços Órfãos são controles que foram executados e removidos da Fila de Eventos, mas não tiveram um longo histórico de comentários. Como nenhum resultado foi relatado para este serviço, ele não é reordenado na fila de eventos. Isso pode fazer com que as verificações de serviço parem. Normalmente c`est um fenômeno muito raro - que pode ocorrer se um utilizador ou processo matou fora do processo usado para executar a verificação de serviço. Se esta opção estiver habilitada eo motor s`aperçoit monitoramento qu`un resultado do teste de determinado serviço não retorna, ele escreveu uma mensagem d`erreur no ficheiro de log, e reagendar o departamento de controle. Esta opção está ativada por padrão.

source: This option allows you to enable or disable checks for orphaned hoste checks. Orphaned host checks are checks which have been executed and have been removed from the event queue, but have not had any results reported in a long time. Since no results have come back in for the host, it is not rescheduled in the event queue. This can cause host checks to stop being executed. Normally it is very rare for this to happen - it might happen if an external user or process killed off the process that was being used to execute a host check. If this option is enabled and Monitoring Engine finds that results for a particular host check have not come back, it will log an error message and reschedule the host check. This option is enabled by default.
pt_pt: Esta opção permite ativar ou desativar a verificação de verificações de host órfãs. Verificações de Host Órfãos são controles que foram executados e removidos da Fila de Eventos, mas não retornaram por um longo tempo. Como nenhum resultado foi relatado para esse host, ele não é reordenado na fila de eventos. Isso pode fazer com que as verificações de convidados parem. Normalmente, esse é um fenômeno muito raro - pode acontecer se um utilizador ou um processo externo tiver matado o processo usado para executar o controle do host. Se esta opção estiver ativada e o mecanismo de supervisor perceber que um resultado de controle de um determinado host não está retornando, ele gravará uma mensagem de erro no ficheiro de log e reordenará o controle do host. . Esta opção está ativada por padrão.

source: This option determines whether or not Monitoring Engine will periodically check the "freshness" of service checks. Enabling this option is useful for helping to ensure that passive service checks are received in a timely manner. If the check results is found to be not fresh, Monitoring Engine will force an active check of the host or service by executing the command specified by in the host or service definition. This option is enabled by default.
pt_pt: Essa opção determina se o mecanismo de monitoramento verificará periodicamente o "frescor" das verificações de serviço. Habilitar essa opção é muito útil para garantir que as verificações passivas de serviço sejam recebidas em tempo hábil. Se os resultados da verificação forem inválidos, o mecanismo de monitoramento forçará um controle ativo do host ou serviço, executando o comando especificado pelo host ou pela definição de serviço. Esta opção está ativada por padrão.

source: This setting determines how often (in seconds) Monitoring Engine will periodically check the "freshness" of service check results. If you have disabled service freshness checking (with the check_service_freshness option), this option has no effect.
pt_pt: Esse parâmetro determina com que frequência (em segundos) o mecanismo de monitoramento verifica periodicamente a atualização dos resultados da verificação de serviço. Se você desativou a verificação de atualização do serviço (com a opção check_service_freshness), essa opção não terá efeito.
