<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//FR">

<html>
<head>
<title>Personnalisation de l'en-t&ecirc;te et du bas de page des CGI</title>

<STYLE type="text/css">
<!--
         .Default { font-family: verdana,arial,serif; font-size: 8pt; }
         .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center"> 
  <h2 class="PageTitle">Personnalisation de l'en-t&ecirc;te et du pied de page des CGI</h2>

</div>
<p></p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p> Si vous &ecirc;tes amen&eacute; &agrave; faire des installations personnalis&eacute;es de Nagios, 
  vous pourriez avoir envie d'avoir un en-t&ecirc;te et/ou un pied de page personnalis&eacute;s 
  &agrave; l'affichage des r&eacute;sultats des <a href="cgis.html">CGI</a>. Ceci est particuli&egrave;rement 
  utile pour l'utilisateur final concernant l'affichage des informations de contact 
  du support, etc. </p>

<p> Il est important de tenir compte du fait que, &agrave; moins d'&ecirc;tre 
  ex&eacute;cutables, les en-t&ecirc;tes et pieds de page personnalis&eacute;s ne sont <b>pas</b> 
  ex&eacute;cut&eacute;s de quelle mani&egrave;re que ce soit avant d'&ecirc;tre affich&eacute;s. Le contenu du 
  fichier d'en-t&ecirc;te et de pied de page est simplement lu et affich&eacute; au r&eacute;sultat 
  de l'ex&eacute;cution de la CGI. Cela signifie qu'ils ne peuvent contenir que des informations 
  qu'un navigateur web peut comprendre (HTML, JavaScript, etc.). </p>

<p>Si les en-t&ecirc;tes et pieds de page personnalis&eacute;s sont ex&eacute;cutables, 
  alors les fichiers sont ex&eacute;cut&eacute;s et leur sortie est affich&eacute;e 
  &agrave; l'utilisateur : ils doivent donc afficher du code HTML valide. Cette 
  fonctionnalit&eacute; permet d'utiliser vos propres CGI pour ajouter des donn&eacute;es 
  &agrave; l'affichage de Nagios. Ceci a &eacute;t&eacute; utilis&eacute; pour ins&eacute;rer 
  des graphiques de rrdtool en utilisant ddraw et des menu de commande dans la 
  fen&ecirc;tre d'affichage de Nagios. Ces en-t&ecirc;tes et pieds de page ex&eacute;cutables 
  disposent du m&ecirc;me environnement que les CGI natives : vous pouvez donc 
  disposer des informations sur la requ&ecirc;te HTTP, sur l'utilisateur authentifi&eacute; 
  etc... pour afficher les informations ad&eacute;quates.</p>

<p>
<strong><u>Comment &ccedil;a marche?</u></strong>
</p>

<p> Vous pouvez inclure les en-t&ecirc;tes et pieds de page personnalis&eacute;s dans le r&eacute;sultat 
  des CGI en fournissant des fichiers HTML avec un nom appropri&eacute; dans le sous-r&eacute;pertoire 
  <i>ssi/</i> du r&eacute;pertoire HTML de Nagios (p.ex. <i>/usr/local/nagios/share/ssi</i>). 

</p>

<p> Les en-t&ecirc;tes personnalis&eacute;s sont inclus imm&eacute;diatement apr&egrave;s la balise <b>&lt;BODY&gt;</b> 
  du r&eacute;sultat de l'ex&eacute;cution de la CGI. Pareillement, les pieds de page personnalis&eacute;s 
  sont inclus avant la balise de fermeture <b>&lt;/BODY&gt;</b>. </p>

<p>Il y a deux types d'en-t&ecirc;tes et de bas de page personnalis&eacute;s:
</p>

<p>
<ul>
  <li><b>En-t&ecirc;tes/pieds de page globaux</b>. Ces fichiers devraient &ecirc;tre nomm&eacute;s 
    <i>common-header.ssi</i> et <i>common-footer.ssi</i>, respectivement. Si ces 
    fichiers existent, ils seront inclus dans le r&eacute;sultat de l'ex&eacute;cution de toutes 
    les CGI.<br />

    <br />
  <li><b>En-t&ecirc;tes/pieds de page de CGI sp&eacute;cifiques</b>. Ces fichiers devraient 
    &ecirc;tre nomm&eacute;s dans le format <i>NOMCGI-header.ssi</i> et <i>NOMCGI-footer.ssi</i>, 
    o&ugrave; <i>CGINAME</i> est le nom physique du CGI sans l'extension .cgi. Par exemple, 
    l'en-t&ecirc;te et le bas de page pour le CGI <a href="cgis.html#summary_cgi">r&eacute;sum&eacute; 
    des alertes [alert summary]</a> (summary.cgi) devrait &ecirc;tre appel&eacute; <i>summary-header.ssi</i> 
    et <i>summary-footer.ssi</i>, respectivement. 

</ul>
<p></p>

<p> L'utilisation des en-t&ecirc;tes et bas de pages personnalis&eacute;s sont optionnels. 
  Utilisez-les si vous le d&eacute;sirez. De m&ecirc;me pour les en-t&ecirc;tes et pieds de 
  page sp&eacute;cifiques. </p>

<hr>

</body>
</html>

