
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<HEAD><TITLE>Supervision des clusters de services et d'h&ocirc;tes</TITLE>
<STYLE type="text/css">
<!--
         .Default { font-family: verdana,arial,serif; font-size: 8pt; }
         .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->
</STYLE>

<BODY bgColor=#ffffff text=black class="Default">
<P> 
  <div align=center> 
    
  <h2 class="PageTitle">Supervision des grappes de services et d'h&ocirc;tes</h2>
  </div>
  <p></p>

<HR>

<P><STRONG><U>Introduction</U></STRONG></P>
<P>Plusieurs personnes m'ont demand&eacute; comment superviser les grappes d'h&ocirc;tes 
  ou de services, c'est pourquoi j'ai d&eacute;cid&eacute; d'&eacute;crire une petite documentation 
  &agrave; ce propos. C'est plut&ocirc;t simple, donc vous devriez trouver ceci facile 
  &agrave; comprendre.</P>

<P>Tout d'abord, nous devons d&eacute;finir ce que nous entendons par &quot;grappe&quot;. 
  La fa&ccedil;on la plus simple de comprendre est de prendre un exemple. Supposons que 
  votre soci&eacute;t&eacute; dispose de 5 h&ocirc;tes qui lui offrent des services 
  DNS redondants. Si l'un d'eux a un d&eacute;faut, ce n'est pas une catastrophe majeure, 
  car les serveurs restants continueront &agrave; fournir des services de r&eacute;solution 
  de noms. Si vous &ecirc;tes concern&eacute; par la supervision de la disponibilit&eacute; du service 
  DNS de votre soci&eacute;t&eacute;, vous voudrez superviser cinq serveurs DNS. 
  C'est ce que je consid&egrave;re comme une grappe de <i>services</i>. Cette grappe 
  de services consiste en 5 services DNS distincts que vous supervisez. Bien que 
  vous vouliez superviser chaque service individuellement, votre pr&eacute;occupation 
  premi&egrave;re est l'&eacute;tat g&eacute;n&eacute;ral de la grappe de service DNS, plut&ocirc;t que la disponibilit&eacute; 
  d'un service en particulier. </P>

<P>Si votre soci&eacute;t&eacute; a un groupe d'h&ocirc;tes qui procure une solution 
  &agrave; haute-disponibilit&eacute; (type grappe), je les consid&eacute;rerai comme &eacute;tant une grappe 
  <i>d'h&ocirc;tes</i>. Si un h&ocirc;te particulier ne r&eacute;pond plus, un autre prendra &agrave; son 
  compte toutes les t&acirc;ches du serveur en panne. A ce sujet, vous pouvez consulter 
  le site <a href="http://www.linux-ha.org/">High-Availability Linux Project [Anglais]</a> 
  pour des informations concernant la redondance d'h&ocirc;tes sous Linux. </P>

<P>
<strong><u>Plan d'attaque</u></strong></P>
<P>Il y a plusieurs fa&ccedil;ons de superviser des grappes de services ou d'h&ocirc;tes. 
  Je d&eacute;crirai la m&eacute;thode qui me semble &ecirc;tre la plus simple. Superviser 
  des grappes de services ou d'h&ocirc;tes implique deux choses :</P>
<P> 
<ul>
  <li>Superviser individuellement les &eacute;l&eacute;ments de la grappe</li>

  <li>Superviser la grappe en tant qu'entit&eacute; collective</li>
</ul>
<p></P>
<P>Superviser individuellement des &eacute;l&eacute;ments d'une grappe d'h&ocirc;tes ou de services 
  est plus simple que vous ne l'imaginez. En fait, vous le faites sans doute d&eacute;j&agrave;. 
  Pour les grappes de services, assurez-vous de superviser chacun de ses &eacute;l&eacute;ments. 
  Si vous avez une grappe de cinq serveurs DNS, v&eacute;rifiez que vous avez 
  bien cinq d&eacute;finitions de service (probablement en utilisant le plugin 
  <i>check_dns</i>). Pour les grappes d'h&ocirc;tes, assurez-vous d'avoir configur&eacute; 
  les d&eacute;finitions d'h&ocirc;tes pour chaque membre de la grappe (vous aurez aussi 
  besoin de d&eacute;finir au moins un service &agrave; superviser pour chacun des h&ocirc;tes). <br />

  <b>Important</b>: Vous allez sans doute vouloir d&eacute;sactiver les notifications 
  pour les &eacute;l&eacute;ments individuels de la grappe (d&eacute;finitions d'h&ocirc;tes ou de services). 
  Bien qu'aucune notification ne soit envoy&eacute;e &agrave; propos des &eacute;l&eacute;ments individuels, 
  vous aurez encore un affichage visuel de l'&eacute;tat individuel de l'h&ocirc;te ou du service 
  dans le <a href="cgis.html#status_cgi">CGI d'&eacute;tat</a>. Cela sera utile 
  &agrave; l'avenir pour retrouver exactement la source de probl&egrave;mes &agrave; l'int&eacute;rieur 
  de la grappe. </P>

<P>Superviser la grappe dans son ensemble peut &ecirc;tre effectu&eacute; en utilisant les 
  r&eacute;sultats de la grappe d'&eacute;l&eacute;ments pr&eacute;c&eacute;demment mis en cache. Bien que vous ayez 
  la possibilit&eacute; de rev&eacute;rifier tous les &eacute;l&eacute;ments de la grappe pour d&eacute;terminer 
  son &eacute;tat, pourquoi gaspiller de la bande passante et des ressources, alors que 
  vous avez d&eacute;j&agrave; le r&eacute;sultat dans le cache ? Les r&eacute;sultats des &eacute;l&eacute;ments 
  de la grappe mis en cache peuvent &ecirc;tre trouv&eacute;s dans le <A href="configmain.html#status_file">journal 
  des &eacute;tats</A> (en supposant que vous supervisiez chaque &eacute;l&eacute;ment). Le plugin 
  <I>check_cluster2</I> a &eacute;t&eacute; d&eacute;velopp&eacute; sp&eacute;cialement pour v&eacute;rifier les &eacute;tats des 
  h&ocirc;tes et services mis en cache dans le journal des &eacute;tats. <br />

  <b>Important</b> : Bien que vous n'ayez pas activ&eacute; les notifications pour les 
  &eacute;l&eacute;ments individuels de la grappe, vous voudrez les activer pour son contr&ocirc;le 
  d'ensemble. </P>

<P> <strong><u>Utilisation du plugin <i>check_cluster2</i></u></strong></P>
<P>Le plugin check_cluster2 est &eacute;tudi&eacute; pour v&eacute;rifier l'&eacute;tat g&eacute;n&eacute;ral d'une grappe 
  d'h&ocirc;tes ou de services. Il fonctionne en v&eacute;rifiant, pour chaque &eacute;l&eacute;ment de la 
  grappe d'h&ocirc;tes ou de services, l'information relative &agrave; chaque &eacute;tat et mise 
  en cache dans le fichier <a href="configmain.html#status_file">journal des &eacute;tats</a>. 

</P>
<P>Le plugin check_cluster2 peut &ecirc;tre trouv&eacute; dans le r&eacute;pertoire &quot;contrib&quot; 
  des plugins Nagios officiels : <a href="http://sourceforge.net/projects/nagiosplug/">http://sourceforge.net/projects/nagiosplug/ 
  [Anglais]</a>. </P>

<P><strong><u>Superviser les grappes de services</u></strong></P>
<P>Mettons que vous ayez trois serveurs DNS en redondance sur votre r&eacute;seau. 
  Vous aurez tout d'abord besoin de superviser chaque serveur DNS individuellement 
  avant de v&eacute;rifier la grappe.<br />

  Je pr&eacute;sume que vous avez donc d&eacute;j&agrave; 3 services s&eacute;par&eacute;s 
  (tous nomm&eacute;s &quot;Service DNS&quot;) associ&eacute;s &agrave; vos h&ocirc;tes 
  (nomm&eacute;s &quot;host1&quot;, &quot;host2&quot;, &quot;host3&quot;).</P>

<P>Afin de superviser ces services comme une grappe, vous avez besoin de cr&eacute;er 
  un nouveau service pour la grappe. </P>
<P>Avant cela, vous devrez avoir d&eacute;fini la commande li&eacute;e &agrave; 
  la surveillance de la grappe. Vous avez donc d&eacute;fini la commande <I>check_service_cluster</I> 
  [NdT : cluster = grappe] de la mani&egrave;re suivante : </P>
<P><font color="red">
<strong>
<pre><font color="red">define command{
	command_name	check_service_cluster
	command_line	/usr/local/nagios/libexec/check_cluster2 --service -l $ARG1$ -w $ARG2$ -c $ARG3$ -d $ARG4$ 
	}
</pre></font>
</strong> </font></P> 
<P>Vous avez maintenant besoin de cr&eacute;er le service &quot;grappe&quot; et 
  utiliser la commande <i>check_service_cluster</i> que vous venez de cr&eacute;er 
  comme commande de v&eacute;rification. L'exemple ci-dessous d&eacute;taille 
  comment le faire. Il va g&eacute;n&eacute;rer un &eacute;tat CRITICAL
  si 2 services ou plus de la grappe ne sont pas en &eacute;tat OK, et un &eacute;tat 
  WARNING, si seulement 1 service n'est pas en &eacute;tat OK. 
  Si tous les services sont en &eacute;tat OK, le service retournera &eacute;galement 
  OK. </P>

<P><pre><font color="red"><strong>define service{
	...
	check_command	check_service_cluster!"DNS Cluster"!1!2!$SERVICESTATEID:host1:DNS Service$,$SERVICESTATEID:host2:DNS Service$,$SERVICESTATEID:host3:DNS Service$
	...
	}
</strong></font></pre>
<p>Il est important de noter que nous passons &agrave; la macro $ARG4$ une liste 
d'&eacute;l&eacute;ments - s&eacute;parateur virgule - de macro d'&eacute;tat 
de service &agrave; la vol&eacute;e. Ce point est important : Nagios va remplir 
ces macros avec l'&eacute;tat du service (en num&eacute;rique plut&ocirc;t qu'en 
texte) des membres de la grappe.</P>

<P><STRONG><U>Superviser les grappes d'h&ocirc;tes</U></STRONG> </P>
<P>La supervision des grappes d'h&ocirc;tes ressemble beaucoup &agrave; celle des grappes de 
  services. Evidemment, la plus grande diff&eacute;rence est que les membres de la grappe 
  sont des h&ocirc;tes et non des services. Afin de superviser l'&eacute;tat d'une grappe d'h&ocirc;tes, 
  vous devez d&eacute;finir un service qui utilise le plugin <I>check_cluster2</I>. Le 
  service <I>ne doit pas</I> &ecirc;tre associ&eacute; &agrave; l'un des h&ocirc;tes de la grappe, car cela 
  causerait des probl&egrave;mes relatifs aux notifications de la grappe si cet h&ocirc;te 
  &eacute;tait hors service. Une bonne id&eacute;e serait d'associer le service &agrave; l'h&ocirc;te 
  sur lequel Nagios tourne. Car, si l'h&ocirc;te sur lequel tourne Nagios tombe, alors 
  Nagios ne fonctionne plus et vous ne pouvez plus rien superviser (sauf si vous 
  avez pr&eacute;vu une <A href="redundancy.html">supervision redondante d'h&ocirc;tes</A>)... 

</P>
<P>Supposons que vous avez d&eacute;fini la commande <I>check_host_cluster</I> de la 
  mani&egrave;re suivante : </P>
<pre><FONT color=red><strong> define command{
	command_name check_host_cluster
	command_line /usr/local/nagios/libexec/check_cluster2 --service -l $ARG1$ -w $ARG2$ -c $ARG3$ -d $ARG4$
	}</strong></FONT></pre>
<P>Supposons que vous ayez trois h&ocirc;tes (nomm&eacute;s &quot;host1&quot;, &quot;host2&quot;, 
  &quot;host3&quot;) dans votre grappe. Si vous voulez que Nagios vous envoie 
  un &eacute;tat WARNING si au moins un h&ocirc;te de la grappe est 
  dans un &eacute;tat diff&eacute;rent de OK, ou un &eacute;tat CRITICAL 
  si au moins deux sont dans un &eacute;tat diff&eacute;rent de OK, le service &agrave; d&eacute;finir 
  pour superviser la grappe d'h&ocirc;te devra ressembler &agrave; : </P>

<pre><font color="red"><strong>define service{
	...
	check_command	check_host_cluster!"Super Host Cluster"!1!2!$HOSTSTATEID:host1$,$HOSTSTATEID:host2$,$HOSTSTATEID:host3$
	...
	}
</strong></font></pre>

<P>Il est important de noter que nous passons &agrave; la macro $ARG4$ une liste 
  d'&eacute;l&eacute;ments - s&eacute;parateur virgule - de macro d'&eacute;tat 
  d'h&ocirc;te &agrave; la vol&eacute;e. Ce point est important : Nagios va remplir 
  ces macros avec l'&eacute;tat du service (en num&eacute;rique plut&ocirc;t qu'en 
  texte) des membres de la grappe.</p> 

<P> Et voil&agrave; ! Nagios contr&ocirc;lera p&eacute;riodiquement l'&eacute;tat de la grappe d'h&ocirc;tes, et 
  vous enverra des notifications, quand son &eacute;tat sera d&eacute;grad&eacute; (en supposant que 
  vous ayez autoris&eacute; les notifications pour le service). Notez que pour les d&eacute;finitions 
  d'h&ocirc;tes de chaque membre de la grappe, vous pr&eacute;f&eacute;rerez vraisemblablement ne 
  pas avoir de notifications lorsque l'h&ocirc;te sera hors service. Souvenez-vous que 
  vous ne vous souciez pas tant de l'&eacute;tat de chaque h&ocirc;te que de celui de la grappe. 
  Suivant la configuration de votre r&eacute;seau et ce que vous souhaitez accomplir, 
  vous voudrez peut-&ecirc;tre laisser les notifications s'effectuer pour les &eacute;tats 
  'inaccessible' dans les d&eacute;finitions d'h&ocirc;tes.</P>

<HR>

</BODY>
</html>
