
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
  <head>
    <title>
      D&eacute;pendances d'h&ocirc;tes et de services
    </title>
<style type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }-->
</style>
  </head>
  <body bgcolor="white" text="black" class="Default">
    <div align="center">
      <h2 class="PageTitle">
        D&eacute;pendances d'h&ocirc;tes et de services
      </h2>
    </div>
    <hr>
    <p>
      <strong><u>Introduction</u></strong>
    </p>
    <p>
      Les d&eacute;pendances d'h&ocirc;tes et de services sont une fonctionnalit&eacute; <i>avanc&eacute;e</i> qui vous
      permet de contr&ocirc;ler le comportement des h&ocirc;tes et des services selon l'&eacute;tat d'un ou
      plusieurs autres h&ocirc;tes ou services. Je vais expliquer comment les d&eacute;pendances
      fonctionnent, ainsi que les diff&eacute;rences entre les d&eacute;pendances d'h&ocirc;tes ou
      de services.
    </p>
    <p>
      <strong><u>Aper&ccedil;u des d&eacute;pendances de services</u></strong>
    </p>
    <p>
      L'image ci-dessous montre un exemple de diagramme de d&eacute;pendances de
      services. Voici quelques points &agrave; noter :
    </p>
    <ol>
      <li>Un service peut &ecirc;tre d&eacute;pendant d'un ou plusieurs autres services
      </li>
      <li>Un service peut &ecirc;tre d&eacute;pendant de services qui ne sont pas associ&eacute;s
      au m&ecirc;me h&ocirc;te
      </li>
      <li>Les d&eacute;pendances de service ne se sont pas h&eacute;rit&eacute;es (&agrave; moins que ce ne soit explicitement sp&eacute;cifi&eacute;)
      </li>
      <li>Les d&eacute;pendances de service permettent de supprimer l'ex&eacute;cution
      de services et de notifications de service selon diff&eacute;rents crit&egrave;res (&eacute;tats OK, WARNING, UNKNOWN, et/ou CRITICAL)
      </li>
    </ol>
    <p>
      <a href="images/service-dependencies.png"><img src=
      "images/service-dependencies.png" alt="Service Dependencies" width="150" height="160" border="1"></a>
    </p>
    <p>
      <strong><u>D&eacute;finition de d&eacute;pendances de services</u></strong>
    </p>
    <p>
      Tout d'abord, les bases. Vous cr&eacute;ez des d&eacute;pendances de service en
      ajoutant des d&eacute;finitions de d&eacute;pendance de service dans votre (vos) <a href=
      "configmain.html#cfg_file">fichier(s) de configuration des objets</a>.
      Dans chaque d&eacute;finition, vous sp&eacute;cifiez le service <i>d&eacute;pendant</i>, le
      service <i>dont il d&eacute;pend</i>, et la condition (s'il y a lieu) qui
      provoque l'&eacute;chec des d&eacute;pendances d'ex&eacute;cution et de notification (ces
      notions sont d&eacute;crites plus loin).
    </p>
    <p>
      Vous pouvez cr&eacute;er plusieurs d&eacute;pendances pour un m&ecirc;me service, mais il
      vous faut une d&eacute;finition de d&eacute;pendance de service s&eacute;par&eacute;e pour chaque
      d&eacute;pendance cr&eacute;&eacute;e.
    </p>
    <p>
      Dans l'exemple ci-dessus, les d&eacute;finitions de d&eacute;pendance du <i>Service
      F</i> sur l'<i>h&ocirc;te C</i> seraient &eacute;crites comme ceci :
    </p>
<p>

<strong>
<font color='red'>
<pre>
define servicedependency{
	host_name			Host B
	service_description		Service D
	dependent_host_name		Host C
	dependent_service_description	Service F
	execution_failure_criteria	o
	notification_failure_criteria	w,u
	}

define servicedependency{
	host_name			Host B
	service_description		Service E
	dependent_host_name		Host C
	dependent_service_description	Service F
	execution_failure_criteria	n
	notification_failure_criteria	w,u,c
	}

define servicedependency{
	host_name			Host B
	service_description		Service C
	dependent_host_name		Host C
	dependent_service_description	Service F
	execution_failure_criteria	w
	notification_failure_criteria	c
	}
</pre>
</font>
</strong>
</p>
<p>Les autres d&eacute;finitions de d&eacute;pendances d&eacute;crites dans l'image pr&eacute;c&eacute;dente s'&eacute;criraient comme suit :</p>
<p>
<strong>
<font color='red'>

<pre>
define servicedependency{
	host_name			Host A
	service_description		Service A
	dependent_host_name		Host B
	dependent_service_description	Service D
	execution_failure_criteria	u
	notification_failure_criteria	n
	}

define servicedependency{
	host_name			Host A
	service_description		Service B
	dependent_host_name		Host B
	dependent_service_description	Service E
	execution_failure_criteria	w,u
	notification_failure_criteria	c
	}

define servicedependency{
	host_name			Host B
	service_description		Service C
	dependent_host_name		Host B
	dependent_service_description	Service E
	execution_failure_criteria	n
	notification_failure_criteria	w,u,c
	}
</pre>
</font>
</strong>
</p>

    <p>
      <strong><u>Comment les d&eacute;pendances d'un service sont test&eacute;es</u></strong>
    </p>
    <p>
      Avant que Nagios n'ex&eacute;cute un contr&ocirc;le de service ou n'envoie des
      notifications concernant un service, il v&eacute;rifiera si le service comporte
      des d&eacute;pendances. Si ce n'est pas le cas, le contr&ocirc;le est ex&eacute;cut&eacute; ou la
      notification est envoy&eacute;e comme en temps normal. Si le service <i>a
      bien</i> une ou plusieurs d&eacute;pendances, Nagios v&eacute;rifiera chacune de la
      mani&egrave;re suivante :
    </p>
    <ol>
      <li>Nagios r&eacute;cup&egrave;re l'&eacute;tat courant<sup><a href=
      "#hard_dependencies">*</a></sup> du service <i>dont il d&eacute;pend</i>.
      </li>
      <li>Nagios compare l'&eacute;tat courant du service <i>dont il d&eacute;pend</i> aux
      options d'&eacute;chec soit d'ex&eacute;cution soit de notification dans la d&eacute;finition
      de d&eacute;pendance (selon ce qui adapt&eacute;).
      </li>
      <li>Si l'&eacute;tat courant du service <i>dont il d&eacute;pend</i> correspond &agrave; une
      des options d'&eacute;chec, la d&eacute;pendance est r&eacute;put&eacute;e avoir &eacute;chou&eacute; et Nagios
      sortira de la boucle de v&eacute;rification des d&eacute;pendances.
      </li>
      <li>Si l'&eacute;tat courant du service <i>dont il d&eacute;pend</i> ne correspond &agrave;
      aucune des options d'&eacute;chec de la d&eacute;pendance, la d&eacute;pendance est r&eacute;put&eacute;e
      avoir r&eacute;ussi et Nagios continuera avec la prochaine d&eacute;pendance.
      </li>
    </ol>
    <p>
      Ce cycle continue jusqu'&agrave; ce que toutes les d&eacute;pendances du service
      aient &eacute;t&eacute; v&eacute;rifi&eacute;es, ou jusqu'&agrave; ce qu'une d&eacute;pendance &eacute;choue.
    </p>
    <p>
      <a name="hard_dependencies" id="hard_dependencies"></a> <sup>*</sup>Il est
      important de noter que par d&eacute;faut, Nagios utilisera l'&eacute;tat <a href=
      "statetypes.html">hard</a> courant du (des) service(s) dont il d&eacute;pend lors de ses v&eacute;rifications de d&eacute;pendance. Si vous voulez que Nagios utilise l'&eacute;tat le plus r&eacute;cent des services (que ce soit un &eacute;tat
      soft ou hard), activez l'option <a href="configmain.html#soft_service_dependencies">soft_service_dependencies</a>.
    </p>
    <p>
      <strong><u>D&eacute;pendances d'ex&eacute;cution</u></strong>
    </p>
<p>Les d&eacute;pendances d'ex&eacute;cution permettent de limiter les v&eacute;rifications de service <i>actives</i>. Les v&eacute;rifications de service passives ne sont pas affect&eacute;es par les d&eacute;pendances d'ex&eacute;cution.</p>
    <p>
      Si <i>tous</i> les tests de d&eacute;pendance d'ex&eacute;cution du service
      <i>r&eacute;ussissent</i>, Nagios ex&eacute;cute le contr&ocirc;le du service comme &agrave;
      l'accoutum&eacute;e. Si ne serait-ce qu'une d&eacute;pendance d'ex&eacute;cution du service
      &eacute;choue, Nagios arr&ecirc;tera temporairement l'ex&eacute;cution des contr&ocirc;les pour ce
      service (d&eacute;pendant). Par la suite, les tests des d&eacute;pendances d'ex&eacute;cution du
      service vont r&eacute;ussir. Alors, Nagios recommencera les contr&ocirc;les de ce
      service de mani&egrave;re normale. Pour plus d'informations sur l'algorithme
      d'ordonnancement des contr&ocirc;les , lisez <a href=
      "checkscheduling.html">ceci</a>.
    </p>
    <p>
      Dans l'exemple ci-dessus, les d&eacute;pendances d'ex&eacute;cution du <b>Service E</b>
      &eacute;choueraient si le <b>Service B</b> est dans un &eacute;tat WARNING ou UNKNOWN.
      Si c'&eacute;tait le cas, le contr&ocirc;le de service ne serait pas r&eacute;alis&eacute; et serait ordonnanc&eacute; pour une future ex&eacute;cution (potentielle).
    </p>
    <p>
      <strong><u>D&eacute;pendances de notification</u></strong>
    </p>
    <p>
      Si <i>tous</i> les tests de d&eacute;pendance de notification du service
      <i>r&eacute;ussissent</i>, Nagios enverra les notifications pour ce service
      comme &agrave; l'accoutum&eacute;e. Si, ne serait-ce qu'une d&eacute;pendance de notification
      du service &eacute;choue, Nagios arr&ecirc;tera temporairement l'&eacute;mission de
      notifications pour ce service (d&eacute;pendant). Plus tard, les tests des
      d&eacute;pendances de notifications du service vont r&eacute;ussir. Alors, Nagios
      recommencera &agrave; envoyer des notifications pour ce service de mani&egrave;re
      normale. Pour plus d'informations sur l'algorithme de notification, lisez
      <a href="notifications.html">ceci</a>.
    </p>
    <p>
      Dans l'exemple ci-dessus, les d&eacute;pendances de notification du <b>Service
      F</b> &eacute;choueraient si le <b>Service C</b> est dans un &eacute;tat CRITICAL,
      <i>et/ou</i> si le <b>Service D</b> est dans un &eacute;tat WARNING ou UNKNOWN,
      <i>et/ou</i> si le <b>Service E</b> est dans un &eacute;tat WARNING, UNKNOWN, ou
      CRITICAL. Si c'&eacute;tait le cas, les notifications pour ce service ne
      seraient pas envoy&eacute;es.
    </p>
    <p>
      <strong><u>H&eacute;ritage de d&eacute;pendance</u></strong>
    </p>
    <p>
      Comme je l'ai d&eacute;j&agrave; dit, par d&eacute;faut les d&eacute;pendances de service <i>ne sont pas</i>
      h&eacute;rit&eacute;es. Dans l'exemple ci-dessus, vous pouvez voir que le Service F est
      d&eacute;pendant du Service E. Toutefois, il n'h&eacute;rite pas automatiquement des
      d&eacute;pendances du Service E sur le Service B et le Service C. Pour rendre le
      Service F d&eacute;pendant du Service C, nous avons d&ucirc; ajouter une autre
      d&eacute;finition de d&eacute;pendance. Il n'y a pas de d&eacute;finition de d&eacute;pendance pour
      le Service B, donc le Service F <i>n'est pas</i> d&eacute;pendant du Service B.</p>
<p>
Si vous <i>voulez</i> rendre les d&eacute;pendances de service h&eacute;ritables, utilisez le param&eacute;tre inherits_parent dans la d&eacute;finition de la <a href="xodtemplate.html#servicedependency">d&eacute;pendance du service</a>. Quand ce param&eacute;tre est activ&eacute;, il indique que la d&eacute;pendance h&eacute;rite des d&eacute;pendances <i>du service dont elle d&eacute;pend</i> (&eacute;galement appel&eacute; le service ma&icirc;tre). En d'autres termes, si le service ma&icirc;tre d&eacute;pend d'autres services et qu'une de ces d&eacute;pendances est en &eacute;chec, la d&eacute;pendance sera aussi en &eacute;chec.</p>
<p>
Dans l'exemple ci-dessus, imaginez que vous vouliez ajouter une nouvelle d&eacute;pendance au service F qui le rende d&eacute;pendant du service A.  Vous pourriez cr&eacute;er une nouvelle d&eacute;finition de d&eacute;pendance qui indique le service F comme le service <i>d&eacute;pendant</i> et le service A comme le service <i>ma&icirc;tre</i> (c'est-&agrave;-dire le service <i>dont il est d&eacute;pendant</i>).  Vous pourriez &eacute;galement modifier la d&eacute;finition de d&eacute;pendance des services D et F de la mani&egrave;re suivante :
</p>

<p>
<strong>
<font color='red'>
<pre>
define servicedependency{
	host_name			Host B
	service_description		Service D
	dependent_host_name		Host C
	dependent_service_description	Service F
	execution_failure_criteria	o
	notification_failure_criteria	n
	inherits_parent		1
	}

</pre>

</font>
</strong>
</p>

<p>
Comme le param&eacute;tre <i>inherits_parent</i> est activ&eacute;, la d&eacute;pendance entre les services A et D sera test&eacute;e quand la d&eacute;pendance entre les services F et D le sera.
</p>

<p>
Les d&eacute;pendances peuvent avoir de multiples niveaux d'h&eacute;ritage.  Si la d&eacute;finition de d&eacute;pendance entre A et D avait le param&eacute;tre <i>inherits_parent</i> activ&eacute;, et que le service A &eacute;tait d&eacute;pendant d'un autre service (appelons-le service G), le service F serait d&eacute;pendant des services D, A, et G (et le serait potentiellement avec chacun selon des crit&egrave;res diff&eacute;rents).
</p>


    <p>
      <strong><u>D&eacute;pendances d'h&ocirc;tes</u></strong>
    </p>
    <p>
      Comme vous vous y attendez probablement, les d&eacute;pendances d'h&ocirc;tes fonctionnent
      d'une mani&egrave;re similaire &agrave; celles de services. La principale diff&eacute;rence est
      que ce sont des h&ocirc;tes et pas des services. Une autre diff&eacute;rence est que
      la d&eacute;pendance d'h&ocirc;te ne sert qu'&agrave; supprimer des notifications d'h&ocirc;tes et
      non pas des controles d'h&ocirc;tes.
    </p>
<p>
<strong>ATTENTION !</strong> Ne confondez pas les d&eacute;pendance d'h&ocirc;tes avec les relations parent/enfant. Vous utiliserez les relations parent/enfant (d&eacute;finies avec le param&eacute;tre <i>parents</i> dans la d&eacute;finition <a href="xodtemplate.html#host">d'h&ocirc;te</a>) dans la plupart des cas, plut&ocirc;t que des d&eacute;pendances d'h&ocirc;tes.

</p>

    <p>
      L'image ci-dessous est un exemple de diagramme logique de d&eacute;pendances
      d'h&ocirc;tes:
    </p>
    <p>
      <a href="images/host-dependencies.png"><img src=
      "images/host-dependencies.png" alt="Host Dependencies" width="125" height="160" border="1"></a>
    </p>
    <p>
      Dans l'image ci-dessus, les d&eacute;finitions de d&eacute;pendances pour l'h&ocirc;te C
      devraient &ecirc;tre d&eacute;finies ainsi:
    </p>
<p>
<strong>
<font color='red'>
<pre>
define hostdependency{
	host_name			Host A
	dependent_host_name		Host C
	notification_failure_criteria	d
	}

define hostdependency{
	host_name			Host B
	dependent_host_name		Host C
	notification_failure_criteria	d,u
	}
</pre>
</font>
</strong>
</p>
    <p>
      Comme pour les d&eacute;pendances de services, les d&eacute;pendances d'h&ocirc;tes ne sont
      pas h&eacute;rit&eacute;es. Dans l'exemple de cette image, vous pouvez voir que l'h&ocirc;te
      C n'h&eacute;rite pas des d&eacute;pendances de l'h&ocirc;te B. Pour que C soit d&eacute;pendant de
      A, une autre d&eacute;finition d'h&ocirc;te doit &ecirc;tre pr&eacute;cis&eacute;e.
    </p>
    <p>
      Les d&eacute;pendances de notifications d'h&ocirc;tes marchent d'une mani&egrave;re similaire
      &agrave; celles de services. Si <i>toutes</i> les notifications de d&eacute;pendance d'un
      h&ocirc;te <i>r&eacute;ussissent</i>, Nagios enverra les notifications comme &agrave; l'accoutum&eacute;e. Si
      ne serait-ce qu'une de ces d&eacute;pendances &eacute;choue, Nagios supprimera
      temporairement toutes les notifications pour cet h&ocirc;te (d&eacute;pendant). Par la suite, les d&eacute;pendances r&eacute;ussiront &agrave; nouveau. Nagios recommencera alors &agrave; envoyer les notifications de mani&egrave;re habituelle. Vous trouverez <a href="notifications.html">ici</a> plus d'informations sur la l'algorithme de notification.      
    </p>
<p>
<strong>NOTE :</strong> Les d&eacute;pendances d'ex&eacute;cution d'h&ocirc;tes fonctionnent de la m&ecirc;me mani&egrave;re que les d&eacute;pendances d'&eacute;x&eacute;cution de services. Toutefois, elle ne sont prises en compte que lors des <i>contr&ocirc;les d'h&ocirc;te ordonnanc&eacute;s r&eacute;guli&egrave;rement</i>. Les contr&ocirc;les d'h&ocirc;tes &agrave; la demande ne sont pas concern&eacute;s par les d&eacute;pendances d'h&ocirc;tes. 
</p>
    <hr>
  </body>
</html>
