
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<HEAD>
<TITLE>Supervision r&eacute;partie</TITLE>
<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->
</STYLE>
<BODY bgColor=#ffffff text=black class="Default">
<P>
<DIV align=center>
<H2 class="PageTitle">Supervision r&eacute;partie</H2></DIV>
<HR>
<P><STRONG><U>Introduction</U></STRONG>
</P>
<P>Nagios peut &ecirc;tre configur&eacute; pour supporter la supervision r&eacute;partie des services 
  et ressources du r&eacute;seau. Je vais essayer d'expliquer bri&egrave;vement comment cela 
  peut s'effectuer... </P>
<P>
<STRONG><U>Buts</U></STRONG>
</P>
<P>Le but de l'environnement de supervision r&eacute;parti que je vais d&eacute;crire est de 
  d&eacute;charger l'exc&egrave;s de charge induit par les contr&ocirc;le de services (sur la CPU, 
  etc.) du serveur central sur un ou plusieurs serveurs "r&eacute;partis". La plupart 
  des petites et moyennes entreprises n'auront pas r&eacute;ellement besoin de mettre 
  en &#156;uvre cet environnement. Cependant, quand vous voulez superviser des 
  centaines, voire des milliers d'<I>h&ocirc;tes</I> (et plusieurs fois cette valeur 
  en termes de services) &agrave; l'aide de Nagios, cela commence &agrave; devenir important. 
</P>
<P>
<STRONG><U>Diagramme de r&eacute;f&eacute;rence</U></STRONG>
</P>
<P>Le diagramme ci-dessous devrait vous aider &agrave; vous faire une id&eacute;e du fonctionnement 
  de la supervision r&eacute;partie avec Nagios. Je ferai r&eacute;f&eacute;rence aux &eacute;l&eacute;ments 
  du diagramme quand j'expliquerai les choses... </P>
<P><A href="images/distributed.png"><IMG border=1 height=959 src="images/distributed.png" width=784></A> 
</P>
<P>
<STRONG><U>Serveur central ou serveurs r&eacute;partis</U></STRONG>
</P>
<P>Quand on installe l'environnement de supervision r&eacute;parti avec Nagios, il y a des diff&eacute;rences entre la configuration du serveur central et celle des serveurs r&eacute;partis. Je vous montrerai comment configurer ces deux types de serveurs et j'expliquerai les effets des changements sur la supervision en g&eacute;n&eacute;ral. A l'intention des d&eacute;butants, d&eacute;crivons d'abord l'utilit&eacute; des diff&eacute;rents serveurs...
</P>
<P>Le r&ocirc;le d'un <I>serveur r&eacute;parti</I> est de contr&ocirc;ler tous les services d&eacute;finis 
  pour une grappe [cluster] d'h&ocirc;tes. J'utilise ce terme "grappe" de mani&egrave;re inappropri&eacute;e 
  : il d&eacute;signe simplement un groupe d'h&ocirc;tes de votre r&eacute;seau. Selon la topographie 
  de votre r&eacute;seau, vous pouvez avoir plusieurs grappes en un seul lieu, ou chaque 
  grappe peut &ecirc;tre s&eacute;par&eacute;e par un WAN, un pare-feu, etc. Il faut surtout se souvenir 
  d'une chose, c'est que pour chaque groupe d'h&ocirc;tes (de quelque mani&egrave;re que vous 
  le d&eacute;finissiez), il y a un serveur r&eacute;parti sur lequel Nagios tourne et qui 
  supervise les services des h&ocirc;tes du cluster. Un serveur r&eacute;parti est g&eacute;n&eacute;ralement 
  une installation simplifi&eacute;e de Nagios. Il n'est pas besoin d'installer l'interface 
  web, d'envoyer des notifications, de faire tourner les scripts de gestionnaires 
  d'&eacute;v&eacute;nements ou de faire autre chose que l'ex&eacute;cution des contr&ocirc;les de service 
  si vous ne le souhaitez pas. De plus amples explications relatives &agrave; la configuration 
  du serveur r&eacute;parti suivront... </P> 
<P>Le but du <I>serveur central</I> est d'&eacute;couter simplement les r&eacute;sultats des 
  contr&ocirc;les de service d'un ou de plusieurs serveurs r&eacute;partis. M&ecirc;me si les services 
  sont occasionnellement contr&ocirc;l&eacute;s activement par le serveur central, les contr&ocirc;les 
  actifs sont seulement ex&eacute;cut&eacute;s dans des circonstances particuli&egrave;res ; 
  disons donc pour l'instant que le serveur central n'accepte que les contr&ocirc;les 
  passifs. Comme le serveur central obtient des r&eacute;sultats des <A href="passivechecks.html">contr&ocirc;les 
  de services passifs</A> d'un ou plusieurs serveurs r&eacute;partis, il est utilis&eacute; 
  comme point central pour la logique de supervision (i.e il envoie des notifications, 
  ex&eacute;cute les scripts de gestionnaires d'&eacute;v&eacute;nements, d&eacute;termine l'&eacute;tat des h&ocirc;tes, 
  son interface web est install&eacute;e, etc.). </P>
<P> <STRONG><U>Obtention des informations de contr&ocirc;le de service &agrave; 
  partir de moniteurs r&eacute;partis</U></STRONG> </P>
<P>Avant de sauter &agrave; pieds joints dans les d&eacute;tails de la configuration, il faut 
  savoir comment envoyer les r&eacute;sultats des contr&ocirc;les de service des serveurs r&eacute;partis 
  au serveur central. J'ai d&eacute;j&agrave; expliqu&eacute; comment soumettre des r&eacute;sultats de contr&ocirc;les 
  passifs &agrave; Nagios &agrave; partir de la machine m&ecirc;me sur laquelle Nagios tourne 
  (cf. documentation sur les <A href="passivechecks.html">contr&ocirc;les passifs</A>), 
  mais je n'ai pas fourni d'information sur la mani&egrave;re d'envoyer des r&eacute;sultats 
  de contr&ocirc;les de service &agrave; partir d'autres h&ocirc;tes. </P>
<P>Afin de faciliter l'envoi de r&eacute;sultats de contr&ocirc;les passifs &agrave; 
  un h&ocirc;te distant, j'ai &eacute;crit le module compl&eacute;mentaire <A href="addons.html#nsca">nsca</A>. 
  Il contient deux parties. La premi&egrave;re est un programme client (send_nsca) 
  qui tourne sur un h&ocirc;te distant et envoi les r&eacute;sultats de contr&ocirc;les 
  de service &agrave; un autre serveur. La seconde est le d&eacute;mon nsca (nsca) 
  qui fonctionne, soit comme un d&eacute;mon autonome, soit sous inetd, et &eacute;coute 
  les connections des programmes du client. Apr&egrave;s avoir re&ccedil;u l'information 
  de contr&ocirc;le de service de la part d'un client, le d&eacute;mon enverra 
  l'information de contr&ocirc;le &agrave; Nagios (sur le serveur central) en 
  ins&eacute;rant une commande <I>PROCESS_SVC_CHECK_RESULT</I> dans le <A href="configmain.html#command_file">fichier 
  de commande externe</A>, avec les r&eacute;sultats du contr&ocirc;le. La prochaine 
  fois que Nagios contr&ocirc;lera les <A href="extcommands.html">commandes externes</A>, 
  il trouvera l'information de contr&ocirc;le de service passif qui avait &eacute;t&eacute; 
  envoy&eacute;e par le serveur r&eacute;parti et la traitera. El&eacute;mentaire, 
  non ? </P>
<P><STRONG><U>Configuration des serveurs r&eacute;partis</U></STRONG> </P>
<P>Bon, comment Nagios est-il configur&eacute; sur un serveur r&eacute;parti ? A la base, c'est juste une simple installation. Il n'est pas n&eacute;cessaire d'installer l'interface web ou de faire envoyer des notifications par le serveur, comme c'est le cas pour le serveur central.
</P>
<P>Changements principaux dans la configuration : </P>
<P>
<UL>
  <LI>Seuls les services et les h&ocirc;tes qui sont supervis&eacute;s directement par le serveur 
    r&eacute;parti sont d&eacute;finis dans le fichier de configuration d'h&ocirc;te. 
  <LI>Le serveur r&eacute;parti a sa <A  href="configmain.html#program_mode">directive d'activation 
    de notification </A> initiale fix&eacute;e &agrave; 0. Cela &eacute;vitera d'envoyer 
    des notifications &agrave; partir du serveur. 
  <LI>Le serveur r&eacute;parti est configur&eacute; avec <A href="configmain.html#obsess_over_services">l'option 
    de remont&eacute;e de contr&ocirc;le de service</A> activ&eacute;e. 
  <LI>Le serveur r&eacute;parti a une <A href="configmain.html#ocsp_command">commande 
    ocsp </A> d&eacute;finie (cf. ci-dessous).</LI>
</UL>
<p></P>
<P>Afin que tout fonctionne ensemble de mani&egrave;re correcte, nous voulons 
  que le serveur r&eacute;parti renvoie les r&eacute;sultats de <i>tous</i> les 
  contr&ocirc;les de service &agrave; Nagios. Nous pourrions utiliser les <A href="eventhandlers.html">gestionnaires 
  d'&eacute;v&eacute;nements</A> pour envoyer les <I>changements</I> de l'&eacute;tat 
  d'un service, mais cela ne fait pas l'affaire. Afin d'obliger le serveur r&eacute;parti 
  &agrave; envoyer tous les r&eacute;sultats des contr&ocirc;les de service, il 
  faut autoriser <a href="configmain.html#obsess_over_services">l'option de remont&eacute;e 
  de contr&ocirc;le de service</a> dans le fichier de configuration principal 
  et permettre qu'une <A href="configmain.html#ocsp_command">commande ocsp</A> 
  soit lanc&eacute;e apr&egrave;s chaque contr&ocirc;le de service. Nous utiliserons 
  cette commande ocsp pour envoyer les r&eacute;sultats de tous les contr&ocirc;les 
  de service au serveur central, en utilisant le client send_nsca et le d&eacute;mon 
  nsca (comme d&eacute;crit ci-dessus) pour g&eacute;rer la transmission. </P>
<P>Pour mener tout cela &agrave; bien, il faut d&eacute;finir la commande ocsp de cette fa&ccedil;on :
</P>
<P>
<STRONG><FONT color=red>ocsp_command=submit_check_result</FONT></STRONG>
</P>
<P>La d&eacute;finition de la commande <I>submit_check_result</I> ressemble &agrave; ceci : 
</P>
<p>
<strong>
<font color="red">
<pre>
define command{
	command_name	submit_check_result
	command_line	/usr/local/nagios/libexec/eventhandlers/submit_check_result $HOSTNAME$ '$SERVICEDESC$' $SERVICESTATEID$ '$SERVICEOUTPUT$'
	}
</pre>
</font>
</strong>
<P>Le script shell <I>submit_check_result</I> ressemble &agrave; cela (remplacez <I>central_server</I> par l'adresse IP du serveur central) :
</P>
<P>
<PRE>	#!/bin/sh
	# Arguments:
	#  $1 = host_name (Short name of host that the service is
	#       associated with)
	#  $2 = svc_description (Description of the service)
	#  $3 = state_string (A string representing the status of
	#       the given service - "OK", "WARNING", "CRITICAL"
	#       or "UNKNOWN")
	#  $4 = plugin_output (A text string that should be used
	#       as the plugin output for the service checks)
	#
	# Convert the state string to the corresponding return code
	return_code=-1
	case "$3" in
    	    OK)
        	        return_code=0
            	    ;;
	        WARNING)
    	            return_code=1
        	        ;;
	        CRITICAL)
    	            return_code=2
        	        ;;
	        UNKNOWN)
    	            return_code=-1
        	        ;;
	esac
	# pipe the service check info into the send_nsca program, which
	# in turn transmits the data to the nsca daemon on the central
	# monitoring server
	/bin/echo -e "$1\t$2\t$return_code\t$4\n" | /usr/local/nagios/bin/send_nsca <I>central_server</I> -c /usr/local/nagios/var/send_nsca.cfg
</PRE>
<P>Le script ci-dessus suppose que vous avez le programme send_nsca et son fichier de configuration (send_nsca.cfg) plac&eacute;s respectivement dans les r&eacute;pertoires <I>/usr/local/nagios/bin/</I> et <I>/usr/local/nagios/var/</I>.
</P>
<P>C'est tout ! Nous venons de configurer avec succ&egrave;s un h&ocirc;te distant 
  sur lequel tourne Nagios pour agir comme un serveur de supervision r&eacute;parti. 
  Voyons maintenant ce qui se passe exactement avec le serveur r&eacute;parti 
  et comment il envoie des r&eacute;sultats de contr&ocirc;le de service &agrave; 
  Nagios (les &eacute;tapes soulign&eacute;es ci-dessous correspondent aux num&eacute;ros 
  du sch&eacute;ma de r&eacute;f&eacute;rence ci-dessus) : </P>
<P>
<OL>
  <LI>Apr&egrave;s que le serveur r&eacute;parti a termin&eacute; l'ex&eacute;cution d'un contr&ocirc;le de service, 
    il ex&eacute;cute la commande d&eacute;finie par la variable <A  href="configmain.html#ocsp_command">ocsp_command</A>. 
    Dans notre exemple, c'est le script <I>/usr/local/nagios/libexec/eventhandlers/submit_check_result</I>. 
    Remarquez que la d&eacute;finition de la commande <I>submit_check_result</I> a envoy&eacute; 
    quatre &eacute;l&eacute;ments d'information au script : le nom de l'h&ocirc;te auquel le service 
    est associ&eacute;, la description du service, le code de retour du contr&ocirc;le de service, 
    et la sortie du plugin de contr&ocirc;le du service. 
  <LI>Le script <I>submit_check_result</I> envoie dans un tube [pipe] l'information du contr&ocirc;le de service (nom de l'h&ocirc;te, description, code de retour et sortie) au programme client <I>send_nsca</I>. 
  <LI>Le programme <I>send_nsca</I> transmet l'information de contr&ocirc;le de service au d&eacute;mon <I>nsca</I> qui se trouve sur le serveur de supervision central.
  <LI>Le d&eacute;mon <I>nsca</I> du serveur central prend l'information de contr&ocirc;le de service et l'&eacute;crit dans le fichier de commande externe pour qu'elle soit reprise ult&eacute;rieurement par Nagios.
  <LI>Le processus Nagios du serveur central lit le fichier de commande externe 
    et analyse l'information de contr&ocirc;le de service provenant du serveur 
    de supervision r&eacute;parti.</LI>
</OL>
<P>
<STRONG><U>Configuration du serveur central</U></STRONG>
</P>
<P>Nous avons vu comment les serveurs de supervision r&eacute;partis doivent &ecirc;tre configur&eacute;s, 
  occupons nous maintenant du serveur central. Pour accomplir toutes ses missions, 
  il est configur&eacute; de la m&ecirc;me mani&egrave;re que vous configureriez un serveur seul. 
  Il est install&eacute; de la mani&egrave;re suivante : </P>
<P>
<UL>
  <LI>L'interface web du serveur central est install&eacute;e (optionnel, mais 
    recommand&eacute;) 
  <LI>Sur le serveur central, la <a href="configmain.html#program_mode">directive d'activation 
    de notifications </a> est fix&eacute;e &agrave; 1. Ceci activera les notifications 
    (optionnel, mais recommand&eacute;) 
  <LI>Les <a href="configmain.html#execute_service_checks">contr&ocirc;les de 
    service actifs</a> sont d&eacute;sactiv&eacute;s sur le serveur central (optionnel, 
    mais recommand&eacute; &#151; voir notes ci-dessous) 
  <LI>Les <A href="configmain.html#check_external_commands">contr&ocirc;les de commandes 
    externes</A> sont activ&eacute;s sur le serveur central (obligatoire) 
  <LI>Les <A href="configmain.html#accept_passive_service_checks">contr&ocirc;les de 
    service passifs</A> sont activ&eacute;s sur le serveur central (obligatoire)</LI>
</UL>
<P>Il y a trois autres &eacute;l&eacute;ments importants que vous devez conserver &agrave; l'esprit 
  en configurant le serveur central : </P>
<P>
<UL>
  <LI><i>Tous les services</i> qui sont supervis&eacute;s par les serveurs r&eacute;partis 
    doivent comporter des d&eacute;finitions de service sur le serveur central.. 
    Nagios ignorera les r&eacute;sultats des contr&ocirc;les de service passifs 
    s'ils ne correspondent pas &agrave; un service qui a &eacute;t&eacute; d&eacute;fini. 
  <li>Si vous n'utilisez le serveur central que pour traiter des services dont 
    les r&eacute;sultats sont fournis par des h&ocirc;tes r&eacute;partis, vous 
    pouvez simplement d&eacute;sactiver tous les contr&ocirc;les de service pour 
    l'ensemble du logiciel en mettant la variable <a href="configmain.html#execute_service_checks">execute_service_checks</a> 
    &agrave; 0. 
  <li>Si vous utilisez le serveur central pour superviser activement quelques 
    services par lui-m&ecirc;me (sans l'intervention des serveurs r&eacute;partis), 
    la variable <i>enable_active_check</i> de chaque d&eacute;finition de service 
    pour les services dont les r&eacute;sultats sont fournis par les h&ocirc;tes 
    r&eacute;partis doit &ecirc;tre positionn&eacute;e &agrave; 0. Ceci emp&ecirc;chera 
    Nagios de v&eacute;rifier activement ces services. 
</UL>
<p></p>
<P>Il est important que vous d&eacute;sactiviez soit tous les contr&ocirc;les 
  de service pour l'ensemble du logiciel, soit l'option <i>enable_active_checks 
  </i>dans la d&eacute;finition de tout service surveill&eacute; par un serveur 
  r&eacute;parti. Cela assure que les contr&ocirc;les de service actifs ne sont 
  jamais ex&eacute;cut&eacute;s en temps normal. Les services continueront &agrave; 
  &ecirc;tre ordonnanc&eacute;s &agrave; leur intervalle de contr&ocirc;le normal 
  (3 minutes, 5 minutes, etc...), mais ils ne seront jamais ex&eacute;cut&eacute;s. 
  Cette boucle de r&eacute; ordonnancement continuera aussi longtemps que Nagios 
  tourne. Je vais expliquer bient&ocirc;t pourquoi ce type de fonctionnement... 
</P>
<P> Et voil&agrave; ! Facile, non ? </P>
<P>
<STRONG><U>Probl&egrave;mes rencontr&eacute;s lors des contr&ocirc;les passifs</U></STRONG>
</P>
<P>Pour toutes les utilisations intensives, nous pouvons dire que le serveur central 
  s'appuie uniquement sur les contr&ocirc;les passifs pour la supervision. Faire 
  totalement confiance aux contr&ocirc;les passifs pour superviser pose un probl&egrave;me 
  majeur : Nagios doit se fier &agrave; quelque chose d'autre pour fournir les donn&eacute;es 
  supervis&eacute;es. Que se passe-t-il si l'h&ocirc;te distant qui envoie les r&eacute;sultats s'effondre 
  ou devient injoignable ? Si Nagios ne contr&ocirc;le pas activement les services de 
  cet h&ocirc;te, comment saura-t-il qu'il y a un probl&egrave;me ? </P>
<p> </p>
<P>Nous pouvons pr&eacute;venir ce type de probl&egrave;mes en utilisant un autre 
  module compl&eacute;mentaire pour superviser les r&eacute;sultats des contr&ocirc;les 
  passifs qui arrivent... </P>
<P> <STRONG><U>Le contr&ocirc;le de validit&eacute; des donn&eacute;es</U></STRONG></P>
<P>Nagios offre une fonctionnalit&eacute; qui teste la validit&eacute; des r&eacute;sultats 
  d'un test. On peut trouver plus d'informations &agrave; ce sujet <a href="freshness.html">ici.</a> 
  Cette fonctionnalit&eacute; apporte une solution aux situations ou les h&ocirc;tes 
  distants peuvent arr&ecirc;ter d'envoyer le r&eacute;sultat des tests passifs 
  au serveur central. Elle permet d'assurer que le test est soit fourni passivement 
  par les serveurs r&eacute;partis, soit ex&eacute;cut&eacute; activement par 
  le serveur central si n&eacute;cessaire. Si les r&eacute;sultats fournis par 
  le test du service deviennent &quot;fig&eacute;s&quot;, Nagios peut &ecirc;tre 
  configur&eacute; pour forcer un contr&ocirc;le actif depuis le serveur central.</P>
<P>Comment fait-on cela ? Sur le serveur central, il faut configurer ainsi les 
  services qui sont surveill&eacute;s par les serveurs r&eacute;partis:</P>
<ul>
  <li>L'option <i>check_freshness </i>dans la d&eacute;finition des services doit 
    &ecirc;tre &agrave; 1. Ceci active le test de validit&eacute;</li>
  <li>L'option <i>freshness_threshold</i> dans la d&eacute;finition des services 
    doit &ecirc;tre positionn&eacute; &agrave; une valeur qui indique le niveau 
    de validit&eacute; (<b>[NdT]</b><i><b> </b></i>: <i>la traduction litt&eacute;rale 
    est la &quot;fra&icirc;cheur&quot;, mais il ne me semble pas adapt&eacute;)</i> 
    des donn&eacute;es (telles que fournies par les serveurs r&eacute;partis) 
  </li>
  <li>L'option <i>check_command </i>dans la d&eacute;finition des services doit 
    indiquer les commandes valides qui seront employ&eacute;es pour tester activement 
    les services depuis le serveur central.</li>
</ul>
<P>Nagios teste r&eacute;guli&egrave;rement la validit&eacute; des r&eacute;sultats 
  pour lesquels cette option est valid&eacute;e. L'option <i>freshness_threshold</i> 
  dans chaque service d&eacute;termine le niveau de validit&eacute; pour celui-ci.</P>
<P>Par exemple, si sa valeur est 300 pour un de vos services, Nagios va consid&eacute;rer 
  que les r&eacute;sultats du service sont &quot;fig&eacute;s&quot; s'ils ont 
  plus de 5 minutes (300 secondes). Si vous ne sp&eacute;cifiez pas la valeur 
  de <i>freshness_threshold,</i> Nagios calculera un seuil &agrave; partir de 
  la valeur des options <i>normal_check_interval</i> ou de <i>retry_check_interval 
  </i>(en fonction de <a href="statetypes.html">l'&eacute;tat du service</a>). 
  Si les r&eacute;sultats sont &quot;fig&eacute;s&quot;, Nagos ex&eacute;cutera 
  la commande sp&eacute;cifi&eacute;e dans <i>check_command</i> dans la d&eacute;finition 
  du service, v&eacute;rifiant ainsi activement ce service.</P>
<P>N'oubliez pas que vous devez d&eacute;finir l'option <i>check_command </i> 
  dans la d&eacute;finition des services, pour pouvoir tester activement l'&eacute;tat 
  d'un service depuis le serveur central. Dans des conditions normales, cette 
  commande <i>check_command </i> ne sera pas ex&eacute;cut&eacute;e (parce que 
  les test actifs auront &eacute;t&eacute; d&eacute;sactiv&eacute;s globalement 
  au niveau du programme, ou pour des services sp&eacute;cifiques). A partir du 
  moment ou le contr&ocirc;le de validit&eacute; des donn&eacute;es est activ&eacute;, 
  Nagios ex&eacute;cutera cette commande, <i>m&ecirc;me si les tests actifs ont 
  &eacute;t&eacute; d&eacute;sactiv&eacute;s globalement au niveau du programme 
  ou pour des services sp&eacute;cifiques.</i></P>
<P>Si nous n'arrivez pas &agrave; d&eacute;finir des commandes pour tester activement 
  un service depuis le serveur central (ou bien cela est un casse-t&ecirc;te douloureux), 
  vous pouvez simplement d&eacute;finir toutes les options <i>check_command </i>d'apr&egrave;s 
  un simple script qui retourne un &eacute;tat &quot;critique&quot;. Voici un 
  exemple : supposons que vous ayez d&eacute;fini une commande &quot;service_fige&quot; 
  et utilisez cette commande dans l'option <i>check_command</i> de vos services. 
  Elle pourrait ressembler &agrave; cela .....</P>
<pre><strong><font color="red">
define command{
	command_name	service-fige<br />   command_line	/usr/local/nagios/libexec/service-fige.sh
	}
</font></strong></pre>
<p></p>
<p> <font color="#000000">Le programme &quot;service_fig&eacute;.sh &quot; dans 
  <i>/usr/local/nagios/libexec</i> pourrait ressembler &agrave; cela:</font> </p>
<p> 
<dir> 
  <table border=1>
    <tr> 
      <td> 
        <pre>
#!/bin/sh
/bin/echo "CRITICAL: Les resultats du service sont figes!"
exit 2
</pre>
      </td>
    </tr>
  </table>
</dir>
<P>Ensuite, quand Nagios d&eacute;tecte que les r&eacute;sultats sont fig&eacute;s 
  et lance la commande <b>service_fige.sh, </b>le script /<i>usr/local/nagios/libexec/service-fige.sh 
  </i>est ex&eacute;cut&eacute; et le service passe dans un &eacute;tat critique. 
  Ceci d&eacute;clenchera l'envoi de notifications, donc vous saurez finalement 
  qu'il y a un probl&egrave;me.</P>
<P><strong><u>Test des h&ocirc;tes</u></strong></P>
<P>Maintenant, vous savez comment obtenir des r&eacute;sultats de contr&ocirc;les 
  passifs depuis des serveurs r&eacute;partis. Ceci signifie que le serveur central 
  ne teste activement que ses propres services. Mais qu'en est-il des h&ocirc;tes 
  ? Vous en avez toujours besoin, non ?</P>
<P>Comme les tests des h&ocirc;tes n'ont qu'un impact faible sur la surveillance 
  (ils ne sont faits que s'ils sont vraiment n&eacute;cessaires), je vous recommanderai 
  bien de faire ces tests, de mani&egrave;re active, depuis le serveur central. 
  Ceci signifie que vous d&eacute;finirez le test des h&ocirc;tes sur le serveur 
  central de la m&ecirc;me mani&egrave;re que vous l'avez fait sur les serveurs 
  r&eacute;partis (&eacute;galement de la m&ecirc;me mani&egrave;re que sur un 
  serveur normal, non r&eacute;partis).</P>
<P>Les r&eacute;sultats de contr&ocirc;le passifs des h&ocirc;tes sont disponible 
  (<a href="passivechecks.html">ici</a>), donc vous pourriez les utiliser dans 
  votre architecture r&eacute;partie mais cette m&eacute;thode comporte certains 
  probl&egrave;mes. Le principal &eacute;tant que Nagios ne traduit pas les &eacute;tats 
  probl&egrave;mes (arr&ecirc;t&eacute;s [down] ou injoignables [unreachable]) 
  retourn&eacute;s par les v&eacute;rifications passives des h&ocirc;tes quand 
  ils sont trait&eacute;s. Par cons&eacute;quent, si vos serveurs de supervision 
  ont une structure diff&eacute;rentes en terme de parents ou enfants (et c'est 
  ce qui se passe lorsque vos serveurs de supervisions ne sont pas exactement 
  au m&ecirc;me endroit), le serveur central va avoir une vision incorrecte des 
  &eacute;tats des h&ocirc;tes.</P>
<P>Si vous voulez vraiment envoyer des r&eacute;sultats passifs de contr&ocirc;le 
  d'h&ocirc;te &agrave; un serveur de supervision central, v&eacute;rifiez que 
  : </P>
<ul>
  <li>Le serveur central a activ&eacute; la r&eacute;ception passive de v&eacute;rification 
    d'h&ocirc;te (requis)</li>
  <li>Le serveur r&eacute;parti est configur&eacute; avec l'<a href="configmain.html#obsess_over_hosts">option 
    de remont&eacute;e de contr&ocirc;le d'h&ocirc;te</a> activ&eacute;e. </li>
  <li>Le serveur r&eacute;parti a une <a href="configmain.html#ochp_command">commande 
    ochp </a> d&eacute;finie</li>
</ul>
<p>La commande ochp utilis&eacute; pour le traitement des v&eacute;rifications 
  d'h&ocirc;te, fonctionne de mani&egrave;re similaire &agrave; la commande ocsp, 
  utilis&eacute;e pour le traitement des v&eacute;rification des services (cf 
  documentation ci dessus). Pour &ecirc;tre sur que les v&eacute;rifications passives 
  d'h&ocirc;te sont valides et &agrave; jour, il est n&eacute;cessaire d'activer 
  la validit&eacute; des v&eacute;rification pour les h&ocirc;tes de la m&ecirc;me 
  mani&egrave;re que pour les services.</p>
<HR>
</BODY>
</html>
