
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//FR">

<html>
<head>
<title>L'escalade des notifications</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">L'escalade des notifications</h2>
</div>
</p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Nagios supporte l'escalade <i>optionelle</i> des notifications envoy&eacute;es aux
contacts pour des services ou h&ocirc;tes. Je vais en expliquer rapidement le fonctionnement,
bien que cela se comprenne facilement...
</p>

<p>
<strong><u>Les escalades des notifications de service</u></strong>
</p>

<p>
L'escalade des notifications de service est effectu&eacute;e en d&eacute;finissant
<a href="xodtemplate.html#serviceescalation">les escalades de service</a> dans votre
<a href="configobject.html">fichier de configuration d'objet</a>. Ces d&eacute;finitions
sont utilis&eacute;es pour que les notifications relatives &agrave; un service particulier
escaladent.
</p>

<p>
<strong><u>Les escalades des notifications d'h&ocirc;tes</u></strong>
</p>

<p>
L'escalade des notifications d'h&ocirc;tes est effectu&eacute;e en d&eacute;finissant <a href="xodtemplate.html#hostescalation">les
escalades d'h&ocirc;tes</a> dans votre <a href="configobject.html">fichier de configuration d'objets</a>. Les exemples
que je donne ci-dessous utilisent tous les d&eacute;finitions d'escalade de service, mais les escalades d'h&ocirc;tes
fonctionnent de la m&ecirc;me mani&egrave;re (&agrave; l'exception du fait qu'elles sont utilis&eacute;es pour les notifications d'h&ocirc;tes
et non de services).
</p>

<p>
<strong><u>Quand y a-t-il escalade des notifications?</u></strong>
</p>

<p>
Cette escalade a lieu <i>si et seulement si</i> au moins une d&eacute;finition d'escalade
correspond &agrave; la notification qui est envoy&eacute;e. Si &agrave; une notification d'h&ocirc;te ou
de service <i>ne s'applique aucune</i> d&eacute;finition d'escalade valide, le groupe
de contacts pr&eacute;cis&eacute; soit dans le groupe d'h&ocirc;te ou de service sera utilis&eacute; pour
la notification. Regardons l'exemple ci-dessous :
</p>

<p>
<font color="red">
<strong>
<pre>
define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	3
	last_notification	5
	notification_interval	90
	contact_groups		nt-admins,managers
	}

define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	6
	last_notification	10
	notification_interval	60
	contact_groups		nt-admins,managers,everyone
	}
</pre>
</strong>
</font>
</p>

<p>
Remarquez qu'il y a des "trous" dans les d&eacute;finitions d'escalade de notification.
En particulier, les notifications 1 et 2 ne sont pas prises en compte par les
escalades, ni celles au-del&agrave; de 10. Pour la premi&egrave;re et la seconde notification,
de m&ecirc;me que pour celles au-del&agrave; de la dixi&egrave;me, le groupe de contacts <i>par d&eacute;faut</i>
pr&eacute;cis&eacute; dans la d&eacute;finition de service est utilis&eacute;. Dans tous les exemples que j'utiliserai,
je consid&egrave;rerai que le groupe de contacts par d&eacute;faut des d&eacute;finitions de service s'appelle <i>nt-admins</i>.
</p>

<p>
<strong><u>Groupes de contact</u></strong>
</p>

<p>
Lorsqu'on d&eacute;finit les escalades de notification, il est important de garder
&agrave; l'esprit que tous les groupes de contact qui appartenaient aux escalades "plus
basses" (i.e celles avec les plus bas num&eacute;ros de notification) doivent aussi
&ecirc;tre inclus dans les d&eacute;finitions d'escalade "plus hautes". Cela doit &ecirc;tre effectu&eacute;
pour s'assurer que ceux qui se voient notifier un probl&egrave;me <i>continuent</i>
de recevoir les notifications lorsque le probl&egrave;me est escalad&eacute;. Exemple:
</p>

<p>
<font color="red">
<strong>
<pre>
define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	3
	last_notification	5
	notification_interval	90
	contact_groups		nt-admins,managers
	}

define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	6
	last_notification	0
	notification_interval	60
	contact_groups		nt-admins,managers,everyone
	}
</pre>
</strong>
</font>
</p>

<p>
Le premier (ou "plus bas") niveau d'escalade comprend &agrave; la fois les groupes
de contact <i>nt-admins</i> et <i>managers</i>. Le dernier (ou "plus haut")
niveau d'escalade comprend les groupes de contact <i>nt-admins</i>, <i>managers</i>,
et <i>everyone</i>. Remarquez que le groupe de contact <i>nt-admins</i> fait
partie des deux d&eacute;finitions d'escalade. C'est pour qu'il continue &agrave; &ecirc;tre pr&eacute;venu
s'il reste des probl&egrave;mes apr&egrave;s que les deux premi&egrave;res notifications de service
aient &eacute;t&eacute; envoy&eacute;es. Le groupe de contact <i>managers</i> appara&icirc;t d'abord dans
la d&eacute;finition d'escalade la "plus basse" - il re&ccedil;oit sa premi&egrave;re notification
lorsque la troisi&egrave;me notification de probl&egrave;me est envoy&eacute;e. Nous voulons que
le groupe <i>managers</i> continue de recevoir des notifications si le probl&egrave;me
persiste apr&egrave;s cinq notifications, il fait donc partie de la "plus haute" d&eacute;finition
d'escalade.
</p>

<p>
<strong><u>Recoupement des port&eacute;es des escalades</u></strong>
</p>

<p>
Les d&eacute;finitions d'escalade de notification peuvent avoir des port&eacute;es qui se
recoupent. Prenons l'exemple suivant :
</p>

<p>
<font color="red">
<strong>
<pre>
define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	3
	last_notification	5
	notification_interval	20
	contact_groups		nt-admins,managers
	}

define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	4
	last_notification	0
	notification_interval	30
	contact_groups		on-call-support
	}
</pre>
</strong>
</font>
</p>

<p>
Dans l'exemple ci-dessus :
</p>

<p>
<ul>
<li>Les groupes de contact <i>nt-admins</i> et <i>managers</i> re&ccedil;oivent la troisi&egrave;me notification
<li>Les trois groupes de contact re&ccedil;oivent les quatri&egrave;me et cinqui&egrave;me notifications
<li>Seul le groupe de contact <I>on-call-support</I> re&ccedil;oit les notifications &agrave; partir de la sixi&egrave;me notification
</ul>
</p>

<p>
<strong><u>Notifications de reprise d'activit&eacute;</u></strong>
</p>

<p>
Les notifications de reprise d'activit&eacute; sont l&eacute;g&egrave;rement diff&eacute;rentes des notifications
de probl&egrave;me lorsqu'il s'agit d'escalade. Prenons l'exemple suivant :
</p>

<p>
<font color="red">
<strong>
<pre>
define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	3
	last_notification	5
	notification_interval	20
	contact_groups		nt-admins,managers
	}

define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	4
	last_notification	0
	notification_interval	30
	contact_groups		on-call-support
	}
</pre>
</strong>
</font>
</p>

<p>
Si, apr&egrave;s trois notifications de probl&egrave;me, une notification de reprise d'activit&eacute;
est envoy&eacute;e au service, qui re&ccedil;oit la notification ? La reprise d'activit&eacute; est
la quatri&egrave;me notification envoy&eacute;e. Cependant, le code d'escalade est suffisamment
bien fait pour que seules les personnes qui ont re&ccedil;u la troisi&egrave;me notification
re&ccedil;oivent celle de reprise d'activit&eacute;. Dans ce cas, les groupes de contact <i>nt-admins</i>
et <i>managers</i> recevront la notification de reprise d'activit&eacute;.
</p>

<p>
<strong><u>Intervalles de notification</u></strong>
</p>

<p>
Vous pouvez modifier la fr&eacute;quence &agrave; laquelle les notifications
escalad&eacute;es sont &eacute;mises pour un h&ocirc;te ou un service particulier
en utilisant le param&egrave;tre <i>notification_interval</i> de la d&eacute;finition
d'escalade de groupe d'h&ocirc;tes ou de service. Par exemple :
</p>

<p>
<font color="red">
<strong>
<pre>
define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	3
	last_notification	5
	notification_interval	45
	contact_groups		nt-admins,managers
	}

define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	6
	last_notification	0
	notification_interval	60
	contact_groups		nt-admins,managers,everyone
	}
</pre>
</strong>
</font>
</p>

<p>
Dans cet exemple nous voyons que l'intervalle de notification par d&eacute;faut
pour les services est de 240 minutes (c'est la valeur donn&eacute;e dans la
d&eacute;finition du service). Quand la notification de ce service est escalad&eacute;e
lors des 3&egrave;me, 4&egrave;me, et 5&egrave;me notifications, un intervalle
de 45 minutes sera utilis&eacute; entre les notifications. Lors de la 6&egrave;me
notification et des suivantes, l'intervalle de notification sera de 60 minutes,
comme il est sp&eacute;cifi&eacute; dans la seconde d&eacute;finition d'escalade.
</p>

<p>
Comme il est possible d'avoir des d&eacute;finitions d'escalade qui se chevauchent
pour un groupe d'h&ocirc;tes ou un service donn&eacute;, et comme un h&ocirc;te
peut &ecirc;tre membre de plusieurs groupes d'h&ocirc;tes, Nagios doit d&eacute;cider
quel intervalle de notification utiliser quand des d&eacute;finitions d'escalade
se chevauchent. Dans tous les cas de chevauchement, Nagios choisira l'intervalle
de notification le plus court. Prenez l'exemple suvant :
</p>

<p>
<font color="red">
<strong>
<pre>
define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	3
	last_notification	5
	notification_interval	45
	contact_groups		nt-admins,managers
	}

define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	4
	last_notification	0
	notification_interval	60
	contact_groups		nt-admins,managers,everyone
	}
</pre>
</strong>
</font>
</p>

<p>
Nous voyons que les deux d&eacute;finitions d'escalade se chevauchent sur
les 4&egrave;me et 5&egrave;me notifications. Pour ces notifications, Nagios
utilisera un intervalle de notification de 45 minutes, car c'est le plus petit
intervalle pr&eacute;sent dans les d&eacute;finitions d'escalade valides de
ces notifications.
</p>

<p>
Une derni&egrave;re remarque &agrave; propos des intervalles de notification
concerne les intervalles de 0. Un intervalle de 0 signifie que Nagios ne doit
&eacute;mettre une notification que pour la premi&egrave;re notification valide
durant cette d&eacute;finition d'escalade. Toutes les notifications suivantes
pour le groupe d'h&ocirc;te ou le service seront supprim&eacute;es. Prenez cet
exemple :
</p>

<p>
<font color="red">
<strong>
<pre>
define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	3
	last_notification	5
	notification_interval	45
	contact_groups		nt-admins,managers
	}

define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	4
	last_notification	6
	notification_interval	0
	contact_groups		nt-admins,managers,everyone
	}

define serviceescalation{
	host_name		webserver
	service_description	HTTP
	first_notification	7
	last_notification	0
	notification_interval	30
	contact_groups		nt-admins,managers
	}
</pre>
</strong>
</font>
</p>

<p>
Dans l'exemple ci-dessus, il y aurait au maximum 4 notifications de probl&egrave;me
envoy&eacute;es &agrave; propos du service. Ceci est d&ucirc; au fait que l'intervalle
de notification de 0 dans la seconde d&eacute;finition d'escalade indique qu'une
seule notification doit &ecirc;tre &eacute;mise (&agrave; partir de et en incluant
la 4&egrave;me notification) et que toutes les notifications suivantes doivent
&ecirc;tre supprim&eacute;es. A cause de cela, la troisi&egrave;me d&eacute;finition
d'escalade du service est sans effet, car il n'y aura jamais plus de quatre
notifications.
</p>

<p>
<strong><u>Restrictions de p&eacute;riode de temps</u></strong>
</p>

<p>
Dans des circonstances normales, les escalades peuvent servir aux heures o&ugrave; une notification pourrait normalement &ecirc;tre
envoy&eacute;e pour le service. Cette "fen&ecirc;tre d'heures de notification" est d&eacute;termin&eacute;e par la directive <i>notification_period</i>
de la <a href="xodtemplate.html#service">definition de service</a>.
</p>

<p>
Vous pouvez optionnellement restreindre l'escalade pour qu'elle ne soit prise ne compte pendant une p&eacute;riode de temps
sp&eacute;cifique en utilisant la directive <i>escalation_period</i> dans la d&eacute;finition de
<a href="xodtemplate.html#serviceescalation">l'escalade de service</a>. Si vous utilisez la directive <i>escalation_period</i>
pour sp&eacute;cifier une <a href="xodtemplate.html#timeperiod">timeperiod</a> pendant laquelle utiliser l'escalade, l'escalade
sera prise en compte uniquement pendant ces heures. Si vous ne sp&eacute;cifiez aucune directive <i>escalation_period</i>,
l'escalade peut &ecirc;tre prise en compte &agrave; n'importe quelle heure pendant la "fen&ecirc;tre d'heures de notification" pour le service.
</p>

<p>
Notez que la notification est toujours soumise aux restriction d'heure normales impos&eacute;es par la directive
<i>notification_period</i> de l'escalade de service, et donc que la p&eacute;riode de temps que vous
sp&eacute;cifiez dans l'escalade doit &ecirc;tre comprise dans une plus grande "fen&ecirc;tre d'heures de notification".
</p>

<p>
<strong><u>Restrictions d'&eacute;tat</u></strong>
</p>

<p>
Si vous voulez restreindre la d&eacute;finition d'escalade pour qu'elle soit prise en compte uniquement quand le service est
dans un &eacute;tat donn&eacute;, vous pouves utiliser la directive <i>escalation_options</i> dans la d&eacute;finition
de <a href="xodtemplate.html#serviceescalation">l'escalade de service</a>. Si vous n'utilisez pas la directive <i>escalation_options</i>,
l'escalade peut &ecirc;tre prise en compte quel que soit l'&eacute;tat du service.
</p>

<hr>

</body>
</html>
