
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//FR">

<html>
<head>
<title>Gestionnaires d'&eacute;v&egrave;nements</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Gestionnaires d'&eacute;v&egrave;nements</h2>
</div>
</p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>
<p>
Les gestionnaires d'&eacute;v&egrave;nements sont des commandes optionnelles qui sont ex&eacute;cut&eacute;es
&agrave; chaque fois qu'un changement d'&eacute;tat d'un h&ocirc;te ou d'un service a lieu. Une
premi&egrave;re utilit&eacute; de ces gestionnaires d'&eacute;v&egrave;nements (particuli&egrave;rement pour les
services) r&eacute;side dans la capacit&eacute; de Nagios &agrave; r&eacute;soudre les probl&egrave;mes de mani&egrave;re
pr&eacute;ventive avant que quelqu'un ne re&ccedil;oive une notification. Une seconde
utilit&eacute; est celle d'enregistrer les &eacute;v&egrave;nements relatifs aux h&ocirc;tes ou
services dans une base de donn&eacute;es externe.
</p>

<p>
<strong><u>Types de gestionnaires d'&eacute;v&egrave;nements</u></strong>
</p>
<p>
Deux types principaux de gestionnaires d'&eacute;v&egrave;nements peuvent &ecirc;tre d&eacute;finis :
les gestionnaires d'&eacute;v&egrave;nements de services et les gestionnaires d'&eacute;v&egrave;nements
d'h&ocirc;tes. Les commandes de gestionnaires d'&eacute;v&egrave;nements sont d&eacute;finies (de mani&egrave;re
optionnelle) dans chaque d&eacute;finition d'h&ocirc;te et de service. Comme ces gestionnaires
d'&eacute;v&egrave;nements ne sont associ&eacute;s qu'avec des h&ocirc;tes ou des services particuliers,
je les appellerai "locaux". Si un gestionnaire d'&eacute;v&eacute;nement local a &eacute;t&eacute; d&eacute;fini
pour un service ou un h&ocirc;te, il sera ex&eacute;cut&eacute; lorsque cet h&ocirc;te ou ce service changera
d'&eacute;tat.
</p>
<p>
Vous pouvez aussi sp&eacute;cifier des gestionnaires d'&eacute;v&egrave;nements globaux qui doivent
fonctionner &agrave; <i>chaque</i> changement d'&eacute;tat d'h&ocirc;te ou de service en utilisant
les options <a href="configmain.html#global_host_event_handler">global_host_event_handler</a>
et <a href="configmain.html#global_service_event_handler">global_service_event_handler</a>
de votre fichier de configuration principal. Les gestionnaires d'&eacute;v&egrave;nements
globaux sont ex&eacute;cut&eacute;s imm&eacute;diatement, <i>avant m&ecirc;me</i> d'ex&eacute;cuter un gestionnaire
local d'&eacute;v&eacute;nement d'h&ocirc;te ou de service.
</p>

<p>
<strong><u>Quand les commandes de gestionnaires d'&eacute;v&egrave;nements sont-elles ex&eacute;cut&eacute;es ?</u></strong>
</p>
<p>
Les commandes de gestionnaires d'&eacute;v&egrave;nements de service et d'h&ocirc;te sont ex&eacute;cut&eacute;es lorsqu'un service ou un h&ocirc;te :
</p>
<p>
<ul>
<li>est dans un &eacute;tat d'erreur "soft"
<li>entre dans un &eacute;tat d'erreur "hard"
<li>se r&eacute;tablit apr&egrave;s un &eacute;tat d'erreur "soft" ou "hard"
</ul>
</p>
<p>
A quoi correspondent les &eacute;tats d'erreur "soft" et "hard" dont vous parlez ?  Ils sont d&eacute;crits <a href="statetypes.html">ici</a> .
</p>

<p>
<strong><u>Ordre d'ex&eacute;cution des gestionnaires d'&eacute;v&egrave;nements</u></strong>
</p>
<p>
Les gestionnaires globaux d'&eacute;v&egrave;nements sont ex&eacute;cut&eacute;s avant les gestionnaires locaux que vous avez configur&eacute;s pour des h&ocirc;tes ou services sp&eacute;cifiques.
</p>

<p>
<strong><u>Comment &eacute;crire des commandes de gestionnaires d'&eacute;v&egrave;nements</u></strong>
</p>
<p>
Dans la plupart des cas, les commandes de gestionnaires d'&eacute;v&egrave;nements seront
des scripts &eacute;crits en shell ou en perl. Ils doivent accepter au moins les <a href="macros.html">macros</a> suivantes comme arguments:
</p>
<p>
Macros de gestionnaire d'&eacute;v&eacute;nement de service : <b>$SERVICESTATE$</b>, <b>$SERVICESTATETYPE$</b>, <b>$SERVICEATTEMPT$</b><br />
Macros de gestionnaire d'&eacute;v&eacute;nement d'h&ocirc;te : <b>$HOSTSTATE$</b>, <b>$HOSTSTATETYPE$</b>, <b>$HOSTATTEMPT$</b>
</p>
<p>
Les scripts doivent examiner les valeurs des arguments qui leur sont pass&eacute;s
et ex&eacute;cuter les actions n&eacute;cessaires en fonction de ces valeurs.
Le meilleur moyen de comprendre comment les gestionnaires d'&eacute;v&egrave;nements doivent
fonctionner est de voir un exemple. Heureusement pour vous, il y en a un
<a href="#example">ci-dessous</a>. Il y a aussi des exemples de scripts de gestionnaires
d'&eacute;v&egrave;nements dans le sous-r&eacute;pertoire <b>eventhandlers/</b> de la distribution
de Nagios. Certains de ces scripts montrent l'usage des <a href="extcommands.html">commandes
externes</a> pour impl&eacute;menter la <a href="redundancy.html">supervision redondante
des h&ocirc;tes</a>.
</p>

<p>
<strong><u>Autorisations d'ex&eacute;cution des commandes de gestionnaires d'&eacute;v&egrave;nements</u></strong>
</p>
<p>
Les commandes de gestionnaires d'&eacute;v&egrave;nements que vous configurerez s'ex&eacute;cuteront
avec les permissions de l'utilisateur gr&acirc;ce auquel Nagios tourne sur votre machine.
Cela pr&eacute;sente un probl&egrave;me pour les scripts qui essaient de red&eacute;marrer les services
du syst&egrave;me, car, pour ce genre de t&acirc;ches, les privil&egrave;ges de root sont g&eacute;n&eacute;ralement
n&eacute;cessaires.
</p>
<p>
Ideally you should evaluate the types of event handlers you will be implementing and grant just enough permissions
to the Nagios user for executing the necessary system commands.  You might want to try using <a href="http://www.courtesan.com/sudo/sudo.html">sudo</a> to accomplish this.  Implementation of this is your job, so read the docs and decide if its what you need.

Vous devrez donc &eacute;valuer le type de gestionnaires d'&eacute;v&egrave;nements que vous impl&eacute;mentez
et donner juste les permissions requises &agrave; l'utilisateur nagios pour ex&eacute;cuter
les commandes du syst&egrave;me n&eacute;cessaires. Vous pourrez essayer d'utiliser <a href="http://www.courtesan.com/sudo/sudo.html">sudo</a>
pour cela. L'impl&eacute;mentation, c'est votre travail. Donc lisez les docs et d&eacute;cidez
si &ccedil;a correspond &agrave; vos besoins.
</p>

<p>
<strong><u>D&eacute;bogage des commandes de gestionnaires d'&eacute;v&egrave;nements</u></strong>
</p>
<p>
Lorsque vous d&eacute;boguez des commandes de gestionnaires d'&eacute;v&egrave;nements, je vous
conseille fortement d'autoriser la journalisation des <a href="configmain.html#log_service_retries">r&eacute;essais
de service</a>, <a href="configmain.html#log_host_retries">r&eacute;essais d'h&ocirc;tes</a>,
et <a href="configmain.html#log_event_handlers">commandes de gestionnaires d'&eacute;v&egrave;nements</a>.
Toutes ces options sont configur&eacute;es dans le <a href="configmain.html">fichier
de configuration principal</a>. Permettre la journalisation de ces options vous
autorisera &agrave; voir exactement quand et pourquoi les commandes de gestionnaires
d'&eacute;v&egrave;nements sont ex&eacute;cut&eacute;es.
</p>
<p>
Quand vous aurez achev&eacute; le d&eacute;bogage des commandes de gestionnaires d'&eacute;v&eacute;nement,
vous voudrez probablement d&eacute;sactiver la journalisation des r&eacute;essais d'h&ocirc;tes
et de services. Ils peuvent rapidement remplir votre fichier journal, mais si
vous avez autoris&eacute; la <a href="configmain.html#log_rotation_method">rotation
des journaux</a>, vous pouvez n&eacute;gliger cela.
</p>

<a name="example"></a>
<p>
<strong><u>Exemple de gestionnaire d'&eacute;v&eacute;nement de service</u></strong>
</p>
<p>
L'exemple ci-dessous suppose que vous supervisez le serveur HTTP de la machine
locale et que vous avez sp&eacute;cifi&eacute; <b>restart-httpd</b> comme commande de gestionnaire
d'&eacute;v&eacute;nement pour la d&eacute;finition du service HTTP. Je supposerai &eacute;galement que
vous avez donn&eacute; &agrave; l'option &lt;max_check_attempts&gt; une valeur sup&eacute;rieure
ou &eacute;gale &agrave; 4 (i.e le service est contr&ocirc;l&eacute; 4 fois avant qu'on ne consid&egrave;re qu'il
a un r&eacute;el probl&egrave;me). Un exemple de d&eacute;finition (avec uniquement les champs concern&eacute;s) ressemblerait &agrave; ceci ...
</p>

<p>
<font color="red"><strong>
<pre>
define service{
	host_name			somehost
	service_description		HTTP
	max_check_attempts		4
	event_handler			restart-httpd
	<i>...other service variables...</i>
	}
</pre>
</strong></font>
</p>


<p>
Une fois que le service a &eacute;t&eacute; d&eacute;fini avec un gestionnaire d'&eacute;v&egrave;nement, nous devons d&eacute;finir
le gestionnaire d'&eacute;v&eacute;nement comme une commande. Remarquez les macros de la ligne de commande que je
passe au gestionnaire d'&eacute;v&egrave;nements, elles sont importantes !
</p>

<p>
<font color="red"><strong>
<pre>
define command{
	command_name	restart-httpd
	command_line	/usr/local/nagios/libexec/eventhandlers/restart-httpd  $SERVICESTATE$ $SERVICESTATETYPE$ $SERVICEATTEMPT$
	}
</pre>
</strong></font>
</p>

<p>
Maintenant, nous allons &eacute;crire le script de gestionnaire d'&eacute;v&eacute;nement (c'est le fichier <b>/usr/local/nagios/restart-httpd</b>).
</p>
<p>
<table border=1>
<tr>
<td>
<font size=-1>
<pre>
#!/bin/sh
#
# Event handler script for restarting the web server on the local machine
#
# Note: This script will only restart the web server if the service is
#       retried 3 times (in a "soft" state) or if the web service somehow
#       manages to fall into a "hard" error state.
#


# What state is the HTTP service in?
case "$1" in
OK)
	# The service just came back up, so don't do anything...
	;;
WARNING)
	# We don't really care about warning states, since the service is probably still running...
	;;
UNKNOWN)
	# We don't know what might be causing an unknown error, so don't do anything...
	;;
CRITICAL)
	# Aha!  The HTTP service appears to have a problem - perhaps we should restart the server...

	# Is this a "soft" or a "hard" state?
	case "$2" in

	# We're in a "soft" state, meaning that Nagios is in the middle of retrying the
	# check before it turns into a "hard" state and contacts get notified...
	SOFT)

		# What check attempt are we on?  We don't want to restart the web server on the first
		# check, because it may just be a fluke!
		case "$3" in

		# Wait until the check has been tried 3 times before restarting the web server.
		# If the check fails on the 4th time (after we restart the web server), the state
		# type will turn to "hard" and contacts will be notified of the problem.
		# Hopefully this will restart the web server successfully, so the 4th check will
		# result in a "soft" recovery.  If that happens no one gets notified because we
		# fixed the problem!
		3)
			echo -n "Restarting HTTP service (3rd soft critical state)..."
			# Call the init script to restart the HTTPD server
			/etc/rc.d/init.d/httpd restart
			;;
			esac
		;;

	# The HTTP service somehow managed to turn into a hard error without getting fixed.
	# It should have been restarted by the code above, but for some reason it didn't.
	# Let's give it one last try, shall we?
	# Note: Contacts have already been notified of a problem with the service at this
	# point (unless you disabled notifications for this service)
	HARD)
		echo -n "Restarting HTTP service..."
		# Call the init script to restart the HTTPD server
		/etc/rc.d/init.d/httpd restart
		;;
	esac
	;;
esac
exit 0
</pre>
</font>
</td>
</tr>
</table>
</p>

<p>
Le script donn&eacute; &agrave; titre d'exemple ci-dessus essaiera de red&eacute;marrer le serveur
web sur la machine locale &agrave; deux occasions diff&eacute;rentes : apr&egrave;s que le le service HTTP
soit essay&eacute; pour la troisi&egrave;me fois (dans un &eacute;tat d'erreur
"soft") et apr&egrave;s que le service soit tomb&eacute; dans un &eacute;tat "hard". L'&eacute;tat "hard"
ne devrait pas arriver, car le script devrait red&eacute;marrer le service quand il
se trouve encore dans un &eacute;tat "soft" (i.e la troisi&egrave;me tentative de contr&ocirc;le),
mais est laiss&eacute; au cas o&ugrave;.
</p>
<p>
Il faut noter que le gestionnaire d'&eacute;v&eacute;nement de service sera seulement ex&eacute;cut&eacute;
la premi&egrave;re fois que le service tombe dans un &eacute;tat "hard". Cela emp&ecirc;che Nagios
de poursuivre l'ex&eacute;cution du script pour red&eacute;marrer le serveur web quand il
est dans un &eacute;tat "hard".
</p>


<hr>

</body>
</html>