
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Contr&ocirc;le de la fra&icirc;cheur des r&eacute;sultats d'h&ocirc;tes et de services</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Contr&ocirc;le de la fra&icirc;cheur des r&eacute;sultats d'h&ocirc;tes et de services</h2>

</div>
</p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Nagios propose une fonctionnalit&eacute; de v&eacute;rification de la "fra&icirc;cheur" des r&eacute;sultats de contr&ocirc;les d'h&ocirc;tes et de services. Cette fonctionnalit&eacute; est utile pour vous assurer que des <a href="passivechecks.html">contr&ocirc;les passifs</a> sont re&ccedil;us &agrave; la fr&eacute;quence que vous souhaitez.  Bien que le contr&ocirc;le de fra&icirc;cheur puisse &ecirc;tre utilis&eacute; dans de nombreuses situations, son emploi premier est dans la configuration d'un <a href="distributed.html">environnement de supervision r&eacute;parti</a>.

</p>

<p>
Le but du contr&ocirc;le de "fra&icirc;cheur" est de s'assurer que les contr&ocirc;les d'h&ocirc;te et de service sont soumis r&eacute;guli&egrave;rement de mani&egrave;re passive par des applications externes. Si les r&eacute;sultats d'un contr&ocirc;le d'h&ocirc;te ou de service (pour lequel vous avez activ&eacute; le contr&ocirc;le de fra&icirc;cheur) sont consid&eacute;r&eacute;s comme "p&eacute;rim&eacute;s", Nagios forcera un contr&ocirc;le actif de l'h&ocirc;te ou du service.
</p>

<p>
<strong><u>Contr&ocirc;le de fra&icirc;cheur d'h&ocirc;te ou de service</u></strong>
</p>

<p>
La documentation ci-dessous d&eacute;crit le contr&ocirc;le de fra&icirc;cheur de service. Le contr&ocirc;le de fra&icirc;cheur d'h&ocirc;te (qui n'est pas document&eacute; individuellement) fonctionne de mani&egrave;re similaire au contr&ocirc;le de fra&icirc;cheur de service - &agrave; part &eacute;videmment qu'il se rapporte &agrave; la fra&icirc;cheur des h&ocirc;tes et pas &agrave; celle des services.  Si vous souhaitez configurer le contr&ocirc;le de fra&icirc;cheur d'h&ocirc;te, adaptez les instructions ci-dessous.
</p>

<p>
<strong><u>Configuration du contr&ocirc;le de fra&icirc;cheur de service</u></strong>

</p>

<p>
Avant de param&eacute;trer le seuil de fra&icirc;cheur de chaque service, vous devez activer le contr&ocirc;le de fra&icirc;cheur par les param&eacute;tres <a href="configmain.html#check_service_freshness">check_service_freshness</a> et <a href="configmain.html#freshness_check_interval">freshness_check_interval</a> du fichier de configuration principal. Si vous deviez configurer le contr&ocirc;le de fra&icirc;cheur d'h&ocirc;te, vous utiliseriez les param&eacute;tres <a href="configmain.html#check_host_freshness">check_host_freshness</a> et <a href="configmain.html#host_freshness_check_interval">host_freshness_check_interval</a>.  
</p>

<p>
Maintenant, comment activer le contr&ocirc;le de fra&icirc;cheur d'un service en particulier ? Vous devez configurer la <a href="xodtemplate.html#service">d&eacute;finition de service</a> comme suit.
</p>

<p>
<ul>
<li>Le param&eacute;tre <b>check_freshness</b> de la d&eacute;finition du service doit valoir 1.  Cela active le contr&ocirc;le de  "fra&icirc;cheur" du service.
<li>Le param&eacute;tre <b>freshness_threshold</b> de la d&eacute;finition du service doit avoir une valeur (en secondes) qui refl&eacute;te quel "fra&icirc;cheur" les r&eacute;sultats de ce service doivent pr&eacute;senter.

<li>Le param&eacute;tre <b>check_command</b> de la d&eacute;finition du service doit &ecirc;tre une commande valide, permettant de contr&ocirc;ler activement le service quand il est vu comme "p&eacute;rim&eacute;".
<li>Le param&eacute;tre <b>normal_check_interval</b> de la d&eacute;finition du service doit &ecirc;tre sup&eacute;rieur &agrave; z&eacute;ro (0) si le param&eacute;tre <b>freshness_threshold</b> vaut z&eacute;ro (0).
<li>Le param&eacute;tre <b>check_period</b> de la d&eacute;finition du service doit &ecirc;tre une p&eacute;riode valide. L'intervalle de temps que sp&eacute;cifie la p&eacute;riode d&eacute;termine quand les contr&ocirc;les de fra&icirc;cheur peuvent &ecirc;tre ex&eacute;cut&eacute;s pour le service.
</ul>
</p>

<p>
<strong><u>Fonctionnement du seuil de fra&icirc;cheur</u></strong>
</p>

<p>
Nagios contr&ocirc;le r&eacute;guli&egrave;rement la "fra&icirc;cheur" des r&eacute;sultats de tous les services dont le contr&ocirc;le de fra&icirc;cheur est activ&eacute;. Le param&eacute;tre <i>freshness_threshold</i> de la d&eacute;finition de chaque service permet de d&eacute;terminer quelle "fra&icirc;cheur" ces r&eacute;sultats doivent pr&eacute;senter. Par exemple, si vous donnez la valeur 60 au param&eacute;tre  <i>freshness_threshold</i> de l'un de vos services, Nagios consid&eacute;rera que le service est "p&eacute;rim&eacute;" si ses resultats sont &acirc;g&eacute;s de plus de 60 secondes (1 minute). Si vous ne sp&eacute;cifiez pas de valeur pour le param&eacute;tre <i>freshness_threshold</i> (ou si vous le mettez &agrave; z&eacute;ro), Nagios calculera automatiquement un seuil de "fra&icirc;cheur" &agrave; utiliser en se basant soit sur le param&eacute;tre <i>normal_check_interval</i> soit sur <i>retry_check_interval</i> (selon <a href="statetypes.html">le type d'&eacute;tat</a> dans lequel se trouve le service actuellement).

</p>

<p>
<strong><u>Ce qui se passe lorsqu'un r&eacute;sultat de contr&ocirc;le de service devient "p&eacute;rim&eacute;"</u></strong>
</p>

<p>
Si le r&eacute;sultat d'un contr&ocirc;le de service devient "p&eacute;rim&eacute;" (selon la d&eacute;finition ci-dessus), Nagios forcera un contr&ocirc;le actif du service en ex&eacute;cutant la commande sp&eacute;cifi&eacute;e par le param&eacute;tre <i>check_command</i> de la d&eacute;finition du service. Il est important de noter qu'un contr&ocirc;le de service actif d&eacute;clench&eacute; parce que le service est vu comme "p&eacute;rim&eacute;" sera ex&eacute;cut&eacute; <i>m&ecirc;me si les contr&ocirc;les actifs de service sont d&eacute;sactiv&eacute;s de mani&egrave;re globale ou pour le service en particulier</i>.
</p>

<p>

<strong><u>Travailler avec des contr&ocirc;les purement passifs</u></strong>
</p>

<p>
Comme je l'ai d&eacute;j&agrave; dit, le contr&ocirc;le de fra&icirc;cheur est surtout utile pour les services dont les r&eacute;sultats sont issus d'un <a href="passivechecks.html">contr&ocirc;le passif</a>. Il se peut bien souvent (comme dans le cas d'une <a href="distributed.html">supervision r&eacute;partie</a>) que ces services ne re&ccedil;oivent pas <i>tous</i> les r&eacute;sultats de leur contr&ocirc;le passif - aucun r&eacute;sultat n'&eacute;tant obtenu par contr&ocirc;le actif.
</p>

<p>
Un exemple de service purement passif pourrait &ecirc;tre un rapport d'&eacute;tat de vos travaux de sauvegarde de nuit. Vous avez peut-&ecirc;tre un script externe qui soumet les r&eacute;sultats du travail de sauvegarde &agrave; Nagios une fois que la sauvegarde est termin&eacute;e. Dans ce cas, tous les r&eacute;sultats des contr&ocirc;les pour ce service sont fournis par une application externe, en utilisant des contr&ocirc;les passifs. Pour vous assurer que l'&eacute;tat des travaux de sauvegarde est bien remont&eacute; chaque jour, vous activerez le contr&ocirc;le de fra&icirc;cheur pour ce service.  Si le script externe ne soumet pas les resultats du travail de sauvegarde, vous pouvez faire en sorte que Nagios simule un r&eacute;sultat "critical" de la mani&egrave;re suivante...

</p>

<p>
Voici ce &agrave; quoi la d&eacute;finition du service pourrait ressembler (certains param&eacute;tres obligatoires ont &eacute;t&eacute; omis)...
</p>

<p>
<strong>
<font color="red">
<pre>
define service{
	host_name		backup-server
	service_description	ArcServe Backup Job
	active_checks_enabled	0			; active checks are NOT enabled
	passive_checks_enabled	1			; passive checks are enabled (this is how results are reported)
	check_freshness		1
	freshness_threshold	93600			; 26 hour threshold, since backups may not always finish at the same time
	check_command		no-backup-report	; this command is run only if the service results are "stale"
	...other options...
	}
</pre>
</font>
</strong>
</p>

<p>

Notez que les contr&ocirc;les actifs sont d&eacute;sactiv&eacute;s pour ce service. En effet les r&eacute;sultats du service sont uniquement fournis par une application externe, en utilisant des contr&ocirc;les passifs. Le contr&ocirc;le de fra&icirc;cheur est activ&eacute; et le seuil de fra&icirc;cheur a &eacute;t&eacute; positionn&eacute; &agrave; 26 heures.  C'est un peu plus de 24 heures parce que la dur&eacute;e des travaux de sauvegarde varie selon les jours (en fonction du volume de donn&eacute;es &agrave; sauvegarder, de l'encombrement du r&eacute;seau, etc.).  La commande <i>no-backup-report</i> est ex&eacute;cut&eacute;e seulement si les r&eacute;sultats du service sont consid&eacute;r&eacute;s comme "p&eacute;rim&eacute;s". La d&eacute;finition de la commande <i>no-backup-report</i> pourrait ressembler &agrave; ceci...
</p>

<p>
<strong>
<font color="red">
<pre>
define command{
	command_name	no-backup-report
	command_line	/usr/local/nagios/libexec/nobackupreport.sh
	}
</pre>
</font>
</strong>

</p>

<p>
Le script <b>nobackupreport.sh</b> dans votre r&eacute;pertoire <i>/usr/local/nagios/libexec</i> pourait ressembler &agrave; ceci :
</p>

<p>
<dir>
<table border=1>
<tr>
<td>

<pre>
#!/bin/sh

/bin/echo "CRITICAL: Results of backup job were not reported!"

exit 2
</pre>
</td>
</tr>
</table>
</dir>
</p>

<p>
Si Nagios d&eacute;tecte que les r&eacute;sultats du service sont p&eacute;rim&eacute;s, il lancera la commande <b>no-backup-report</b> comme un contr&ocirc;le actif de service (m&ecirc;me si les contr&ocirc;les actifs sont d&eacute;sactiv&eacute;s pour ce service - rappelez-vous que nous sommes dans un cas particulier).  Cela lance le script <i>/usr/local/nagios/libexec/nobackupreport.sh</i>, qui retourne un &eacute;tat "critical". Le service passe en &eacute;tat "critical" (s'il n'y &eacute;tait pas d&eacute;j&agrave;) et quelqu'un sera probablement notifi&eacute; du probl&egrave;me.

</p>

<hr>

</body>
</html>
