
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Setting Up The Web Interface</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->     
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Configurer l'Interface Web</h2>
</div>
</p>
<hr>


<p>
<strong><u>Notes</u></strong>
</p>

<p>
Dans ce qui suit, je supposerai que vous utilisez le serveur Web <a href="http://www.apache.org">Apache</a> sur votre machine.
Si vous utilisez un autre serveur Web, vous devrez faire les changements appropri&eacute;s.
Je supposerai &eacute;galement que vous utilisez  <i>/usr/local/nagios</i> comme pr&eacute;fixe d'installation.
</p>

<p>
<strong><u>Exemple de configuration</u></strong>
</p>
<p>
Un fichier de configuration d'Apache est cr&eacute;&eacute; lorsque vous ex&eacute;cutez le script de configuration - vous pouvez trouver ce fichier (appel&eacute; <i>httpd.conf</i>) dans le sous r&eacute;pertoire <i>sample-config/</i> de la distribution Nagios. Vous aurez besoin d'ajouter le contenu de ce fichier &agrave; votre configuration Apache avant d'acc&eacute;der &agrave; l'interface Web. Les instructions ci-dessous d&eacute;taillent comment ajouter manuellement la configuration appropri&eacute;e &agrave; Apache.
</p>

<p>
<strong><u>Configuration des Alias et des Options des Repertoires pour l'Interface Web</u></strong>
</p>

<p>
Premi&egrave;rement vous aurez besoin de cr&eacute;er les entr&eacute;es appropri&eacute;es dans votre fichier de configuration du serveur Web.
Ajouter les lignes suivantes &agrave; votre fichier de configuration Web (i.e. <b>httpd.conf</b>) en les changeant pour les faires correspondrent aux r&eacute;pertoires de votre syst&egrave;mes.
</p>

<strong>
<font color="red">
<pre>
ScriptAlias /nagios/cgi-bin /usr/local/nagios/sbin

&lt;Directory "/usr/local/nagios/sbin"&gt;
    Options ExecCGI
    AllowOverride None
    Order allow,deny
    Allow from all
    AuthName "Nagios Access"
    AuthType Basic
    AuthUserFile /usr/local/nagios/etc/htpasswd.users
    Require valid-user
&lt;/Directory&gt;

Alias /nagios /usr/local/nagios/share

&lt;Directory "/usr/local/nagios/share"&gt;
    Options None
    AllowOverride None
    Order allow,deny
    Allow from all
    AuthName "Nagios Access"
    AuthType Basic
    AuthUserFile /usr/local/nagios/etc/htpasswd.users
    Require valid-user
&lt;/Directory&gt;
</pre>
</font>
</strong>

<p>
<strong>Note:</strong> L'installation par d&eacute;faut de Nagios esp&egrave;re trouver les fichiers HTML sur <b>http://yourmachine/nagios/</b> et les CGIs sur <b>http://yourmachine/nagios/cgi-bin/</b>.
Ces emplacements peuvent &ecirc;tre modifi&eacute;s en utilisant les options <b>--with-htmurl</b> et <b>--with-cgiurl</b> du script de configuration.
</p>

<p>
<strong>Important!</strong> Si vous installez Nagios sur un syst&egrave;me multi-utilisateurs, vous pourriez souhaiter utiliser <a href="http://cgiwrap.unixtools.org/">CGIWrap</a> pour apporter un niveau de s&eacute;curit&eacute; sup&eacute;rieur entre les CGIs et le <a href="commandfile.html">fichier de commandes externes</a>.
Si vous utilisez CGIWrap, l'option ScriptAlias que vous utiliserez sera probablement diff&eacute;rente de celle indiqu&eacute;e plus haut. Plus d'informations &agrave; ce sujet <a href="security.html">ici</a>.
</p>

<p>
<strong><u>Red&eacute;marrer le Serveur Web</u></strong>
</p>

<p>
Une fois que vous aurez fini de modifier le fichier de configuration Apache, vous aurez besoin de red&eacute;marrer le serveur web avec une commande comme celle ci...
</p>

<p>
<strong>
<font color="red">
/etc/rc.d/init.d/httpd restart
</font>
</strong>
</p>

<p>
<strong><u>Configuration de l'authentification Web</u></strong>
</p>

<p>
Une fois que vous avez install&eacute; proprement l'interface web, vous aurez besoin de sp&eacute;cifier qui peut avoir acc&egrave;s &agrave; l'interface Web de Nagios. Suivez <a href="cgiauth.html">ces instructions</a> pour faire cela.
</p>

<p>
<strong><u>V&eacute;rifiez vos modifications</u></strong>
</p>

<p>
N'oubliez pas de v&eacute;rifier si les changements que vous faites sur Apache fonctionnent. Vous devriez &ecirc;tre capable de pointer votre navigateur sur <b>http://votremachine/nagios/</b> et obtenir l'interface Nagios. Les CGIs peuvent ne pas afficher d'informations mais ceci sera r&eacute;solu une fois que vous aurez tout configur&eacute; et lanc&eacute; Nagios.
</p>

<hr>

</body>
</html>
