
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Int&eacute;gration d'un TCP Wrapper</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Int&eacute;gration d'un TCP Wrapper</h2>
</div>
</p>
<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Cet exemple explique comment g&eacute;n&eacute;rer ais&eacute;ment des alertes dans Nagios pour des connexions rejet&eacute;es par un TCP wrapper (encapsuleur TCP).
Ces explications supposent que l'h&ocirc;te pour lequel vous g&eacute;n&eacute;rez ces alertes (i.e. l'h&ocirc;te sur lequel vous utilisez le TCP wrappers) n'est pas le m&ecirc;me h&ocirc;te que celui sur lequel Nagios est install&eacute;.
Si vous souhaitez g&eacute;n&eacute;rer des alertes sur l'h&ocirc;te Nagios, vous aurez besoin de faire quelques modifications &agrave; l'exemple que je vous propose.
Je suppose &eacute;galement que vous avez install&eacute; le <a href="addons.html#nsca">daemon nsca</a> sur la machine de surpervision et le client nsca (<i>send_nsca</i>) sur la machine qui g&eacute;n&egrave;re les alertes TCP wrappers.
</p>

<p>
<strong><u>D&eacute;finition du Service</u></strong>
</p>

<p>
Tout d'abord vous devez d&eacute;finir un service dans votre <a href="configobject.html">fichier de configuration des objets</a> pour les alertes du TCP wrapper.
En supposant que l'h&ocirc;te &eacute;mettant les alertes s'appelle <b>firestorm</b>, un exemple de d&eacute;finition pourrait ressembler &agrave; quelque chose comme &ccedil;a :
</p>

<p>
<font color="red">
<pre>
define service{
	host_name                       firestorm
	service_description             TCP Wrappers
	is_volatile                     1
	active_checks_enabled		0
	passive_checks_enabled		1
	max_check_attempts              1
	contact_groups                  security-admins
	notification_interval           120
	notification_period             24x7
	notification_options            w,u,c,r
	check_command                   check_none
	}
</pre>
</font>
</p>

<p>
Il est important de noter que le service &agrave; l'option <i>volatile</i> activ&eacute;e.
Cette option est activ&eacute;e parce que nous voulons qu'une notification soit g&eacute;n&eacute;r&eacute;e pour toutes les alertes survenant.
Notez &eacute;galement que les contr&ocirc;les actifs sont d&eacute;sactiv&eacute;s pour ce service, alors que les contr&ocirc;les passifs sont activ&eacute;s.
Ceci signifie que ce service ne sera jamais contr&ocirc;l&eacute; activement - toutes les alertes seront envoy&eacute;es passivement par le <i>client nsca</i> de l'h&ocirc;te <b>firestorm</b>.
</p>

<p>
<strong><u>Configuration du TCP Wrapper</u></strong>
</p>

<p>
Maintenant, il faut modifier le fichier <i>/etc/hosts.deny</i> sur la machine <b>firestorm</b>.
Pour que l'encapsuleur TCP envoie une alerte &agrave; chaque connexion refus&eacute;e, vous devez ajouter une ligne de ce type:
</p>

<p>
<font color="red">
<pre>
ALL: ALL: RFC931: twist (/usr/local/nagios/libexec/eventhandlers/handle_tcp_wrapper %h %d) &amp;
</pre>
</font>

<p>
Cette ligne suppose qu'il existe un script appell&eacute; <i>handle_tcp_wrapper</i> dans le r&eacute;pertoire <i>/usr/local/nagios/libexec/eventhandlers/</i> sur <b>firestorm</b>. Le r&eacute;pertoire et le nom du script peuvent &ecirc;tre chang&eacute;s comme vous le voulez.
</p>

<p>
<strong><u>Ecriture du Script</u></strong>
</p>

<p>
La derni&egrave;re chose &agrave; faire est d'&eacute;crire le script <i>handle_tcp_wrapper</i> sur <b>firestorm</b> qui enverra les alertes &agrave; l'h&ocirc;te de supervision. Cela donnera quelque chose qui ressemblera &agrave; &ccedil;a :
</p>

<p>
<font color="red">
<pre>
#!/bin/sh

/usr/local/nagios/libexec/eventhandlers/submit_check_result firestorm "TCP Wrappers" 2 "Denied $2-$1" > /dev/null 2> /dev/null
</pre>
</font>
</p>

<p>
Notez que le script <i>handle_tcp_wrapper</i> appelle le script <i>submit_check_result</i> pour envoyer des alertes &agrave; l'h&ocirc;te charg&eacute; de supervision.
Supposons que votre h&ocirc;te de supervision s'appelle <b>monitor</b>, le script <i>submit check_result</i> pourrait ressembler &agrave; ceci (vous devrez &eacute;ventuellement modifier le script pour sp&eacute;cifier l'emplacement du programme <i>send_nsca</i> sur <b>firestorm</b>):
</p>

<p>
<font color="red">
<pre>
#!/bin/sh

# Arguments
#	$1 = name of host in service definition
#	$2 = name/description of service in service definition
#	$3 = return code
#	$4 = output

/bin/echo -e "$1\t$2\t$3\t$4\n" | /usr/local/nagios/bin/send_nsca monitor -c /usr/local/nagios/etc/send_nsca.cfg
</pre>
</font>
</p>

<p>
<strong><u>Finition</u></strong>
</p>

<p>
Maintenant que vous avez configure tout ce dont vous avez besoin, vous devez red&eacute;marrer le processus <i>inetd</i> sur <b>firestorm</b> et red&eacute;marrer Nagios sur votre serveur de supervision.
C'est tout !
Quand le TCP wrapper sur <b>firestorm</b> refusera une connexion, vous devriez recevoir des alertes via Nagios. 
Cela ressemblera &agrave; &ccedil;a :
</p>

<p>
<font color="red">
<pre>
Denied sshd2-sdn-ar-002mnminnP321.dialsprint.net 
</pre>
</font>
</p>


<hr>

</body>
</html>
