

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Int&eacute;gration de CD-SNMP (NET-SNMP)</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Int&eacute;gration de UCD-SNMP (NET-SNMP)</h2>

</div>
</p>
<hr>

<p>
<font color="red"><strong>Note :</strong></font> Nagios n'a pas &eacute;t&eacute; con&ccedil;u pour remplacer une application compl&egrave;te d'administration SNMP comme HP OpenView ou <a href="http://www.opennms.org/">OpenNMS [Anglais]</a>.  Toutefois, vous pouvez faire en sorte que les interruptions [NdT : traps] SNMP re&ccedil;us par un h&ocirc;te de votre r&eacute;seau g&eacute;n&egrave;rent des alertes dans Nagios.  Voici comment...
</p>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Cet exemple explique comment g&eacute;n&eacute;rer facilement dans Nagios des alertes qui correspondent &agrave; des interruptions SNMP re&ccedil;ues par le service <a href="http://net-snmp.sourceforge.net">UCD-SNMP [Anglais]</a> <i>snmptrapd</i>.  Ces indications pr&eacute;supposent que l'h&ocirc;te qui re&ccedil;oit les interruptions SNMP n'est pas celui sur lequel s'ex&eacute;cute Nagios.  Si votre machine de supervision est la m&ecirc;me que celle qui re&ccedil;oit les interruptions SNMP, vous devrez adapter les exemples que je fournis. De plus, je pr&eacute;suppose que vous avez install&eacute; le <a href="addons.html#nsca">service nsca</a> sur votre machine de supervision et le client nsca (<i>send_nsca</i>) sur la machine qui re&ccedil;oit les interruptions SNMP.
</p>

<p>
Dans cet exemple, je d&eacute;crirai comment configurer Nagios pour g&eacute;n&eacute;rer des alertes &agrave; partir des interruptions SNMP re&ccedil;ues concernant les travaux de sauvegarde ArcServe qui tournent sur mes serveurs Novell. Je voulais &ecirc;tre notifi&eacute; en cas d'erreur de la sauvegarde, ce qui a tr&egrave;s bien fonctionn&eacute; pour moi. Vous devrez adapter les exemples &agrave; vos propres besoins.
</p>

<p>
<strong><u>Logiciels compl&eacute;mentaires</u></strong>
</p>

<p>
Traduire des interruptions SNMP en &eacute;v&egrave;nements Nagios peut &ecirc;tre fastidieux. Si vous voulez vous simplifier les choses, int&eacute;ressez-vous au projet SNMP Trap Translator d'Alex Burger disponible sur <a href="http://www.snmptt.org">http://www.snmptt.org [Anglais]</a> qui, combin&eacute; &agrave; Net-SNMP, constitue un syst&egrave;me d'administration des interruptions plus &eacute;volu&eacute;. La documentation de snmptt d&eacute;taille la proc&eacute;dure d'int&eacute;gration &agrave; Nagios.
</p>

<p>
<strong><u>D&eacute;finition du service</u></strong>
</p>

<p>
Vous devez d'abord d&eacute;finir un service dans votre <a href="configobject.html">fichier de configuration des objets</a>, pour les interruptions SNMP (dans notre exemple, je d&eacute;finis un service pour les travaux de sauvegarde ArcServe). Si l'on suppose que l'h&ocirc;te dont proviennent les alertes s'appelle <b>novellserver</b>, la d&eacute;finition du service ressemblerait &agrave; ceci :
</p>

<p>
<font color="red">
<pre>
define service{
	host_name                       novellserver
	service_description             ArcServe Backup
	is_volatile                     1
	active_checks_enabled		0
	passive_checks_enabled		1
	max_check_attempts              1
	contact_groups                  novell-backup-admins
	notification_interval           120
	notification_period             24x7
	notification_options            w,u,c,r
	check_command                   check_none
	}
</pre>
</font>
</p>

<p>
Il est important de noter que le param&eacute;tre <i>volatile</i> est activ&eacute; pour ce service.  Nous l'activons car nous voulons qu'une notification soit g&eacute;n&eacute;r&eacute;e pour chaque alerte re&ccedil;ue. Notez &eacute;galement que les contr&ocirc;les actifs sont d&eacute;sactiv&eacute;s pour ce service, et les contr&ocirc;les passifs activ&eacute;s. Cela signifie que le service ne sera jamais contr&ocirc;l&eacute; activement - toutes les informations d'alerte devront &ecirc;tre envoy&eacute;es passivement par le <i>client nsca</i> qui s'ex&eacute;cute sur l'h&ocirc;te d'administration SNMP (dans mon exemple, celui-ci s'appelle <b>firestorm</b>).
</p>

<p>
<strong><u>Configuration SNMP d'ArcServe et de Novell</u></strong>
</p>

<p>
Pour qu'ArcServe (et mon serveur Novell) envoient des interruptions SNMP &agrave; mon h&ocirc;te d'administration, j'ai d&ucirc; mener les actions suivantes :
</p>

<p>
<ol>
<li>Modifier le travail autopilot d'ArcServe pour qu'il envoie des interruptions SNMP en cas d'&eacute;chec, de r&eacute;ussite, etc. des travaux
<li>Editer SYS:\ETC\TRAPTARG.CFG et y ajouter l'adresse IP de mon h&ocirc;te d'administration (celui qui re&ccedil;oit les interruptions SNMP)
<li>Charger SNMP.NLM
<li>Charger ALERT.NLM pour permettre l'envoi effectif des interruptions SNMP
</ol>
</p>

<p>
<strong><u>Configuration de l'h&ocirc;te d'administration SNMP</u></strong>

</p>

<p>
Sur mon h&ocirc;te Linux d'administration SNMP (<b>firestorm</b>), j'ai install&eacute; le logiciel <a href="http://net-snmp.sourceforge.net">UCD-SNMP [Anglais]</a> (NET-SNMP). Une fois le logiciel install&eacute;, il m'a fallu :
</p>

<p>
<ol>
<li>Installer les MIB ArcServe (comprises dans le CD d'installation d'ArcServe).
<li>Editer le fichier de configuration de snmptrapd <i>(/etc/snmp/snmptrapd.conf)</i> pour d&eacute;finir un gestionnaire d'interruption [NdT : trap handler] pour les alertes ArcServe. Le d&eacute;tail est ci-dessous.

<li>D&eacute;marrer le service <i>snmptrapd</i> pour recevoir les interruptions SNMP entrantes.
</ol>
</p>

<p>
Pour que le service <i>snmptrapd</i> route les interruptions SNMP d'ArcServe &agrave; notre h&ocirc;te Nagios, nous devons d&eacute;finir un gestionnaire d'interruption dans le fichier <i>/etc/snmp/snmptrapd.conf</i>. Dans mon cas, le fichier de configuration ressemble &agrave; ceci :
</p>

<p>
<font color="red">
<pre>
#############################
# ArcServe SNMP Traps
#############################

# Tape format failures
traphandle ARCserve-Alarm-MIB::arcServetrap9 /usr/local/nagios/libexec/eventhandlers/handle-arcserve-trap 9

# Failure to read tape header
traphandle ARCserve-Alarm-MIB::arcServetrap10 /usr/local/nagios/libexec/eventhandlers/handle-arcserve-trap 10

# Failure to position tape
traphandle ARCserve-Alarm-MIB::arcServetrap11 /usr/local/nagios/libexec/eventhandlers/handle-arcserve-trap 11

# Cancelled jobs
traphandle ARCserve-Alarm-MIB::arcServetrap12 /usr/local/nagios/libexec/eventhandlers/handle-arcserve-trap 12

# Successful jobs
traphandle ARCserve-Alarm-MIB::arcServetrap13 /usr/local/nagios/libexec/eventhandlers/handle-arcserve-trap 13

# Imcomplete jobs
traphandle ARCserve-Alarm-MIB::arcServetrap14 /usr/local/nagios/libexec/eventhandlers/handle-arcserve-trap 14

# Job failures
traphandle ARCserve-Alarm-MIB::arcServetrap15 /usr/local/nagios/libexec/eventhandlers/handle-arcserve-trap 15
</pre>
</font>
</p>

<p>
Cet exemple pr&eacute;suppose que vous avez un r&eacute;pertoire <i>/usr/local/nagios/libexec/eventhandlers/</i> sur votre h&ocirc;te d'administration SNMP et que le script <i>handle-arcserve-trap</i> s'y trouve. Vous pouvez modifier ces param&eacute;tres selon vos besoins. Quoiqu'il en soit, le script <i>handle-arcserve-trap</i> de mon h&ocirc;te d'administration ressemble &agrave; ceci :

</p>

<p>
<font color="red">
<pre>
#!/bin/sh

# Arguments:
#  $1 = trap type

	# First line passed from snmptrapd is FQDN of host that sent the trap
     read host

    # Given a FQDN, get the short name of the host as it is setup in Nagios
    hostname="unknown"
    case $host in
        novellserver.mylocaldomain.com)
            hostname="novellserver"
            ;;
        nt.mylocaldomain.com)
            hostname="ntserver"
            ;;
	esac
	
    # Get severity level (OK, WARNING, UNKNOWN, or CRITICAL) and plugin output based on trape type
    state=-1
    output="No output"
    case "$1" in

        # failed to format tape - critical
        11)
            output="Critical: Failed to format tape"
            state=2
            ;;

        # failed to read tape header - critical
        10)
            output="Critical: Failed to read tape header"
            state=2
            ;;

        # failed to position tape - critical
        11)
            output="Critical: Failed to position tape"
            state=2
            ;;

        # backup cancelled - warning
        12)
            output="Warning: ArcServe backup operation cancelled"
            state=1
            ;;

        # backup success - ok
        13)
            output="Ok: ArcServe backup operation successful"
            state=0
            ;;

        # backup incomplete - warning
        14)
            output="Warning: ArcServe backup operation incomplete"
            state=1
            ;;

        # backup failure - critical
        15)
            output="Critical: ArcServe backup operation failed"
            state=2
            ;;
    esac


    # Submit passive check result to monitoring host
    /usr/local/nagios/libexec/eventhandlers/submit_check_result $hostname "ArcServe Backup" $state "$output"

exit 0
</pre>
</font>
</p>

<p>
Notez que le script <i>handle-arcserve-trap</i> appelle le script <i>submit_check_result</i> pour envoyer effectivement l'alerte &agrave; l'h&ocirc;te de supervision. Si votre h&ocirc;te de supervision s'appelle <b>monitor</b>, le script <i>submit_check_result</i> ressemblerait &agrave; ceci (modifiez-le pour pr&eacute;ciser l'emplacement correct du programme <i>send_nsca</i> sur votre h&ocirc;te d'administration):

</p>

<p>
<font color="red">
<pre>
#!/bin/sh

# Arguments
#	$1 = name of host in service definition
#	$2 = name/description of service in service definition
#	$3 = return code
#	$4 = output

/bin/echo -e "$1\t$2\t$3\t$4\n" | /usr/local/nagios/bin/send_nsca monitor -c /usr/local/nagios/etc/send_nsca.cfg
</pre>
</font>
</p>

<p>
<strong><u>Pour terminer</u></strong>
</p>

<p>
Vous avez maintenant configur&eacute; tout ce qui doit l'&ecirc;tre, il ne reste plus qu'&agrave; red&eacute;marrer Nagios sur votre serveur de supervision. C'est fini ! Vous devriez recevoir des alertes dans Nagios &agrave; chaque fois qu'un travail &eacute;choue, r&eacute;ussit, etc.
</p>

<hr>

</body>
</html>
