<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Rupture de la continuit&eacute; du r&eacute;seau</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Rupture de la continuit&eacute; du r&eacute;seau</h2>

</div>
</p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Le <a href="cgis.html#outages_cgi">CGI de rupture</a> a &eacute;t&eacute; fait pour aider au diagnostic des ruptures de la continuit&eacute; du r&eacute;seau. Pour des r&eacute;seaux de petite taille, ce CGI peut ne pas &ecirc;tre tr&egrave;s utile, mais pour les plus grands, il le sera. Le diagnostic des ruptures de la continuit&eacute; du r&eacute;seau aidera les administrateurs &agrave; trouver et r&eacute;soudre plus rapidement les probl&egrave;mes qui causent le plus de d&eacute;g&acirc;ts au r&eacute;seau.
</p>

<p>
Notez que le CGI de rupture n'essaiera pas de trouver la cause exacte du probl&egrave;me, mais localisera plut&ocirc;t les h&ocirc;tes de votre r&eacute;seau qui semblent causer le plus de probl&egrave;mes. Creuser plus profond&eacute;ment le probl&egrave;me est laiss&eacute; aux bons soins de l'utilisateur, car le nombre de causes possibles pour un probl&egrave;me est illimit&eacute;.
</p>

<p>
<strong><u>Diagrammes</u></strong>
</p>

<p>
Les diagrammes ci-dessous montrent comment le CGI de rupture fonctionne pour d&eacute;terminer leur cause. Vous pouvez cliquer sur une image pour l'obtenir en plus grand format...
</p>

<table border=0 cellpadding=10 class="Default">

<tr>
<td valign=top><strong><u>Diagramme 1</u></strong></td>
</tr>

<tr>
<td valign=top>
Ce diagramme sera la base de notre exemple. Tous les h&ocirc;tes apparaissant en rouge sont soit hors fonction, soit inaccessibles (du point de vue de Nagios). Tous les autres sont en fonctionnement.
</td>
</tr>

<tr>
<td align=center valign=top>
<a href="images/network-outage1.png"><img src="images/network-outage1.png" border=1 alt="Hosts That Are Down Or Unreachable" width=500 height=300></a>
</td>
</tr>

<tr>
<td valign=top><strong><u>Diagramme 2</u></strong></td>
</tr>

<tr>
<td valign=top>
Ce diagramme met en exergue les causes de rupture du r&eacute;seau (du point de vue de Nagios), et montre les divers groupes d'h&ocirc;tes affect&eacute;s par le probl&egrave;me.
</td>
</tr>

<tr>
<td align=center valign=top>
<a href="images/network-outage2.png"><img src="images/network-outage2.png" border=1 alt="Hosts That Are Causing Outages" width=500 height=300></a>
</td>
</tr>

</table>

<p>
<strong><u>D&eacute;termination de la cause d'une rupture du r&eacute;seau</u></strong>
</p>

<p>
Maintenant, comment le CGI de rupture d&eacute;termine-t'il les h&ocirc;tes &agrave; la source du probl&egrave;me ? <i>Les h&ocirc;tes "&agrave; probl&egrave;me" doivent &ecirc;tre dans l'&eacute;tat DOWN ou UNREACHABLE <b>et</b> au moins un de leur parents imm&eacute;diats doit &ecirc;tre dans l'&eacute;tat UP</i>. Les h&ocirc;tes remplissant ce crit&egrave;re sont marqu&eacute;s comme &eacute;tant une cause potentielle de la rupture.
</p>
<p>
Pour d&eacute;terminer si ces h&ocirc;tes marqu&eacute;s sont la cause de la rupture du r&eacute;seau, nous devons proc&eacute;der &agrave; d'autres tests...

</p>
<p>
Si <i>tous</i> les enfants imm&eacute;diats d'un de ces h&ocirc;tes marqu&eacute;s sont DOWN ou UNREACHABLE <i>et</i> qu'ils n'ont aucun parent imm&eacute;diat qui soit UP, l'h&ocirc;te marqu&eacute; est la cause de la rupture du r&eacute;seau. Si ne serait-ce qu'un des enfants imm&eacute;diats d'un h&ocirc;te marqu&eacute; <i>ne remplit pas</i> ces conditions, alors l'h&ocirc;te marqu&eacute; <i>n'est pas</i> la cause de la rupture du r&eacute;seau.
</p>

<p>
<strong><u>D&eacute;termination des effets d'une rupture du r&eacute;seau</u></strong>
</p>

<p>
En plus de vous dire quel h&ocirc;te est &agrave; l'origine d'une rupture du r&eacute;seau, le CGI de rupture vous dira aussi combien d'h&ocirc;tes et de services sont affect&eacute;s par un h&ocirc;te posant probl&egrave;me. Comment cela est-il d&eacute;termin&eacute; ? Regardez le diagramme 2 ci-dessus...
</p>

<p>
Le diagramme montre clairement que l'h&ocirc;te 1 bloque 2 enfants (dans le domaine A). L'h&ocirc;te 2 est seulement responsable de son propre blocage (domaine B) et l'h&ocirc;te 3 est responsable du blocage de 7 h&ocirc;tes (domaine C). Les effets de la rupture sur les deux h&ocirc;tes du domaine D sont "partag&eacute;s" entre les h&ocirc;tes 2 et 3, car il n'est pas possible de d&eacute;terminer la cause r&eacute;elle de la rupture. Si un des h&ocirc;tes 2 ou 3 &eacute;tait UP, alors les h&ocirc;tes du domaine D pourraient ne pas &ecirc;tre bloqu&eacute;s.
</p>

<p>
Le nombre d'h&ocirc;tes affect&eacute;s par chaque probl&egrave;me se d&eacute;compose comme suit (l'h&ocirc;te causant probl&egrave;me &eacute;tant inclus dans ces chiffres) :
</p>

<p>
<ul>
<li>H&ocirc;te 1 : 3 h&ocirc;tes affect&eacute;s
<li>H&ocirc;te 2 : 3 h&ocirc;tes affect&eacute;s
<li>H&ocirc;te 3 : 10 h&ocirc;tes affect&eacute;s 
</ul>
</p>

<p>
<strong><u>Classement des probl&egrave;mes par niveau de gravit&eacute;</u></strong>
</p>

<p>
Le CGI de rupture affiche tous les h&ocirc;tes &agrave; probl&egrave;me, qu'ils causent des ruptures du r&eacute;seau ou non. Quoiqu'il en soit, le CGI vous dira combien parmi les h&ocirc;tes &agrave; probl&egrave;mes (s'il y en a) causent des ruptures du r&eacute;seau.
</p>

<p>
Pour afficher les h&ocirc;tes &agrave; probl&egrave;mes de mani&egrave;re utile, le tri est effectu&eacute; selon la gravit&eacute; de la r&eacute;percussion de leurs effets sur le r&eacute;seau. Le niveau de gravit&eacute; est d&eacute;termin&eacute; par deux &eacute;l&eacute;ments : le nombre d'h&ocirc;tes affect&eacute;s par le probl&egrave;me et le nombre de services affect&eacute;s. Les h&ocirc;tes p&egrave;sent plus lourd que les services dans le niveau de gravit&eacute;. La version actuelle r&eacute;partit le poids &agrave; 4 contre 1 (c.-&agrave;-d. que les h&ocirc;tes sont 4 fois plus importants que les services).
</p>

<p>
En supposant que tous les h&ocirc;tes du diagramme 2 ont le m&ecirc;me nombre de services associ&eacute;s, l'h&ocirc;te 3 serait class&eacute; comme posant le probl&egrave;me le plus grave, alors que les h&ocirc;tes 1 et 2 auraient le m&ecirc;me niveau de gravit&eacute;.
</p>

<hr>

</body>
</html>
