
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Parall&eacute;lisation des contr&ocirc;les de service</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Parall&eacute;lisation des contr&ocirc;les de service</h2>

</div>
</p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>
<p>
Une des fonctionnalit&eacute;s de Nagios est la possibilit&eacute; d'effectuer des contr&ocirc;les de service en parall&egrave;le. Cette documentation essaiera d'expliquer en d&eacute;tail ce que cela signifie et quel est son impact sur les services que vous avez d&eacute;finis.
</p>

<p>
<strong><u>Comment fonctionne la parall&eacute;lisation</u></strong>
</p>

<p>
Avant que je n'explique comment fonctionne la parall&eacute;lisation du contr&ocirc;le des services, vous devez d'abord comprendre comment Nagios effectue l'ordonnancement des &eacute;v&eacute;nements. Tous les &eacute;v&eacute;nements internes de Nagios (c.-&agrave;-d. rotation des fichiers journaux, contr&ocirc;le des commandes externes, contr&ocirc;le des services, etc.) sont plac&eacute;s dans une file d'attente. Chaque membre de la file d'attente est ordonnanc&eacute; pour une ex&eacute;cution &agrave; un instant donn&eacute;. Nagios fait de son mieux pour que tous les &eacute;v&eacute;nements soient ex&eacute;cut&eacute;s au bon moment, bien que certains puissent &ecirc;tre retard&eacute;s si Nagios est occup&eacute; &agrave; autre chose.
</p>

<p>
Les contr&ocirc;les de services sont un des types d'&eacute;v&eacute;nement qui sont plac&eacute;s dans la file d'attente de Nagios. Lorsqu'un contr&ocirc;le de service doit &ecirc;tre effectu&eacute;, Nagios d&eacute;marre un nouveau processus (avec un appel &agrave; la fonction fork()) et effectue le contr&ocirc;le de service (c.-&agrave;-d. un quelconque plugin). Cependant, Nagios <i>n'attend pas</i> que le contr&ocirc;le de service s'ach&egrave;ve ! Il retourne plut&ocirc;t s'occuper des autres &eacute;v&eacute;nements qui se trouvent dans la file d'attente...
</p>

<p>
Que se passe-t-il donc lorsque le contr&ocirc;le de service s'ach&egrave;ve ? H&eacute; bien, le processus lanc&eacute; par Nagios pour effectuer ce contr&ocirc;le envoie un message &agrave; Nagios avec les r&eacute;sultats du contr&ocirc;le. C'est alors au tour de Nagios de v&eacute;rifier la pr&eacute;sence et d'analyser les r&eacute;sultats de ce contr&ocirc;le de service quand il aura le temps.
</p>

<p>
Afin que Nagios supervise effectivement, il doit analyser les r&eacute;sultats des contr&ocirc;les de services qui sont termin&eacute;s. Ceci est effectu&eacute; via un processus de "r&eacute;colte". Les "r&eacute;coltes" de service sont un autre type d'&eacute;v&eacute;nement plac&eacute; dans la file d'attente de Nagios. La fr&eacute;quence de ces &eacute;v&eacute;nements de "r&eacute;colte" est d&eacute;termin&eacute;e par le param&eacute;tre <a href="configmain.html#service_reaper_frequency">service_reaper_frequency</a> du fichier de configuration principal. Lorsqu'un &eacute;v&eacute;nement de "r&eacute;colte" est ex&eacute;cut&eacute;, il cherche tous les messages qui contiennent le r&eacute;sultat d'un contr&ocirc;le de service termin&eacute;. Ces r&eacute;sultats sont alors trait&eacute;s par l'algorithme de contr&ocirc;le des services. A partir de cela, Nagios d&eacute;termine si des h&ocirc;tes doivent ou non &ecirc;tre contr&ocirc;l&eacute;s, si des notifications doivent &ecirc;tre envoy&eacute;es, etc. Lorsque les r&eacute;sultats des contr&ocirc;les de service ont &eacute;t&eacute; analys&eacute;s, Nagios reprogramme le prochain traitement des contr&ocirc;les de service et le place dans la file d'attente pour une ex&eacute;cution ult&eacute;rieure. Ce qui termine le cycle contr&ocirc;le de service/traitement !
</p>

<p>
Pour ceux d'entre vous qui veulent vraiment savoir, mais qui n'ont pas regard&eacute; le code source, Nagios utilise des files de messages pour traiter les communications entre Nagios et le processus qui effectue le contr&ocirc;le de service...
</p>

<p>
<strong><u>Attrape-nigauds possibles...</u></strong>
</p>
<p>
Vous devez savoir qu'il y a quelques ennuis potentiels li&eacute;s &agrave; la parall&eacute;lisation du contr&ocirc;le des services. Comme plusieurs contr&ocirc;les de service peuvent s'ex&eacute;cuter simultan&eacute;ment, ils peuvent interf&eacute;rer les uns avec les autres. Vous devrez &eacute;valuer le type de contr&ocirc;les de services qui tournent et prendre les mesures appropri&eacute;es pour vous pr&eacute;munir des cons&eacute;quences ind&eacute;sirables. Ceci est particuli&eacute;rement important si vous avez plus d'un contr&ocirc;le de service qui acc&egrave;de au m&ecirc;me mat&eacute;riel (comme un modem). De m&ecirc;me, si au plusieurs contr&ocirc;les de services se connectent au m&ecirc;me d&eacute;mon sur un h&ocirc;te distant pour v&eacute;rifier une information, assurez-vous que le d&eacute;mon peut traiter les connexions simultan&eacute;es.
</p>

<p>
Heureusement, vous pouvez effectuer certaines manipulations pour &eacute;viter les "collisions" de contr&ocirc;les de services...
</p>

<p>
<ol>
<li>Le moyen le plus simple pour &eacute;viter les collisions est d'utiliser le param&eacute;tre <a href="configmain.html#service_interleave_factor">service_interleave_factor</a>. Entrelacer les services aidera &agrave; r&eacute;duire la charge impos&eacute;e par les contr&ocirc;les de services sur les h&ocirc;tes distants. R&eacute;glez la variable pour utiliser le calcul "d&eacute;brouillard" [NdT : smart] du facteur d'entrelacement, puis r&eacute;glez-la manuellement si vous estimez que c'est n&eacute;cessaire.
<li>Ensuite, vous pouvez r&eacute;gler le param&eacute;tre <i>max_check_attempts</i> de chaque d&eacute;finition de service &agrave; une valeur sup&eacute;rieure &agrave; un. Si le contr&ocirc;le de service entre en collision avec un autre contr&ocirc;le en cours, Nagios r&eacute;essaiera le contr&ocirc;le de service <i>max_check_attempts - 1</i> fois avant d'envoyer une notification du probl&egrave;me &agrave; quelqu'un.
<li>Vous pouvez aussi essayer d'impl&eacute;menter un algorithme du type "retrait et r&eacute;essai" [NdT : back-off and retry] dans le code de contr&ocirc;le de service, bien que vous puissiez trouver cela trop difficile ou trop consommateur de temps.
<li>Si rien de tout cela ne fonctionne, vous pouvez emp&ecirc;cher la parall&eacute;lisation des contr&ocirc;les de service en r&eacute;glant l'option <a href="configmain.html#max_concurrent_checks">max_concurrent_checks</a> &agrave; 1. Cela ne permettra le contr&ocirc;le que d'un seul service &agrave; la fois, ce n'est donc pas une solution spectaculaire. S'il y a suffisamment de demandes, j'ajouterai une option aux d&eacute;finitions de services qui vous permettra de pr&eacute;ciser si le contr&ocirc;le de chaque service doit &ecirc;tre ou non parall&eacute;lis&eacute;. S'il n'y a pas assez de demandes, je ne le ferai pas...
</ol>
</p>

<p>
Un autre &eacute;l&eacute;ment &agrave; noter est l'effet de la parall&eacute;lisation des contr&ocirc;les de service sur les ressources de la machine h&eacute;bergeant Nagios. Effectuer un grand nombre de contr&ocirc;les de services en parall&egrave;le peut grever les ressources m&eacute;moire et processeur. Le param&eacute;tre <a href="configmain.html#service_inter_check_delay_method">inter_check_delay_method</a> essaiera de minimiser la charge impos&eacute;e sur votre machine en r&eacute;partissant les contr&ocirc;les de mani&egrave;re homog&egrave;ne dans le temps (si vous utilisez la m&eacute;thode "d&eacute;brouillard" [NdT : smart]), mais ce n'est pas une solution totalement s&ucirc;re. Afin d'avoir un regard sur le nombre de contr&ocirc;les de services qui peuvent s'ex&eacute;cuter en m&ecirc;me temps, utilisez le param&eacute;tre <a href="configmain.html#max_concurrent_checks">max_concurrent_checks</a>. Vous devrez affiner sa valeur, bas&eacute;e sur le nombre total de services que vous contr&ocirc;lez, les ressources syst&egrave;me disponibles (cadence du processeur, m&eacute;moire, etc.) et les autres processus qui tournent sur votre machine. Pour avoir davantage d'informations sur la fa&ccedil;on de r&eacute;gler le param&eacute;tre <i>max_concurrent_checks</i> pour qu'il corresponde &agrave; vos exigences, lisez la documentation relative &agrave; l'<a href="checkscheduling.html#max_concurrent_checks">ordonnancement des contr&ocirc;les</a>.
</p>


<p>
<strong><u>Ce qui n'est pas parall&eacute;lis&eacute;</u></strong>
</p>
<p>
Il faut se souvenir que seule <i>l'&eacute;xecution</i> des contr&ocirc;les de services a &eacute;t&eacute; parall&eacute;lis&eacute;e. Il y a une bonne raison &agrave; cela - les autres choses ne peuvent pas l'&ecirc;tre d'une mani&egrave;re tr&eacute;s s&ucirc;re ou tr&egrave;s saine. En particulier les gestionnaires d'&eacute;v&eacute;nements, les notifications de contact, le traitement des contr&ocirc;les de services et des contr&ocirc;les d'h&ocirc;tes <i>ne sont pas</i> parall&eacute;lis&eacute;s. Voici pourquoi...
</p>

<p>
Les <i>gestionnaires d'&eacute;v&eacute;nements</i> ne sont pas parall&eacute;lis&eacute;s du fait de leur conception m&ecirc;me. Une grande part de leur puisssance provient de leur capacit&eacute; &agrave; r&eacute;soudre les probl&egrave;mes de mani&egrave;re pr&eacute;ventive. Par exemple, red&eacute;marrer le serveur web quand le service HTTP de la machine locale est d&eacute;tect&eacute; DOWN. Pour &eacute;viter que plusieurs gestionnaires d'&eacute;v&eacute;nements n'essayent de "r&eacute;soudre" des probl&egrave;mes en parall&egrave;le (sans savoir  ce que font les autres), j'ai d&eacute;cid&eacute; de ne pas les parall&eacute;liser.
</p>

<p>
Les <i>notifications de contact</i> ne sont pas parall&eacute;lis&eacute;es &agrave; cause des m&eacute;thodes de notification que vous pouvez utiliser. Si, par exemple, une notification de contact utilise un modem pour composer le num&eacute;ro de votre pager et lui envoyer un message, elle a besoin de l'acc&egrave;s exclusif au modem pendant que la notification s'effectue. Si plusieurs notifications &eacute;taient ex&eacute;cut&eacute;es en parall&egrave;le, une seule serait effectu&eacute;e car les autres n'auraient pas acc&egrave;s au modem. Il y a des moyens de contourner cela, comme employer une m&eacute;thode du style "retrait et r&eacute;essai" dans le script de notification, mais j'ai d&eacute;cid&eacute; de ne pas me fier aux utilisateurs qui pourraient impl&eacute;menter ce type de fonction dans leurs scripts. Une note rapide : si vous avez des contr&ocirc;les de services qui utilisent un modem, assurez-vous que les scripts de notification qui effectuent la num&eacute;rotation peuvent r&eacute;essayer d'acc&eacute;der au modem apr&egrave;s un &eacute;chec. C'est n&eacute;cessaire, car un contr&ocirc;le de service peut s'ex&eacute;cuter en m&ecirc;me temps qu'une notification !
</p>

<p>
Le <i>traitement des r&eacute;sultats des contr&ocirc;les de services</i> n'a pas &eacute;t&eacute; parall&eacute;lis&eacute;. Et cela pour &eacute;viter les situations o&ugrave; de multiples notifications relatives &agrave; des probl&egrave;mes ou au r&eacute;tablissement d'h&ocirc;tes ou de service peuvent &ecirc;tre envoy&eacute;es lorsqu'un h&ocirc;te passe dans l'&eacute;tat DOWN, UNREACHABLE, ou RECOVERY.
</p>

<hr>

</body>
</html>