<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Donn&eacute;es de performance</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Donn&eacute;es de performance</h2>

</div>
</p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Nagios est con&ccedil;u pour permettre aux <a href="plugins.html">plugins</a> de renvoyer des donn&eacute;es de performance optionnelles en plus des donn&eacute;es d'&eacute;tat habituelles, ainsi que pour permettre de transf&eacute;rer ces donn&eacute;es de performance &agrave; des applications tierces qui les traiteront. Vous trouverez ci-dessous une description des diff&eacute;rents types de donn&eacute;es de performance, ainsi que des informations sur la fa&ccedil;on de les traiter...
</p>

<p>
<strong><u>Types de donn&eacute;es de performance</u></strong>
</p>

<p>
Nagios peut fournir de base deux cat&eacute;gories de donn&eacute;es de performance :
</p>

<p>
<ol>
<li><b>Donn&eacute;es de performance du contr&ocirc;le</b>
<li><b>Donn&eacute;es de performance du plugin</b>
</ol>
</p>

<p>
<i>Les donn&eacute;es de performance du contr&ocirc;le</i> sont des donn&eacute;es internes li&eacute;es &agrave; l'ex&eacute;cution proprement dite d'un contr&ocirc;le d'h&ocirc;te ou de service. Cela inclut entre autres la latence de contr&ocirc;le de service (c.-&agrave;-d. le "retard" par rapport au moment o&ugrave; le contr&ocirc;le du service &eacute;tait ordonnanc&eacute;) et le nombre de secondes n&eacute;cessaires &agrave; l'ex&eacute;cution du contr&ocirc;le d'h&ocirc;te ou de service. Ce type de donn&eacute;es de performance est disponible pour tous les contr&ocirc;les r&eacute;alis&eacute;s.  Les <a href="macros.html">macros</a> $HOSTEXECUTIONTIME$ et $SERVICEEXECUTIONTIME$ contiennent le nombre de secondes n&eacute;cessaires &agrave; l'ex&eacute;cution d'un contr&ocirc;le d'h&ocirc;te ou de service, et les macros $HOSTLATENCY$ et $SERVICELATENCY$ peuvent servir &agrave; d&eacute;terminer le "retard" qu'a pris le lancement d'un contr&ocirc;le r&eacute;gulier d'h&ocirc;te ou de service par rapport au moment o&ugrave; il &eacute;tait ordonnanc&eacute;.
</p>

<p>
<i>Les donn&eacute;es de performance du plugin</i> sont des donn&eacute;es externes propres au plugin utilis&eacute; pour r&eacute;aliser le contr&ocirc;le d'h&ocirc;te ou de service. Elles peuvent par exemple comporter le pourcentage de perte de paquets, l'espace disque disponible, la charge du processeur, le nombre d'utilisateurs courant, etc. - &agrave; la base tout type de mesure que le plugin r&eacute;alise lors de son ex&eacute;cution. Les donn&eacute;es de performance du plugin sont optionnelles et peuvent ne pas &ecirc;tre fournies par tous les plugins. Au moment de la r&eacute;daction de ce document, aucun plugin ne retourne de don&eacute;nes de performance [NdT: ce n'est plus vrai aujourd'hui], mais ils devraient prochainement le faire.  Les donn&eacute;es de performance du plugin (lorsqu'elle sont disponibles) sont accessibles &agrave; travers les <a href="macros.html">macros</a> $HOSTPERFDATA$ et $SERVICEPERFDATA$. Vous trouverez ci-dessous plus d'informations sur la fa&ccedil;on dont les plugins peuvent renvoyer &agrave; Nagios des donn&eacute;es de performance qui soient exploitables via les macros $HOSTPERFDATA$ et $SERVICEPERFDATA$.
</p>

<p>
<strong><u>G&eacute;n&eacute;ration des donn&eacute;es de performance par les plugins</u></strong>
</p>

<p>
En temps normal les plugins renvoient un seule ligne de texte indiquant l'&eacute;tat d'une quelconque donn&eacute;e mesurable.  Par exemple, le plugin check_ping peut renvoyer une ligne de texte comme suit :
</p>

<p>
<dir>
PING ok - Packet loss = 0%, RTA = 0.80 ms 
</dir>
</p>

<p>

Avec ce type de valeur, toute la ligne de texte est accessible via les <a href="macros.html">macros</a> $HOSTOUTPUT$ ou $SERVICEOUTPUT$ (selon que le plugin a &eacute;t&eacute; utilis&eacute; pour un contr&ocirc;le d'h&ocirc;te ou de service).
</p>

<p>
Pour simplifier le transfert de donn&eacute;es de performance du plugin &agrave; Nagios, la sp&eacute;cification des plugins a &eacute;t&eacute; augment&eacute;e. Si un plugin souhaite renvoyer des donn&eacute;es de performance &agrave; Nagios, il affiche la ligne de texte habituelle, suivie du caract&egrave;re "pipe" (|), puis une cha&icirc;ne de caract&egrave;res contenant une ou plusieurs mesures de performance.  Prenons par exemple le plugin check_ping et supposons qu'il ait &eacute;t&eacute; modifi&eacute; pour renvoyer le pourcentage de paquets perdus et le temps moyen de retour [NdT : average round trip time] comme donn&eacute;es de performance. La cha&icirc;ne retourn&eacute;e par le plugin pourrait ressembler &agrave; ceci :
</p>

<p>
<dir>
PING ok - Packet loss = 0%, RTA = 0.80 ms | percent_packet_loss=0, rta=0.80
</dir>
</p>

<p>

Quand Nagios rencontre ce format de donn&eacute;es affich&eacute;es par un plugin, il &eacute;clate le texte en deux parties : tout ce qui pr&eacute;c&egrave;de le caract&egrave;re "pipe" est consid&eacute;r&eacute; comme &eacute;tant l'affichage "normal" du plugin et tout ce qui suit le caract&egrave;re "pipe" est consid&eacute;r&eacute; comme des donn&eacute;es de performance du plugin. L'affichage "normal" est stock&eacute; dans les macros $HOSTOUTPUT$ ou $SERVICEOUTPUT$, et les donn&eacute;es de performance optionnelles sont stock&eacute;es dans les macros $HOSTPERFDATA$ ou $SERVICEPERFDATA$. Dans notre exemple, les macros $HOSTOUTPUT$ ou $SERVICEOUTPUT$ contiendraient "<i>PING ok - Packet loss = 0%, RTA = 0.80 ms</i>" (sans les guillemets) et les macros $HOSTPERFDATA$ ou $SERVICEPERFDATA$ contiendraient "<i>percent_packet_loss=0, rta=0.80</i>" (sans les guillemets).
</p>

<p>
<strong><u>Format de l'affichage des donn&eacute;es de performance</u></strong>
</p>

<p>
Le d&eacute;mon Nagios ne traite pas directement les donn&eacute;es de performance, si bien qu'il ne pr&eacute;occupe pas du formatage des donn&eacute;es de performance. Il n'y pas de limitations intrins&egrave;ques concernant le format ou le contenu des donn&eacute;es de performance. Cependant, si vous utilisez un addon externe pour traiter les donn&eacute;es de performance (p.ex. PerfParse), l'addon peut attendre un format particulier de la part du plugin. V&eacute;rifiez la documentation accompagnant l'addon pour plus d'information. De m&ecirc;me, assurez-vous de lire le "Guide du d&eacute;veloppeur de plugin" sur SourceForge (<a href="http://nagiosplug.sourceforge.net/">http://nagiosplug.sourceforge.net/</a>) si vous souhaitez &eacute;crire des plugins.
</p>

<p>
<strong><u>Activation du traitement des donn&eacute;es de performance</u></strong>
</p>

<p>
Pour traiter les donn&eacute;es de performance mises &agrave; disposition par Nagios et les plugins, vous devez :
</p>

<p>
<ol>
<li>Activer le param&eacute;tre <a href="configmain.html#process_performance_data">process_performance_data</a>.<br /><br />

<li>Configurer Nagios pour que les donn&eacute;es de performance soient &eacute;crites dans des fichiers et/ou trait&eacute;es en ex&eacute;cutant des commandes.
</ol>
</p>

<p>
<strong><u>Ecriture des donn&eacute;es de performance dans des fichiers</u></strong>
</p>

<p>
Vous pouvez configurer Nagios pour qu'il &eacute;crive toutes les donn&eacute;es de performance d'h&ocirc;te ou de service dans des fichiers gr&acirc;ce aux param&eacute;tres <a href="configmain.html#host_perfdata_file">host_perfdata_file</a> et <a href="configmain.html#service_perfdata_file">service_perfdata_file</a>. Vous pouvez contr&ocirc;ler comment les donn&eacute;es sont &eacute;crites dans ces fichiers avec les param&eacute;tres <a href="configmain.html#host_perfdata_file_template">host_perfdata_file_template</a> et <a href="configmain.html#service_perfdata_file_template">service_perfdata_file_template</a>. De plus, vous pouvez faire en sorte que Nagios ex&eacute;cute r&eacute;guli&egrave;rement des commandes pour traiter les donn&eacute;es de performance pr&eacute;sentes dans les fichiers gr&acirc;ce aux param&eacute;tres <a href="configmain.html#host_perfdata_file_processing_command">host_perfdata_file_processing_command</a> et <a href="configmain.html#service_perfdata_file_processing_command">service_perfdata_file_processing_command</a>.

</p>

<p>
<strong><u>Traitement des donn&eacute;es de de performance par des commandes</u></strong>
</p>

<p>
Vous pouvez configurer Nagios pour qu'il traite les donn&eacute;es de performance d'h&ocirc;te et de service en ex&eacute;cutant des  commandes gr&acirc;ce aux param&eacute;tres <a href="configmain.html#host_perfdata_command">host_perfdata_command</a> ou <a href="configmain.html#service_perfdata_command">service_perfdata_command</a>. Voici un exemple de commande qui &eacute;crit simplement les donn&eacute;es de performance de service dans un fichier :
</p>

<p>
<font color='red'>
<pre>
define command{
	command_name	process-service-perfdata
	command_line	/bin/echo -e "$LASTSERVICECHECK$\t$HOSTNAME$\t$SERVICEDESC$\t$SERVICESTATE$\t$SERVICEATTEMPT$\t$SERVICESTATETYPE$\t$SERVICEEXECUTIONTIME$\t$SERVICELATENCY$\t$SERVICEOUTPUT$\t$SERVICEPERFDATA$" &gt;&gt; /usr/local/nagios/var/service-perfdata.dat
	}
</pre>
</font>
</p>




<hr>

</body>
</html>

