
<html>
<head>
<title>Gestion de panne et redondance pour la supervision r&eacute;seau</title>
<STYLE type="text/css">
<!--
         .Default { font-family: verdana,arial,serif; font-size: 8pt; }
         .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>
</head>
<body bgcolor="#FFFFFF" text="black" class="Default">
<p>
<div align="center">
<h2 class="PageTitle">Gestion de panne et redondance pour la supervision r&eacute;seau</h2>
</div>
<p></p>
<hr>
<p>
<strong><u>Introduction</u></strong>
</p>
<p>
Cette section d&eacute;crit quelques sc&eacute;narii d'impl&eacute;mentation de syst&egrave;mes de supervision redondante ainsi que plusieurs topologies r&eacute;seau.  
Avec la redondance des syst&egrave;mes, vous pouvez maintenir la possibilit&eacute; de surveiller votre r&eacute;seau alors que le premier syst&egrave;me sur
lequel tourne Nagios pose probl&egrave;me ou lorsque des parties du r&eacute;seau deviennent injoignables.
</p>
<p> <font color="red"><strong>Note:</strong></font> Si vous apprenez &agrave; utiliser 
  Nagios, je sugg&egrave;re de ne pas essayer d'impl&eacute;menter la redondance tant que vous 
  n'&ecirc;tes pas habitu&eacute; aux <a href="#prerequisites">pr&eacute;-requis</a> d&eacute;j&agrave; pr&eacute;sent&eacute;s. 
  La redondance est un sujet relativement complexe, et il est encore plus difficile 
  de l'impl&eacute;menter correctement. </p>
<p>
<strong><u>Index</u></strong>
</p>
<p>
<a href="#prerequisites">Pr&eacute;-requis</a><br />
<a href="#samples">Exemples de scripts</a><br />
<a href="#scenario_1">Scenario 1 - Monitoring Redondant</a><br />
  <a href="#scenario_2">Scenario 2 - Monitoring en haute disponibilit&eacute;</a><br />
</p>
<p>
<a name="prerequisites"></a>
<table border="0" width="100%">
<tr>
    <td bgcolor="#cbcbcb"><strong class="Default">Pr&eacute;-requis</strong></td>
</tr>
</table>
<p></p>
<p>
Avant de penser pouvoir impl&eacute;menter la redondance avec Nagios, vous devez &ecirc;tre familier avec ce qui suit...
</p>
<p>
<ul>
  <li>Impl&eacute;menter les <a href="eventhandlers.html">Gestionnaires d'&eacute;v&eacute;nements</a> 
    pour les h&ocirc;tes et services 
  <li>Pr&eacute;senter une <a href="extcommands.html">commande externe</a> &agrave; Nagios via 
    des scripts shell
  <li>Ex&eacute;cuter des plugins sur des h&ocirc;tes distants en utilisant soit <a href="addons.html#nrpe">NRPE</a>, soit d'autres 
    m&eacute;thodes 
  <li>V&eacute;rifier l'&eacute;tat du processus Nagios avec le plugin check_nagios. 
</ul>
<p></p>
<p>
<a name="samples"></a>
<table border="0" width="100%">
<tr>
    <td bgcolor="#cbcbcb"><strong class="Default">Exemples de scripts</strong></td>
</tr>
</table>
<p></p>
<p>
Tous les exemples que j'utilise dans cette documentation se trouvent dans le r&eacute;pertoire <i>eventhandlers/</i> de la distribution Nagios.
Vous devrez probablement les modifier pour les faire fonctionner sur votre syst&egrave;me...
</p>
<p>
<a name="scenario_1"></a>
<table border="0" width="100%">
<tr>
    <td bgcolor="#cbcbcb"><strong class="Default">Sc&eacute;nario 1 - Supervision Redondante</strong></td>
</tr>
</table>
<p></p>
<p>
<strong><u>Introduction</u></strong>
</p>
<p> Ceci est une m&eacute;thode facile (et na&iuml;ve) pour impl&eacute;menter le monitoring 
  redondant d'h&ocirc;tes sur votre r&eacute;seau, qui prot&egrave;gera seulement contre un nombre 
  limit&eacute; de probl&egrave;mes. Des r&eacute;glages plus complexes sont n&eacute;cessaires pour 
  fournir une redondance plus pratique, une meilleure redondance &agrave; travers des 
  segments r&eacute;seau, etc. </p>
<p>
<strong><u>Buts</u></strong>
</p>
<p>
Le but de ce type d'impl&eacute;mentation de redondance est simple.  Les h&ocirc;tes "ma&icirc;tre" et "esclave" surveillent 
les m&ecirc;mes syst&egrave;mes et services sur le r&eacute;seau.  Dans des circonstances normales, le syst&egrave;me "ma&icirc;tre" 
prendra en charge l'envoi des notifications aux contacts concernant les probl&egrave;mes d&eacute;tect&eacute;s.
Nous voulons que syst&egrave;me "esclave" fasse fonctionner Nagios et prenne en charge la notification des 
probl&egrave;mes si:
</p>
<p>
<ol>
  <li>Soit le syst&egrave;me "Ma&icirc;tre" faisant fonctionner Nagios ne r&eacute;pond plus 
  <li>Soit le processus Nagios sur le syst&egrave;me "Ma&icirc;tre" arr&ecirc;te de fonctionner. 
</ol>
<p></p>
<p>
<strong><u>Diagramme de topologie r&eacute;seau</u></strong>
</p>
<p>
Le diagramme ci-dessous montre une configuration r&eacute;seau tr&egrave;s simple.
Pour ce sc&eacute;nario, je vais supposer que les syst&egrave;mes A et E font tourner tous deux Nagios et surveillent
tous les syst&egrave;mes que l'on y voit.
Le syst&egrave;me A sera consid&eacute;r&eacute; comme &eacute;tant le syst&egrave;me "ma&icirc;tre" et le syst&egrave;me E sera consid&eacute;r&eacute; comme &eacute;tant 'l'esclave'.
</p>
<p>
<table border=1>
<tr>
<td><img src="images/redundancy.png" border=0></td>
</tr>
</table>
<p></p>
<p> <strong><u>R&eacute;glages initiaux du programme</u></strong> </p>
<p> Le syst&egrave;me esclave (syst&egrave;me E) a sa directive initiale de notification <a href="configmain.html#enable_notifications">enable_notifications</a> 
  d&eacute;sactiv&eacute;e, afin de lui &eacute;viter d'envoyer des notifications autant pour les h&ocirc;tes 
  que pour les services. Il faut aussi s'assurer que le syst&egrave;me esclave a sa directive 
  <a  href="configmain.html#check_external_commands">check_external_commands</a> 
  activ&eacute;e. C'est plut&ocirc;t simple... </p>
<p>
<strong><u>Configuration Initiale</u></strong>
</p>
<p>
Il faudra ensuite consid&eacute;rer les changements entre le(s) <a href="configobject.html">fichier(s) de configuration des objets</a>
sur les syst&egrave;mes ma&icirc;tre et esclave... 
</p>
<p> Je vais supposer que le syst&egrave;me ma&icirc;tre (syst&egrave;me A) est configur&eacute; pour surveiller 
  des services sur tous les syst&egrave;mes montr&eacute;s dans le diagramme ci-dessus. Le syst&egrave;me 
  esclave (syst&egrave;me E) doit &ecirc;tre configur&eacute; pour surveiller les m&ecirc;mes syst&egrave;mes et 
  services, avec les ajouts suivants aux fichiers de configuration... </p>
<p>
<ul>
<li>La d&eacute;finition du syst&egrave;me A (dans le fichier de configuration du syst&egrave;me E) devrait avoir un <a href="eventhandlers.html">gestionnaire d'&eacute;v&egrave;nement</a> 
d&eacute;fini.  Supposons que le nom du gestionnaire d'&eacute;v&egrave;nement pour le syst&egrave;me s'appelle <font color="red">handle-master-host-event</font>.
  <li>Le fichier de configuration sur le syst&egrave;me E devrait avoir un service d&eacute;fini 
    pour surveiller l'&eacute;tat du processus Nagios sur le syst&egrave;me A. Supposons 
    que vous ayez d&eacute;fini cette v&eacute;rification de service pour lancer 
    le plugin <i>check_nagios</i> sur le syst&egrave;me A. 
  <li>La d&eacute;finition du service pour la surveillance du processus Nagios sur le syst&egrave;me A devrait &ecirc;tre un <a href="eventhandlers.html">gestionnaire d'&eacute;v&egrave;nement</a>.
Supposons que ce service gestionnaire d'&eacute;v&egrave;nement soit <font color="red">handle-master-proc-event</font>.
</ul>
<p></p>
<p> Il est important de noter que le syst&egrave;me A (le syst&egrave;me ma&icirc;tre) ne sait rien 
  du syst&egrave;me E (le syst&egrave;me esclave). Dans ce sc&eacute;nario, il n'en a simplement pas 
  besoin. Bien &eacute;videmment, vous pouvez surveiller les services du syst&egrave;me E depuis 
  le syst&egrave;me A, mais cela n'a rien &agrave; voir avec l'impl&eacute;mentation de la redondance... 
</p>
<p>
<strong><u>D&eacute;finition de commandes de Gestion d'Ev&egrave;nements</u></strong>
</p>
<p>
Faisons une petite pause, et d&eacute;crivons les d&eacute;finitions de commandes de gestion d'&eacute;v&egrave;nement sur l'esclave.  Voici un exemple...
</p>
<p>
<strong> <font color="red"> 
<pre>
define command{
	command_name	handle-master-host-event
	command_line    /usr/local/nagios/libexec/eventhandlers/handle-master-host-event $HOSTSTATE$ $HOSTSTATETYPE$
	}
	
define command{
	command_name	handle-master-proc-event
	command_line	/usr/local/nagios/libexec/eventhandlers/handle-master-proc-event $SERVICESTATE$ $SERVICESTATETYPE$
	}
</pre>
</font> </strong> 
<p></p>
<p> Cela implique que vous ayez plac&eacute; les scripts de gestion d'&eacute;v&egrave;nements dans 
  le r&eacute;pertoire <i>/usr/local/nagios/libexec/eventhandlers</i>. Vous pouvez les 
  placer ailleurs, mais vous devrez modifier les exemples que j'ai donn&eacute;s ici. 
</p>
<p>
<strong><u>Scripts de Gestion d'Ev&egrave;nements</u></strong>
</p>
<p>
Ok, regardons &agrave; quoi ressemble ce script...
</p>
<p>
Gestionnaire d'Ev&egrave;nement de syst&egrave;me (<font color="red">handle-master-host-event</font>):
</p>
<p>
<pre>
<font size=-1>
#!/bin/sh
# Only take action on hard host states...
case "$2" in
HARD)
	case "$1" in
	DOWN)
		# The master host has gone down!
		# We should now become the master host and take
		# over the responsibilities of monitoring the 
		# network, so enable notifications...
		/usr/local/nagios/libexec/eventhandlers/enable_notifications
		;;
	UP)
		# The master host has recovered!
		# We should go back to being the slave host and
		# let the master host do the monitoring, so 
		# disable notifications...
		/usr/local/nagios/libexec/eventhandlers/disable_notifications
		;;
	esac
	;;
esac
exit 0
</font>
</pre>
<p></p>
<p>
Gestionnaire d'Ev&egrave;nements de Service (<font color="red">handle-master-proc-event</font>):
</p>
<p>
<pre>
<font size=-1>
#!/bin/sh
# Only take action on hard service states...
case "$2" in
HARD)
	case "$1" in
	CRITICAL)
		# The master Nagios process is not running!
		# We should now become the master host and
		# take over the responsibility of monitoring
		# the network, so enable notifications...
		/usr/local/nagios/libexec/eventhandlers/enable_notifications
		;;
	WARNING)
	UNKNOWN)
		# The master Nagios process may or may not
		# be running.. We won't do anything here, but
		# to be on the safe side you may decide you 
		# want the slave host to become the master in
		# these situations...
		;;
	OK)
		# The master Nagios process running again!
		# We should go back to being the slave host, 
		# so disable notifications...
		/usr/local/nagios/libexec/eventhandlers/disable_notifications
		;;
	esac
	;;
esac
exit 0
</font>
</pre>
<p></p>
<p>
<strong><u>Que fait ce script pour nous ?</u></strong>
</p>
<p> La notification sur le syst&egrave;me esclave (syst&egrave;me E) est d&eacute;sactiv&eacute;e, donc il 
  n'enverra pas de notifications pour les syst&egrave;mes autant que pour les services 
  tant que le processus Nagios fonctionne sur le syst&egrave;me ma&icirc;tre (syst&egrave;me A). </p>
<p>
Le processus Nagios sur le syst&egrave;me esclave (syst&egrave;me E) devient ma&icirc;tre quand...
</p>
<p>
<ul>
<li>Le syst&egrave;me ma&icirc;tre (syst&egrave;me A) tombe et le gestionnaire d'&eacute;v&egrave;nement de syst&egrave;me <i><font color="red">handle-master-host-event</font></i> est ex&eacute;cut&eacute;.  
<li>Le processus Nagios sur le syst&egrave;me ma&icirc;tre (syst&egrave;me A) s'arr&ecirc;te de fonctionner et le gestionnaire d'&eacute;v&egrave;nement du service <i><font color="red">handle-master-proc-event</font></i> est ex&eacute;cut&eacute;.
</ul>
<p></p>
<p>
D&egrave;s que le processus Nagios sur le syst&egrave;me esclave (syst&egrave;me E) a la notification activ&eacute;e, il sera capable d'envoyer 
des notifications quant aux services ou probl&egrave;mes syst&egrave;me ou encore les retours &agrave; la normale.  
A ce moment, le syst&egrave;me E a effectivement pris la responsabilit&eacute; de notifier les contacts des probl&egrave;mes de syst&egrave;mes et services!
</p>
<p>
Le processus Nagios sur le syst&egrave;me E retourne &agrave; son &eacute;tat d'esclave quand...
</p>
<p>
<ul>
  <li>Le syst&egrave;me A revient &agrave; la normale et le gestionnaire d'&eacute;v&egrave;nement de syst&egrave;me 
    <i><font color="red">handle-master-host-event</font></i> est ex&eacute;cut&eacute;. 
  <li>Le processus Nagios sur le syst&egrave;me A revient &agrave; la normale et que le gestionnaire d'&eacute;v&egrave;nement de service <i><font color="red">handle-master-proc-event</font></i> est ex&eacute;cut&eacute;.
</ul>
<p></p>
<p> D&egrave;s que le processus Nagios sur le syst&egrave;me E est d&eacute;sactiv&eacute;, il n'enverra plus 
  de notification concernant les probl&egrave;mes li&eacute;s aux services et aux syst&egrave;mes 
  ou encore les retours &agrave; la normale. D&egrave;s ce moment, le syst&egrave;me E a pris la responsabilit&eacute; 
  de notifier les contacts des probl&egrave;mes du processus Nagios sur le syst&egrave;me A. 
  Tout revient maintenant dans le m&ecirc;me &eacute;tat que lorsque l'on a d&eacute;marr&eacute;! </p>
<p>
<strong><u>D&eacute;lais</u></strong>
</p>
<p>
La redondance dans Nagios n'est en rien parfaite.  Un des nombreux probl&egrave;mes est le d&eacute;lai entre le moment o&ugrave; le ma&icirc;tre tombe
et que l'esclave prend le relai.  En voici les raisons...
</p>
<p>
<ul>
<li>L'intervalle entre la rupture du syst&egrave;me ma&icirc;tre et la premi&egrave;re fois que le syst&egrave;me esclave d&eacute;tecte le probl&egrave;me.
<li>Le temps qu'il faut pour v&eacute;rifier que le syst&egrave;me ma&icirc;tre a r&eacute;ellement un probl&egrave;me (en utilisant une nouvelle fois la commande
'check' d'un service ou d'un syst&egrave;me sur le syst&egrave;me esclave)
<li>Le temps entre l'ex&eacute;cution du gestionnaire d'&eacute;v&egrave;nement et la fois suivante o&ugrave; Nagios va v&eacute;rifier la pr&eacute;sence d'une commande externe
</ul>
<p></p>
<p>
Vous pouvez minimiser ce d&eacute;lai en...
</p>
<p>
<ul>
<li>S'assurant que le processus Nagios sur le syst&egrave;me E (re)v&eacute;rifie un ou plusieurs services avec une fr&eacute;quence &eacute;lev&eacute;e.  Ceci peut &ecirc;tre fait en utilisant les arguments <i>check_interval</i> et <i>retry_interval</i> dans chaque d&eacute;finition de service.
  <li>S'assurer que le nombre de re-v&eacute;rifications de la pr&eacute;sence du syst&egrave;me A 
    (sur le syst&egrave;me E) permette une d&eacute;tection des probl&egrave;mes li&eacute;s au syst&egrave;me plus 
    rapidement. Ceci peut &ecirc;tre fait en utilisant l'argument <i>max_check_attempts</i> 
    dans la d&eacute;finition du syst&egrave;me. 
  <li>Augmenter la fr&eacute;quence de v&eacute;rification des <a href="extcommands.html">commandes externes</a> sur le syst&egrave;me E.  Ceci peut &ecirc;tre fait en modifiant l'option <a href="configmain.html#command_check_interval">command_check_interval</a> dans le fichier de configuration principal.
</ul>
<p></p>
<p>
Quand Nagios revient &agrave; la normale sur le syst&egrave;me A, il y a aussi un d&eacute;lai avant que le syst&egrave;me E ne redevienne esclave.  C'est du aux faits suivants...
</p>
<p>
<ul>
<li>Le temps entre le retour &agrave; la normale du syst&egrave;me A la fois suivante o&ugrave; le processus Nagios sur le syst&egrave;me E d&eacute;tecte le retour &agrave; la normale.
  <li>L'intervalle entre l'ex&eacute;cution du gestionnaire d'&eacute;v&egrave;nement sur le syst&egrave;me 
    E et la fois suivante o&ugrave; le processus Nagios sur le syst&egrave;me E v&eacute;rifie la pr&eacute;sence 
    de commandes externes 
</ul>
<p></p>
<p> Les intervalles exacts entre le transfert des responsabilit&eacute;s de supervision 
  d&eacute;pendent du nombre de services d&eacute;finis, l'intervalle auquel les services sont 
  v&eacute;rifi&eacute;s, et un peu de chance. A tous niveaux, c'est mieux que rien. </p>
<p>
<strong><u>Cas sp&eacute;ciaux</u></strong>
</p>
<p> Il y a une chose &agrave; laquelle il faut &ecirc;tre attentif... Si le syst&egrave;me A tombe, 
  le syst&egrave;me de notifications sur le syst&egrave;me E sera activ&eacute; et prendra la responsabilit&eacute; 
  de notifier les contacts de probl&egrave;mes. Lorsque le syst&egrave;me A revient &agrave; la normale, 
  le syst&egrave;me E aura sa notification d&eacute;sactiv&eacute;e. Si, quand le syst&egrave;me A revient 
  &agrave; la normale, le processus Nagios ne red&eacute;marre pas correctement, il y aura une 
  p&eacute;riode de temps o&ugrave; aucun syst&egrave;me ne notifiera les contacts de probl&egrave;mes! Heureusement 
  on peut compter sur la logique de v&eacute;rification de services de Nagios. La fois 
  suivante o&ugrave; le processus Nagios sur le syst&egrave;me E v&eacute;rifie l'&eacute;tat du processus 
  Nagios sur le syst&egrave;me A, il verra qu'il ne fonctionne pas. Le syst&egrave;me E aura 
  donc sa notification activ&eacute;e et prendra la responsabilit&eacute; de notifier les contacts 
  des probl&egrave;mes. </p>
<p>
Le temps o&ugrave; aucun syst&egrave;me ne surveille est assez difficile &agrave; d&eacute;terminer.  Toutefois, cette p&eacute;riode peut &ecirc;tre minimis&eacute;e en augmentant la fr&eacute;quence de v&eacute;rification (sur le syst&egrave;me E) du processus Nagios sur le syst&egrave;me A.   Le reste est une question de chance, mais le temps de "blackout" total ne devrait pas &ecirc;tre trop mauvais.
</p>
<p>
<a name="scenario_2"></a>
<table border="0" width="100%">
<tr>
    <td bgcolor="#cbcbcb"><strong class="Default">Sc&eacute;nario 2 - Supervision en 
      mode haute disponibilit&eacute;</strong></td>
</tr>
</table>
<p></p>
<p>
<strong><u>Introduction</u></strong>
</p>
<p>
La supervision avec gestion de panne est pratiquement identique. Il existe quand m&ecirc;me des diff&eacute;rences avec le syst&egrave;me pr&eacute;c&eacute;dent (<a href="#scenario_1">sc&eacute;nario 1</a>).
</p>
<p>
<strong><u>Buts</u></strong>
</p>
<p> Le but principal de la gestion de panne est d'avoir le processus Nagios sur 
  le syst&egrave;me esclave en hibernation tant que le processus Nagios sur le syst&egrave;me 
  maitre fonctionne. Si le processus sur le syst&egrave;me ma&icirc;tre arr&ecirc;te de fonctionner 
  (ou si le syst&egrave;me tombe), le processus Nagios sur le syst&egrave;me esclave commence 
  &agrave; tout surveiller. </p>
<p> Bien que la m&eacute;thode d&eacute;crite dans la partie <a href="#scenario_1">sc&eacute;nario 
  1</a> permette de continuer &agrave; recevoir la notification si le syst&egrave;me maitre 
  tombe, il y a quelques pi&egrave;ges. Le plus gros probl&egrave;me est que le syst&egrave;me esclave 
  surveille les m&ecirc;mes syst&egrave;mes que le maitre <i>au m&ecirc;me moment</i>! Ceci peut 
  causer des probl&egrave;mes de trafic excessif et charger les machines surveill&eacute;es 
  si vous avez beaucoup de services d&eacute;finis. Voici une mani&egrave;re de contourner ce 
  probl&egrave;me... </p>
<p> <strong><u>R&eacute;glages initiaux du programme</u></strong> </p>
<p>
D&eacute;sactiver la v&eacute;rification active des services et la notification sur le syst&egrave;me esclave en utilisant les directives <a href="configmain.html#execute_service_checks">execute_service_checks</a> et <a href="configmain.html#enable_notifications">enable_notifications</a>.  Ceci &eacute;vitera au syst&egrave;me esclave de surveiller les services et les syst&egrave;mes et d'envoyer des notifications tant que le processus Nagios sur le syst&egrave;me ma&icirc;tre fonctionne.  Assurez-vous d'avoir la directive <a href="configmain.html#check_external_commands">check_external_commands</a> activ&eacute;e sur le syst&egrave;me esclave.
</p>
<p>
<strong><u>V&eacute;rification du processus principal</u></strong>
</p>
<p> Cr&eacute;er un t&acirc;che programm&eacute;e [cron job] sur le syst&egrave;me esclave qui 
  lance p&eacute;riodiquement un script (disons toutes les minutes) qui v&eacute;rifie l'&eacute;tat 
  du processus Nagios sur le syst&egrave;me ma&icirc;tre (en utilisant le plugin <i>check_nrpe</i> 
  sur le syst&egrave;me esclave et le <a href="addons.html#nrpe">d&eacute;mon nrpe</a> sur le 
  syst&egrave;me ma&icirc;tre). Le script va v&eacute;rifier le code de retour du <i>plugin nrpe</i>. 
  S'il retourne un &eacute;tat non-OK, le script va envoyer les commandes appropri&eacute;es 
  au <a href="configmain.html#command_file">fichier de commandes externes</a> 
  pour activer la notification et la surveillance des services. Si le plugin retourne 
  un &eacute;tat OK, le script enverra les commandes pour d&eacute;sactiver la surveillance 
  active des services et la notification. </p>
<p>
En proc&eacute;dant comme suit, vous n'utilisez qu'un processus de surveillance de syst&egrave;me et de service &agrave; la fois, ce qui est plus efficace 
que de surveiller en double.
</p>
<p> Notez aussi que vous <i>ne</i> devez <i>pas</i> d&eacute;finir de gestionnaires d'&eacute;v&egrave;nements 
  comme d&eacute;fini dans le <a href="#scenario_1">sc&eacute;nario 1</a> , car les contraintes 
  sont surmont&eacute;es de mani&egrave;re diff&eacute;rente. </p>
<p>
<strong><u>Cas Suppl&eacute;mentaires</u></strong>
</p>
<p> Vous avez maintenant impl&eacute;ment&eacute; une gestion de panne de mani&egrave;re plut&ocirc;t basique. 
  Il y a toutefois d'autres mani&egrave;res de proc&eacute;der pour que celafonctionne de mani&egrave;re 
  plus douce. </p>
<p> Le gros probl&egrave;me avec cette technique est surtout le fait que l'esclave ne 
  connait pas l'&eacute;tat courant des services ou des syst&egrave;mes au moment m&ecirc;me 
  o&ugrave; il prend &agrave; sa charge le travail de surveillance. Une mani&egrave;re de solutionner 
  ce probl&egrave;me est d'activer la <a href="configmain.html#ocsp_command">commande 
  ocsp</a> sur le syst&egrave;me ma&icirc;tre et de lui demander de rapporter les r&eacute;sultats 
  des v&eacute;rifications &agrave; l'esclave en utilisant l'ajout <a href="addons.html#nsca">nsca</a>. 
  De cette mani&egrave;re, le syst&egrave;me esclave poss&egrave;de un statut mis &agrave; jour des informations 
  de tous les services et des syst&egrave;mes s'il venait &agrave; prendre en charge la surveillance. 
  Tant que les v&eacute;rifications actives ne sont pas activ&eacute;es sur le syst&egrave;me esclave, 
  il n'effectuera aucune v&eacute;rification active. Malgr&eacute; tout, il ex&eacute;cutera les v&eacute;rifications 
  si n&eacute;cessaire. Cela signifie qu'autant le ma&icirc;tre que l'esclave ex&eacute;cuteront les 
  v&eacute;rifications de syst&egrave;me comme il le faut, ce qui n'est pas vraiment une bonne 
  affaire puisque la majorit&eacute; des surveillances fonctionnent par rapport aux services. 
</p>
<p> Voil&agrave; &agrave; peu pr&egrave;s tout ce qu'il y a &agrave; configurer. </p>
<hr>
</body>
</html>
