<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Suivi pr&eacute;cis des changements d'&eacute;tat</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Suivi pr&eacute;cis des changements d'&eacute;tat</h2>
</div>
</p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Ce type de fonctionnalit&eacute; ne sera probablement pas utilis&eacute;e par beaucoup d'entre vous.
Quand elle est activ&eacute;e, elle permet d'enregistrer des changements dans le contr&ocirc;le d'un service ou d'un h&ocirc;te, m&ecirc;me si l'&eacute;tat de celui-ci ne change pas.
Nagios va alors surveiller plus particuli&egrave;rement ce service ou cet h&ocirc;te et enregistrer tout changement.
Comme vous allez le constater, ceci peut &ecirc;tre tr&egrave;s utile plus tard, lors d'une analyse de vos fichiers de logs.
</p>

<p>
<strong><u>Comment cela marche t il ?</u></strong>
</p>

<p>
Dans des conditions de fonctionnement normales, le r&eacute;sultat de la surveillance d'un h&ocirc;te ou d'un service n'est enregistr&eacute; que lorsqu'il a chang&eacute; d'&eacute;tat depuis le dernier contr&ocirc;le.
Il y a quelques exceptions &agrave; cette r&eacute;gle, mais c'est comme cela que cela se passe la plupart du temps.
</p>

<p>
Si vous activez ce type de contr&ocirc;le pour un ou plusieurs &eacute;tats d'un h&ocirc;te ou d'un service en particulier, Nagios enregistrera dans ses journaux toute diff&eacute;rence entre le contr&ocirc;le actuel et le pr&eacute;c&eacute;dent.
Examinez l'exemple suivant, sur 8 tests cons&eacute;cutifs d'un service :
</p>

<p>
<table border="1" class="Default">
<tr><td><b>Contr&ocirc;le du Service # :</b></td><td><b>Etat du Service :</b></td><td><b>Message issu &agrave; la fin du Contr&ocirc;le:</b></td></tr>
<tr><td>x</td><td>OK</td><td>RAID array optimal</td></tr>
<tr><td>x+1</td><td>OK</td><td>RAID array optimal</td></tr>
<tr><td>x+2</td><td>WARNING</td><td>RAID array degraded (1 drive bad, 1 hot spare rebuilding)</td></tr>
<tr><td>x+3</td><td>CRITICAL</td><td>RAID array degraded (2 drives bad, 1 host spare online, 1 hot spare rebuilding)</td></tr>
<tr><td>x+4</td><td>CRIICAL</td><td>RAID array degraded (3 drives bad, 2 hot spares online)</td></tr>
<tr><td>x+5</td><td>CRITICAL</td><td>RAID array failed</td></tr>
<tr><td>x+6</td><td>CRITICAL</td><td>RAID array failed</td></tr>
<tr><td>x+7</td><td>CRITICAL</td><td>RAID array failed</td></tr>
</table>
</p>

<p>
Cette s&eacute;quence &eacute;tant donn&eacute;e, vous devriez seulement voir deux entr&eacute;es dans vos journaux, concernant cette catastrophe.
La premi&egrave;re arrivera &agrave; X+2 quand le service basculera de l'&eacute;tat OK &agrave; l'&eacute;tat WARNING.
Le deuxi&egrave;me arrivera (trop tard), au moment du passage de WARNING &agrave; CRITICAL.
</p>

<p>
Vous pouriez avoir envie, pour une raison quelconque, d'avoir un historique complet de cet accident dans vos journaux.
Peut &ecirc;tre pour expliquer &agrave; votre patron comment tout cela est arriv&eacute; soudainement, ou aller vous en jeter un ou deux au bar du coin, pour en rire plut&ocirc;t qu'en pleurer, ou encore ....
</p>

<p>
Ceci dit, si le suivi pr&eacute;cis avait &eacute;t&eacute; activ&eacute; pour les &eacute;tats CRITICAL, les &eacute;tats x+4 et x+5 logged auraient &eacute;t&eacute; enregistr&eacute;s en plus de x+2 et x+3.
Pourquoi ? parce que dans ce cas-l&agrave;, Nagios aurait examin&eacute; les message &eacute;mis pour v&eacute;rifier s'ils diff&eacute;raient des pr&eacute;c&eacute;dents.
Si le message &eacute;mis change alors que l'&eacute;tat ne change pas, le message sera quand m&ecirc;me enregistr&eacute;.
</p>

<p>
Un exemple similaire peut &ecirc;tre donn&eacute; avec un service qui contr&ocirc;le un serveur web.
Si le plugin check_http retourne d'abord un WARNING sur une erreur 404, puis ensuite des WARNING &agrave; cause d'un mod&egrave;le manquant sur la page, vous pouvez avoir envie de le savoir.
Si vous n'avez pas activ&eacute; le suivi pr&eacute;cis, seul le premier WARNING (celui de l'erreur 404) sera enregistr&eacute; dans les logs et vous n'aurez aucune id&eacute;e (en analysant les logs archiv&eacute;s) que les WARNING suivants ne sont pas dus &agrave; une erreur 404, mais plut&ocirc;t &agrave; un mod&eacute;le absent de la page web retourn&eacute;e.
</p>

<p>
<strong><u>Dois je activer le suivi pr&eacute;cis?</u></strong>
</p>

<p>
Tout d'abord, vous devez d&eacute;cider si vous avez r&eacute;ellement besoin d'examiner vos logs pour trouver la cause d'un probl&egrave;me.
Vous pouvez d&eacute;cider de l'activer pour quelques services ou h&ocirc;tes, mais pas pour tous.
Vous pouvez aussi d&eacute;cider que vous ne surveillerez que quelques &eacute;tats d'h&ocirc;tes ou de services, mais pas tous.
Par exemple, surveiller les &eacute;tats WARNING et CRITICAL d'un service, et pas les &eacute;tats OK ou UNKNOWN.
</p>

<p>
Cette d&eacute;cision d&eacute;pend principalement du plugin que vous allez utiliser.
Si le plugin retourne toujours le m&ecirc;me texte/message pour un &eacute;tat particulier, il n'y a aucune raison de se fatiguer &agrave; activer ce type de contr&ocirc;le.
</p>

<p>
<strong><u>Comment l'activer ?</u></strong>
</p>

<p>
Vous pouvez activ&eacute; le suivi pr&eacute;cis des services et des h&ocirc;tes en utilisant la directive <i>stalking_options</i> dans les <a href="configobject.html">d&eacute;finitions d'h&ocirc;tes et de services</a>.
</p>


<p>
<strong><u>Inconv&eacute;nients</u></strong>
</p>

<p>
Vous devez &ecirc;tre conscients du fait qu'activer ce type de contr&ocirc;le am&egrave;ne quelques inconv&eacute;nients.
Ils sont relatifs aux fonctions d'enregistrement trouv&eacute;es dans les diff&eacute;rents <a href="cgis.html">CGIs</a> (histogramme, r&eacute;sum&eacute; des alertes, etc.).
Comme le suivi pr&eacute;cis va apporter des entr&eacute;es suppl&eacute;mentaires dans les journaux, les donn&eacute;es retourn&eacute;es montreront un accroissement sensible du nombre d'alertes.
</p>

<p>
D'une mani&egrave;re g&eacute;n&eacute;rale, je d&eacute;conseille d'activer ce service <i>sans</i> avoir men&eacute; auparavant une r&eacute;flexion profonde sur le sujet.
Mais, bien entendu, c'est l&agrave; pour servir si vous en avez besoin.
</p>


<hr>

</body>
</html>
