<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html><head><title>D&eacute;marrer Nagios</title>




<style type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</style></head><body class="Default" bgcolor="#ffffff" text="black">

<p>
</p><div align="center">
<h2 class="PageTitle">D&eacute;marrer Nagios</h2>
</div>
<p></p>
<hr>

<p>
<font color="red"><strong>IMPORTANT : </strong></font>

Avant de d&eacute;marrer Nagios, vous devez &ecirc;tre s&ucirc;r de l'avoir <a href="http://www.manubulon.com/nagios/traduction/docs25en/config.html">configur&eacute;</a> correctement et d'avoir <a href="http://www.manubulon.com/nagios/traduction/docs25en/verifyconfig.html">v&eacute;rifi&eacute; les donn&eacute;es de configurations</a> !
 </p>

<p>
<strong><u>M&eacute;thodes pour d&eacute;marrer Nagios</u></strong>
</p>

<p>
Il y a quatre moyens diff&eacute;rents de lancer Nagios:
</p>
<p>
</p><ol>
<li>Manuellement, en tant que processus prioritaire (utile pour les tests initiaux et le d&eacute;buggage)
</li><li>Manuellement, en tant que processus d'arri&egrave;re-plan
</li><li>Manuellement, en tant que un d&eacute;mon
</li><li>Automatiquement au d&eacute;marrage (boot) du syst&egrave;me
</li></ol>
<p></p>

<p>
Examinons bri&egrave;vement chacune des m&eacute;thodes...
</p>

<p>
<strong><u>Lancer Nagios manuellement en tant que processus prioritaire</u></strong>
</p>

<p>
Si vous avez valid&eacute; les options de d&eacute;buggage dans le script de configuration (et recompil&eacute; Nagios), cela devrait &ecirc;tre votre premier choix pour le test et le d&eacute;buggage.
Lancer Nagios comme processus prioritaire dans un terminal de commande vous permettra de voir plus facilement ce qui se passe dans les processus de supervision et de notification.
Pour lancer Nagios en tant que processus prioritaire, tapez ceci dans un terminal :
</p>
<p>
<strong><font color="red">/usr/local/nagios/bin/nagios &lt;main_config_file&gt;</font></strong>
</p>
<p>
Remarquez que vous devez sp&eacute;cifier le chemin d'acc&egrave;s au <a href="http://www.manubulon.com/nagios/traduction/docs25en/configmain.html">fichier de configuration principal</a> (c.-&agrave;-d. <i>/usr/local/nagios/etc/cfg</i>) sur la ligne de commande.
</p>
<p>
Pour arr&ecirc;ter Nagios, tapez simplement CTRL-C. Si vous avez activ&eacute; les options de d&eacute;buggage, vous souhaiterez probablement rediriger la sortie vers un fichier afin de le consulter plus facilement plus tard.
</p>

<p>
<strong><u>Lancer manuellement Nagios en processus d'arri&egrave;re-plan</u></strong>
</p>
<p>
Pour d&eacute;marrer Nagios en processus d'arri&egrave;re-plan, lancez-le comme suit...
</p>
<p>
<strong><font color="red">/usr/local/nagios/bin/nagios &lt;main_config_file&gt; &amp;</font></strong>
</p>
<p>
Remarquez que vous devez sp&eacute;cifier le chemin d'acc&egrave;s au <a href="http://www.manubulon.com/nagios/traduction/docs25en/configmain.html">fichier de configuration principal</a> (c.-&agrave;-d. <i>/usr/local/nagios/etc/cfg</i>) sur la ligne de commande.
</p>

<p>
<strong><u>Lancer manuellement le d&eacute;mon Nagios</u></strong>
</p>
<p>
Pour lancer manuellement Nagios sous forme de d&eacute;mon, vous devez pr&eacute;ciser l'option <b>-d</b> sur la ligne de commande comme suit...
</p>
<p>
<strong><font color="red">/usr/local/nagios/bin/nagios -d &lt;main_config_file&gt;</font></strong>
</p>
<p>
Remarquez que vous devez sp&eacute;cifier le chemin d'acc&egrave;s au <a href="http://www.manubulon.com/nagios/traduction/docs25en/configmain.html">fichier de configuration principal</a> (c.-&agrave;-d. <i>/usr/local/nagios/etc/cfg</i>)  sur la ligne de commande.
</p>

<p>
<strong><u>Lancer Nagios automatiquement au d&eacute;marrage de la machine</u></strong>
</p>
<p>
Une fois que vous aurez test&eacute; Nagios et que vous serez &agrave; peu pr&egrave;s s&ucirc;r qu'il ne se plantera pas, vous souhaiterez probablement le lancer au boot de la machine.
Pour cela (sous Linux), il faudra &eacute;crire un script de d&eacute;marrage dans votre r&eacute;pertoire <b>/etc/rc.d/init.d/</b>. 
Il faudra &eacute;galement cr&eacute;er un lien vers ce script dans les runlevels pour lesquels Nagios doit d&eacute;marrer. 
Je suppose que vous savez de quoi je parle et que vous &ecirc;tes capable de le faire.
</p>
<p>
Un exemple de script d'initialisation (appel&eacute; <b>daemon-init</b>) est cr&eacute;&eacute; dans le r&eacute;pertoire racine de la distribution de Nagios lorsque vous ex&eacute;cutez le script de configuration.
Vous pouvez installer ce script d'exemple dans votre r&eacute;pertoire /etc/rc.d/init.d gr&acirc;ce &agrave; la commande '<font color="red"><strong>make install-daemoninit</strong></font>', comme il est d&eacute;crit dans les <a href="http://www.manubulon.com/nagios/traduction/docs25en/installing.html#installing">instructions d'installation</a>.
</p>
<p>
Les exemples de scripts d'initialisation sont pr&eacute;vus pour tourner sous Linux, ce qui fait que si vous voulez les utiliser sous FreeBSD, Solaris, etc. Vous devrez peut-&ecirc;tre les modifier un peu...
</p>

<p>
<strong><u>Arr&ecirc;t et red&eacute;marrage de Nagios</u></strong>
</p>

<p>
Les instructions relatives &agrave; l'arr&ecirc;t et au red&eacute;marrage de Nagios se trouvent <a href="http://www.manubulon.com/nagios/traduction/docs25en/stoprestart.html">ici</a>.
</p>

<hr>


</body></html>
