
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Arr&ecirc;ter et Red&eacute;marrer Nagios</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->     
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Arr&ecirc;ter et Red&eacute;marrer Nagios</h2>
</div>
</p>
<hr>

<p>
Une fois que Nagios fonctionne, vous pouvez avoir besoin d'arr&ecirc;ter le processus ou de recharger les donn&eacute;es de configuration
"&agrave; la vol&eacute;e". Cette section d&eacute;crit comment le faire.
</p>

<p>
<font color="red"><strong>IMPORTANT:</strong></font> Avant de red&eacute;marrer Nagios, assurez vous d'avoir <a href="verifyconfig.html">v&eacute;rifi&eacute; les donn&eacute;es de configuration</a> &agrave; l'aide de la commande -v, <i>surtout</i> si vous avez fait des changements dans vos <a href="config.html">fichiers de configuration</a>.
</p>

<p>
<strong><u>Arr&ecirc;ter et Red&eacute;marrer avec le Script d'Initalisation</u></strong>
</p>

<p>
Si vous avez install&eacute; le script d'initialisation dans votre r&eacute;pertoire /etc/rc.d/init.d, vous pouvez arr&ecirc;ter et red&eacute;marrer Nagios facilement.
Si ce n'est pas le cas, passez cette section et lisez plus bas comment le faire manuellement.
Dans les exemples ci-dessous, je supposerai que vous appelez le script d'initialisation <b>Nagios</b>.
</p>

<p>
<table border="1" class="Default">
<tr>
<td bgcolor="#cbcbcb"><strong>Action souhait&eacute;e</strong></td>
<td bgcolor="#cbcbcb" nowrap><strong>Commande</strong></td>
<td bgcolor="#cbcbcb"><strong>Description</strong></td>
</tr>
<tr>
<td>Arr&ecirc;ter Nagios</td>
<td nowrap><font color="red"><strong>/etc/rc.d/init.d/nagios stop</strong></font></td>
<td>Arr&ecirc;te Nagios</td>
</tr>
<tr>
<td>Red&eacute;marrer Nagios</td>
<td nowrap><font color="red"><strong>/etc/rc.d/init.d/nagios restart</strong></font></td>
<td>Arr&ecirc;te puis red&eacute;marre un nouveau processus Nagios</td>
</tr>
<tr>
<td>Recharger les Donn&eacute;es de Configuration</td>
<td nowrap><font color="red"><strong>/etc/rc.d/init.d/nagios reload</strong></font></td>
<td>Envoie un signal SIGHUP au processus Nagios, lui imposant de purger ses donn&eacute;es actuelles de configuration, relire les fichiers de configuration et red&eacute;marrer la supervision</td>
</tr>
</table>
</p>

<p>
Arr&ecirc;ter, red&eacute;marrer et recharger Nagios est vraiment simple avec un script d'initialisation et je vous recommande vivement de l'utiliser dans la mesure du possible.
</p>

<p>
<strong><u>Arr&ecirc;ter et Red&eacute;marrer Manuellement Nagios</u></strong>
</p>

<p>
Si vous n'utilisez pas le script d'initialisation pour d&eacute;marrer Nagios, vous devrez le faire manuellement.
D'abord vous devrez trouver l'identifiant du processus Nagios et utiliser la commande <i>kill</i> pour arr&ecirc;ter l'application ou recharger les donn&eacute;es de configuration en envoyant le bon signal. Les instructions relatives &agrave; ces op&eacute;rations se trouvent ci-dessous...
</p>

<p>
<strong><u>Trouver l'identifiant du processus Nagios</u></strong>
</p>

<p>
Il faut d'abord conna&icirc;tre le num&eacute;ro du processus de Nagios. Pour cela, taper juste la commande suivante :
</p>
<p>
<strong><font color="red">ps axu | grep nagios</font></strong>
</p>
<p>
Vous devriez obtenir quelque chose qui ressemble a ca :
<pre>
nagios  6808  0.0  0.7   840   352  p3 S    13:44   0:00 grep nagios
nagios 11149  0.2  1.0   868   488  ?  S   Feb 27   6:33 /usr/local/nagios/bin/nagios nagios.cfg
</pre>
De ces informations, vous d&eacute;duisez que Nagios a &eacute;t&eacute; lanc&eacute; par l'utilisateur <b>nagios</b> et qu'il tourne sous l'identifiant de processus <b>11149</b>.
</p>

<p>
<strong><u>Stopper Manuellement Nagios</u></strong>
</p>

<p>
Pour arr&ecirc;ter Nagios, utilisez la commande <i>kill</i> comme suit...
</p>
<p>
<strong><font color="red">kill 11149</font></strong>
</p>
<p>
Vous devrez remplacer <b>11149</b> par l'identifiant du processus Nagios de votre machine.
</p>

<p>
<strong><u>Red&eacute;marrer Manuellement Nagios</u></strong>
</p>

<p>
Si vous avez modifi&eacute; les donn&eacute;es de configuration, vous voudrez red&eacute;marrer Nagios et lui faire relire la nouvelle configuration.
Si vous avez chang&eacute; le code source et recompil&eacute; l'ex&eacute;cutable principal nagios, vous ne <i>devez pas</i> utiliser cette m&eacute;thode.
Il vaut mieux arr&ecirc;ter Nagios avec la commande kill (cf. plus haut) et le red&eacute;marrer manuellement.
Red&eacute;marrer Nagios en utilisant la m&eacute;thode ci-dessous ne recharge pas r&eacute;ellement Nagios - cela le force &agrave; purger son fichier de configuration, relire le nouveau et reprendre la supervision.
Pour red&eacute;marrer Nagios, vous aurez besoin d'envoyer le signal <b>SIGHUP</b> &agrave; Nagios.
En supposant que Nagios tourne sous l'identifiant de processus 11149 (en prenant l'exemple ci-dessus), il faut utiliser la commande suivante :
</p>
<p>
<strong><font color="red">kill -HUP 11149</font></strong>
</p>
<p>
Souvenez-vous que vous aurez besoin de remplacer <b>11149</b> avec l'identifiant du processus Nagios qui tourne sur votre machine.
</p>


<hr>

</body>
</html>