<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Configuration des objets par h&eacute;ritage via les mod&egrave;les</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Configuration des objets par h&eacute;ritage via les mod&egrave;les</h2>
</div>
</p>
<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Cette partie de la documentation tente d'expliquer la configuration des objets par h&eacute;ritage et comment ils sont utiliser dans <a href="xodtemplate.html">la configuration des objets bas&eacute; sur des mod&egrave;les</a>.
</p>

<p>
Une de mes motivations majeures en ajoutant un support pour la configuration des objets via des mod&egrave;les &eacute;tait de fournir l'h&eacute;ritage de propri&eacute;t&eacute;s depuis d'autres d&eacute;finitions d'objets.
L'h&eacute;ritage de propri&eacute;t&eacute;s d'objets s'accomplit de mani&egrave;re r&eacute;cursive lors de la lecture des fichiers de configurations par Nagios.
</p>

<p>
Si vous avez encore des doutes sur les principes de r&eacute;cursion ou d'h&eacute;ritage apr&egrave;s la lecture de ce document, regardez les exemples de configuration dans le paquetage. 
Si cela ne vous suffit pas, envoyer un email avec une description d&eacute;taill&eacute;e de votre probl&egrave;me sur la liste de diffusion <i>nagios-users</i>[NdT : liste de diffusion en anglais, pour un support en fran&ccedil;ais vous pouvez aller sur <a href="http://forums.opsyx.com/">http://forums.opsyx.com/</a>].
</p>

<p>
<strong><u>Les concepts de base</u></strong>
</p>

<p>
Il y a trois variables concernant le principe de r&eacute;cursion et d'h&eacute;ritage qui sont disponibles dans toutes d&eacute;finitions d'objets. 
Elles sont indiqu&eacute;es en rouge dans ce qui suit...
</p>

<p>
<pre>
	define <i>someobjecttype</i>{
		<i>object-specific variables</i> ...
		<font color="red">name		<i>template_name</i></font>
		<font color="red">use		<i>name_of_template_to_use</i></font>
		<font color="red">register	[0/1]</font>
		}
</pre>
</p>

<p>
La premi&egrave;re variable est <i>name</i>. 
C'est simplement un nom pour faire r&eacute;f&eacute;rence au "mod&egrave;le" dans d'autres d&eacute;finitions d'objets qui, dans ce cas, h&eacute;ritent des propri&eacute;t&eacute;s/variables des objets.
Le nom du mod&egrave;le doit &ecirc;tre unique dans tous les objets du m&ecirc;me type, vous ne pouvez pas avoir deux ou plus de d&eacute;finitions d'h&ocirc;te qui ont "hosttemplate" comme nom de mod&egrave;les.
</p>

<p>
La seconde variable est <i>use</i>. 
C'est la variable qui permet de sp&eacute;cifier le nom du mod&egrave;le duquel vous voulez h&eacute;riter les propri&eacute;t&eacute;s/variables.
Le nom que vous sp&eacute;cifiez pour cette variable doit &ecirc;tre d&eacute;fini dans un autre mod&egrave;le d'objet (en utilisant la variable <i>name</i>).
</p>

<p>
La troisi&egrave;me variable est <i>register</i>.
Cette variable est utilis&eacute;e pour indiquer si oui ou non la d&eacute;finition de l'objet devrait &ecirc;tre "enregistr&eacute;e" avec Nagios.
Par d&eacute;faut, toutes les d&eacute;finitions d'objet sont enregistr&eacute;es.
Si vous utilisez une d&eacute;finition partielle d'objet comme mod&egrave;le, vous souhaiterz &eacute;viter l'enregistrer (un exemple est fourni par la suite). 
Les valeurs sont: 0 = NE PAS enregistrer la d&eacute;finition de l'objet, 1 = enregistrer la d&eacute;finition (la valeur par d&eacute;faut).
Cette variable n'est pas h&eacute;rit&eacute;e; chaque d&eacute;finition d'objet (m&ecirc;me partielle) utilis&eacute;e comme template doit explicitement mettre la variable <i>register</i> &agrave; <i>0</i>.
Ceci permet d'&eacute;viter de sp&eacute;cifier la directive <i>register</i> &agrave; <i>1</i> pour chaque objet qui doit &ecirc;tre enregistr&eacute; [NdT : je comprends la phrase mais j'arrive pas &agrave; trouver une bonne traduction ! :(].
</p>

<p>
<strong><u>Variables locales versus variables h&eacute;rit&eacute;es</u></strong>
</p>

<p>
Une des choses importante &agrave; comprendre avec l'h&eacute;ritage est que les variables locales d'un objet sont toujours prioritaires par rapport &agrave; celles d&eacute;finies dans le mod&egrave;le.
Regardez l'exemple suivant contenant deux d&eacute;finitions d'h&ocirc;tes (l'ensemble des variables n&eacute;cessaires au bon fonctionnement n'a pas &eacute;t&eacute; pr&eacute;sent&eacute;).
</p>

<p>
<pre>
	define host{
		host_name		bighost1
		check_command		check-host-alive
		notification_options	d,u,r
		max_check_attempts	5
		<font color="red">name			hosttemplate1</font>
		}

	define host{
		host_name		bighost2
		max_check_attempts	3
		<font color="red">use			hosttemplate1</font>
		}
</pre>
</p>

<p>
Vous remarquerez que la d&eacute;finition de l'h&ocirc;te <i>bighost1</i> a &eacute;t&eacute; d&eacute;finie avec <i>hosttemplate1</i> comme nom de mod&egrave;le.
La d&eacute;finition de l'h&ocirc;te <i>bighost2</i> utilise la d&eacute;finition de <i>bighost1</i> comme mod&egrave;le d'objet.
Une fois que Nagios a analys&eacute; ces donn&eacute;es, la d&eacute;finition de l'h&ocirc;te <i>bighost2</i> devrait &ecirc;tre &eacute;quivalente &agrave; la d&eacute;finition suivante :
</p>

<p>
<pre>
	define host{
		host_name		bighost2
		check_command		check-host-alive
		notification_options	d,u,r
		max_check_attempts	3
		}
</pre>
</p>

<p>
Vous pouvez voir que les variables <i>check_command</i> et <i>notification_options</i> sont h&eacute;rit&eacute;es depuis le mod&egrave;le d'objet (o&ugrave; l'h&ocirc;te <i>bighost1</i> est d&eacute;fini).
Cependant, les variables <i>host_name</i> et <i>max_check_attempts</i> ne sont pas h&eacute;rit&eacute;es depuis le mod&egrave;le parce qu'elles ont &eacute;t&eacute; d&eacute;finies localement.
Souvenez-vous, les variables d&eacute;finies localement surchargent les variables qui normalement devraient &ecirc;tre h&eacute;rit&eacute;es depuis le mod&egrave;le. 
Cela devrait &ecirc;tre un concept assez simple &agrave; comprendre.
</p>

<p>
<strong><u>L'h&eacute;ritage en cha&icirc;ne</u></strong>
</p>

<p>
Les objets peuvent h&eacute;riter de propri&eacute;t&eacute;s/variables &agrave; travers plusieurs niveaux de mod&egrave;les d'objets.
Regardez l'exemple suivant :
</p>

<p>
<pre>
	define host{
		host_name		bighost1
		check_command		check-host-alive
		notification_options	d,u,r
		max_check_attempts	5
		<font color="red">name			hosttemplate1</font>
		}

	define host{
		host_name		bighost2
		max_check_attempts	3
		<font color="red">use			hosttemplate1</font>
		<font color="red">name			hosttemplate2</font>
		}

	define host{
		host_name		bighost3
		<font color="red">use			hosttemplate2</font>
		}
</pre>
</p>

<p>
Vous pouvez remarquer que la d&eacute;finition de l'h&ocirc;te <i>bighost3</i> h&eacute;rite de variables depuis la d&eacute;finition d'h&ocirc;te <i>bighost2</i>, laquelle h&eacute;rite de variables depuis la d&eacute;finition d'h&ocirc;te <i>bighost1</i>.
Une fois que Nagios a analys&eacute; ces donn&eacute;es, les d&eacute;fintions des h&ocirc;tes devraient &ecirc;tre &eacute;quivalentes &agrave; celle-ci :
</p>


<p>
<pre>
	define host{
		host_name		bighost1
		check_command		check-host-alive
		notification_options	d,u,r
		max_check_attempts	5
		}

	define host{
		host_name		bighost2
		check_command		check-host-alive
		notification_options	d,u,r
		max_check_attempts	3
		}

	define host{
		host_name		bighost3
		check_command		check-host-alive
		notification_options	d,u,r
		max_check_attempts	3
		}
</pre>
</p>

<p>
Il n'y a aucune limite d'h&eacute;ritage sur la "profondeur" de l'h&eacute;ritage, mais vous voudrez probablement vous limiter vous-m&ecirc;me &agrave; quelques niveaux pour une gestion plus saine.
</p>

<p>
<strong><u>Utiliser des d&eacute;finitions incompl&egrave;te d'h&ocirc;te comme mod&egrave;le</u></strong>
</p>

<p>
Il est possible d'utiliser des d&eacute;finitions incompl&egrave;te d'objets comme mod&egrave;le.
Par "d&eacute;finition incompl&egrave;te", j'entends que toutes les variables n&eacute;cessaires &agrave; un objet n'ont pas &eacute;t&eacute; fournies dans la d&eacute;finition.
Capeut sembler bizarre d'utiliser une d&eacute;finition incompl&egrave;te comme mod&egrave;le, pourtant c'est en effet ce que je vous recommande d'utiliser.
Pourquoi ? Et bien, cela peut &ecirc;tre vu comme un ensemble de valeurs par d&eacute;faut utilis&eacute;es par toutes les d&eacute;finitions d'objets.
Prenez l'exemple qui suit :
</p>

<p>
<pre>
	define host{
		check_command		check-host-alive
		notification_options	d,u,r
		max_check_attempts	5
		<font color="red">name			generichosttemplate</font>
		<font color="red">register			0</font>
		}

	define host{
		host_name		bighost1
		address			192.168.1.3
		<font color="red">use			generichosthosttemplate</font>
		}

	define host{
		host_name		bighost2
		address			192.168.1.4
		<font color="red">use			generichosthosttemplate</font>
		}
</pre>
</p>

<p>
Remarquez que la premi&egrave;re d&eacute;finition est incompl&egrave;te car il manque la variable <i>host_name</i> n&eacute;cessaire. 
Nous n'avons pas besoin de fournir le nom d'h&ocirc;te car nous voulons simplement utiliser cette d&eacute;finition comme un mod&egrave;le g&eacute;n&eacute;rique.
Dans le but d'&eacute;viter que cette d&eacute;finition soit enregistr&eacute;e par Nagios comme celle d'un h&ocirc;te traditionnel, nous affectons 0 &agrave; la variable <i>register</i>.
</p>

<p>
Les d&eacute;finitions des h&ocirc;tes <i>bighost1</i> et <i>bighost2</i> h&eacute;ritent des variables d&eacute;finies dans l'h&ocirc;te g&eacute;n&eacute;rique.
La seule variable que nous avons choisie de surcharger est la variable <i>addres</i>s afin que les deux h&ocirc;tes aient exactement les m&ecirc;mes propi&eacute;t&eacute;s en dehors de leurs variables <i>host_name</i> et <i>address</i>.
Une fois que Nagios a analys&eacute; ces donn&eacute;es, les d&eacute;finitions des h&ocirc;tes devraient &ecirc;tre &eacute;quivalentes &agrave; ceci :
</p>

<p>
<pre>
	define host{
		host_name		bighost1
		address			192.168.1.3
		check_command		check-host-alive
		notification_options	d,u,r
		max_check_attempts	5
		}

	define host{
		host_name		bighost2
		address			192.168.1.4
		check_command		check-host-alive
		notification_options	d,u,r
		max_check_attempts	5
		}
</pre>
</p>


<p>
Enfin, l'utilisation de mod&egrave;le pour les variables par d&eacute;faut fait gagner un temps pr&eacute;cieux.
Cela vous &eacute;vitera aussi de vous casse la t&ecirc;te si vous voulez changer des valeurs par d&eacute;faut pour un grand nombre d'h&ocirc;tes.
</p>



<hr>

</body>
</html>
