
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>R&eacute;gler Nagios pour des performances maximales</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">R&eacute;gler Nagios pour des performances maximales</h2>

</div>
</p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Maintenant que vous avez pu installer et lancer Nagios, vous voulez savoir comment le r&eacute;gler plus finement... Voici quelques points &agrave; prendre en compte pour optimiser Nagios. Faites moi savoir si vous en trouvez d'autres...
</p>

<p><strong>Trucs et astuces d'optimisation :</strong></p>

<p>
<ol>

<li><b>Utilisez des changements d'&eacute;tat agr&eacute;g&eacute;s</b>. En activant la consolidation des changements d'&eacute;tat (gr&acirc;ce au param&egrave;tre <a href="configmain.html#aggregate_status_updates">aggregate_status_updates</a>), vous r&eacute;duirez consid&eacute;rablement la charge sur votre h&ocirc;te de supervision, car il n'essaiera pas constamment de mettre &agrave; jour le <a href="configmain.html#status_file">journal des &eacute;tats</a>. Ceci est particuli&egrave;rement vrai si vous supervisez un grand nombre de services. La principale contrepartie lorsque vous agr&eacute;gez les changements d'&eacute;tat est que les modifications d'&eacute;tat des h&ocirc;tes et des services ne sont pas imm&eacute;diatement r&eacute;pliqu&eacute;es dans le fichier d'&eacute;tat. Ceci peut vous poser probl&egrave;me, ou pas.<br /><br />

<li><b>Utilisez un disque virtuel [NdT : ramdisk] pour conserver les donn&eacute;es d'&eacute;tat</b>. Si vous utilisez le <a href="configmain.html#status_file">journal des &eacute;tats</a> standard et que vous n'utilisez <i>pas</i> l'agr&eacute;gation des changements d'&eacute;tat, pensez &agrave; mettre le r&eacute;pertoire o&ugrave; le journal des &eacute;tats est stock&eacute; sur un disque virtuel en m&eacute;moire. Cela acc&eacute;l&eacute;rera pas mal les choses (&agrave; la fois pour le programme principal et les CGI) parce que cela &eacute;vite beaucoup d'interruptions et d'acc&egrave;s au disque.<br /><br />


<li><b>V&eacute;rifiez la latence des services pour d&eacute;terminer la meilleure valeur pour le nombre maximal de contr&ocirc;les en parall&egrave;le</b>. Nagios peut restreindre le nombre maximal de contr&ocirc;les de service ex&eacute;cut&eacute;s en parall&egrave;le &agrave; la valeur que vous sp&eacute;cifiez dans le param&egrave;tre <a href="configmain.html#max_concurrent_checks">max_concurrent_checks</a>. Cela vous permet de g&eacute;rer la charge que Nagios impose &agrave; votre h&ocirc;te de supervision, mais cela peut aussi ralentir le traitement. Si vous notez des latences importantes (> 10 ou 15 secondes) pour la majorit&eacute; de vos contr&ocirc;les de service (via le <a href="cgis.html#extinfo_cgi">CGI d'informations compl&eacute;mentaires</a>), vous privez sans doute Nagios des contr&ocirc;les dont il a besoin. Ce n'est pas la faute de Nagios - c'est la v&ocirc;tre. Dans des conditions id&eacute;ales, tous les contr&ocirc;les de service ont une latence de 0, ce qui signifie qu'ils sont ex&eacute;cut&eacute;s au moment pr&eacute;cis o&ugrave; ils ont &eacute;t&eacute; ordonnanc&eacute;s. Ceci dit, il est normal que certains contr&ocirc;les aient de petites latences. Je recommanderais de doubler la valeur que propose Nagios pour le nombre minimal de contr&ocirc;les en parall&egrave;le, fournie lorsque Nagios est lanc&eacute; avec le param&egrave;tre <b>-s</b>. Continuez &agrave; augmenter cette valeur tant que la latence moyenne pour vos services reste assez basse. Vous trouverez plus d'informations sur l'ordonnancement des contr&ocirc;les de service <a href="checkscheduling.html">ici</a>.<br /><br />

<li><b>Utilisez des contr&ocirc;les passifs &agrave; chaque fois que c'est possible</b>. La surcharge induite par le traitement des r&eacute;sultats des <a href="passivechecks.html">contr&ocirc;les passifs de service</a> est bien moindre que celle des contr&ocirc;les actifs "normaux", donc prenez cette information en compte si vous supervisez de nombreux services. Notez que les contr&ocirc;les passifs de service ne sont r&eacute;ellement utiles que si une application externe r&eacute;alise une partie de la supervision ou produit des rapports ; si c'est Nagios qui r&eacute;alise tout le travail, ceci ne changera rien.<br /><br />

<li><b>Evitez l'utilisation des plugins interpr&eacute;t&eacute;s.</b> L'utilisation de plugins compil&eacute;s (C/C++, etc.) r&eacute;duira significativement la charge de votre h&ocirc;te de supervision par rapport aux scripts interpr&eacute;t&eacute;s (Perl, etc.). Si les scripts Perl ou autres sont faciles &agrave; &eacute;crire et fonctionnent bien, le fait qu'ils soient compil&eacute;s/interpr&eacute;t&eacute;s &agrave; chaque ex&eacute;cution peut augmenter consid&eacute;rablement la charge de votre h&ocirc;te de supervision lorsque vous avez de nombreux contr&ocirc;les de service. Si vous souhaitez utiliser des plugins Perl, essayez de les compiler en vrais ex&eacute;cutables gr&acirc;ce &agrave; perlcc(1) (un utilitaire qui fait partie de la distribution Perl standard) ou essayez de compiler Nagios avec un interpr&eacute;teur Perl int&eacute;gr&eacute; (voir ci-dessous).<br /><br />

<li><b>Utilisez l'interpr&eacute;teur Perl int&eacute;gr&eacute;.</b> Si vous utilisez de nombreux scripts Perl pour les contr&ocirc;les de service, etc., vous vous apercevrez sans doute qu'en compilant Nagios avec un interpr&eacute;teur Perl int&eacute;gr&eacute; vous acc&eacute;l&eacute;rez les traitements. Pour compiler l'interpr&eacute;teur Perl int&eacute;gr&eacute;, vous devez ajouter le param&egrave;tre <i>--enable-embedded-perl</i> au script de configuration [NdT : ./configure] avant de compiler Nagios. De m&ecirc;me, si vous ajoutez le param&egrave;tre <i>--with-perlcache</i>, la version compil&eacute;e de tous les scripts Perl ex&eacute;cut&eacute;s par l'interpr&eacute;teur Perl int&eacute;gr&eacute; sera mise en cache pour r&eacute;utilisation.<br /><br />

<li><b>Optimisez les commandes de contr&ocirc;le d'h&ocirc;te.</b> Si vous contr&ocirc;lez l'&eacute;tat des h&ocirc;tes avec le plugin check_ping, vous vous apercevrez que ces contr&ocirc;les se font bien plus vite en les &eacute;clatant. Plut&ocirc;t que de sp&eacute;cifier une valeur de 1 pour le param&eacute;tre <i>max_attempts</i> dans la d&eacute;finition de l'h&ocirc;te et de dire au plugin check_ping d'envoyer 10 paquets ICMP &agrave; l'h&ocirc;te, il est bien plus rapide de passer max_attempts &agrave; 10 et de n'envoyer qu'un paquet ICMP &agrave; chaque fois. Ceci est d&ucirc; au fait que Nagios peut souvent d&eacute;terminer l'&eacute;tat d'un h&ocirc;te apr&egrave;s n'avoir ex&eacute;cut&eacute; le plugin qu'une fois, il vaut donc mieux que le premier contr&ocirc;le soit le plus rapide possible. Cette m&eacute;thode pr&eacute;sente des inconv&eacute;nients dans certaines situations (c.-&agrave;-d. que les h&ocirc;tes lents &agrave; r&eacute;pondre peuvent &ecirc;tre consid&eacute;r&eacute;s comme hors service), mais vous aurez des contr&ocirc;les d'h&ocirc;te plus rapides si vous l'utilisez. Vous pouvez aussi utiliser un plugin plus rapide (c.-&agrave;-d. check_fping) dans le param&egrave;tre <i>host_check_command</i> plut&ocirc;t que check_ping.<br /><br />

<li><b>Ne planifiez pas une v&eacute;rification r&eacute;guli&egrave;re des h&ocirc;tes</b>.  Il ne faut PAS planifier des v&eacute;rifications r&eacute;guli&egrave;res d'h&ocirc;tes &agrave; moins que ce ne soit absolument n&eacute;cessaire. Il n'y a pas beaucoup de raisons de faire cela, car les v&eacute;rifications d'h&ocirc;tes sont effectu&eacute;es &agrave; la demande lorsque c'est n&eacute;cessaire. Pour d&eacute;sactiver la v&eacute;rification r&eacute;guli&egrave;re d'un h&ocirc;te, mettez 0 &agrave; la directive <i>check_interval</i> dans la <a href="xodtemplate.html#host">d&eacute;finition d'h&ocirc;te</a>. Si vous avez besoin de v&eacute;rifier r&eacute;guli&egrave;rement les h&ocirc;tes, essayez de mettre un intervalle de v&eacute;rification plus grand et v&eacute;rifiez que vos v&eacute;rifications sont optimis&eacute;es (voir plus haut).<br /><br />

<li><b>N'utilisez pas le contr&ocirc;le agressif des h&ocirc;tes.</b> Sauf si Nagios a du mal &agrave; identifier les r&eacute;tablissements d'h&ocirc;te, je recommanderais de <i>ne pas</i> activer le param&egrave;tre <a href="configmain.html#use_aggressive_host_checking">use_aggressive_host_checking</a>. Quand cette option est d&eacute;sactiv&eacute;e, les contr&ocirc;les s'ex&eacute;cutent beaucoup plus vite, acc&eacute;l&eacute;rant le traitement des r&eacute;sultats de contr&ocirc;les de service. Cependant, les r&eacute;tablissements d'h&ocirc;tes peuvent &ecirc;tre manqu&eacute;s en certaines circonstances lorsque l'option est d&eacute;sactiv&eacute;e. Par exemple, si un h&ocirc;te se r&eacute;tablit et que tous les services associ&eacute;s &agrave; cet h&ocirc;te restent dans un &eacute;tat non-OK (et ne "bagotent" pas entre diff&eacute;rents &eacute;tats non-OK), Nagios peut ne pas voir que l'h&ocirc;te s'est r&eacute;tabli. Certains utilisateurs peuvent avoir besoin d'activer cette option, mais ce n'est pas le cas pour la majorit&eacute;, et je recommanderais de <i>ne pas</i> l'utiliser si vous n'en avez pas express&eacute;ment besoin...<br /><br />

<li><b>Augmentez l'intervalle de v&eacute;rification des commandes externes.</b> Si vous g&eacute;rez beaucoup de commandes externes (p. ex. des v&eacute;rifications passives dans une <a href="distributed.html">supervision distribu&eacute;e</a>), vous devrez probablement affecter <b>-1</b> au param&egrave;tre <a href="configmain.html#command_check_interval">command_check_interval</a>. Cela forcera Nagios &agrave; v&eacute;rifier les commandes externes aussi souvent que possible. C'est important parce que la plupart des syst&egrave;mes ont une petite taille de tampon pour les tubes de redirections [NdT : pipe] (c.-&agrave;-d. 4 Ko). Si Nagios ne lit pas les donn&eacute;es depuis le tube le plus rapidement possible, l'application qui &eacute;crit dans le fichier de commandes externes (p. ex. le <a href="addons.html#nsca">d&eacute;mon NSCA</a>) se bloquera et attendra jusqu'&agrave; ce qu'il y ait assez d'espace libre dans le tube pour &eacute;crire ses donn&eacute;es.<br /><br />

<li><b>Optimisez le mat&eacute;riel pour des performances maximales.</b> La configuration mat&eacute;rielle va affecter directement les performances de votre syst&egrave;me d'exploitation, et donc celles de Nagios. L'am&eacute;lioration principale que vous puissiez r&eacute;aliser concerne les disques durs. La vitesse du processeur et la m&eacute;moire affectent bien &eacute;videmment les performances, mais les acc&egrave;s disque seront votre goulet d'&eacute;tranglement le plus fr&eacute;quent. Ne stockez pas les plugins, le journal des &eacute;tats, etc. sur des disques lents (c.-&agrave;-d. des vieux disques IDE ou des montages NFS). Si vous en avez, utilisez des disques UltraSCSI ou des disques IDE rapides. Une remarque importante pour les utilisateurs de IDE/Linux : bien des installations de Linux n'essaient pas d'optimiser les acc&egrave;s au disque. Si vous ne changez pas les param&egrave;tres d'acc&egrave;s au disque (en utilisant un utilitaire comme <b>hdparam</b>), vous perdrez <b>beaucoup</b> des fonctionnalit&eacute;s am&eacute;liorant la vitesse des nouveaux disques IDE.

</ol>
</p>


<hr>

</body>
</html>
