
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>V&eacute;rifier votre configuration de Nagios</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">V&eacute;rifier votre configuration de Nagios</h2>
</div>
</p>
<hr>

<p>
<strong><u>V&eacute;rification de la Configuration en Ligne de Commande</u></strong>
</p>

<p>
Une fois que vous avez saisi toutes les informations n&eacute;cessaires dans  <a href="config.html">le fichier de configuration</a>, il est temps de faire un contr&ocirc;le "sanitaire".
Tout le monde commet des erreurs de temps en temps, il vaut donc mieux v&eacute;rifier ce que vous avez saisi.
Nagios ex&eacute;cute automatiquement un "contr&ocirc;le avant le d&eacute;collage" avant de commencer &agrave; superviser, mais vous pouvez aussi lancer ce contr&ocirc;le manuellement avant d'essayer de lancer la supervision.
Pour cela, vous devez, sur la ligne de commande, lancer Nagios avec l'argument de ligne de commande <b>-v</b> comme suit...
</p>
<p>
<strong><font color="red">/usr/local/nagios/bin/nagios -v &lt;fichier_de_configuration_principal&gt;</font></strong>
</p>

<p>
Notez que vous devez sp&eacute;cifier le chemin/nom de votre fichier de configuration principal (i.e.<i>/usr/local/nagios/etc/nagios.cfg</i>) comme second argument.
Nagios lira votre <a href="configmain.html">fichier de configuration principal</a> et tous vos <a href="configobject.html">fichiers de configuration des objets</a> et v&eacute;rifiera qu'ils contiennent des donn&eacute;es valides.
</p>

<p>
<strong><u>Relations V&eacute;rifi&eacute;es au Cours du "Contr&ocirc;le Avant D&eacute;collage"</u></strong>
</p>

<p>
Au cours du "contr&ocirc;le avant d&eacute;collage", Nagios v&eacute;rifie que vous avez d&eacute;fini les relations entre les donn&eacute;es n&eacute;cessaires &agrave; la supervision.
Les objets sont tous li&eacute;s et doivent &ecirc;tre correctement d&eacute;finis pour que les choses fonctionnent. 
Voici une liste des contr&ocirc;les de base que tente d'effectuer Nagios avant de commencer la supervision...
</p>

<p>
<ol>
<li>V&eacute;rifier que tous les contacts sont membres d'au moins un groupe de contacts.
<li>V&eacute;rifier que tous les contacts sp&eacute;cifi&eacute;s dans chaque groupe de contacts sont valides.
<li>V&eacute;rifier que tous les h&ocirc;tes sont membres d'au moins un groupe d'h&ocirc;tes.
<li>V&eacute;rifier que tous les h&ocirc;tes sp&eacute;cifi&eacute;s dans chaque groupe d'h&ocirc;tes sont valides.
<li>V&eacute;rifier que tous les h&ocirc;tes sont associ&eacute;s &agrave; au moins un service.
<li>V&eacute;rifier que toutes les commandes utilis&eacute;es dans les contr&ocirc;les de services et d'h&ocirc;tes sont valides.
<li>V&eacute;rifier que toutes les commandes utilis&eacute;es dans les gestionnaires d'&eacute;v&eacute;nement de services et d'h&ocirc;tes sont valides.
<li>V&eacute;rifier que toutes les commandes utilis&eacute;es dans les notifications de contacts, services et h&ocirc;tes sont valides.
<li>V&eacute;rifier que toutes les p&eacute;riodes de notification sp&eacute;cifi&eacute;es pour les services, h&ocirc;tes et contacts sont valides.
<li>V&eacute;rifier que toutes les p&eacute;riodes de contr&ocirc;le de service sp&eacute;cifi&eacute;es pour les services sont valides.
</ol>
</p>

<p>
<strong><u>Correction des Erreurs de Configuration</u></strong>
</p>

<p>
Si vous avez oubli&eacute; de saisir des donn&eacute;es critiques ou si vous vous &ecirc;tes tout simplement m&eacute;lang&eacute; les pinceaux, Nagios affichera un message d'alerte ou d'erreur vous donnant la localisation de l'erreur.
Les messages d'erreur contiennent g&eacute;n&eacute;ralement la ligne du fichier de configuration qui semble &ecirc;tre &agrave; l'origine du probl&egrave;me.
En cas d'erreur, Nagios sortira souvent du "contr&ocirc;le avant d&eacute;collage" et retournera &agrave; l'invite de commande apr&egrave;s avoir affich&eacute; seulement la premi&egrave;re erreur qu'il a rencontr&eacute;e. 
Ceci afin qu'une erreur n'en entra&icirc;ne pas de multiples autres au fur et &agrave; mesure que le reste de la configuration est v&eacute;rifi&eacute;e.
Si vous recevez des messages d'erreur, vous devrez modifier vos fichiers de configuration pour y rem&eacute;dier. 
Les messages d'avertissement peuvent g&eacute;n&eacute;ralement &ecirc;tre ignor&eacute;s sans risque, car il s'agit de recommandations et non d'obligations.  
</p>

<p>
<strong><u>Que faire maintenant</u></strong>
</p>

<p>
Une fois que vous aurez v&eacute;rifi&eacute; et corrig&eacute; vos fichiers de configuration, vous pouvez &ecirc;tre assur&eacute; que Nagios commencera la supervision des services que vous avez sp&eacute;cifi&eacute;. Passons maintenant &agrave; <a href="starting.html">D&eacute;marrer Nagios</a>!
</p>

<hr>

</body>
</html>