
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Services volatiles</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Services volatiles</h2>
</div>
</p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Nagios a la capacit&eacute; de faire la distinction entre les services "normaux" et les services "volatiles". 
L'option <i>is_volatil</i> de chaque d&eacute;finition de service vous permet de sp&eacute;cifier si ou non un service sp&eacute;cifique est volatile.
Pour la plupart des gens, la majorit&eacute; des services supervis&eacute;s sera de type non-volatile (i.e. "normal"). Toutefois, des services volatiles peuvent se r&eacute;v&eacute;ler tr&egrave;s utiles lorsqu'ils sont bien utilis&eacute;s...
</p>

<p>
<strong><u>A quoi servent-ils ?</u></strong>
</p>

<p>
Les services volatiles sont utiles pour superviser...
</p>

<p>
<ul>
<li>des choses qui se remettent automatiquement en &eacute;tat "OK" chaque fois qu'ils sont contr&ocirc;l&eacute;s
<li>des &eacute;v&eacute;nements comme les alertes de s&eacute;curit&eacute; qui r&eacute;clament de l'attention &agrave; chaque probl&egrave;me (et pas seulement la premi&egrave;re fois)
</ul>
</p>

<p>
<strong><u>Qu'est-ce que les services volatiles ont de si particulier ?</u></strong>
</p>

<p>
Les services volatiles diff&egrave;rent des services "normaux" de trois fa&ccedil;ons importantes. <i>Chaque fois</i> qu'ils sont contr&ocirc;l&eacute;s quand ils sont dans un &eacute;tat <a href="statetypes.html">hard</a> non-OK, et que le contr&ocirc;le retourne un &eacute;tat non-OK (i.e. aucun changement d'&eacute;tat n'a eu lieu)...
</p>

<p>
<ul>
<li>l'&eacute;tat non-OK du service est journalis&eacute;
<li>les contacts re?oivent notification du probl&egrave;me (si c'est <a href="notifications.html">ce qui doit &ecirc;tre fait</a>)
<li><a href="eventhandlers.html">le gestionnaire d'&eacute;v&eacute;nement</a> du service est lanc&eacute; (s'il a &eacute;t&eacute; d&eacute;fini)
</ul>
</p>

<p>
Ces &eacute;v&eacute;nements ne se produisent normalement que lorsque des services sont dans un &eacute;tat non-OK et qu'un changement d'&eacute;tat hard vient de se produire. 
En d'autre termes, ils ne se produisent que la premi&egrave;re fois que le service passe dans un &eacute;tat non-OK. 
Si des contr&ocirc;les ult&eacute;rieurs du service conduisent au m&ecirc;me &eacute;tat non-OK, il n'y a aucun changement d'&eacute;tat hard et aucun des &eacute;v&eacute;nements mentionn&eacute;s ne se reproduit.
</p>

<p>
<strong><u>La puissance de deux</u></strong>
</p>

<p>
Si vous combinez les fonctionnalit&eacute;s des services volatiles avec les <a href="passivechecks.html">contr&ocirc;les passifs</a> de service, vous pouvez faire des choses tr&egrave;s utiles. Par exemple, g&eacute;rer des traps SNMP, des alertes de s&eacute;curit&eacute;, etc.
</p>

<p>
Que diriez-vous d'un exemple ?... 
Disons que vous ex&eacute;cutiez le produit <a href="http://sourceforge.net/projects/sentrytools/">PortSentry</a> pour scanner les ports de votre machine et les intrus potentiels.
Si vous voulez que Nagios soit averti des scans de ports, vous pouvez mettre en place ce qui suit...
</p>

<p>
<font color="red"><b>Dans Nagios:</b></font>
</p>

<p>
<ul>
<li>Configurez un service appel&eacute; <i>Port Scans</i> et associez-le avec l'h&ocirc;te sur lequel tourne PortSentry.
<li>Mettez l'option <i>max_check_attempts</i> de la d&eacute;finition du service &agrave; 1. Ceci dira &agrave; Nagios de passer imm&eacute;diatement le service en &eacute;tat <a href="statetypes.html">hard</a> quand un &eacute;tat non-OK est retourn&eacute;.
<li>Mettez l'option <i>active_check_enabled</i> &agrave; 0 ou mettez l'option <i>check_time</i> de la d&eacute;finition du service &agrave; une <a href="timeperiods.html">p&eacute;riode</a> qui ne contient <i>aucune</i> plage de temps valide. Cela &eacute;vitera que Nagios ne contr&ocirc;le activement le service. M&ecirc;me si le contr&ocirc;le du service est ordonnanc&eacute;, il ne sera jamais r&eacute;ellement contr&ocirc;l&eacute;.
</ul>
</p>

<p>
<font color="red"><b>Dans PortSentry:</b></font>
</p>

<p>
<ul>
<li>Modifiez votre fichier de configuration de PortSentry (portsentry.conf), et d&eacute;finissez une commande pour la directive <b>KILL_RUN_CMD</b> comme suit ::<br /><br />
 <font color="red">KILL_RUN_CMD="/usr/local/Nagios/libexec/eventhandlers/submit_check_result <i>&lt;host_name&gt;</i> 'Port Scans' 2 'Port scan from host $TARGET$ on port $PORT$.  Host has been firewalled.'"</font>
<br /><br />
Assurez-vous de remplacer <i>&lt;host_name&gt;</i> avec le nom court de l'h&ocirc;te avec lequel le service est associ&eacute;.
</ul>
</p>

<p>
Cr&eacute;ez un script Shell dans le r&eacute;pertoire <i>/usr/local/nagios/libexec/eventhandlers</i> que vous appelez <i>submit_check_result</i>. Le contenu de ce script Shell doit ressembler &agrave; ceci...
</p>

<p>
<font size=-1>
<pre>
	#!/bin/sh
 
	# Write a command to the Nagios command file to cause
	# it to process a service check result
 
	echocmd="/bin/echo"
 
	CommandFile="/usr/local/nagios/var/rw/nagios.cmd"
 
	# get the current date/time in seconds since UNIX epoch
	datetime=`date +%s`
 
	# create the command line to add to the command file
	cmdline="[$datetime] PROCESS_SERVICE_CHECK_RESULT;$1;$2;$3;$4"
 
	# append the command to the end of the command file
	`$echocmd $cmdline >> $CommandFile`
</pre>
</font> 
</p>

<p>
Notez que si vous ex&eacute;cutez PortSentry en tant que root, vous devrez ajouter au script la modification du propri&eacute;taire du fichier et les permissions de fa&ccedil;on &agrave; ce que Nagios et les CGI puissent lire/modifier le fichier de commande. Vous trouverez des d&eacute;tails sur les permissions/l'appartenance du fichier de commande <a href="commandfile.html">ici</a>.
</p>

<p>
Et donc qu'arrive-t'il lorsque PortSentry d&eacute;tecte un scan de port sur la machine?
</p>

<p>
<ul>
<li>Il bloque l'h&ocirc;te (c'est une fonction du logiciel PortSentry)
<li>Il ex&eacute;cute le script <i>submit_check_result</i> pour envoyer l'information d'alerte de s&eacute;curit&eacute; &agrave; Nagios
<li>Nagios lit le fichier de commande, reconna&icirc;t l'entr&eacute;e du scan de port comme un contr&ocirc;le passif de service
<li>Nagios traite les r&eacute;sultats du service en journalisant l'&eacute;tat CRITICAL, en envoyant des notifications aux contacts (s'il a &eacute;t&eacute; configur&eacute; pour le faire), et ex&eacute;cute le gestionnaire d'&eacute;v&eacute;nement pour le service <i>Port Scans</i> (s'il a &eacute;t&eacute; d&eacute;fini).
</ul>
</p>

<hr>

</body>
</html>
