Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: This field give you the possibility to select all hostgroups and all hosts contained into the selected hostgroups implied by this downtime
de: Mit dieser Option können alle Hostgruppen und alle darin befindlichen Hosts ausgewählt werden, die eine Verbindung zu dieser Ausfallszeit besitzen
fr: Ce champ vous donne la possibilité de choisir tous les groupes d'hôtes et tous les hôtes contenus dans le groupe d'hôte sélectionné impliqués par ce temps d'arrêt

source: This field give you the possibility to select all services implied by this downtime
de: Mit dieser Option können alle Services ausgewählt werden, die eine Verbindung zu dieser Ausfallszeit besitzen
fr: Ce champ vous donne la possibilité de choisir tous les services impliqués par cette plage de maintenance

source: This field give you the possibility to select all servicegroups and all services contained into the servicegroups implied by this downtime
de: Mit dieser Option können alle Servicegruppen und alle darin befindlichen Services ausgewählt werden, die eine Verbindung zu dieser Ausfallszeit besitzen
fr: Ce champ vous donne la possibilité de choisir tous les groupes de services et tous les services contenus dans le groupe de services sélectionné impliqués par cette plage de maintenance

source: Select the poller you would like to interact with.
de: Wähle den Poller, mit dem interagiert werden soll.
fr: Sélectionner un collecteur avec lequel vous voulez interagir.

source: Generates configuration files and stores them in cache directory.
de: Erzeugt Konfigurationsdateien und speichert diese im cache-Verzeichnis.
fr: Générer les fichiers de configuration et les enregistrer dans le dossier cache.

source: Runs the scheduler debug mode.
de: Führt den Scheduler-Debugmodus aus.
fr: Lancer le mode débogage de l'ordonnanceur.

source: Copies the generated files into the scheduler's configuration folder.
de: Kopiert die erzeugten Dateien in den Konfigurationsordner des Schedulers.
fr: Copier les fichiers générés dans le répertoire de configuration de l'ordonnanceur.

source: Restart the scheduler: Restart, Reload or External Command.
de: Startet den Scheduler neu: Neustart, neu Laden oder externen Befehl.
fr: Méthode de rechargement de la configuration : Redémarrer, Recharger ou Commande Externe.

source: Run the commands that are defined in the poller configuration page (Configuration > Centreon > Poller > Post-Restart command).
de: Führe die in der Poller-Konfigurationsseite definierten Befehle aus (Konfiguration > Centreon > Poller > Post-Neustart Befehle).
fr: Exécute la commande définie dans la configuration du collecteur (Configuration > Centreon > Poller > Post-Restart command).

source: What kind of method is needed to reach the Remote Server, HTTP or HTTPS?
de: Welche Methode muss verwendet werden, damit der Remote-Server erreicht werden kann (HTTP oder HTTPS)?
fr: Quel type de méthode est nécessaire pour contacter le Remote Server, HTTP ou HTTPS ?

source: On which TCP port is listening the Remote Server?
de: Auf welchem TCP-Port lauscht der Remote-Server?
fr: Sur quel port TCP écoute le Remote Server ?

source: If checked, it won't check the validity of the SSL certificate of the Remote Server.
de: Wenn diese Option aktiviert ist, wird die Validität des SSL-Zertifikats des Remote-Servers nicht überprüft.
fr: Si cette case est cochée, la validité du certificat SSL du Remote Server ne sera pas vérifiée.

source: If checked, it won't use the proxy configured in 'Administration > Parameters > Centreon UI' to connect to the Remote Server.
fr: Si cette case est cochée, le paramétrage du proxy dans le menu Administration > Parameters > Centreon UI' ne sera pas utilisée pour se connecter au Remote Server

source: Master Remote Server to which this server will be attached
de: Master Remote-Server, dem dieser Server zugeordnet wird
fr: Remote Server principal auquel ce collecteur sera lié

source: Additional Remote Server to which this server will be attached
de: Zusätzlicher Remote-Server, dem dieser Server zugeordnet wird
fr: Remote Server additionnel auquel ce collecteur sera lié

source: Enter the name of an active contact who have the right to 'reach API configuration' on the Central.This user will be used to call the API from the Remote to the Central.
de: Geben Sie den Namen eines Benutzers an, der dazu berechtigt ist, auf dem zentralen Server auf die API-Konfiguration zuzugreifen. Dieser Benutzer wird dazu verwendet, von einem Remote-Server API-Calls auf den zentralen Server durchzuführen.
fr: Entrez le nom d'un contact actif qui a le droit d'accéder à l'API de configuration sur le Central.Ce compte sera utilisé pour appeler l'API depuis le Remote vers le Central.

source: Enter the current password of this account.
de: Geben Sie das Passwort für diesen Account ein.
fr: Entrez le mot de passe actuel de ce compte.

source: Full URL allowing access to the API of the Centreon's central server.
de: Vollständige URL, die den Zugriff auf die API des zentralen Centreon Servers ermöglicht.
fr: URL complète permettant d'accéder à l'API du serveur central Centreon.

source: Allows to skip the SSL certificate check on the Centreon's central server.
de: Erlaubt es, die SSL-Zertifikatsüberprüfung auf Centreon's zentralem Server zu überspringen.
fr: Permet de ne pas vérifier le certificat SSL du serveur central Centreon.

source: If checked this option will restore the use of the deprecated pages.This includes display of the deprecated pages and internal redirections between pagesIf not checked this option will enable the full use of the new Monitoring page Resource Status
fr: Si l'option est activée l'utilisation des pages dépréciées sera totalement rétablieCela inclu: l'affichage des pages mais également toutes les redirections entre pages dépréciéesSi l'option n'est pas activée l'utilisation de la nouvelle page de Monitoring Resource Status sera pleinement activée

source: Expected TLS certificate common name (CN) - leave blank if unsure.
fr: Champ common name (CN) attendu dans le certificat TLS - laisser vide en cas de doute

source: No: You don't consent to share your platform data. Contact Details: You consent to share your platform data including your alias and email. Anonymized: You consent to share your platform data, but your alias and email will be anonymized.
de: Nein: Sie stimmen der Weitergabe Ihrer Plattformdaten nicht zu. Kontaktdaten: Sie stimmen der Weitergabe Ihrer Plattformdaten einschließlich Ihres Alias und Ihrer E-Mail-Adresse zu. Anonymisiert: Sie stimmen der Weitergabe Ihrer Plattformdaten zu. Ihr Alias und Ihre E-Mail-Adresse werden jedoch anonymisiert.

source: If checked this option will restore the use of the deprecated pages.This includes display of the deprecated pages and internal redirection between pagesIf not checked this option will enable the full use of the new Monitoring page Resource Status
de: Wenn diese Option aktiviert ist, wird die Verwendung der veralteten Seiten inklusive der internen Verlinkungen wiederhergestellt. Wenn diese Option nicht aktiviert ist, wird überall die neue Überwachungsseite für den Ressourcenstatus verwendet

source: Timeout value in seconds. Used to make actions calls timeout.
de: Timeout Dauer in Sekunden. Wenn diese Zeit überschritten wird, meldet eine Aktion ein Timeout.

source: Retention time for partitioned tables (data_bin, logs, log_archive_host, log_archive_service), by default 365 days.
de: Aufbewahrungszeit für partitionierte Tabellen (data_bin, logs, log_archive_host, log_archive_service). Standardwert: 365 Tage.

source: number of partitions created in advance to prevent issues, by default 10 days.
de: Anzahl der Partitionen die im Voraus erstellt werden, um Probleme zu vermeiden. Standardwert: 10 Tage.

source: Backup directory to store partition, by default /var/cache/centreon/backup.
de: Sicherungsverzeichnis für die Partition. Standardwert: /var/cache/centreon/backup.

source: I agree to participate to the Centreon Customer Experience Improvement Program whereby anonymous information about the usage of this server may be sent to Centreon. This information will solely be used to improve the software user experience. I will be able to opt-out at anytime. Refer to <a style="text-decoration: underline" href="http://ceip.centreon.com/">ceip.centreon.com</a> for further details.
de: Ich stimme zu, an dem Verbesserungsprogramm der Centreon-Kundenerfahrung teilzunehmen. Dadurch wird es ermöglicht, dass anonymisierte Informationen zur Nutzung dieses Servers an Centreon gesendet werden können. Diese Informationen werden ausschließlich dazu verwendet, die Nutzererfahrung der Software zu verbessern. Es ist mir jederzeit möglich, diese Einwilligung zu widerrufen. Weitere Informationen finden Sie unter <a style="text-decoration: underline" href="http://ceip.centreon.com/">ceip.centreon.com</a>.

source: Refresh interval used for statistics (top counters). Minimum value: 10
de: Aktualisierungsintervall für die Statistiken in der oberen Menüleiste. Minimaler Wert: 10

source: Refresh interval used in monitoring consoles. Minimum value: 10
de: Aktualisierungsintervall für Überwachungsübersichten. Minimaler Wert: 10

source: Notification inheritance for hosts and services. Vertical for the legacy mode, Close for the first valid object and Cumulative for all valid object.
de: Benachrichtigungsvererbung für Hosts und Services. Ausschließlich vertikal für den Legacy-Modus, nächster Wert für das erste gültige Objekt und Kumulativ für alle gültigen Objekte.

source: Your OpenId Connect login claim value (if empty preferred_username will be used).
de: OpenId Connect Login Variablenname (Wenn dieser Wert nicht spezifiziert wird, wird der bevorzugte Benutzername (preferred_username) verwendet). Dieser Wert legt die Variable fest, die Centreon dazu nutzt, um den Login des Benutzers zu ermitteln.

source: Your OpenId Connect redirect url (this server, {scheme}, {hostname} and {port} can be used for substitions, default is {scheme}://{hostname}:{port}/your_centreon_path/index.php if left empty).
de: OpenId Weiterleitungs-URL (Dieser Server, {scheme}, {hostname} und {port} können als Ersatzwerte genutzt werden. Wenn dieser Wert leergelassen wird, wird {scheme}://{hostname}:{port}/your_centreon_path/index.php verwendet).

source: Switch token_endpoint_auth_method from client_secret_post to client_secret_basic
de: Ändere token_endpoint_auth_method von client_secret_post auf client_secret_basic

source: User of the proxy (Only if you use basic authentication).
de: Benutzer für die Proxy-Authentifizierung (Wird nur benötigt, wenn die Basic-Authentifizierung verwendet wird).

source: Password of the proxy (Only if you use basic authentication).
de: Passwort für die Proxy-Authentifizierung (Wird nur benötigt, wenn die Basic-Authentifizierung verwendet wird).

source: Enable Centreon Broker statistics collection into the central server. Be careful: if disabled, Broker statistics will not be available into Home > Broker statistics.
de: Aktiviert die Centreon Broker Statistiksammlung zum zentralen Server. Vorsicht: Wenn diese Option deaktiviert ist, werden Brokerstatistiken nicht unter Startseite > Broker-Statistiken angezeigt.

source: Illegal characters in external commands. Those characters will be removed before being processed by Centreon Gorgone.
de: Zeichen, die in externen Kommandos nicht verwendet werden dürfen. Diese Zeichen werden entfernt, bevor sie von Centreon Gorgone verarbeitet werden.

source: IP Address or hostname to communicate with Gorgone API. Should remain default value (Default: "127.0.0.1").
de: IP bzw. DNS-Adresse zur Kommunikation mit der Gorgone-API. Dieser Wert sollte auf dem Standardwert belassen werden (Standardwert: "127.0.0.1").

source: Port on which Gorgone API is listening. It must match Gorgone httpserver module definition. Should remain default value (Default: "8085").
de: Port, auf dem die Gorgone-API lauscht. Dieser muss mit der Gorgone httpserver Moduldefinition übereinstimmen. Dieser Wert sollte auf dem Standardwert belassen werden (Standardwert: "8085").

source: Username used to connect to Gorgone API. It must match Gorgone httpserver module definition (Default: none).
de: Benutzername, der verwendet wird, um eine Verbindung zur Gorgone-API herzustellen. Dieser muss mit der Einstellung des Gorgone-httpserver-Moduls übereinstimmen (Standardwert: keiner).

source: Password used to connect to Gorgone API. It must match Gorgone httpserver module definition (Default: none).
de: Passwort, das verwendet wird, um eine Verbindung zur Gorgone-API herzustellen. Dieses muss mit der Einstellung des Gorgone-httpserver-Moduls übereinstimmen (Standardwert: keiner).

source: Define if SSL/TLS must be used to connect to API. It must match Gorgone httpserver module definition (Default: no).
de: Legt fest, ob für die API-Verbindung SSL/TLS verwendet werden muss. Diese Einstellung muss mit der des Gorgone-httpserver-Moduls übereinstimmen (Standardwert: Nein).

source: Define if connection to Gorgone API can be done even if a self signed certificat is used (Default: yes).
de: Legt fest, ob eine Verbindung mit der Gorgone-API hergestellt werden kann, wenn ein selbstsigniertes Zertifikat verwendet wird (Standardwert: Ja).

source: Ignore ssl certificate.
de: SSL-Zertifikat ignorieren.

source: Enable the rrdcached for Centreon. This option is valid only with Centreon Broker
de: Aktiviert rrdcached für Centreon. Diese Option ist ausschließlich in Kombination mit Centreon Broker gültig

source: Port for communicating with rrdcached
de: Port für die Kommunikation mit rrdcached

source: The absolute path to unix socket for communicating with rrdcached
de: Absoluter Pfad zum Unix-Socket für die Kommunikation mit rrdcached

source: The Unix socket used to communicate with rrdcached. This is a global option, go to Administration > Options > RRDTool to modify it.
de: Unix-Socket für die Kommunikation mit rrdcached. Diese Einstellungen muss global gesetzt werden. Sie kann unter Administration > Optionen > RRDTool geändert werden.

source: The TCP port used to communicate with rrdcached. This is a global option, go to Administration > Options > RRDTool to modify it.
de: TCP-Port für die Kommunikation mit rrdcached. Diese Einstellungen muss global gesetzt werden. Sie kann unter Administration > Optionen > RRDTool geändert werden.

source: Define the poller timezone. If not set, default Centreon timezone is used (parameters). This timezone is used for hosts which have not configured timezone.
de: Liegt die Zeitzone des Pollers fest. Wenn dieser Wert nicht gesetzt ist, wird die Standard Centreon Zeitzone genutzt (Parameter). Diese Zeitzone wird für Hosts genutzt, für die keine explizite Zeitzone festgelegt wurde.

source: Time interval in seconds between two heartbeat events. This event is the one responsible of the 'Last Update' column update in the Pollers listing. Value must be between 5 and 600. Default value is 30.
de: Zeitintervall in Sekunden zwischen zwei "Herzschlag"-Events. Dieses Event ist für den Wert in der 'Letztes Update'-Spalte in der Poller-Liste verantwortlich. Wertebereich: 5 bis 600. Standardwert: 30.

source: This options is an advanced configuration of engine that enables or not the filtering of macros sent to broker.If you don't understand the purpose of enabling this option, please do not enable it.
de: Diese Option ist Teil der fortgeschrittenen Konfiguration und legt fest, ob Makros die an den Broker gesendet werden, gefiltert werden sollen. Wenn Sie diese Option nicht verstehen, sollte sie nicht aktiviert werden.

source: This field should be filled only if filtering option is enabled. You can define the list of macros that should be sent to Centreon Broker.
de: Dieses Feld sollte nur ausgefüllt werden, wenn die Filteroption aktiviert ist. Hierin kann eine Liste von Makros angegeben werden, die an den Centreon Broker gesendet werden sollen.

source: Allow this user to access to Centreon Rest API Realtime with its account.
de: Erlaubt diesem Benutzer den Zugriff auf die Centreon Rest API Realtime mit deren Account.

source: Specify one or more templates of services that should be linked to this host's template. A host deployed from this host's template will benefit all services themselves based from services' templates previously linked.
de: Geben Sie ein oder mehrere Templates für Services an, die mit dem Template diesen Hosts verknüpft werden sollen. Ein Host der das Template diesen Hosts nutzt, erhält alle Services, die vorher mit dem Host-Template verknüpft wurden.

source: This directive is used to define is a longer name or description used to identify the host group.It is provided in order to allow you to more easily identify a particular host group.
de: Diese Richtlinie legt den längeren Namen bzw. eine Beschreibung zur Identifikation der Hostgruppe fest. Dieser Wert kann angegeben werden, um eine bestimmte Hostgruppe einfacher identifizieren zu können.

source: By default monitoring engine will assume that all services are in OK states when it starts.You can override the initial state for a service by using this directive.
de: Standardmäßig nimmt die Monitoring Engine an, dass sich alle Services im OK Status befinden, wenn diese startet. Dieses Verhalten kann überschrieben werden, indem hier der gewünschte Service-Status angegeben wird.

source: Allows user to generate and export configuration, and restart poller.
de: Erlaubt dem Benutzer die Erzeugung und den Export der Konfiguration sowie den Neustart des Pollers.

source: Allows user to generate and export configuration, and restart centreontrapd process.
de: Erlaubt dem Benutzer die Erzeugung und den Export der Konfiguration sowie den Neustart des centreontrapd-Prozesses.

source: Images.
de: Bilder.

source: When filling property is enable, the area color displayed in Centreon is the curve line color with transparency.For exported graphs, the area color is defined with those fields.
de: Wenn die Füllen-Option aktiviert ist, ist die in Centreon angezeigte Flächenfarbe die Kurvenlinienfarbe mit Transparenz. Für exportierte Graphen wird die Flächenfarbe mit diesen Feldern festgelegt.

source: Curve transparency. Used to export the chart.
de: Kurventransparenz. Wird für den Export des Diagramms verwendet.

source: Width of grid. Used to export the chart.
de: Breite des Rasters. Wird für den Export des Diagramms verwendet.

source: Height of grid. Used to export the chart.
de: Höhe des Rasters. Wird für den Export des Diagramms verwendet.
