Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: Duration of retention regarding comments stored in database. 0 means that no retention will be applied.
de: Aufbewahrungsdauer von Kommentaren in der Datenbank. Ein Wert von 0 bedeutet, dass die Daten nicht aufbewahrt werden.
fr: Durée de rétention concernant les commentaires stockés en base de données. 0 signifie qu'aucune rétention n'est appliquée.

source: Enables RRDTool auto purge system.
fr: Active la purge automatique RRDTool.

source: Centstorage will check for data to purge every now and then.
fr: Centstorage va vérifier les données à purger de temps en temps.

source: Storage Type.
fr: Type de Stockage.

source: Dumps data into another file.
fr: Sauvegarde les données dans un autre fichier.

source: Dump file.
fr: Fichier de sauvegarde.

source: Archives logs of monitoring engine.
fr: Journaux d'archive des moteurs de supervision.

source: Retention duration of logs. 0 means that no retention will be applied.
de: Aufbewahrungsdauer von Logs. Ein Wert von 0 bedeutet, dass die Daten nicht aufbewahrt werden.
fr: Durée de rétention des journaux. 0 signifie qu'aucune rétention n'est appliquée.

source: Retention duration of reporting data. 0 means that no retention will be applied.
de: Aufbewahrungsdauer von Berichtsdaten. Ein Wert von 0 bedeutet, dass die Daten nicht aufbewahrt werden.
fr: Durée de rétention des données de reporting. 0 signifie qu'aucune rétention n'est appliquée.

source: Enable/Disable logging of all modifications in Centreon
de: Logging von Modifikationen an Centreon aktivieren bzw. deaktivieren
fr: Activer/Désactiver le traçage (log) de toutes les modifications de configuration de Centreon.

source: Enable Backup process
de: Sicherungsprozess aktivieren
fr: Activer le processus de sauvegarde

source: Backup configuration files (MySQL, Apache, PHP, SNMP, centreon, centreon-engine, centreon-broker)
de: Sicherungskonfigurationsdateien (MySQL, Apache, PHP, SNMP, centreon, centreon-engine, centreon-broker)
fr: Activer la sauvegarde des fichiers de configuration (MySQL, Apache, PHP, SNMP, centreon, centreon-engine, centreon-broker)

source: Backup centreon database
de: Sicherung der centreon-Datenbank erstellen
fr: Activer la sauvegarde de la base de données 'centreon'

source: Backup centreon_storage database
de: Sicherung der centreon_storage-Datenbank erstellen
fr: Activer la sauvegarde de la base de données 'centreon_storage'

source: Backup type for centreon_storage database : mysqldump or LVM snapshot (need available space on MySQL LVM)
de: Sicherungstyp für die centreon_storage-Datenbank: mysqldump oder LVM-Snapshot (Für die Sicherung muss genügend freier Speicher auf der Festplatte der MySQL LVM verfügbar sein).
fr: Méthode de sauvegarde pour la base de données 'centreon_storage" : mysqldump ou LVM snapshot (de l'espace non alloué doit être disponible sur le LVM hébergeant la base de données)

source: Full backup period
de: Zeitplan für vollständige Sicherungen
fr: Période pour les sauvegarde de type complètes

source: Partial backup period (available on partitioned tables)
de: Zeitplan für Teilsicherungen (Auf partitionierten Tabellen verfügbar)
fr: Période pour les sauvegarde de type partielles (disponible dans le cas ou les tables sont partitionnées)

source: Directory where backups will be stored
de: Sicherungsverzeichnis
fr: Répertoire où sont stockées les sauvegardes

source: Temporary directory used by backup process
de: Temporäres Verzeichnis das vom Sicherungsprozess verwendet wird
fr: Répertoire temporaire utilisé pour le processus de sauvegarde

source: Backup retention (in days)
de: Aufbewahrungsdauer der Sicherungen (In Tagen)
fr: Durée de rétention des sauvegardes avant suppression (exprimé en jours)

source: MySQL configuration file path (i.e. /etc/my.cnf.d/centreon.cnf)
de: Pfad zur MySQL-Konfigurationsdatei (z.B. /etc/my.cnf.d/centreon.cnf)
fr: Chemin d'accès au fichier de configuration MySQL (i.e. /etc/my.cnf.d/centreon.cnf)

source: Use SCP to copy backup on remote host
de: Verwende SCP (Secure copy) um eine Sicherung auf einen Remote-Host zu kopieren
fr: Utilise le protocole SCP pour externaliser les sauvegardes

source: Remote user used by SCP
de: Remote-Benutzer, den SCP (Secure copy) verwendet
fr: Utilisateur permettant d'accéder au stockage distant pour copier les sauvegardes

source: Remote host to copy by SCP
de: Remote-Host, auf den die Sicherung durch SCP (Secure copy) kopiert werden soll
fr: Adresse du stockage distant pour copier les sauvegardes

source: Remote directory to copy by SCP
de: Remote-Verzeichnis, in das die Sicherung durch SCP (Secure copy) kopiert werden soll
fr: Répertoire de stockage distant pour copier les sauvegardes

source: Application directory of Centreon.
de: Applikationsverzeichnis von Centreon.
fr: Répertoire d'installation du logiciel Centreon.

source: Centreon Web URI.
fr: URI d'accès à l'interface Centreon.

source: Default number of displayed elements in listing pages.
de: Standardwert für die Anzahl der Elemente auf Seiten mit Listen.
fr: Nombre global d'objets affichés par défaut pour les pages.

source: Default number of displayed elements in monitoring consoles.
de: Standardwert für die Anzahl der Elemente in Überwachungskonsolen.
fr: Nombre d'éléments affichés par défaut pour les pages de supervision des hôtes et des services.

source: Number of performance graphs displayed per page.
de: Anzahl der angezeigten Performance-Graphen pro Seite.
fr: Nombre de graphiques de performance à afficher par page.

source: The number elements loaded in async select.
de: Anzahl der Elemente, die bei der asynchronen Auswahl geladen werden. Dieser Wert wird für Filter und Formulare verwendet, um festzulegen, wie viele Listenobjekte geladen werden, bevor der Nutzer in dem Menü scrollt.
fr: Le nombre d'éléments chargé par défaut dans les listes de sélection.

source: Life duration of sessions. The value in minutes cannot be greater than the session.gc_maxlifetime value set in your php centreon.ini file.
de: Gültigkeitsdauer von Sessions (In Minuten). Dieser Wert darf nicht größer sein als der Wert für session.gc_maxlifetime in der PHP centreon.ini-Datei.
fr: Temps d'expiration en minutes de la session des utilisateurs connectés à Centreon.Cette valeur ne peut dépasser la valeur définie dans votre fichier de configuration php centreon.ini

source: Refresh interval.
de: Aktualisierungsintervall.
fr: Intervalle de rafraichissement global des objets.

source: Refresh interval used for statistics (top counters).
fr: Intervalle de rafraichissement utilisé pour les statistiques des états des hôtes et services (tableaux situés en haut des pages).

source: Refresh interval used in monitoring consoles.
fr: Intervalle de rafraichissement utilisé dans les pages de supervision.

source: First refresh delay for statistics (top counters).
de: Erstmaliges Aktualisierungsintervall für die Statistiken in der oberen Menüleiste.
fr: Délai de rafraichissement des statistiques des états des hôtes et des services lors du premier accès à la page (tableaux situés en haut des pages).

source: First refresh delay for monitoring.
de: Erstmaliges Aktualisierungsintervall für die Überwachung.
fr: Délai de rafraichissement des données de supervision lors du premier accès à la page.

source: CSS theme.
fr: Thème CSS par défaut qui sera appliqué à l'interface web Centreon.

source: Default sort in monitoring consoles.
de: Standardsortierung in Überwachungskonsolen.
fr: Tri par défaut pour les pages de supervision des hôtes et des services.

source: Default order in monitoring consoles.
de: Standardreihenfolge in Überwachungskonsolen.
fr: Ordre par défaut de tri pour les pages de supervision des services et des hôtes.

source: Enables Autologin.
de: Aktiviert Autologin.
fr: Autorise les utilisateurs à se connecter à l'interface Centreon de manière automatique en utilisant le token prédéfini dans la configuration de leur compte.

source: Displays Autologin shortcut.
de: Blendet den Autologin-Shortcut ein.
fr: Affiche l'icône du raccourci de connexion automatique sur l'interface situé sous le tableau de l'état général de la supervision.

source: Default host and contact timezone.
de: Standardzeitzone für Hosts und Kontakte.
fr: fuseau horaire par défaut des hôtes et contacts.

source: Whether SSO authentication is enabled. SSO feature have only to be enabled in a secured and dedicated environment for SSO. Direct access to Centreon UI from users have to be disabled.
de: Legt fest, ob die SSO-Authentifizierung aktiviert ist. SSO darf nur in einer sicheren und dedizierten Umgebung für SSO eingesetzt werden. Der direkte Zugriff von Benutzern auf die Centreon UI muss deaktiviert werden.
fr: Permet d'activer l'authentification via SSO. Cette option doit être activée dans un environnement sécurisé et dédié à l'authentification SSO. L'accès direct à l'interface web Centreon pour les utilisateurs doit être désactivé.

source: Authentication can be solely based on SSO or it can work with both SSO and local authentication systems.
de: Die Authentifizierung kann entweder ausschließlich mit SSO oder sowohl mit SSO wie auch mit lokalen Authentifizierungssystemen umgesetzt werden.
fr: L'authentification peut-être seulement basée sur SSO ou elle peut fonctionner à la fois avec SSO et un système d'authentification local.

source: Enable login with OpenId Connect.
de: Login mit OpenID Connect aktivieren.
fr: Activer le login avec OpenId Connect.

source: Authentication can be solely based on OpenId Connect or it can work with both OpenId Connect and local authentication systems.
de: Die Authentifizierung kann entweder ausschließlich mit OpenId Connect oder sowohl mit OpenId Connect wie auch mit lokalen Authentifizierungssystemen umgesetzt werden.
fr: L'authentification peut être basée sur OpenId Connect uniquement ou peut fonctionner avec OpenId Connect et les systèmes.d'authentification locaux.

source: Your OpenId Connect base Url (for example http://IP:8080/auth/realms/master/protocol/openid-connect).
de: OpenId Connect Basis-URL (z.B. http://IP:8080/auth/realms/master/protocol/openid-connect).
fr: L'url de base du service OpenId Connect (par exemple http://IP:8080/auth/realms/master/protocol/openid-connect).

source: Your OpenId Connect Authorization endpoint (for example /auth).
de: OpenId Connect Autorisierungsverzeichnis (z.B. /auth).
fr: L'url du service OpenId Connect Authorization (par exemple /auth).

source: Your OpenId Connect Token endpoint (for example /token).
de: OpenId Connect Token-Verzeichnis (z.B. /token).
fr: L'url du service OpenId Connect Token (par exemple /token).

source: Your OpenId Connect Introspection Token endpoint (for example /token/introspect).
de: OpenId Connect Introspection-Token-Verzeichnis (z.B. /token/introspect).
fr: L'url du service OpenId Connect Introspection Token (par exemple /token/introspect).

source: Your OpenId Connect User Information endpoint (for example /userinfo).
de: OpenId Connect Benutzerinformationsverzeichnis (z.B. /userinfo).
fr: L'url du service OpenId Connect User Information (par exemple /userinfo).

source: Your OpenId Connect End Session endpoint (for example /logout).
de: OpenId Connect Sessionendeverzeichnis (z.B. /logout).
fr: L'url du service OpenId Connect End Session (par exemple /logout).

source: Your OpenId Connect Scope (for example openid).
de: OpenId Connect Scope (z.B. openid).
fr: Le champ d'application 'scope' (par exemple openid).

source: Your OpenId Connect redirect url (this server).
fr: L'URL OpenId Connect de redirection vers Centreon (ce serveur).

source: Your OpenId Connect client ID.
de: OpenId Connect Client-ID.
fr: L'identifiant Centreon OpenId Connect (client ID).

source: Your OpenId Connect client secret.
de: OpenId Connect Client-Geheimnis.
fr: La clé secrète OpenId Connect pour l'application Centreon.

source: IP/DNS of trusted clients. Use coma as delimiter in case of multiple clients.
de: IP bzw. DNS-Adresse von vertrauenswürdigen Clients. Wenn mehrere Clients angegeben werden, müssen diese durch Kommata getrennt sein.
fr: IP/DNS des clients de confiance. Utilisez des virgules comme séparateur en cas de clients multiples

source: IP/DNS of blacklist clients. Use coma as delimiter in case of multiple clients.
de: IP bzw. DNS-Adresse von gesperrten Clients. Wenn mehrere Clients angegeben werden, müssen diese durch Kommata getrennt sein.
fr: IP/DNS des clients de la liste noire. Utilisez des virgules comme séparateur en cas de clients multiples

source: The header variable that will be used as login. i.e: $_SERVER['HTTP_AUTH_USER']
de: Die Header-Variable, die als Login genutzt wird. Als Beispiel: $_SERVER['HTTP_AUTH_USER']
fr: La variable d'entête qui sera utilisée comme login. Exemple : $_SERVER['HTTP_AUTH_USER']

source: The pattern to search for in the username. If i want to remove the domain of the email: /@.*/
de: Muster, nach dem im Benutzernamen gesucht werden soll. Durch die Angabe von /@.*/ kann die E-Mail-Domain entfernt werden
fr: Expression rationnelle (pattern) de recherche pour l'utilisateur. Par exemple pour sélectionner supprimer le domaine d'une adresse mail : /@.*/

source: The string to replace.
de: Die zu ersetzende Zeichenfolge.
fr: Chaine de remplacement

source: This option enable a strict mode for the management of parent links between hosts on different pollers. Some hosts can have a parent link between them even if they are not monitored by the same poller. Select yes if you want to block the UI in order to oblige user to let host with a declared relation on the same poller. if you select No, during the generation process, relation will be broken and not generated but kept with Centreon Broker Correlation module.
de: Diese Option aktiviert einen strikten Modus für die Verwaltung von übergeordneten Links zwischen Hosts auf verschiedenen Pollern. Einige Hosts können eine übergeordnete Verbindung zwischen ihnen haben, auch wenn sie nicht von demselben Poller überwacht werden. Wählen Sie Ja aus, wenn Sie die Benutzeroberfläche blockieren möchten, um den Benutzer zu verpflichten, den Host mit einer deklarierten Beziehung auf demselben Poller zuzulassen. Wenn Sie Nein auswählen, wird die Beziehung während des Generierungsprozesses unterbrochen und nicht erstellt, sondern mit dem Centreon Broker-Korrelationsmodul beibehalten.
fr: L’activation de cette option permet, lors de la configuration des relations de parentés des hôtes, d’obliger l’utilisateur à superviser ces deux éléments (hôte parent et hôte enfant) sur le même collecteur de supervision. Certains hôtes ne sont pas supervisés par le même collecteur et la relation de parentés peut être gérée par le module Centreon Broker grâce au module de corrélation. Ainsi la relation classique de parenté sera supprimée de la configuration envoyée au moteur mais sera présente dans le fichier de corrélation de Centreon Broker.

source: Centreon Support email: this email is uses in the Centreon footer in order to have a quick link in order to open an issue to your help desk.
de: Centreon Support E-Mail: Diese E-Mail wird in der Fußzeile der Weboberfläche verwendet, damit Nutzern ein Quick-Link zu Ihrem Help-Desk zur Verfügung steht.
fr: Adresse mail de support de votre société. Cette adresse sera affichée dans le bas de chaque page permettant à vos utilisateurs de vous joindre rapidement.

source: Used protocol to join proxy.
fr: Protocole utilisé pour le proxy web.

source: URL of the proxy.
de: Proxy-URL.
fr: URL ou adresse IP du proxy web.

source: Port of the proxy.
de: Proxy-Port.
fr: Port de connexion au proxy.

source: If this option is enable, the downtimes and acknowledgments will be displayed on metric chart.<br><b>Warning</b> : This option can slow down the display of chart.
de: Wenn diese Option aktiviert ist, werden Ausfallszeiten und Inkenntnisnahmen auf Metrikdiagrammen angezeigt.<br><b>Achtung</b>: Diese Option kann dazu führen, dass die Anzeige von Diagrammen mehr Zeit in Anspruch nimmt.
fr: Si cette option est activée, les périodes de plage de maintenance et d'acquittements seront visibles sur les graphiques.<br><b>Attention</b> : Cette option peut ralentir le chargement des graphiques.

source: If this option is enable, the comments will be displayed on status chart.<br><b>Warning</b> : This option can slow down the display of chart.
de: Wenn diese Option aktiviert ist, werden Kommentare auf Statusdiagrammen angezeigt.<br><b>Achtung</b>: Diese Option kann dazu führen, dass die Anzeige von Diagrammen mehr Zeit in Anspruch nimmt.
fr: Si cette option est activée, les périodes de plage de maintenance et d'acquittements seront visibles sur les graphiques représentant l'état du service.<br><b>Attention</b> : Cette option peut ralentir le chargement des graphiques.

source: Default monitoring engine.
de: Standard Monitoring Engine.
fr: Moteur de supervision par défaut

source: Directory where images are stored.
de: Verzeichnis für die Aufbewahrung von Bildern.
fr: Répertoire où sont stockées les images.

source: Directory where check plugins are stored.
de: Verzeichnis für die Aufbewahrung von Überprüfungsplugins.
fr: Répertoire où sont stockées les sondes de supervision (plugin).

source: This is the number of seconds per "unit interval" used for timing in the scheduling queue, re-notifications, etc. "Units intervals" are used in the object configuration file to determine how often to run a service check, how often to re-notify a contact, etc. The default value for this is set to 60, which means that a "unit value" of 1 in the object configuration file will mean 60 seconds (1 minute).
de: Anzahl der Sekunden pro "Einheitenintervall", die für das Timing in der Scheduler-Warteschlange, für wiederholte Benachrichtigungen und weiteres verwendet wird. "Einheitenintervalle" werden in der Objektkonfigurationsdatei verwendet, um zu bestimmen, wie häufig eine Service-Überprüfung ausgeführt werden soll, wie oft ein Kontakt erneut benachrichtigt werden soll, usw.. Der Standardwert ist 60 Sekunden. Ein "Einheitswert" von 1 in der Objektkonfigurationsdatei entspricht somit 60 Sekunden (1 Minute).
fr: Intervalle de temps de référence en secondes utilisé pour planifier les contrôles, les notifications. La valeur par défaut est de 60s (1 min), ainsi dans tous les formulaires l'intervalle de temps unitaire sera de 60 secondes (1 minute).

source: Broker module used by Centreon.
de: Von Centreon genutztes Brokermodul.
fr: Module broker utilisé par Centreon.

source: Init script for broker daemon.
de: Initialisierungsskript für den Broker Daemon.
fr: Script d'initialisation du broker.

source: Mailer binary with complete path. This define the @MAILER@ macro used in notification commands.
de: Mailer-Ausführungsdatei inklusive des gesamten Pfads. Dieser Pfad wird im @MAILER@-Makro in Benachrichtigungsbefehlen verwendet.
fr: Chemin complet de l'exécutable d'envoi de mails. Ceci définit la variable@MAILER@ utilisée dans les commandes de notification.

source: Maximum number of hosts to show in the Tactical Overview page.
de: Maximale Anzahl an Hosts die auf der Übersichtsseite angezeigt werden.
fr: Nombre maximum d'hôtes affichés sur la page de vue d’ensemble.

source: Maximum number of services to show in the Tactical Overview page.
de: Maximale Anzahl an Services die auf der Übersichtsseite angezeigt werden.
fr: Nombre maximum de services affichés sur la page de vue d'ensemble.

source: Refresh interval used in the Tactical Overview page.
de: Aktualisierungsintervall der Informationen auf der Übersichtsseite.
fr: Intervalle de rafraichissement utilisé dans la page Aperçu Tactique.

source: [Sticky] option is enabled by default.
de: [Angeheftet]-Option ist standardmäßig aktiviert.
fr: Active cette option par défaut dans le formulaire. Cette option permet de garder l'acquittement en cas de changement de statut non-OK.

source: [Notify] option is enabled by default.
de: [Benachrichtigen]-Option ist standardmäßig aktiviert.
fr: Active cette option par défaut dans le formulaire. Cette option permet de générer une notification qui sera envoyée aux contacts liés à l'objet.

source: [Persistent] option is enabled by default.
de: [Persistent]-Option ist standardmäßig aktiviert.
fr: Active cette option par défaut dans le formulaire. Cette option permet de repositionner la plage de maintenance en cas de redémarrage du moteur de supervision.

source: [Acknowledge services attached to hosts] option is enabled by default.
de: [Mit diesem Host verknüpfte Services zur Kenntnis nehmen]-Option ist standardmäßig aktiviert.
fr: Active cette option par défaut dans le formulaire. Cette option permet d'acquitter tous les services liés à l'hôte.

source: [Force Active Checks] option is enabled by default.
de: [Aktive Überprüfungen erzwingen]-Option ist standardmäßig aktiviert.
fr: Active cette option par défaut dans le formulaire. Cette option permet de reprogrammer un contrôle du service suite à l'acquittement.

source: Fixed.
de: Fixiert.
fr: Active cette option par défaut dans le formulaire. Cette option permet planifier une plage de maintenance fixe.

source: [Set downtimes on services attached to hosts] option is enbaled by default.
de: [Ausfallszeiten für mit dem Host verknüpfte Services setzen]-Option ist standardmäßig aktiviert.
fr: Active cette option par défaut dans le formulaire. Cette option permet de programmer une plage de maintenance aux services liés à l'hôte.

source: Default duration of scheduled downtimes.
de: Standarddauer von angesetzten Ausfallszeiten.
fr: Durée par défaut des plages de maintenance planifiées.

source: When enabled, notification messages are displayed when new alerts arise in the monitoring consoles.
de: Wenn diese Option aktiviert ist und neue Alerts auftreten, werden Benachrichtigungen in der Überwachungskonsole angezeigt.
fr: Lorsque l'option est activée, les messages de notification sont affichés quand une nouvelle alerte apparaît dans la console de supervision temps réel.

source: When enabled, "Host Up" notification messages will be displayed.
de: Wenn diese Option aktiviert ist, werden "Host verfügbar"-Benachrichtigungen angezeigt.
fr: Si cette option est activée, alors une fenêtre contextuelle apparaîtra pour signaler un hôte dans un statut "Up".

source: When enabled, "Host Down" notification messages will be displayed.
de: Wenn diese Option aktiviert ist, werden "Host Down"-Benachrichtigungen angezeigt.
fr: Si cette option est activée, alors une fenêtre contextuelle apparaîtra pour signaler un hôte dans un statut injoignable.

source: When enabled, "Host Unreachable" notification messages will be displayed.
de: Wenn diese Option aktiviert ist, werden "Host nicht erreichbar"-Benachrichtigungen angezeigt.
fr: Si cette option est activée, alors une fenêtre contextuelle apparaîtra pour signaler un hôte dans un statut inconnu.

source: When enabled, "Service OK" notification messages will be displayed.
de: Wenn diese Option aktiviert ist, werden "Service OK"-Benachrichtigungen angezeigt.
fr: Si cette option est activée, alors une fenêtre contextuelle apparaîtra pour signaler un service dans un statut OK.

source: When enabled, "Service Warning" notification messages will be displayed.
de: Wenn diese Option aktiviert ist, werden "Service Warnung"-Benachrichtigungen angezeigt.
fr: Si cette option est activée, alors une fenêtre contextuelle apparaîtra pour signaler un service dans un statut "Warning".

source: When enabled, "Service Critical" notification messages will be displayed.
de: Wenn diese Option aktiviert ist, werden "Service Kritisch"-Benachrichtigungen angezeigt.
fr: Si cette option est activée, alors une fenêtre contextuelle apparaîtra pour signaler un service dans un statut "Critical".
