Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: This option allows you to specify a command to be run after every host check to process host performance data that may be returned from the check. This command is only executed if the process_performance_data option is enabled globally and if the process_perf_data directive in the host definition is enabled.
de: Mit dieser Option kann ein Befehl festgelegt werden, der nach jeder Host-Überprüfung ausgeführt wird und die Host-Leistungsdaten verarbeitet, die von der Überprüfung zurückgegeben werden. Dieser Befehl wird nur ausgeführt, wenn die Leistungsdaten verarbeiten (process_performance_data) Option global und die Leistungsdaten verarbeiten (process_perf_data) Richtlinie in der Host-Definition aktiviert ist.
fr: Cette option vous permet de spécifier une commande qui sera lancée après chaque vérification d'hôte pour traiter les données de performance qui peuvent être retournées après la vérification. Cette commande est exécutée seulement si l'option « process_performance_data » est activée et si le paramètre process_perf_data dans la définition de l'hôte l'est aussi.

source: This option allows you to specify a command to be run after every service check to process service performance data that may be returned from the check. This command is only executed if the process_performance_data option is enabled globally and if the process_perf_data directive in the service definition is enabled.
de: Mit dieser Option kann ein Befehl festgelegt werden, der nach jeder Service-Überprüfung ausgeführt wird und die Service-Leistungsdaten verarbeitet, die von der Überprüfung zurückgegeben werden. Dieser Befehl wird nur ausgeführt, wenn die Leistungsdaten verarbeiten (process_performance_data) Option global und die Leistungsdaten verabeiten (process_perf_data) Richtlinie in der Service-Definition aktiviert ist.
fr: Cette option vous permet de spécifier une commande qui sera lancée après chaque vérification de service pour traiter les données de performance qui peuvent être retournées après la vérification. Cette commande est exécutée seulement si l'option de traitement des données de performance est activée et si le paramètre process_perf_data est activé dans la définition du service.

source: This option allows you to specify a file to which host performance data will be written after every host check. Data will be written to the performance file as specified by the host_perfdata_file_template option. Performance data is only written to this file if the process_performance_data option is enabled globally and if the process_perf_data directive in the host definition is enabled.
de: Mit dieser Option kann eine Datei festgelegt werden, in die nach jeder Host-Überprüfung die Host-Leistungsdaten geschrieben werden. Die Daten werden wie in host_perfdata_file_template definiert geschrieben. Leistungsdaten werden nur geschrieben, wenn die process_performance_data Option global und die process_perf_data Richtlinie in der Host-Definition aktiviert ist.
fr: Cette option vous permet de spécifier un fichier dans lequel les données de performance seront écrites après chaque contrôle d'hôte. Les données seront écrites dans le fichier de performance comme spécifié par l'option host_perfdata_file_template. Les données de performance seront écrites dans ce fichier uniquement si l'option process_performance_data est activée de manière globale et si la directive process_perf_data est activée dans la définition du service.

source: This option allows you to specify a file to which service performance data will be written after every service check. Data will be written to the performance file as specified by the service_perfdata_file_template option. Performance data is only written to this file if the process_performance_data option is enabled globally and if the process_perf_data directive in the service definition is enabled.
de: Mit dieser Option kann eine Datei festgelegt werden, in die nach jeder Service-Überprüfung die Service-Leistungsdaten geschrieben werden. Die Daten werden wie in service_perfdata_file_template definiert geschrieben. Leistungsdaten werden nur geschrieben, wenn die process_performance_data Option global und die process_perf_data Richtlinie in der Service-Definition aktiviert ist.
fr: Cette option vous permet de spécifier un fichier dans lequel les données de performance des services seront écrites après chaque contrôle de service. Les données seront écrites dans le fichier de performance comme spécifié par l'option service_perfdata_file_template. Les données de performance seront écrites dans ce fichier uniquement si l'option process_performance_data est activée de manière globale et si la directive process_perf_data est activée dans la définition du service.

source: This option determines what (and how) data is written to the host performance data file. The template may contain macros, special characters (\t for tab, \r for carriage return, \n for newline) and plain text. A newline is automatically added after each write to the performance data file.
de: Diese Option legt fest, welche (und wie) Daten in die Host-Leistungsdatendatei geschrieben werden. Das Template kann Makros, Sonderzeichen (\t für Tab, \r für Zeilenumbruch, \n für neue Zeile) und Text enthalten. Nach jedem Schreibvorgang in die Leistungsdatendatei wird eine neue Zeile angehängt.
fr: Cette option détermine quoi (et comment) les données seront écrites dans le fichier des données de performance de l'hôte. Le modèle peut contenir des macros, des caractères spéciaux (\t pour une tabulation, \r pour les retours chariot, \n pour une nouvelle ligne) et du texte. Une nouvelle ligne est automatiquement ajoutée après chaque écriture dans le fichier de données de performance.

source: This option determines what (and how) data is written to the service performance data file. The template may contain macros, special characters (\t for tab, \r for carriage return, \n for newline) and plain text. A newline is automatically added after each write to the performance data file.
de: Diese Option legt fest, welche (und wie) Daten in die Service-Leistungsdatendatei geschrieben werden. Das Template kann Makros, Sonderzeichen (\t für Tab, \r für Zeilenumbruch, \n für neue Zeile) und Text enthalten. Nach jedem Schreibvorgang in die Leistungsdatendatei wird eine neue Zeile angehängt.
fr: Cette option détermine quoi (et comment) les données seront écrites dans le fichier des données de performance du service. Le modèle peut contenir des macros, des caractères spéciaux (\t pour une tabulation, \r pour les retours chariot, \n pour une nouvelle ligne) et du texte. Une nouvelle ligne est automatiquement ajoutée après chaque écriture dans le fichier de données de performance.

source: This option determines how the host performance data file is opened. Unless the file is a named pipe you'll probably want to use the default mode of append.
de: Diese Option legt fest, wie die Host-Leistungsdatendatei geöffnet wird. Wenn es sich bei der Datei nicht um eine Named Pipe handelt, sollte der Standardmodus anhängen verwendet werden.
fr: Cette option détermine le mode d'ouverture du fichier de données de performance des hôtes. Sauf si le fichier est un canal nommé, on utilise par défaut le mode en ajout.

source: This option determines how the service performance data file is opened. Unless the file is a named pipe you'll probably want to use the default mode of append.
de: Diese Option legt fest, wie die Service-Leistungsdatendatei geöffnet wird. Wenn es sich bei der Datei nicht um eine Named Pipe handelt, sollte der Standardmodus anhängen verwendet werden.
fr: Cette option détermine le mode d'ouverture du fichier de données de performance des services. Sauf si le fichier est un canal nommé, on utilise par défaut le mode en ajout.

source: This option allows you to specify the interval (in seconds) at which the host performance data file is processed using the host performance data file processing command. A value of 0 indicates that the performance data file should not be processed at regular intervals.
de: Diese Option legt das Intervall (in Sekunden) fest, nachdem die Host-Leistungsdatendatei mithilfe des Host-Leistungsdatendateiverarbeitungsbefehls verarbeitet wird. Eine Wert von 0 bedeutet, dass die Leistungsdatendatei nicht in regulären Intervallen verarbeitet werden soll.
fr: Cette option vous permet de spécifier l'intervalle (en secondes) auquel le fichier de données de performance des hôtes sera parcouru en utilisant la commande de traitement du fichier de données de performance des hôtes. Une valeur de 0 indiquera que le fichier de données de performance ne sera pas traité à intervalle régulier.

source: This option allows you to specify the interval (in seconds) at which the service performance data file is processed using the service performance data file processing command. A value of 0 indicates that the performance data file should not be processed at regular intervals.
de: Diese Option legt das Intervall (in Sekunden) fest, nachdem die Service-Leistungsdatendatei mithilfe des Service-Leistungsdatendateiverarbeitungsbefehls verarbeitet wird. Eine Wert von 0 bedeutet, dass die Leistungsdatendatei nicht in regulären Intervallen verarbeitet werden soll.
fr: Cette option vous permet de spécifier l'intervalle (en secondes) auquel le fichier de données de performance des services sera parcouru en utilisant la commande de traitement du fichier de données de performance des services. Une valeur de 0 indiquera que le fichier de données de performance ne sera pas traité à intervalle régulier.

source: This option allows you to specify the command that should be executed to process the host performance data file.
de: Mit dieser Option kann ein Befehl festgelegt werden, der zur Verarbeitung der Host-Leistungsdatendatei verwendet wird.
fr: Cette option vous permet de spécifier la commande qui devra être exécutée de manière à traiter le fichier de données de performance des hôtes.

source: This option allows you to specify the command that should be executed to process the service performance data file.
de: Mit dieser Option kann ein Befehl festgelegt werden, der zur Verarbeitung der Service-Leistungsdatendatei verwendet wird.
fr: Cette option vous permet de spécifier la commande qui devra être exécutée de manière à traiter le fichier de données de performance des services.

source: This option allows you to enable or disable checks for orphaned service checks. Orphaned service checks are checks which have been executed and have been removed from the event queue, but have not had any results reported in a long time. Since no results have come back in for the service, it is not rescheduled in the event queue. This can cause service checks to stop being executed. Normally it is very rare for this to happen - it might happen if an external user or process killed off the process that was being used to execute a service check. If this option is enabled and Monitoring Engine finds that results for a particular service check have not come back, it will log an error message and reschedule the service check. This option is enabled by default.
de: Diese Option legt fest, ob Überprüfungen für verwaiste Service-Überprüfungen de(aktiviert) werden sollen. Verwaiste Service-Überprüfungen sind Überprüfungen, die zwar ausgeführt und von der Event-Warteschlange entfernt wurden, jedoch seit längerer Zeit kein Ergebnis geliefert haben. Da keine Ergebnisse für den Service erhalten wurden, wird die Überprüfung in der Event-Warteschlange nicht erneut angesetzt. Das kann dazu führen, dass einige Service-Überprüfungen nicht mehr ausgeführt werden. Normalerweise tritt dies sehr selten auf; kann jedoch eintreten, wenn ein externer Nutzer oder Prozess den Prozess, der dazu genutzt wurde eine Service-Überprüfung auszuführen, beendet hat. Wenn diese Option aktiviert ist und von der Monitoring Engine festgestellt wurde, dass seit längerer Zeit für einen Service kein Ergebnis geliefert wurde, wird eine Fehlernachricht protokolliert und die Service-Überprüfung erneut angesetzt. Diese Option ist standardmäßig deaktiviert.
fr: Cette option vous permet d'activer ou désactiver la vérification des contrôles de services orphelins. Les contrôles de services orphelins sont des contrôles ayant été exécutés et supprimés de la file d'attente des événements, mais dont les résultats n'ont pas été remontés depuis longtemps. Comme aucun résultat n'a été remonté pour ce service, il n'est pas réordonnancé dans la file d'attente des événements. Cela peut causer l'arrêt des contrôles du service. Normalement, c'est un phénomène très rare - il peut se produire si un utilisateur ou un processus extérieur a tué le processus utilisé pour exécuter le contrôle de service. Si cette option est activée et que le moteur de supervision s'aperçoit qu'un résultat de contrôle de service particulier ne revient pas, il écrira un message d'erreur dans le fichier de journalisation, et réordonnancera le contrôle du service. Cette option est activée par défaut.

source: This option allows you to enable or disable checks for orphaned hoste checks. Orphaned host checks are checks which have been executed and have been removed from the event queue, but have not had any results reported in a long time. Since no results have come back in for the host, it is not rescheduled in the event queue. This can cause host checks to stop being executed. Normally it is very rare for this to happen - it might happen if an external user or process killed off the process that was being used to execute a host check. If this option is enabled and Monitoring Engine finds that results for a particular host check have not come back, it will log an error message and reschedule the host check. This option is enabled by default.
de: Diese Option legt fest, ob Überprüfungen für verwaiste Host-Überprüfungen de(aktiviert) werden sollen. Verwaiste Host-Überprüfungen sind Überprüfungen, die zwar ausgeführt und von der Event-Warteschlange entfernt wurden, jedoch seit längerer Zeit kein Ergebnis geliefert haben. Da keine Ergebnisse für den Host erhalten wurden, wird die Überprüfung in der Event-Warteschlange nicht erneut angesetzt. Das kann dazu führen, dass einige Host-Überprüfungen nicht mehr ausgeführt werden. Normalerweise tritt dies sehr selten auf; kann jedoch eintreten, wenn ein externer Nutzer oder Prozess den Prozess, der dazu genutzt wurde eine Host-Überprüfung auszuführen, beendet hat. Wenn diese Option aktiviert ist und von der Monitoring Engine festgestellt wurde, dass seit längerer Zeit für einen Host kein Ergebnis geliefert wurde, wird eine Fehlernachricht protokolliert und die Host-Überprüfung erneut angesetzt. Diese Option ist standardmäßig deaktiviert.
fr: Cette option vous permet d'activer ou désactiver la vérification des contrôles d'hôtes orphelins. Les contrôles d'hôtes orphelins sont des contrôles ayant été exécutés et supprimés de la file d'attente des événements, mais dont les résultats n'ont pas été remontés depuis longtemps. Comme aucun résultat n'a été remonté pour cet hôte, il n'est pas réordonnancé dans la file d'attente des événements. Cela peut causer l'arrêt des contrôles d'hôtes. Normalement, c'est un phénomène très rare - il peut se produire si un utilisateur ou un processus extérieur a tué le processus utilisé pour exécuter le contrôle de l'hôte. Si cette option est activée et que le moteur de supervision s'aperçoit qu'un résultat de contrôle d'un hôte particulier ne revient pas, il écrira un message d'erreur dans le fichier de journalisation, et réordonnancera le contrôle de l'hôte. Cette option est activée par défaut.

source: This option determines whether or not Monitoring Engine will periodically check the "freshness" of service checks. Enabling this option is useful for helping to ensure that passive service checks are received in a timely manner. If the check results is found to be not fresh, Monitoring Engine will force an active check of the host or service by executing the command specified by in the host or service definition. This option is enabled by default.
de: Diese Option legt fest, ob die Monitoring Engine regelmäßig die Aktualität von Service-Überprüfungen überprüft. Das Aktivieren dieser Option kann hilfreich sein, um sicherzustellen, dass passive Service-Überprüfungen rechtzeitig erhalten wurden. Wenn ein Überprüfungsergebnis nicht aktuell ist, wird von der Monitoring Engine eine aktive Überprüfung des Hosts bzw. Services erzwungen. Dazu wird der in der Host- bzw. Servicedefinition festgelegte Befehl verwendet. Diese Option ist standardmäßig aktiviert.
fr: Cette option détermine si le moteur de supervision vérifiera périodiquement la "fraîcheur" des contrôles de services. L'activation de cette option est très utile pour s'assurer que les contrôles de services passifs sont reçus en temps voulu. Si les résultats de la vérification s'avèrent non valide, le moteur de supervision va forcer un contrôle actif de l'hôte ou le service en exécutant la commande spécifiée par la définition d'hôte ou d'un service. Cette option est activée par défaut.

source: This setting determines how often (in seconds) Monitoring Engine will periodically check the "freshness" of service check results. If you have disabled service freshness checking (with the check_service_freshness option), this option has no effect.
de: Diese Option legt fest, wie häufig (in Sekunden) die Monitoring Engine die Aktualität von Service-Überprüfungsergebnissen überprüft. Wenn die Aktualitätsprüfung von Service-Überprüfungsergebnissen deaktiviert wurde (mithilfe der check_service_freshness Option), hat diese Einstellung keine Auswirkungen.
fr: Ce paramètre détermine la fréquence (en secondes) où le moteur de supervision va contrôler périodiquement la fraîcheur des résultats des vérifications de services. Si vous avez désactivé la vérification du contrôle de fraîcheur des services (avec l'option check_service_freshness), cette option n'a aucun effet.

source: This option determines whether or not Monitoring Engine will periodically check the "freshness" of host checks. Enabling this option is useful for helping to ensure that passive host checks are received in a timely manner. If the check results is found to be not fresh, Monitoring Engine will force an active check of the host or service by executing the command specified by in the host or service definition. This option is enabled by default.
de: Diese Option legt fest, ob die Monitoring Engine regelmäßig die Aktualität von Host-Überprüfungen überprüft. Das Aktivieren dieser Option kann hilfreich sein, um sicherzustellen, dass passive Host-Überprüfungen rechtzeitig erhalten wurden. Wenn ein Überprüfungsergebnis nicht aktuell ist, wird von der Monitoring Engine eine aktive Überprüfung des Hosts bzw. Services erzwungen. Dazu wird der in der Host- bzw. Servicedefinition festgelegte Befehl verwendet. Diese Option ist standardmäßig aktiviert.
fr: Cette option détermine si le moteur de supervision vérifiera périodiquement la "fraîcheur" des contrôles d'hôtes. L'activation de cette option est très utile pour s'assurer que les contrôles d'hôtes passifs sont reçus en temps voulu. Si les résultats de la vérification s'avèrent non valide, le moteur de supervision va forcer un contrôle actif de l'hôte ou le service en exécutant la commande spécifiée par la définition d'hôte ou d'un service. Cette option est activée par défaut.

source: This setting determines how often (in seconds) Monitoring Engine will periodically check the "freshness" of host check results. If you have disabled host freshness checking (with the check_host_freshness option), this option has no effect.
de: Diese Option legt fest, wie häufig (in Sekunden) die Monitoring Engine die Aktualität von Host-Überprüfungsergebnissen überprüft. Wenn die Aktualitätsprüfung von Host-Überprüfungsergebnissen deaktiviert wurde (mithilfe der check_host_freshness Option), hat diese Einstellung keine Auswirkungen.
fr: Ce paramètre détermine la fréquence (en secondes) où le moteur de supervision va contrôler périodiquement la fraîcheur des résultats des vérifications d'hôtes. Si vous avez désactivé la vérification du contrôle de fraîcheur des hôtes (avec l'option check_host_freshness), cette option n'a aucun effet.

source: This option determines the number of seconds Monitoring Engine will add to any host or services freshness threshold it automatically calculates (e.g. those not specified explicitly by the user).
de: Diese Option legt fest, wieviele Sekunden automatisch von der Monitoring Engine auf den Aktualitätsgrenzwert von Hosts oder Services aufaddiert werden, der automatisch kalkuliert wurde (Diese Option bezieht sich also nur auf solche Werte, die nicht explizit vom Benutzer festgelegt wurden).
fr: Cette option détermine le nombre de secondes que le moteur de supervision ajoutera comme seuil de rafraîchissement qu'il calcule automatiquement pour tous les hôtes ou services (par exemple ceux qui n'ont pas été spécifié explicitement par l'utilisateur).

source: Time interval in seconds between two heartbeat events. This event is the one responsible of the ‘Last Update’ column update in the Pollers listing. Value must be between 5 and 600. Default value is 30.
fr: Intervalle de temps en secondes entre deux événements heartbeat. Cet événement est le responsable de la mise à jour de la colonne 'Dernière mise à jour' dans la liste des Poller. La valeur doit être comprise entre 5 et 600. La valeur par défaut est 30.

source: This option allows you to specify what kind of date/time format Monitoring Engine should use in the web interface and date/time macros.
de: Diese Option legt fest, welches Datum/Zeit-Format von der Monitoring Engine für das Web-Interface und Datum/Zeit-Makros verwendet.
fr: Cette option vous permet de spécifier le format de la date/heure que le moteur de supervision utilisera dans l'interface web et dans les macros de date/heure.

source: This is the email address for the administrator of the local machine (i.e. the one that Monitoring Engine is running on). This value can be used in notification commands by using the $ADMINEMAIL$ macro.
de: E-Mail-Adresse des Administrators des lokalen Servers (d.h. der, auf dem die Monitoring Engine ausgeführt wird). Dieser Wert kann mithilfe des $ADMINEMAIL$ Makros in Benachrichtigungsbefehlen verwendet werden.
fr: C'est l'adresse mail de l'administrateur local de la machine (celle sur laquelle le moteur de supervision tourne). Cette valeur peut être utilisée dans les commandes de notification grâce à la macro $ADMINEMAIL$.

source: This is the pager number (or pager email gateway) for the administrator of the local machine (i.e. the one that Monitoring Engine is running on). The pager number/address can be used in notification commands by using the $ADMINPAGER$ macro.
de: Pager Nummer (bzw. Pager E-Mail Gateway) des Administrators des lokalen Servers (d.h. der, auf dem die Monitoring Engine ausgeführt wird). Dieser Wert kann mithilfe des $ADMINPAGER$ Makros in Benachrichtigungsbefehlen verwendet werden.
fr: C'est le numéro du pager (ou la passerelle pager-email) de l'administrateur de la machine locale (celle sur laquelle le moteur de supervision tourne). Le numéro ou l'adresse de pager peut être utilisé dans les commandes de notification grâce à la macro $ADMINPAGER$.
