Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: Directory where Centreon will export Monitoring Engine object configuration files to. Monitoring Engine will parse all .cfg files in this directory.
de: Verzeichnis, in das von Centreon "Monitoring Engine Objektkonfigurationsdateien" exportiert werden sollen. Die Monitoring Engine verarbeitet alle .cfg-Dateien in diesem Verzeichnis.
fr: Répertoire où Centreon exportera les fichiers de configuration relatifs aux objets du Moteur de Supervision. Celui-ci analysera tous les fichiers .cfg de ce répertoire.

source: This is a temporary file that Monitoring Engine periodically creates and uses when updating comment data, status data, etc. The file is deleted when it is no longer needed.
de: Diese Datei ist eine temporäre Datei die von der Monitoring Engine periodisch erstellt und verwendet wird, wenn Kommentardaten, Statusdaten und weitere aktualisiert werden. Diese Datei wird automatisch gelöscht, wenn sie nicht mehr benötigt wird.
fr: C'est un fichier temporaire que le moteur de supervision crée périodiquement durant la mise à jour des commentaires, des statuts, etc. Ce fichier est supprimé lorsqu'il n'est plus nécessaire.

source: This is used to set the effective user that the Monitoring Engine process should run as. After initial program startup and before starting to monitor anything, Monitoring Engine will drop its effective privileges and run as this user. You may specify either a username or a UID.
de: Dieser Wert legt den tatsächlichen Nutzer fest, unter dem die Monitoring Engine ausgeführt wird. Nach Programmstart und bevor das Monitoring gestartet wird, werden die tatsächlichen Berechtigungen verworfen und die Monitoring Engine unter dem angegebenen Benutzer ausgeführt. Es kann entweder ein Benutzername oder eine UID angegeben werden.
fr: Ce paramètre détermine avec quel utilisateur sera lancé le processus du moteur de supervision. Après le démarrage du programme, et avant toute supervision, le moteur de supervision abandonnera ses privilèges effectifs, et se lancera avec cet utilisateur. Vous pouvez donner un nom d'utilisateur ou un UID.

source: This is used to set the effective group that the Monitoring Engine process should run as. After initial program startup and before starting to monitor anything, Monitoring Engine will drop its effective privileges and run as this group. You may specify either a groupname or a GID.
de: Dieser Wert legt die tatsächliche Gruppe fest, unter dem die Monitoring Engine ausgeführt wird. Nach Programmstart und bevor das Monitoring gestartet wird, werden die tatsächlichen Berechtigungen verworfen und die Monitoring Engine unter der angegebenen Gruppe ausgeführt. Es kann entweder ein Gruppenname oder eine GID angegeben werden.
fr: Ce paramètre détermine avec quel groupe sera lancé le processus du moteur de supervision. Après le démarrage du programme, et avant toute supervision, le moteur de supervision abandonnera ses privilèges effectifs et se lancera avec ce groupe. Vous pouvez donner un nom de groupe ou un GID.

source: This option determines whether or not Monitoring Engine will send out notifications when it initially (re)starts. If this option is disabled, Monitoring Engine will not send out notifications for any host or service. Note: If you have state retention enabled, Monitoring Engine will ignore this setting when it (re)starts and use the last known setting for this option (as stored in the state retention file), unless you disable the use_retained_program_state option. If you want to change this option when state retention is active (and the use_retained_program_state is enabled), you'll have to use the appropriate external command or change it via the web interface. Notifications are enabled by default.
de: Diese Option legt fest, ob die Monitoring Engine beim (Neu)Start Benachrichtigungen sendet. Wenn diese Option deaktiviert ist, werden keine Benachrichtigungen für Hosts bzw. Services gesendet. Hinweis: Wenn die Aufbewahrung des letzten Status aktiviert ist, wird diese Einstellung beim (Neu)Start der Monitoring Engine ignoriert und die letzte bekannte Einstellung für diese Option verwendet (die letzte verwendete Einstellung wird in der Satusbeibehaltungsdatei gespeichert). Das ist jedoch nicht der Fall, wenn die beibehaltene Status verwenden (use_retained_program_state)-Option deaktviert ist. Wenn diese Option angepasst werden soll, während die Beibehaltung des letzten Status aktiviert ist (und die use_retained_program_state ebenfalls aktiviert ist), muss der entsprechende externe Befehl verwendet bzw. die Einstellung über das Web-Interface angepasst werden. Benachrichtigungen sind standardmäßig aktiviert.
fr: Cette option définit si le moteur de supervision envoie ou non des notifications quand il (re)démarre. Si cette option est désactivée, le moteur de supervision n'envoie aucune notification pour aucun hôte ou service. Note: si la rétention d'état est activée, le moteur de supervision ignorera ce paramètre quand il (re)démarre et utilise la dernière valeur connue de ce paramètre (telle qu'enregistrée dans le fichier de consignation des états), sauf si l'option use_retained_program_state est désactivée. Si vous voulez changer cette option quand la rétention d'état est activé (et que use_retained_program_state est actif), il faudra utiliser la commande externe adéquate ou la changer via l'interface web. Les notifications sont activées par défaut.

source: This option determines whether or not Monitoring Engine will execute service checks when it initially (re)starts. If this option is disabled, Monitoring Engine will not actively execute any service checks and will remain in a sort of "sleep" mode (it can still accept passive checks unless you've disabled them). This option is most often used when configuring backup monitoring servers, as described in the documentation on redundancy, or when setting up a distributed monitoring environment. Note: If you have state retention enabled, Monitoring Engine will ignore this setting when it (re)starts and use the last known setting for this option (as stored in the state retention file), unless you disable the use_retained_program_state option. If you want to change this option when state retention is active (and the use_retained_program_state is enabled), you'll have to use the appropriate external command or change it via the web interface. Service checks are enabled by default.
de: Diese Option legt fest, ob die Monitoring Engine beim (Neu)Start Service-Überprüfungen ausführt. Wenn diese Option deaktiviert ist, werden von der Monitoring Engine keine aktiven Service-Überprüfungen ausgeführt. Sie befindet sich in einer Art "Schlafmodus" (Passive Überprüfungen werden weiterhin ausgeführt, außer diese wurden deaktiviert). Diese Option wird meist auf Backup-Monitoring-Servern (Beschrieben in der Dokumentation zum Thema Redundanz) oder in verteilten Monitoring-Umgebungen verwendet. Hinweis: Wenn die Aufbewahrung des letzten Status aktiviert ist, wird diese Einstellung beim (Neu)Start der Monitoring Engine ignoriert und die letzte bekannte Einstellung für diese Option verwendet (die letzte verwendete Einstellung wird in der Statusbeibehaltungsdatei gespeichert). Das ist jedoch nicht der Fall, wenn die beibehaltenen Programmstatus verwenden (use_retained_program_state)-Option deaktiviert ist. Wenn diese Option angepasst werden soll, während die Beibehaltung des letzten Status aktiviert ist (und die use_retained_program_state ebenfalls aktiviert ist), muss der entsprechende externe Befehl verwendet bzw. die Einstellung über das Web-Interface angepasst werden. Service-Überprüfungen sind standardmäßig aktiviert.
fr: Cette option détermine si le moteur de supervision exécute ou non des vérifications de service quand il (re)démarre. Si cette option est désactivée, le moteur de supervision n'effectue aucune vérification de service et reste dans un état de "veille" (il continue à accepter les vérifications passives sauf si elles sont désactivées). Cette option est le plus souvent utilisée pour la sauvegarde de la configuration des serveurs de surveillance, tel que décrit dans la documentation sur la redondance, ou encore pour la configuration d'environnement de surveillance distribuée. Note : si la rétention d'état est activée, le moteur de supervision ignorera ce paramètre quand il (re)démarre et utilise la dernière valeur connue de ce paramètre (telle qu'enregistrée dans le fichier de rétention des états), sauf si l'option use_retained_program_state est désactivée. Si vous voulez changer cette option quand la rétention d'état est active (et que use_retained_program_state est actif), il faudra utiliser la commande externe adéquate ou la changer via l'interface web. Les vérifications de service sont activées par défaut.

source: This option determines whether or not Monitoring Engine will execute host checks when it initially (re)starts. If this option is disabled, Monitoring Engine will not actively execute any host checks and will remain in a sort of "sleep" mode (it can still accept passive checks unless you've disabled them). This option is most often used when configuring backup monitoring servers, as described in the documentation on redundancy, or when setting up a distributed monitoring environment. Note: If you have state retention enabled, Monitoring Engine will ignore this setting when it (re)starts and use the last known setting for this option (as stored in the state retention file), unless you disable the use_retained_program_state option. If you want to change this option when state retention is active (and the use_retained_program_state is enabled), you'll have to use the appropriate external command or change it via the web interface. Host checks are enabled by default.
de: Diese Option legt fest, ob die Monitoring Engine beim (Neu)Start Host-Überprüfungen ausführt. Wenn diese Option deaktiviert ist, werden von der Monitoring Engine keine aktiven Host-Überprüfungen ausgeführt. Sie befindet sich in einer Art "Schlafmodus" (Passive Überprüfungen werden weiterhin ausgeführt, außer diese wurden deaktiviert). Diese Option wird meist auf Backup-Monitoring-Servern (Beschrieben in der Dokumentation zum Thema Redundanz) oder in verteilten Monitoring-Umgebungen verwendet. Hinweis: Wenn die Aufbewahrung des letzten Status aktiviert ist, wird diese Einstellung beim (Neu)Start der Monitoring Engine ignoriert und die letzte bekannte Einstellung für diese Option verwendet (die letzte verwendete Einstellung wird in der Statusbeibehaltungsdatei gespeichert). Das ist jedoch nicht der Fall, wenn die beibehaltenen Programmstatus verwenden (use_retained_program_state)-Option deaktiviert ist. Wenn diese Option angepasst werden soll, während die Beibehaltung des letzten Status aktiviert ist (und die use_retained_program_state ebenfalls aktiviert ist), muss der entsprechende externe Befehl verwendet bzw. die Einstellung über das Web-Interface angepasst werden. Host-Überprüfungen sind standardmäßig aktiviert.
fr: Cette option détermine si le moteur de supervision exécute ou non des vérifications d'hôte quand il (re)démarre. Si cette option est désactivée, le moteur de supervision n'effectue aucune vérification d'hôte et reste dans un état de veille (il continue à accepter les vérifications passives sauf si elles sont désactivées). Cette option est le plus souvent utilisée pour la sauvegarde de la configuration des serveurs de surveillance, tel que décrit dans la documentation sur la redondance, ou encore pour la configuration d'environnement de surveillance distribuée. Note : si la rétention d'état est activée, le moteur de supervision ignorera ce paramètre quand il (re)démarre et utilise la dernière valeur connue de ce paramètre (telle qu'enregistrée dans le fichier de consignation des états), sauf si l'option use_retained_program_state est désactivée. Pour changer cette option quand la rétention d'état est active (et que use_retained_program_state est actif), il faudra utiliser la commande externe adéquate ou la changer via l'interface web. Les vérifications d'hôte sont activées par défaut.

source: This option determines whether or not Monitoring Engine will accept passive service checks when it initially (re)starts. If this option is disabled, Monitoring Engine will not accept any passive service checks. Note: If you have state retention enabled, Monitoring Engine will ignore this setting when it (re)starts and use the last known setting for this option (as stored in the state retention file), unless you disable the use_retained_program_state option. If you want to change this option when state retention is active (and the use_retained_program_state is enabled), you'll have to use the appropriate external command or change it via the web interface. Option is enabled by default.
de: Diese Option legt fest, ob die Monitoring Engine beim (Neu)Start passive Service-Überprüfungen annimmt. Wenn diese Option deaktiviert ist, werden von der Monitoring Engine keine passiven Service-Überprüfungen angenommen. Hinweis: Wenn die Aufbewahrung des letzten Status aktiviert ist, wird diese Einstellung beim (Neu)Start der Monitoring Engine ignoriert und die letzte bekannte Einstellung für diese Option verwendet (die letzte verwendete Einstellung wird in der Statusbeibehaltungsdatei gespeichert). Das ist jedoch nicht der Fall, wenn die beibehaltenen Programmstatus verwenden (use_retained_program_state)-Option deaktiviert ist. Wenn diese Option angepasst werden soll, während die Beibehaltung des letzten Status aktiviert ist (und die use_retained_program_state ebenfalls aktiviert ist), muss der entsprechende externe Befehl verwendet bzw. die Einstellung über das Web-Interface angepasst werden. Diese Option ist standardmäßig aktiviert.
fr: Cette option détermine si le moteur de supervision accepte ou non des vérifications passives de service quand il (re)démarre. Si cette option est désactivée, le moteur de supervision n'effectue aucune vérification de services passifs. Note : si la rétention d'état est activée, le moteur de supervision ignorera ce paramètre quand il (re)démarre et utilise la dernière valeur connue de ce paramètre (telle qu'enregistrée dans le fichier de rétention des états), sauf si l'option use_retained_program_state est désactivée. Si vous voulez changer cette option quand la rétention d'état est active (et que use_retained_program_state est actif), il faudra utiliser la commande externe adéquate ou la changer via l'interface web. L'option est activée par défaut.

source: This option determines whether or not Monitoring Engine will accept passive host checks when it initially (re)starts. If this option is disabled, Monitoring Engine will not accept any passive host checks. Note: If you have state retention enabled, Monitoring Engine will ignore this setting when it (re)starts and use the last known setting for this option (as stored in the state retention file), unless you disable the use_retained_program_state option. If you want to change this option when state retention is active (and the use_retained_program_state is enabled), you'll have to use the appropriate external command or change it via the web interface. Option is enabled by default.
de: Diese Option legt fest, ob die Monitoring Engine beim (Neu)Start passive Host-Überprüfungen annimmt. Wenn diese Option deaktiviert ist, werden von der Monitoring Engine keine passiven Host-Überprüfungen angenommen. Hinweis: Wenn die Aufbewahrung des letzten Status aktiviert ist, wird diese Einstellung beim (Neu)Start der Monitoring Engine ignoriert und die letzte bekannte Einstellung für diese Option verwendet (die letzte verwendete Einstellung wird in der Statusbeibehaltungsdatei gespeichert). Das ist jedoch nicht der Fall, wenn die beibehaltenen Programmstatus verwenden (use_retained_program_state)-Option deaktiviert ist. Wenn diese Option angepasst werden soll, während die Beibehaltung des letzten Status aktiviert ist (und die use_retained_program_state ebenfalls aktiviert ist), muss der entsprechende externe Befehl verwendet bzw. die Einstellung über das Web-Interface angepasst werden. Diese Option ist standardmäßig aktiviert.
fr: Cette option détermine si le moteur de supervision accepte ou non des vérifications passives d'hôte quand il (re)démarre. Si cette option est désactivée, le moteur de supervision n'accepte aucune vérification passive d'hôtes. Note : si la rétention d'état est activée, le moteur de supervision ignorera ce paramètre quand il (re)démarre et utilise la dernière valeur connue de ce paramètre (telle qu'enregistrée dans le fichier de rétention des états), sauf si l'option use_retained_program_state est désactivée. Si vous voulez changer cette option quand la rétention d'état est active (et que use_retained_program_state est actif), il faudra utiliser la commande externe adéquate ou la changer via l'interface web. L'option est activée par défaut.

source: This option determines whether or not Monitoring Engine will run event handlers when it initially (re)starts. If this option is disabled, Monitoring Engine will not run any host or service event handlers. Note: If you have state retention enabled, Monitoring Engine will ignore this setting when it (re)starts and use the last known setting for this option (as stored in the state retention file), unless you disable the use_retained_program_state option. If you want to change this option when state retention is active (and the use_retained_program_state is enabled), you'll have to use the appropriate external command or change it via the web interface. Option is enabled by default.
de: Diese Option legt fest, ob die Monitoring Engine beim (Neu)Start Event-Handler ausführt. Wenn diese Option deaktiviert ist, werden von der Monitoring Engine keine Host bzw. Service Event-Handler ausgeführt. Hinweis: Wenn die Beibehaltung des letzten Status aktiviert ist, wird diese Einstellung beim (Neu)Start der Monitoring Engine ignoriert und die letzte bekannte Einstellung für diese Option verwendet (die letzte verwendete Einstellung wird in der Satusbeibehaltungsdatei gespeichert). Das ist jedoch nicht der Fall, wenn die beibehaltenen Programmstatus verwenden (use_retained_program_state)-Option deaktviert ist. Wenn diese Option angepasst werden soll, während die Aufbewahrung des letzten Status aktiviert ist (und die use_retained_program_state ebenfalls aktiviert ist), muss der entsprechende externe Befehl verwendet bzw. die Einstellung über das Web-Interface angepasst werden. Diese Option ist standardmäßig aktiviert.
fr: Cette option détermine si le moteur de supervision utilise ou non les gestionnaires d'événements quand il (re)démarre. Si cette option est désactivée, le moteur de supervision n'utilise aucun gestionnaire d'événements d'hôte ou de service. Note : si la rétention d'état est activée, le système de supervision ignorera ce paramètre quand il (re)démarre et utilise la dernière valeur connue de ce paramètre (telle qu'enregistrée dans le fichier de rétention des états), sauf si l'option use_retained_program_state est désactivée. Pour changer cette option quand la rétention d'état est active (et que use_retained_program_state est actif), il faudra utiliser la commande externe adéquate ou la changer via l'interface web. L'option est activée par défaut.

source: This is the rotation method that you would like Monitoring Engine to use for your log file.
de: Rotationsmethode, die für die Protokolldatei der Monitoring Engine verwendet werden soll.
fr: Méthode de rotation que vous souhaitez que le moteur de supervision utilise pour vos fichiers journaux.

source: This is the directory where Monitoring Engine should place log files that have been rotated. This option is ignored if you choose to not use the log rotation functionality.
de: In diesem Verzeichnis werden Protokolldateien abgelegt, die von der Monitoring Engine rotiert wurden. Diese Option wird ignoriert, wenn die Protokollrotation nicht genutzt wird.
fr: C'est le répertoire où le moteur de supervision doit enregistrer les fichiers journaux ayant fait l'objet d'une rotation. Cette option est ignorée si vous n'avez pas activé la rotation du journal.

source: This option determines whether or not Monitoring Engine will check the command file for commands that should be executed. This option must be enabled if you plan on using Centreon to issue commands via the web interface.
de: Diese Option legt fest, ob die Monitoring Engine die Befehlsdatei nach Befehlen durchsucht, die ausgeführt werden sollen. Diese Option muss aktiviert sein, wenn durch Centreon über das Web-Interface Befehle ausgeführt werden sollen.
fr: Cette option détermine si le moteur de supervision doit vérifier ou non le fichier de commandes pour les commandes qui doivent être exécutées. Cette option doit être activée si vous souhaitez que Centreon exécute des commandes via l'interface web.

source: If you specify a number with an "s" appended to it (i.e. 30s), this is the number of seconds to wait between external command checks. If you leave off the "s", this is the number of "time units" to wait between external command checks. Unless you've changed the interval_length value (as defined below) from the default value of 60, this number will mean minutes. By setting this value to -1, Monitoring Engine will check for external commands as often as possible. Each time Monitoring Engine checks for external commands it will read and process all commands present in the command file before continuing on with its other duties.
de: Wenn in diesem Feld eine Zahl mit angehängtem "s" angegeben wird (z.B. 30s), wird diese als Zeit in Sekunden zwischen Überprüfungen auf externe Befehle interpretiert. Ohne "s" wird diese Zahl als Anzahl von Zeiteinheiten zwischen Überprüfungen auf externe Befehle interpretiert. Wenn der Standardwert der Intervalllänge (interval_length) (60) nicht geändert wurde, entspricht der eingetragene Wert Minuten. Wenn dieser Wert auf -1 gesetzt wird, findet die Überprüfung durch die Monitoring Engine so häufig wie möglich statt. Dadurch werden bei jeder Überprüfung der Monitoring Engine alle Befehle in der Befehlsdatei gelesen und verarbeitet, bevor andere Aktivitäten ausgeführt werden.
fr: Si vous spécifiez un nombre suivi d'un "s" (ex: 30s), celui-ci sera l'intervalle en secondes entre les vérifications des commandes externes. Si vous ne mettez pas "s", ce sera un nombre d'"unité de temps" à attendre entre les vérifications de commandes externes. Sauf si vous avez changé la valeur "interval_length" (tel que défini ci-dessous) à partir de la valeur par défaut de 60, ce nombre exprime des minutes. En définissant cette valeur à -1, le moteur de surveillance contrôlera les commandes externes aussi souvent que possible. À chaque fois que le moteur de vérification contrôlera les commandes externes, il lira et exécutera toutes les commandes présentes dans le fichier de commandes avant de passer à tâches suivantes.
