Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: This option determines whether or not Monitoring Engine will log passive host and service checks that it receives from the external command file. This option is enabled by default. If you are setting up a distributed monitoring environment or plan on handling a large number of passive checks on a regular basis, you may wish to disable this option so your log file doesn't get too large.
de: Diese Option legt fest, ob passive Host- bzw. Service-Überprüfungen durch die Monitoring Engine protokolliert werden, die aus der Befehlsdatei stammen. Diese Option ist standardmäßig aktiviert. Wenn Centreon als verteilte Monitoring-Umgebung aufgesetzt ist bzw. regelmäßig eine hohe Anzahl von passiven Überprüfungen ausgeführt wird, kann diese Option deaktiviert werden, um den Zuwachs der Protokolldatei zu minimieren.
fr: Cette variable détermine si le moteur de supervision journalisera les commandes externes reçues via le fichier de commandes externes. Cette option est activée par défaut. Si vous mettez en place un environnement distribué ou le traitement d'un grand nombre de contrôles passifs sur une base régulière, vous pouvez désactiver cette option pour éviter que votre fichier journal soit trop grand.

source: This option allows you to specify a host event handler command that is to be run for every host state change. The global event handler is executed immediately prior to the event handler that you have optionally specified in each host definition. The maximum amount of time that this command can run is controlled by the event_handler_timeout option.
de: Mit dieser Option kann ein Host Event Handler angeben werden, der für jede Statusänderung eines Hosts ausgeführt werden soll. Der globale Event Handler wird unmittelbar vor dem Event Handler ausgeführt, der optional pro Host in dessen Konfiguration angegeben werden kann. Nach der in event_handler_timeout festgelegten Zeit läuft der Befehl in einen Timeout und wird zwangsweise beendet.
fr: Cette option permet de spécifier un gestionnaire d'événements appelé à chaque changement d'état d'un hôte. Le gestionnaire d'événements global s'exécute juste avant le gestionnaire d'événement que vous avez spécifié de manière optionnelle dans la définition de l'hôte. Le temps d'exécution maximal de cette commande est déterminé par la variable event_handler_timeout.

source: This option allows you to specify a service event handler command that is to be run for every service state change. The global event handler is executed immediately prior to the event handler that you have optionally specified in each service definition. The maximum amount of time that this command can run is controlled by the event_handler_timeout option.
de: Mit dieser Option kann ein Service Event Handler angeben werden, der für jede Statusänderung eines Services ausgeführt werden soll. Der globale Event Handler wird unmittelbar vor dem Event Handler ausgeführt, der optional pro Service in dessen Konfiguration angegeben werden kann. Nach der in event_handler_timeout festgelegten Zeit läuft der Befehl in einen Timeout und wird zwangsweise beendet.
fr: Cette option permet de spécifier un gestionnaire d'événement appelé à chaque changement d'état d'un service. Le gestionnaire d'événements global s'exécute juste avant le gestionnaire d'événement que vous avez spécifié de manière optionnelle dans la définition du service. Le temps d'exécution maximal de cette commande est déterminé par la variable event_handler_timeout.

source: This is the number of seconds that Monitoring Engine will sleep before checking to see if the next service or host check in the scheduling queue should be executed. Note that Monitoring Engine will only sleep after it "catches up" with queued service checks that have fallen behind.
de: Zeit in Sekunden, die die Monitoring Engine in den Ruhezustand versetzt wird, bevor überprüft wird, ob die nächste Service- bzw. Hostüberprüfung in der Warteschlange ausgeführt werden soll. Hinweis: Die Monitoring Engine wird erst in den Ruhezustand versetzt, wenn alle sich in der Warteschlange befindlichen Service-Überprüfungen abgearbeitet wurden.
fr: C'est le nombre de secondes pendant lequel le moteur de supervision va dormir avant de vérifier si le prochain contrôle de service ou d'hôte en file d'attente doit être exécuté. Notez que le moteur de supervision ne s'endormira qu'après avoir liquidé les contrôles de services en retard dans la file.

source: This option allows you to specify the maximum number of service checks that can be run in parallel at any given time. Specifying a value of 1 for this variable essentially prevents any service checks from being run in parallel. Specifying a value of 0 (the default) does not place any restrictions on the number of concurrent checks. You'll have to modify this value based on the system resources you have available on the machine that runs Monitoring Engine, as it directly affects the maximum load that will be imposed on the system (processor utilization, memory, etc.).
de: Maximale Anzahl an Service-Überprüfungen, die parallel ausgeführt werden können. Ein Wert von 1 für diese Variable verhindert, dass Service-Überprüfungen parallel ausgeführt werden. Ein Wert von 0 (Standardwert) schränkt die Anzahl der gleichzeitigen Überprüfungen nicht ein. Dieser Wert sollte basierend auf den Systemressourcen festgelegt werden, die auf dem Computer, auf dem Monitoring Engine ausgeführt wird, verfügbar sind. Er wirkt sich direkt auf die maximale Last auf die Systemressourcen aus (Prozessorauslastung, Arbeitsspeichernutzung usw.).
fr: Cette option permet de spécifier le nombre maximal de contrôles de service pouvant tourner en parallèle à un instant donné. Une valeur de 1 empêche la parallélisation. Une valeur de 0 (par défaut) n'impose aucune restriction sur le nombre de contrôles simultanés. Vous ajusterez cette valeur en fonction des capacités de la machine sur laquelle tourne le moteur de supervision, car elle impacte directement la charge du système (processeur, mémoire, etc.).

source: This option determines the maximum number of minutes from when Monitoring Engine starts that all hosts (that are scheduled to be regularly checked) are checked. This option will automatically adjust the host inter-check delay method (if necessary) to ensure that the initial checks of all hosts occur within the timeframe you specify. In general, this option will not have an effect on host check scheduling if scheduling information is being retained using the use_retained_scheduling_info option. Default value is 30 (minutes).
de: Maximale Zeit in Minuten ab dem Start der Monitoring Engine, in denen alle Hosts (die regelmäßig überprüft werden sollen) überprüft werden. Diese Option passt automatisch, sofern erforderlich, die Inter-Host-Überprüfungsverzögerung an, um sicherzustellen, dass die initialen Überprüfungen aller Hosts innerhalb des angegebenen Zeitraums erfolgen. Im Allgemeinen hat diese Option keine Auswirkungen auf die Planung von Host-Überprüfungen, wenn Planungsinformationen mithilfe der Option use_retained_scheduling_info gespeichert werden. Standardwert ist 30 (Minuten).
fr: Cette option détermine le nombre maximal de minutes entre le démarrage du moteur de supervision et la vérification de tous les hôtes (qui doivent être régulièrement vérifiés). Cette option permet de régler automatiquement la stratégie de délai entre les vérifications d'hôte (si nécessaire) pour s'assurer que les vérifications initiales de tous les hôtes se produisent dans l'intervalle de temps spécifié. En général cette option n'a pas d'effet sur ​​la planification des vérifications d'hôte si l'information sur la planification est conservée en utilisant l'option use_retained_scheduling_info. La valeur par défaut est 30 (minutes).

source: This option determines the maximum number of minutes from when Monitoring Engine starts until all services (that are scheduled to be regularly checked) are checked. This option will automatically adjust the service inter-check delay method (if necessary) to ensure that the initial checks of all services occur within the timeframe you specify. In general, this option will not have an effect on service check scheduling if scheduling information is being retained using the use_retained_scheduling_info option. Default value in centengine is 5 (minutes) but it should be raised to 30 if the poller monitors more than 5000 services to avoid load issues.
de: Maximale Zeit in Minuten ab dem Start der Monitoring Engine, in denen alle Services (die regelmäßig überprüft werden sollen) überprüft werden. Diese Option passt automatisch, sofern erforderlich, die Inter-Service-Überprüfungsverzögerung an, um sicherzustellen, dass die initialen Überprüfungen aller Services innerhalb des angegebenen Zeitraums erfolgen. Im Allgemeinen hat diese Option keine Auswirkungen auf die Planung von Service-Überprüfungen, wenn Planungsinformationen mithilfe der Option use_retained_scheduling_info gespeichert werden. Standardwert in der centengine ist 5 (Minuten). Dieser Wert sollte jedoch auf 30 erhöht werden, wenn von diesem Poller über 5000 Services überwacht werden. Dadurch können Auslastungsprobleme vermieden werden.
fr: Cette option détermine le nombre maximal de minutes entre le démarrage du moteur de supervision et la vérification de tous les services (qui doivent être régulièrement vérifiés). Cette option permet de régler automatiquement la stratégie de délai entre les vérifications de service (si nécessaire) pour s'assurer que les vérifications initiales de tous les services se produisent dans l'intervalle de temps spécifié. En général, cette option n'a pas d'effet sur la planification des vérifications de service si l'information sur la planification est conservée en utilisant l'option use_retained_scheduling_info. La valeur par défaut est 5 (minutes) mais elle doit être augmentée à 30 si le collecteur supervise plus de 5000 services pour éviter des problèmes de charge.

source: This option determines how service checks are interleaved. Interleaving allows for a more even distribution of service checks, reduced load on remote hosts, and faster overall detection of host problems. By default this value is set to s (smart) for automatic calculation of the interleave factor. Don't change unless you have a specific reason to change it. Setting this value to a number greater than or equal to 1 specifies the interleave factor to use. A value of 1 is equivalent to not interleaving the service checks.
de: Diese Option legt fest, wie Service-Überprüfungen verschachtelt werden. Verschachtelung ermöglicht eine gleichmäßigere Verteilung von Service-Überprüfungen, reduzierte Auslastung auf Remote-Hosts und allgemein schnellere Erkennung von Host-Problemen. Standardwert ist s (smart) für eine automatische Kalkulation des Verschachtelungsfaktors. Dieser Wert sollte nicht ohne einen konkreten Anlass geändert werden. Ein Wert von 1 oder höher gibt den Verschachtelungsfaktor an. Ein Wert von 1 entspricht keiner Verschachtelung.
fr: Cette option détermine comment les contrôles des services sont entrelacés. L'entrelacement permet une meilleure distribution des contrôles des services, de réduire la charge sur les hôtes distants, et d'accélérer la détection des problèmes d'hôtes. Par défaut cette valeur est définie à s (intelligent) pour le calcul automatique du facteur d'entrelacement. Ne changez pas cette valeur à moins que vous ayez une raison particulière de le faire. Configurer cette valeur avec un nombre supérieur ou égal à 1 spécifie le facteur d'entrelacement à utiliser. Une valeur de 1 est équivalente à ne pas entrelacer les contrôles de service.

source: This option allows you to control how service checks are initially "spread out" in the event queue. Enter "s" for using a "smart" delay calculation (the default), which will cause Monitoring Engine to calculate an average check interval and spread initial checks of all services out over that interval, thereby helping to eliminate CPU load spikes. Using no delay ("n") is generally not recommended, as it will cause all service checks to be scheduled for execution at the same time. This means that you will generally have large CPU spikes when the services are all executed in parallel. Use a "d" for a "dumb" delay of 1 second between service checks or supply a fixed value of x.xx seconds for the inter-check delay.
de: Mit dieser Option kann gesteuert werden, wie Service-Überprüfungen zunächst in der Warteschlange "verteilt" werden. Standardwert ist "s" (smart) für eine automatische Verzögerungsberechnung, die dazu führt, dass die Monitoring Engine ein durchschnittliches Prüfintervall berechnet und die ersten Überprüfungen aller Services über dieses Intervall verteilt, wodurch CPU-Lastspitzen vermieden werden. Keine Verzögerung ("n") wird im Allgemeinen nicht empfohlen, da dadurch alle Service-Überprüfungen gleichzeitig für die Ausführung eingeplant werden. Die Ausführung aller Service-Überprüfungen ohne Verzögerung führt dazu, dass zu der Überprüfungszeit CPU-Spitzen ausgelöst werden. Mit "d" (dumb) wird eine Verzögerung von 1 Sekunde zwischen Service-Überprüfungen verwendet. Alternativ kann ein fester Wert von x,xx Sekunden für die Inter-Überprüfungsverzögerung angegeben werden.
fr: Cette option permet de contrôler comment les vérifications de service sont initialement "étalées" dans la file d'attente. Entrer "s" pour un calcul "intelligent" du délai (par défaut), le moteur de supervision calculera un intervalle de temps moyen entre les vérifications et répartira les vérifications initiales des services dans cet intervalle, ce qui contribue à éliminer les pics de charge du CPU. La valeur sans délai ("n") n'est généralement pas recommandée, car cela planifie toutes les vérifications de service en même temps. Cela signifie que les pics de consommation CPU sont généralement importants lorsque les vérifications de service sont toutes exécutées en parallèle. Entrer la valeur "d" pour un délai par défaut de 1 seconde entre les vérifications de service ou encore fournir une valeur fixe de x.xx secondes pour le délai entre les vérifications.

source: This option allows you to control how host checks are initially "spread out" in the event queue. Enter "s" for using a "smart" delay calculation (the default), which will cause Monitoring Engine to calculate an average check interval and spread initial checks of all hosts out over that interval, thereby helping to eliminate CPU load spikes. Using no delay ("n") is generally not recommended, as it will cause all host checks to be scheduled for execution at the same time. This means that you will generally have large CPU spikes when the hosts are all executed in parallel. Use a "d" for a "dumb" delay of 1 second between host checks or supply a fixed value of x.xx seconds for the inter-check delay.
de: Mit dieser Option kann gesteuert werden, wie Host-Überprüfungen zunächst in der Warteschlange "verteilt" werden. Standardwert ist "s" (smart) für eine automatische Verzögerungsberechnung, die dazu führt, dass die Monitoring Engine ein durchschnittliches Prüfintervall berechnet und die ersten Überprüfungen aller Hosts über dieses Intervall verteilt, wodurch CPU-Lastspitzen vermieden werden. Keine Verzögerung ("n") wird im Allgemeinen nicht empfohlen, da dadurch alle Host-Überprüfungen gleichzeitig für die Ausführung eingeplant werden. Die Ausführung aller Host-Überprüfungen ohne Verzögerung führt dazu, dass zu der Überprüfungszeit CPU-Spitzen ausgelöst werden. Mit "d" (dumb) wird eine Verzögerung von 1 Sekunde zwischen Host-Überprüfungen verwendet. Alternativ kann ein fester Wert von x,xx Sekunden für die Inter-Überprüfungsverzögerung angegeben werden.
fr: Cette option permet de contrôler comment les vérifications d'hôte sont initialement "étalées" dans la file d'attente. Entrer "s" pour un calcul "intelligent" du délai (par défaut), le moteur de supervision calculera un intervalle de temps moyen entre les vérifications et répartira les vérifications initiales des hôtes dans cet intervalle, ce qui contribue à éliminer les pics de charge du CPU. La valeur sans délai ("n") n'est généralement pas recommandée, car cela planifie toutes les vérifications des hôtes en même temps. Cela signifie que les pics de consommation CPU sont généralement importants lorsque les vérifications d'hôte sont toutes exécutées en parallèle. Entrer la valeur "d" pour un délai par défaut de 1 seconde entre les vérifications de service ou encore fournir une valeur fixe de x.xx secondes pour le délai entre les vérifications.

source: This option allows you to control the frequency in seconds of check result "reaper" events. "Reaper" events process the results from host and service checks that have finished executing. These events constitute the core of the monitoring logic in Monitoring Engine.
de: Diese Option legt fest, wie häufig (in Sekunden) Überprüfungsergebnis "Reaper"-Events ausgeführt werden sollen. "Reaper"-Events verarbeiten die Ergebnisse von Host- und Serviceüberprüfungen, die vollständig ausgeführt wurden. Diese Events bilden den Kern der Überwachungslogik in der Monitoring Engine.
fr: Cette option vous permet de contrôler la fréquence de consolidation des événements en secondes. La consolidation des événements traitent les résultats des contrôles d'hôtes et de services dont l'exécution est terminée. Ces événements constituent le cœur de la logique de supervision du moteur de supervision.

source: This option determines whether or not Monitoring Engine will translate DOWN/UNREACHABLE passive host check results to their "correct" state from the viewpoint of the local Monitoring Engine instance. This can be very useful in distributed and failover monitoring installations. Option is disabled by default.
de: Diese Option legt fest, ob die Monitoring Engine Ergebnisse von passiven Host-Überprüfungen mit dem Ergebnis DOWN/UNREACHABLE aus Sicht der lokalen Monitoring Engine-Instanz in den "richtigen" Zustand übersetzt. Diese Option kann bei verteilten und Failover-Installationen sehr nützlich sein. Diese Option ist standardmäßig deaktiviert.
fr: Cette option détermine si le moteur de supervision traduira ou pas les états indisponible/injoignable des résultats de vérification d'hôte dans un état "corrigé" vu de l'instance locale du moteur de supervision. Ceci peut être très utile dans des environnements distribués ou redondés. Cette option est désactivée par défaut.

source: This option determines whether or not Monitoring Engine will treat passive host checks as HARD states or SOFT states. By default, a passive host check result will put a host into a HARD state type. This option is disabled by default.
de: Diese Option legt fest, ob die Ergebnisse von passiven Host-Überprüfungen von der Monitoring Engine als HARD- oder SOFT-Status interpretiert werden. Standardmäßig werden die Ergebnisse von passiven Host-Überprüfungen als HARD-Status festgelegt. Diese Option ist standardmäßig deaktiviert.
fr: Cette option détermine si le moteur de supervision considère les vérifications passives d'hôte comme des états HARD ou bien SOFT. Par défaut, le résultat d'une vérification passive d'hôte se traduit par un état HARD. Cette option est désactivée par défaut.

source: This option determines whether or not Monitoring Engine will attempt to automatically reschedule active host and service checks to "smooth" them out over time. This can help to balance the load on the monitoring server, as it will attempt to keep the time between consecutive checks consistent, at the expense of executing checks on a more rigid schedule.<br><b>Warning:</b> this is an experimental feature and may be removed in future versions. Enabling this option can degrade performance - rather than increase it - if used improperly!
de: Diese Option legt fest, ob die Monitoring Engine automatisch versucht, aktive Host- und Service-Überprüfungen neu zu planen, um diese über die Zeit "auszuglätten". Dadurch kann die Last auf dem Monitoring-Server reduziert werden, da versucht wird, den Abstand zwischen Überprüfungen konstant zu halten statt eine starre Planung auszuführen.<br><b>Achtung:</b> Dies ist eine experimentelle Option und wird in künftigen Versionen ggf. entfernt. Bei falscher Nutzung kann diese Option dazu führen, dass die Performance des Servers verschlechtert wird, statt diese zu verbessern!
fr: Cette option détermine si le moteur de supervision tente ou pas de replanifier automatiquement les vérifications actives d'hôte et de service afin de les «étaler» dans le temps. Cela peut aider à équilibrer la charge sur le serveur de surveillance, car il va essayer de garder le temps entre les vérifications consécutives cohérentes, au détriment de l'exécution des vérifications selon une planification plus strict. <br><b>Avertissement:</b> cette fonctionnalité est expérimentale et peut être supprimée dans les prochaines versions. L'activation de cette option peut dégrader les performances - plutôt que de l'augmenter - elle est mal utilisée!

source: This option determines how often Monitoring Engine will attempt to automatically reschedule checks. This option only has an effect if the auto_reschedule_checks option is enabled. Default is 30 seconds.
de: Diese Option legt fest, wie oft die Monitoring Engine versucht, Überprüfungen automatisch neu zu planen. Diese Option wirkt sich nur aus, wenn die Option Überprüfungen automatisch neu ansetzen (auto_reschedule_checks) aktiviert ist. Standardwert ist 30 Sekunden.
fr: Cette option détermine la fréquence à laquelle le moteur de supervision tentera automatiquement de reprogrammer les vérifications. Cette option a un effet uniquement si l'option auto_reschedule_checks est activée. Par défaut à 30 secondes.

source: This option determines the "window" of time that Monitoring Engine will look at when automatically rescheduling checks. Only host and service checks that occur in the next X seconds (determined by this variable) will be rescheduled. This option only has an effect if the auto_reschedule_checks option is enabled. Default is 180 seconds (3 minutes).
de: Diese Option legt fest, welcher Zeitraum von der Monitoring Engine für die Neuplanung von Überprüfungen berücksichtigt wird. Nur Host- und Service-Überprüfungen die in den nächsten X Sekunden (Festgelegt durch diese Option) ausgeführt werden, werden neu geplant. Diese Option wirkt sich nur aus, wenn die Option Überprüfungen automatisch neu ansetzen (auto_reschedule_checks) aktiviert ist. Standardwert ist 180 Sekunden (3 Minuten).
fr: Cette option détermine la «fenêtre» de temps dans laquelle le moteur de supervision replanifie automatiquement les vérifications. Seules les vérifications d'hôtes et de services qui se produisent dans les prochaines N secondes (déterminé par cette variable) seront replanifiées. Cette option n'a d'effet que si l'option auto_reschedule_checks est activée. La valeur par défaut est de 180 secondes (3 minutes).
