Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: This is a list of host group-bound services that should be included in this service group.
de: Dies ist eine Liste der hostgruppengebundenen Service, die Mitglieder in dieser Servicegruppe sein sollen.
fr: C'est une liste de services par groupe d'hôtes et qui devraient être inclus dans ce groupe de services.

source: This is a list of service templates that should be included in this service group. Service template needs to be associated with a host template in order to show up here.
de: Dies ist eine Liste der Service-Templates, die Mitglied in dieser Servicegruppe sein sollen. Die Dienstvorlage muss einer Hostvorlage zugeordnet sein, damit sie hier angezeigt wird.
fr: Ce champ permet de sélectionner des modèles de services, ainsi les services qui hériteront des modèles sélectionnés seront automatiquement ajouté au groupe de service. Seuls les modèles de services liés à des modèles d’hôtes sont proposés dans ce champ.

source: This optional directive can be used to include services from other "sub" service groups in this service group.
de: Diese optionale Richtlinie kann dazu verwendet werden, um Services von anderen Sub-Servicegruppen in dieser Kontaktgruppe aufzunehmen.
fr: Ce paramètre optionnel peut être utilisé pour inclure des services d'autres "sous" groupes de services dans ce groupe de services.

source: This directive is used to define an optional string of notes pertaining to the service group. If you specify a note here, you will see it in the extended information CGI (when you are viewing information about the specified service group).
de: Optionale Notizen zur Servicegruppe. Wenn hier Notizen angegeben werden, werden diese in den erweiterten Informationen CGI angezeigt (Wenn Informationen zu der angegebenen Servicegruppe angesehen werden).
fr: Cette option est utilisée pour lier une chaîne de caractère optionnelle sous forme de note concernant le groupe de service. Si vous spécifiez une note ici, celle-ci sera visible dans les informations étendues (Quand vous visualisez ces informations concernant le service groupe en question).

source: This directive is used to define an optional URL that can be used to provide more information about the service group. Any valid URL can be used. If you plan on using relative paths, the base path will be the same as what is used to access the CGIs (i.e. /cgi-bin/nagios/). This can be very useful if you want to make detailed information on the service group, emergency contact methods, etc. available to other support staff.
de: Geben Sie eine optionale URL an, unter der weitere Informationen zu der Servicegruppe verfügbar sind. Jede valide URL kann genutzt werden. Wenn relative Pfade genutzt werden sollen, ist der Basispfad der selbe, wie der für den Zugriff auf die CGIs (d.h. /cgi-bin/nagios/). Diese Option ist nützlich, um detaillierte Informationen zu der Servicegruppe oder Notfallkontakten für andere Supportmitarbeiter zur Verfügung zu stellen.
fr: Permet de définir une URL optionnelle pouvant être utilisée pour ajouter des informations additionnelles. Toute URL valide peut être utilisée. Dans le cas où les URL sont relatives, elles seront basée sur l'accès aux CGI (c'est à dire /cgi-bin/nagios pour l'ordonnanceur Nagios). Ceci peut être très utile pour ajouter des informations détaillées sur le groupe de service, des méthodes de contact de secours, etc, disponibles pour d'autre personnes du support.

source: This directive is used to define an optional URL that can be used to provide more actions to be performed on the service group. Any valid URL can be used. If you plan on using relative paths, the base path will be the same as what is used to access the CGIs (i.e. /cgi-bin/nagios/).
de: Geben Sie eine optionale URL an, unter der weitere Aktionen für diese Servicegruppe verfügbar sind. Jede valide URL kann genutzt werden. Wenn relative Pfade genutzt werden sollen, ist der Basispfad der selbe, wie der für den Zugriff auf die CGIs (d.h. /cgi-bin/nagios/).
fr: Cette option est utilisée pour définir une URL facultative pouvant être utilisée pour permettre d’exécuter des actions supplémentaires sur le groupe de service. N'importe quelle URL valide peut être utilisée. Si vous souhaitez utiliser des chemins relatifs d, le chemin de base sera le même que celui utilisé pour accéder aux CGIs (par ex: /cgi-bin/nagios/)

source: The name is used to identify the group with a short name.
de: Der Name wird dazu verwendet, die Gruppe anhand eines Kurznamens zu identifizieren.
fr: Nom court du groupe pour l'identifier rapidement.

source: Select traps to be grouped. Execution will be sequential.
de: Wählen Sie Traps aus, die gruppiert werden sollen. Diese werden sequentiell ausgeführt.
fr: Sélectionner les traps SNMP qui seront groupées. Le traitement associé aux traps SNMP sera alors séquentiel.

source: This directive is used to identify the host(s) that the service that is being depended upon (also referred to as the master service) "runs" on or is associated with.
de: Diese Richtlinie legt den/die Kurzname(n) des/der Host(s) fest, zu dem/denen eine Relation besteht bzw. auf dem/denen er läuft (Auch als Master-Host bezeichnet).
fr: Cette variable est utilisée pour identifier l'hôte (ou les hôtes) sur lequel tourne le service dont on dépend (aussi appelé service maître) avec lequel il est associé.

source: This directive is used to identify the description of the service that is being depended upon (also referred to as the master service).
de: Diese Richtlinie legt die Beschreibung des Services fest, zu dem eine Abhängigkeit besteht (Auch als Master-Service bezeichnet).
fr: Cette variable est utilisée pour identifier la description d'un service dont on dépend (aussi appelé service maître).

source: This directive is used to identify the host(s) that the dependent service "runs" on or is associated with. Leaving this directive blank can be used to create "same host" dependencies.
de: Diese Richtlinie legt den/die Host(s) fest, zu dem/denen der abhängige Service eine Relation hat bzw. auf dem/denen er läuft (Auch als Master-Host bezeichnet). Dieser Wert kann leer gelassen werden, um Abhängigkeiten zwischen Services die auf dem gleichen Host laufen darzustellen.
fr: Cette variable est utilisée pour identifier l'hôte (ou les hôtes) sur lequel tourne le service dépendant avec lequel il est associé. Laissez cette variable vide peut être une solution pour créer des dépendances sur le même hôte.

source: This directive is used to identify the short name(s) of the hostgroup(s) that the service that is being depended upon (also referred to as the master service) "runs" on or is associated with. Multiple hostgroups should be separated by commas. The hostgroup_name may be used instead of, or in addition to, the host_name directive.
de: Diese Richtlinie legt den/die Kurzname(n) der Hostgruppe(n) fest, zu der/zu denen der Service, zu dem eine Abhängigkeit besteht (Auch als Master-Service bezeichnet), eine Relation hat bzw. auf dem/denen er läuft. Mehrere Hostgruppen müssen durch Kommata separiert werden. Der hostgroup_name kann statt bzw. zusätzlich zu host_name genutzt werden.
fr: Cette variable est utilisée pour identifier le(s) nom(s) court(s) de groupe(s) d'hôtes sur lequel tourne le service dont on dépend (aussi appelé service maître) avec lequel il est associé. Plusieurs groupes hôtes peuvent être séparés par des virgules. La variable hostgroup_name peut être utilisé à la place ou en conjonction avec la variable host_name.

source: This directive is used to specify the short name (s) of the hostgroup(s) that the dependent service "runs" on or is associated with. The dependent_hostgroup may be used instead of, or in addition to, the dependent_host directive.
de: Diese Richtlinie legt den/die Kurzname(n) der Hostgruppe(n) fest, zu dem/denen der abhängige Service eine Relation hat bzw. auf dem/denen er läuft. Der dependent_hostgroup kann statt bzw. zusätzlich zu dependent_host genutzt werden.
fr: Cette variable est utilisée pour identifier le(s) nom(s) court(s) de groupe(s) d'hôtes sur lesquels tourne le service dépendant avec lesquels il est associé. Plusieurs groupes d'hôtes peuvent être séparés par des virgules. La variable dependent_hostgroup peut être utilisée à la place ou en conjonction avec la variable dependent_host.

source: This directive is used to identify the description of the service group that is being depended upon (also referred to as the master service group).
de: Diese Richtlinie legt die Beschreibung der Servicegruppe fest, zu dem eine Abhängigkeit besteht (Auch als Master-Servicegruppe bezeichnet).
fr: Cette directive est utilisée pour identifier la description du groupe de service dont on dépend (aussi appelé groupe de service maître).

source: This directive is used to identify the description of the dependent service group.
de: Diese Richtlinie legt die Beschreibung der abhängigen Servicegruppe fest.
fr: Cette variable est utilisée pour identifier la description d'un groupe de service dépendant.

source: This directive is used to identify the description of the meta service that is being depended upon (also referred to as the master meta service).
de: Diese Richtlinie legt die Beschreibung des Meta-Services fest, zu dem eine Abhängigkeit besteht (Auch als Master-Meta-Service bezeichnet).
fr: Cette directive est utilisée pour identifier la description d'un méta service dont on dépend (aussi appelé le service méta maître).

source: This directive is used to identify the description of the dependent meta service.
de: Diese Richtlinie legt die Beschreibung des abhängigen Meta-Services fest.
fr: Cette directive est utilisée pour identifier la description d'un méta service dépendant.

source: This directive is used to identify the description of the dependent host.
de: Diese Richtlinie legt die Beschreibung des abhängigen Hosts fest.
fr: Cette directive est utilisée pour identifier la description de l'hôte dépendant.

source: Name which will be used for identifying the connector.
de: Name, der den Konnektor identifiziert.
fr: Nom qui sera utilisé pour identifier le connecteur

source: A short description of the connector.
de: Kurze Beschreibung des Konnektors.
fr: Brève description du connecteur

source: The connector binary that centreon-engine will launch.
de: Die Konnektorausführungsdatei die Centreon-Engine ausführen wird.
fr: Chemin d'accès au connecteur qui sera exécuté par le moteur de supervision.

source: Whether or not the connector is enabled.
de: Legt fest, ob der Konnektor aktiviert ist.
fr: Connecteur activé ou non

source: Choose a local MIB file containing SNMP trap definitions to upload and import. The file will be parsed with snmpttconvertmib.
de: Geben Sie eine lokal vorhandene MIB-Datei an, die die SNMP-Trap-Definitionen enthält, die hochgeladen und importiert werden sollen. Die Datei wird mithilfe von snmpttconvertmib verarbeitet.
fr: Choisissez un fichier MIB local contenant les définitions des traps SNMP à envoyer et importer. Le fichier sera parcouru par snmpttconvertmib.

source: The contact group name is a short name used to identify the contact group in other sections.
de: Der Kontaktgruppenname ist ein Kurzname der verwendet wird, um die Kontaktgruppe in anderen Bereichen anzuzeigen.
fr: Le nom du groupe de contacts est un nom court utilisé afin d'identifier le groupe de contacts dans les autres sections.

source: The alias is a longer name or description used to identify the contact group.
de: Der Alias ist ein längerer Name bzw. eine Beschreibung für die Kontaktgruppe.
fr: L'alias est un nom long ou une description utilisé afin d'identifier le groupe de contacts.

source: The linked contacts define a list of contacts that should be included in this group. This definition is an alternative way to specifying the contact groups in contact definitions.
de: Die verlinkten Kontakte geben eine Liste von Kontakten an, die dieser Gruppe angehören. Dies ist Alternative zur Angabe von Kontaktgruppen über die Kontaktdefinition zu sehen.
fr: Les contacts liés définissent une liste de contacts qui devraient être inclus dans ce groupe. Cette définition est une manière alternative pour spécifier les groupes de contacts dans les définitions des contacts.

source: Refers to the ACL groups this contact group is linked to. This parameter is mandatory if you are not an administrator.
de: Bezieht sich auf die Zugriffssteuerungslistengruppen (ACL Gruppen), mit denen diese Kontaktgruppe verknüpft ist. Dieser Parameter ist obligatorisch, wenn Sie kein Administrator sind.
fr: Désigne les groupes d'accès auxquel ce groupe de contacts est lié. Ce paramètre est obligatoire si vous n'êtes pas un administrateur.

source: This optional directive can be used to include contacts from other "sub" contact groups in this contact group. Specify a list of other contact groups whose members should be included in this group.
de: Diese optionale Richtlinie kann dazu verwendet werden, um Kontakte von anderen Sub-Kontaktgruppen in dieser Kontaktgruppe aufzunehmen. Geben Sie eine Liste von anderen Kontaktgruppen an, deren Mitglieder in diese Kontaktgruppe aufgenommen werden sollen.
fr: Cette directive optionnelle peut être utilisée pour inclure des contacts d'autres "sous" groupes de contact dans ce groupe de contact. Spécifie une liste avec d'autres groupes de contact dont les membres devraient être inclus dans ce groupe.

source: Generate a light database for traps.
de: Legt fest, ob für Traps eine SQLite-Datenbank erzeugt werden soll.
fr: Génère une base de données réduite (SQLite) contenant la définition des traps SNMP pour les collecteurs de supervision distants.

source: Push database to poller.
de: Übertrage die Datenbank an den Poller.
fr: Envoyer la base de données vers le collecteur

source: Send restart or reload signal to centreontrapd.
de: Sende ein Neustart bzw. neu Laden Befehl an centreontrapd.
fr: Envoyer un signal de redémarrage ou de rechargement à centreontrapd

source: Poller to interact with.
de: Poller, mit dem interagiert werden soll.
fr: Collecteur distant sur lequel réaliser les opérations.

source: Category filter for flux in output
de: Kategorien, mit denen der Netzwerkfluss im Output gefiltert werden kann
fr: Permet de filtre les données réceptionnées par catégorie de flux entrant.

source: When enabled, the broker engine will check whether or not the replication is up to date before attempting to update data.
de: Wenn diese Option aktiviert ist, wird, bevor eine Aktualisierung durchgeführt wird, die Aktualität der Replikation durch die Broker Engine überprüft.
fr: Si activée, Centreon Broker va contrôle l'état de la réplication MySQL avant d'insérer les données.

source: File for external commands
de: Datei für externe Befehle
fr: Fichier de commandes externes

source: The higher the buffer size is, the best compression. This however increase data streaming latency. Use with caution.
de: Je höher die Puffergröße, desto besser die Kompression. Hinweis: Durch eine höhere Puffergröße wird die Datenstrom-Latenz erhöht.
fr: Plus la taille du cache est élevée, plus la compression est bonne. Cela augmente cependant la latence de transmission des données. Utiliser avec précaution.

source: Whether or not Broker should create entries in the index_data table. This process should be done by Centreon and this option should only be enabled by advanced users knowing what they're doing
de: Legt fest, ob vom Broker Einträge in der index_data-Tabelle erstellt werden sollen. Dieser Eintrag sollte nur von Centreon bzw. von erfahrenen Nutzern aktiviert werden
fr: Permet d'activer ou non l'insertion des données dans la table "index_data". Ce processus est normalement réalisé par Centreon et la modification de cette option doit être réalisée en connaissance de cause.

source: Enable rrdcached option for Centreon, please see Centreon documentation to configure it.
fr: Activer l'option rrdcached pour Centreon, veuillez consulter la documentation de Centreon pour le configurer.

source: The absolute path to unix socket or TCP port for communicating with rrdcached daemon.
fr: Le chemin absolu vers la socket Unix ou le port TCP pour communiquer avec le démon rrdcached.

source: It should be enabled to control whether or not Centreon Broker should insert performance data in the data_bin table.
de: Legt fest, ob vom Centreon Broker Einträge in der index_data-Tabelle erstellt werden sollen.
fr: Doit être activé pour que le module Centreon Broker insère les données de performance en base de données dans la table "data_bin".

source: Used for identifying the poller
de: Name, der den Poller identifiziert
fr: Utilisé pour identifier le collecteur

source: IP address of the poller
de: IP-Adresse des Pollers
fr: Adresse IP du collecteur

source: Whether the poller is local
de: Diese Option legt fest, ob es sich um einen lokalen Poller handelt
fr: Si le collecteur est local

source: Main poller
de: Hauptpoller
fr: Collecteur principal

source: SSH legacy port used by Centreon extensions or tools (see Gorgone Information for communication port between monitoring servers)
de: SSH-Legacy Port der von Centreon Erweiterung oder Tools verwendet wird (In den Gorgone Informationen kann der Port für die Kommunikation zwischen Überwachungsservern eingesehen werden)
fr: Port SSH utilisé par les extensions ou outils Centreon (voir Gorgone Information pour le port de communication entre les serveurs de supervision)

source: Gorgone communication protocol (ZMQ or SSH)
de: Gorgone Kommunikationsprotokoll (ZMQ oder SSH)
fr: Protocole de communication Gorgone (ZMQ ou SSH)

source: Gorgone port of the remote poller (5556 or 22)
de: Gorgone Port des Remote-Pollers (5556 oder 22)
fr: Port de communication Gorgone (5556 ou 22)

source: Monitoring engine
fr: Moteur de supervision

source: Path of init script of the scheduler
fr: Chemin du script de démarrage de l’ordonnanceur

source: Path of init script of centreontrapd
de: Pfad zum Initialisierungsskript von centreontrapd
fr: Chemin du script de démarrage du processus centreontrapd

source: Command to start Centreon Engine process
de: Befehl, um den Prozess der Centreon Engine zu starten
fr: Commande pour démarrer le processus Centreon Engine

source: Command to stop Centreon Engine process
de: Befehl, um den Prozess der Centreon Engine zu beenden
fr: Commande pour arrêter le processus Centreon Engine

source: Command to restart Centreon Engine process
de: Befehl, um den Prozess der Centreon Engine zu neuzustarten
fr: Commande pour redémarrer le processus Centreon Engine

source: Command to reload Centreon Engine process
de: Befehl, um den Prozess der Centreon Engine neuzuladen
fr: Commande pour recharger le processus Centreon Engine

source: Path of binary of the scheduler
de: Pfad zur Ausführdatei des Schedulers
fr: Chemin du binaire de l’ordonnanceur

source: Path of stats binary of the scheduler
de: Pfad zur Statistikausführungsdatei des Schedulers
fr: Chemin du binaire de statistiques de l’ordonnanceur

source: Perfdata script
de: Perfdata Skript
fr: Script pour les données de performance

source: Command to reload Centreon Broker process
de: Befehl, um den Prozess des Centreon Broker neuzustarten
fr: Commande pour recharger le processus Centreon Broker

source: Path of the configuration file for Centreon Broker
de: Pfad zur Konfigurationsdatei des Centreon Broker
fr: Chemin pour le fichier de configuration de Centreon Broker

source: Path with modules for Centreon Broker
de: Pfad zu den Modulen des Centreon Broker
fr: Chemin pour les modules de Centreon Broker

source: Path of the Centreon Broker log file
de: Pfad zur Protokolldatei des Centreon Broker
fr: Chemin du fichier de log de Centreon Broker

source: Path with Centreon Connector binaries
de: Pfad zu den Binaries des Centreon Connector
fr: Chemin d'accès aux connecteurs Centreon

source: Enable or disable poller
de: Aktiviere bzw. Deaktiviere den Poller
fr: Activer ou désactiver le collecteur

source: Centreontrapd init script to restart process on poller.
de: Centreontrapd Initialisierungsskript für den Neustart des Prozesses auf dem Poller.
fr: Script d'initialisation du processus Centreontrapd pour redémarrer celui-ci sur le collecteur.

source: Light databases will be stored in the specified directory. They are used for synchronizing trap definitions on pollers.
de: SQLite-Datenbanken werden in dem angegebenen Verzeichnis gespeichert. Sie werden für die Synchronisierung von Trapdefinitionen auf Pollern verwendet.
fr: Les bases de données réduites sont enregistrées dans un répertoire dédié. Elles sont utilisées pour synchroniser la configuration des traps SNMP pour un collecteur distant.

source: Those commands can be executed at the end of the file generation generation/restart process. Do not specify macros in the commands, for they will not be replaced. Make sure to have sufficient rights for the Apache user to run these commands.
de: Diese Befehle können am Ende der Dateierstellung beim Erstellungs bzw. Neustartprozess ausgeführt werden. In diesen Befehlen dürfen keine Makros angegeben werden, da diese nicht ersetzt werden. Stellen Sie sicher, dass sie ausreichende Berechtigungen für den Apache-Nutzer haben, sodass diese Befehle ausgeführt werden können.
fr: Ces commandes sont exécutées à la fin de la génération de la configuration de la supervision et après le redémarrage du moteur de collecte. NE pas spécifier de macros ans cette commande car elles ne seraient pas remplacées. Vérifier que les droits d'exécution sont suffisant pour l'utilisateur "apache".

source: If checked, it won't use the proxy configured in 'Administration > Parameters > Centreon UI' to connect to the Remote Server.
de: Wenn diese Option aktiviert ist, wird die unter 'Administration > Parameter > Centreon UI' definierte Proxy nicht für die Verbindung zum Remote-Server verwendet.
fr: Si coché, il n'utilisera pas le proxy configuré dans 'Administration > Paramètres > Centreon UI' pour se connecter au serveur distant.

source: Short description of the poller
de: Kurzbeschreibung des Pollers
fr: Brève description du collecteur

source: If disabled, the Central server will send configuration and external commands directly to the poller and will not use the Remote Server as a proxy.
de: Wenn diese Option deaktiviert ist, sendet der zentrale Server die Konfiguration und externen Befehle direkt an den Poller. Der Remote-Server wird in diesem Fall nicht als Proxy verwendet.
fr: Si désactivé, le serveur Central se connectera directement au collecteur pour transférer la configuration et les commandes externes et n'utilisera pas le Remote Server comme proxy.

source: The name of the recurrent downtime rule.
de: Name der wiederkehrenden Ausfallszeitregel.
fr: Le nom de la règle de la plage de maintenance récurrente.

source: Description of the downtime
de: Beschreibung der Ausfallszeit
fr: Description de la plage de maintenance

source: Option to enable or disable this downtime
de: Option um diese Ausfallszeit zu (de)aktivieren
fr: Option pour activer et désactiver la plage de maintenance

source: This field give the possibility to configure the frequency of this downtime.
de: Diese Option legt die Häufigkeit dieser Ausfallszeit fest.
fr: Ce champ donne la possibilité de configurer la fréquence de cette plage de maintenance.

source: This field give you the possibility to select all hosts implied by this downtime
de: Mit dieser Option können alle Hosts ausgewählt werden, die eine Verbindung zu dieser Ausfallszeit besitzen
fr: Ce champ vous donne la possibilité de choisir tous les hôtes impliqués par cette plage de maintenance
