Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: Database name.
de: Datenbankname.
fr: Nom de la base de données

source: Database user.
de: Datenbanknutzer.
fr: Compte utilisateur pour se connecter à la base de données

source: Enable TLS encryption.
de: Aktiviere die TLS-Verschlüsselung.
fr: Active le chiffrement des données via le protocole TLS.

source: Enable caching
fr: Activer la gestion du cache

source: Enable negotiation option (use only for version of Centren Broker >= 2.5)
de: Aktiviert die Verhandlungsoption (Diese Option gilt ausschließlich für Centreon Broker-Versionen >= 2.5)
fr: Permet d'activer la négociation automatique de protocole entre modules Centreon Broker (Centreon Broker doit être en version >= 2.5).

source: Enable or not configuration messages logging.
de: Legt fest, ob Konfigurationsnachrichten protokolliert werden.
fr: Active ou non les évènements de type configuration dans la journalisation.

source: Enable or not data stream compression.
de: Legt fest, ob die Datenstromkompression aktiviert wird.
fr: Activer ou non la compression du flux de données.

source: Enable or not debug messages logging.
de: Legt fest, ob Debug-Nachrichten protokolliert werden.
fr: Active ou non les évènements de type débogage dans la journalisation.

source: Enable or not error messages logging.
de: Legt fest, ob Error-Nachrichten protokolliert werden.
fr: Active ou non les évènements de type erreur dans la journalisation.

source: Enable or not informational messages logging.
de: Legt fest, ob Informationsnachrichten protokolliert werden.
fr: Active ou non les évènements de type information dans la journalisation.

source: File where Centreon Broker statistics will be stored
de: Datei, in der Centreon-Broker-Statistiken gespeichert werden
fr: Fichier où seront stockées les données de statistiques de fonctionnement du module Centreon Broker.

source: File where correlation state will be stored during correlation engine restart
fr: Fichier de rétention des données de corrélation qui sera utilisé lors d'un redémarrage du moteur de supervision.

source: For a file logger this is the path to the file. For a standard logger, one of 'stdout' or 'stderr'.
de: Pfad für einen Dateilogger. Für einen Standardlogger, entweder 'stdout' oder 'stderr'.
fr: Chemin d'accès au journal d'évènements. Pour visualiser les évènements sur la sortie standard, sélectionner "stdout" ou "stderr".

source: How much messages must be logged.
de: Maximale Anzahl an Nachrichten, die protokolliert werden müssen.
fr: Combien de messages doit être enregistrés dans le journal d'évènements.

source: IP address or hostname of the database server.
de: IP-Adresse bzw. Hostname des Datenbankservers.
fr: Adresse IP ou FQDN permettant d'accéder au serveur de base de données.

source: IP address or hostname of the host to connect to (leave blank for listening mode).
de: IP-Adresse bzw. Hostname des Hosts, zu dem eine Verbindung aufgebaut werden soll (Um den Lauschmodus zu verwenden, muss dieses Feld leer gelassen werden).
fr: Adresse IP ou FQDN sur lequel se connecter (laisser vide pour mettre le module en écoute sur ce port).

source: Interval in seconds before change status of resources from a disconnected poller
de: Intervall in Sekunden, bevor der Status der Ressourcen eines Pollers, zu dem die Verbindung verloren gegangen ist, geändert wird
fr: Intervalle en secondes avant de modifier le statut des ressources supervisées par le collecteur déconnecté.

source: Interval in seconds before delete data from deleted pollers.
de: Intervall in Sekunden, nach dem Daten eines gelöschten Pollers ebenfalls gelöscht werden.
fr: Intervalle en secondes avant la suppression des données liées aux collecteurs supprimés.

source: Interval length in seconds.
de: Intervalllänge in Sekunden.
fr: Unité de temps de référence (en secondes).

source: It should be enabled to control whether or not Centreon Broker should insert performance data in the data_bin table.
fr: Doit être activé pour que le module Centreon Broker insère les données de performance en base de données dans la table "data_bin".

source: Maximum size in bytes.
de: Maximale Größe in Bytes.
fr: Taille maximale en octets (Bytes).

source: Name of the input or output object that will act as failover.
de: Name des Eingabe- oder Ausgabeobjekts, das als Failover fungiert.
fr: Nom de l'objet qui sera utilisé pour la bascule lorsque la connexion distante paramétrée ici sera interrompue.

source: Password of database user.
de: Passwort des Datenbanknutzers.
fr: Mot de passe associé au compte d'accès à la base de données.

source: Path to the correlation file which holds host, services, dependencies and parenting definitions.
fr: Chemin d'accès vers le fichier de corrélation qui contient la définition des dépendances d'hôte, services et les relations physiques d'hôtes.

source: Path to the file.
de: Pfad zur Datei.
fr: Chemin d'accès au fichier.

source: Port on which the DB server listens
de: Port, auf dem der Datenbankserver lauscht
fr: Port de connexion à la base de données

source: Port to listen on (empty host) or to connect to (with host filled).
de: Port auf dem gelauscht werden soll (Ohne Angabe eines Hosts) oder zu dem eine Verbindung aufgebaut werden soll (Mit Angabe eines Hosts).
fr: Port sur lequel écouter (dans le cas où aucune adresse distante n'a été renseignée) ou auquel se connecter (si une adresse distante a été renseignée).

source: Private key file path when TLS encryption is used.
de: Pfad zum Private-Key, wenn die TLS-Verschlüsselung genutzt wird.
fr: Chemin du fichier de clé privée lorsque le chiffrement TLS est utilisé.

source: Public certificate file path when TLS encryption is used.
de: Öffentlicher Pfad der Zertifikatsdatei, wenn TLS-Verschlüsselung genutzt wird.
fr: Chemin du fichier de certificat public lorsque le chiffrement TLS est utilisé.

source: RRD file directory, for example /var/lib/centreon/metrics
de: RRD-Dateiverzeichnis. Z.B.: /var/lib/centreon/metrics
fr: Chemin d'accès aux bases de données RRD de performance, par exemple /var/lib/centreon/metrics

source: RRD file directory, for example /var/lib/centreon/status
de: RRD-Dateiverzeichnis. Z.B.: /var/lib/centreon/status
fr: Chemin d'accès aux bases de données RRD de statut, par exemple /var/lib/centreon/status

source: RRD storage duration in seconds.
de: RRD-Speicherdauer in Sekunden.
fr: Durée de rétention en minutes pour le stockage des données en bases RRD.

source: Ranges from 0 (no compression) to 9 (best compression). Default is -1 (zlib compression)
de: Dieser Wert legt die stärke der Kompression fest. (Wertebereich: 0 (keine Kompression) bis 9 (Beste Kompression). Standardwert ist -1 (zlib-Kompression)
fr: Niveau de compression du flux de données : 0 (pas de compression) à 9 (meilleure compression). Par défaut -1 (compression standard zlib).

source: Serialization protocol.
de: Serialisierungsprotokoll.
fr: Protocole de sérialisation des données

source: Target DBMS.
de: Ziel-DBMS.
fr: Type de base de données.

source: The higher the buffer size is, the best compression. This however increase data streaming latency. Use with caution.
fr: Plus l'espace en mémoire alloué pour la compression est important et plus le mécanisme de compression sera meilleur. Cependant, les données sont envoyées quand la limite du cache est atteinte, ce qui peut ajouter quelques latences avant envoi des données. À utiliser avec prudence.

source: The interval between check if some metrics must be rebuild. The default value is 300s
de: Intervall, nachdem überprüft wird, ob Metriken neu erstellt werden müssen (Standardwert: 300 Sekunden)
fr: Intervalle de temps entre deux contrôles du module Centreon Broker RRD afin de récupérer les directives de reconstruction des graphiques de performance. Par défaut cette valeur est positionnée à 300s.

source: Usually cpus/2.
de: Normalerweise cpus/2.
fr: Généralement le nombre de cpus/2.

source: The maximum queries per transaction before commit.
de: Anzahl der maximalen Anfragen pro Transaktion, bevor ein Commit erzwungen wird.
fr: Nombre maximum de requêtes par transaction avant validation d'insertion (commit).

source: The maximum size of log file.
de: Maximale Größe der Protokolldatei.
fr: Taille maximale du fichier de journalisation du module.

source: The passive mode is for the secondary Centreon Broker.
fr: Chemin d'accès aux modules de Centreon Broker

source: The transaction timeout before running commit.
de: Transaktionstimeout, nachdem ein Commit erzwungen wird.
fr: Désigne le temps maximal d'une transaction avant de valider l'insertion des données (commit).

source: This allows the retention to work even if the socket is listening
de: Diese Option ermöglicht die Aufbewahrung von Daten, selbst wenn ein Socket lauscht
fr: Permet de mettre en rétention les données jusqu'à ce qu'une connexion entrante les récupère.

source: This can be used to disable graph update and therefore reduce I/O
de: Mit dieser Option kann die Aktualisierung der Graphen deaktiviert werden, wodurch die I/O-Last reduziert wird
fr: Cette option peut être utilisée pour désactiver la mise à jour des graphiques de performance afin de réduire les E/S disques.

source: Time in seconds to wait before launching failover.
de: Zeit in Sekunden bevor ein Failover-Szenario initiiert wird.
fr: Temps en secondes à attendre avant d'activer le basculement.

source: Time in seconds to wait between each connection attempt (Default value: 30s).
de: Zeit in Sekunden, die zwischen Verbindungsversuchen gewartet wird (Standardwert: 30 Sekunden).
fr: Temps d'attente en secondes entre chaque tentative de connexion. Par défaut 30s.

source: Trusted CA's certificate.
de: Verstrauenswürdiges CA-Zertifikat.
fr: Certificat CA (certificat émanant d'une autorité de certification)

source: When enabled, the broker engine will check whether or not the replication is up to date before attempting to update data.
fr: Permet au module Centreon Broker de contrôler l'état de la réplication MySQL (si elle est mise en oeuvre) avant de tenter d'insérer les données en base.

source: Whether or not Broker should create entries in the index_data table. This process should be done by Centreon and this option should only be enabled by advanced users knowing what they\'re doing
fr: Permet d'activer ou non l'insertion des données dans la table "index_data". Ce processus est normalement réalisé par Centreon et la modification de cette option doit être réalisée en connaissance de cause.

source: Enable Perfdata synchronisation between poller and Central Server operated by Centcore
fr: Active la synchronisation des données de performance entre les collecteurs et le serveur central, opérée par Centcore.

source: Enable Monitoring Engine Logs synchronisation between poller and Central Server operated by Centcore
fr: Active la synchronisation des journaux des ordonnanceurs entre les collecteurs et le serveur central, opérée par Centcore.

source: Timeout value in seconds. Used for freeing Centcore when it's stuck because of blocking pipe files or SSH connections.
fr: Temps maximal en secondes du processus centcore avant échec de récupération des données de statistiques des modules Centreon Broker via la connexion SSH (apparaît dans le cas où le pipe des statistiques est bloqué).

source: Enable Centreon Broker statistics collection into the central server in order to reduce the network load generated by Centcore. Be carefull: broker statistics will not be available into Home > Broker statistics.
de: Aktiviere die Centreon Broker-Statistikerfassung auf dem zentralen Server, um die von Centcore erzeugte Netzwerklast zu reduzieren. Hinweis: Centreon Broker-Statistiken sind dadurch nicht mehr unter Startseite > Broker-Statistiken verfügbar.
fr: Active ou non la récupération des données de statistiques des module Centreon Broker des collecteurs distant. Attention, la récupération des données par le processus centcore peut générer une surcharge réseau dans le cas où le processus n’arriverait pas à récupérer le fichier dû à une mauvaise configuration du module Centreon Broker. Si l’option est désactivée, alors les données de statistiques ne seront pas visibles dans le menu dédié.

source: Illegal characters in external commands. Those characters will be removed before being interpreted by Centcore.
fr: Caractères illégaux dans les commandes externes. Ces caractères seront supprimés avant d'être interprétés par Centcore.

source: Name of configuration
de: Name der Konfiguration
fr: Nom de la configuration

source: Short description of configuration
de: Kurzbeschreibung der Konfiguration
fr: Description succincte de la configuration

source: Enable LDAP authentication
de: Aktiviere die LDAP-Authentifizierung
fr: Activer l'authentification LDAP

source: Whether or not the password should be stored in database
de: Legt fest, ob Passwörter in der Datenbank gespeichert werden sollen
fr: Le mot de passe doit-il être stocké en base de données ou non

source: Can connect with LDAP without import
de: Die LDAP-Verbindung ist ohne einen Import möglich
fr: Autorise les utilisateurs à se connecter à l'interface Centreon sans import préalable des comptes. La configuration du serveur LDAP doit être valide et l'utilisateur doit correspondre aux critères de recherche définis.

source: The contact template for auto imported user.<br/>This template is applied for Monitoring Engine contact configuration and ACLs.
de: Das Kontakt-Template für automatisch importierte Benutzer.<br/>Dieses Template wird sowohl für die Kontaktkonfiguration der Monitoring Engine wie auch für Zugriffssteuerungslisten (ACLs) genutzt.
fr: Le modèle de contact pour les utilisateurs auto importés.<br/>Ce modèle est appliqué pour la configuration des contacts de l'ordonnanceur et pour les ACLs.

source: Default contact group applied to new users.<br/>All imported users will join this contactgroup.
de: Standardkontaktgruppe für neue Nutzer.<br/>Alle importierten Nutzer sind Mitglied dieser Kontaktgruppe.
fr: Groupe de contact par défaut.<br/>Tous les nouveaux utilisateurs rejoindront ce groupe de contact.

source: Use the DNS service for get LDAP host
de: DNS-Dienst verwenden um den LDAP-Host zu ermitteln
fr: Utilise le service DNS pour obtenir les hôtes LDAP

source: Enable SSL connection
de: Aktiviere SSL-Verbindungen
fr: Active la connexion SSL

source: Enable TLS connection
de: Aktiviere TLS-Verbindungen
fr: Active la connexion TLS

source: Set the domain for search the service
de: Name der Domäne, in der nach dem LDAP-Dienst gesucht wird
fr: Configure le domaine pour la recherche du service

source: Search size limit
de: Suchgrößenlimit
fr: Limite du nombre d'objets affichés lors de la recherche.

source: Search timeout
de: Suchtimeout
fr: Durée maximale de la recherche avant arrêt.

source: Ldap server. Failover will take place if multiple servers are defined.<br/>If TLS is enabled, make sure to configure the certificate requirements on the ldap.conf file and restart your web server.
de: LDAP-Server. Falls mehrere Server angegeben werden, wird bei Ausfall eines Servers der nächste verfügbare Server verwendet.<br/>Falls TLS aktiviert ist, müssen die Zertifikatsanforderungen in der ldap.conf-Datei konfiguriert und der Web-Server neugestartet werden.
fr: Serveur LDAP. Le failover prend le dessus si nous avons plusieurs serveur définis<br/>. Si TLS est activé, assurez-vous de configurer les exigences de certification dans le fichier ldap.conf et redémarrez votre serveur web.

source: User DN for connect to LDAP in read only
de: Benutzer-DN für die read only LDAP-Verbindung
fr: Utilisateur DN pour la connexion en lecture seule au LDAP.

source: Password for connect to LDAP in read only
de: Passwort für die read only LDAP-Verbindung
fr: Mot de passe pour la connexion LDAP en lecture seule.

source: The version protocol for connect to LDAP<br/>Use version 3 for Active Directory
de: Versionsprotokoll für die LDAP-Verbindung<br/>Für Active Directory sollte Version 3 genutzt werden
fr: Version du protocole pour la connexion au serveur LDAP<br/>Utiliser la version 3 pour un serveur de type Active Directory

source: Template for LDAP attribute
de: Template für LDAP-Attribut
fr: Sélectionner un modèle de serveur LDAP. Les attributs de recherche seront ainsi pré-remplis par défaut.

source: The base DN for search users
de: Basis-DN für die Benutzersuche
fr: La base DN de la recherche des utilisateurs

source: The base DN for search groups
de: Basis-DN für die Gruppensuche
fr: La base DN de la recherche des groupes

source: The LDAP search filter for users<br/>Use %s in filter. The %s will replaced by login in autologin or * in LDAP import
de: LDAP-Suchfilter für die Benutzersuche<br/>In Filtern kann %s genutzt werden. %s wird beim Autologin durch Login ersetzt bzw. beim LDAP-Import durch *
fr: Le filtre de recherche LDAP pour les utilisateurs<br/>Utiliser %s en tant que filtre. %s sera remplacé par le l'identifiant dans pour la connexion automatique (autologin) ou par * pour l'import LDAP.

source: The LDAP search filter for groups<br/>Use %s in filter. The %s will replaced by group name in autologin or * in contactgroup field
de: LDAP-Suchfilter für die Gruppensuche<br/>In Filtern kann %s genutzt werden. %s wird beim Autologin durch den Gruppennamen ersetzt bzw. beim Kontaktgruppenfeld durch *
fr: Le filtre de recherche LDAP pour les groupes<br/>utilise %s en tant que filtre. Le %s sera remplacé par le nom de groupe dans l'autologin ou par * dans le champ groupe de contacts

source: The login attribute<br/>In Centreon : Alias / Login
de: Das Login-Attribut<br/>In Centreon: Alias / Login
fr: L'attribut de login<br/>Dans Centreon : Alias / Login

source: The group attribute for user
de: Das Gruppenattribut für Benutzer
fr: L'attribut du groupe pour l'utilisateur

source: The user name<br/>In Centreon : Full Name
de: Benutzername<br/>In Centreon: Full Name
fr: Attribut LDAP définissant le nom de l'utilisateur<br/>Par défaut : Full Name

source: This field is used to specify the interval, in hours, between two LDAP data synchronization. By default 1 hour.
de: LDAP-Synchronisationsintervall. Standardwert: 1 Stunde.
fr: Permet de spécifier une durée minimale, en heures, entre deux synchronisation des données avec le LDAP.Par défaut 1 heure.

source: If enabled, a user LDAP synchronization will be performed on login to update contact's data and calculate new Centreon ACLs.
de: Wenn diese Option aktiviert ist, wird beim Login eine LDAP-Synchronisation ausgeführt, um Kontaktdaten und Centreon Zugriffssteuerungslisten (ACLs) zu aktualisieren.
fr: Si cette case est cochée, une synchronisation des groupes LDAP de l'utilisateur sera effectuée lors de la connexion pour appliquer les ACL Centreon.

source: The user firstname<br/>In Centreon : givenname
de: Benutzervorname<br/>In Centreon: givenname
fr: Attribut LDAP définissant le prénom de l'utilisateur<br/>Par défaut : givenname

source: The user lastname<br/>In Centreon : sn
de: Benutzernachname<br/>In Centreon: sn
fr: Attribut LDAP définissant le nom de l'utilisateur<br/>Par défaut : sn

source: The user email<br/>In Centreon : Email
de: E-Mail des Benutzers<br/>In Centreon: Email
fr: Attribut LDAP définissant l'adresse mail de l'utilisateur<br/>Par défaut : Email

source: The user pager<br/>In Centreon : Pager
de: Pager des Benutzers<br/>In Centreon: Pager
fr: Attribut LDAP définissant le numéro de téléphone de l'utilisateur<br/>Par défaut : Pager

source: The group name<br/>In Centreon : Contact Group Name
de: Gruppenname<br/>In Centreon: Contact Group Name
fr: Le nom du groupe<br/>Dans Centreon : Nom du groupe de Contact

source: The LDAP attribute for relation between group and user
de: LDAP-Attribut für die Verknüpfung zwischen Benutzer und Gruppe
fr: L'attribut LDAP pour la relation entre groupe et utilisateur

source: Knowledge database name.
fr: Nom de la base de données de la base de connaissance.

source: Knowledge database user.
fr: Compte utilisateur pour se connecter à la base de données de la base de connaissance

source: Knowledge database password.
fr: Mot de passe utilisateur du compte utilisateur

source: Knowledge database host.
fr: Adresse de la base de données.

source: Knowledge database prefix.
fr: Prefix des tables de la base de données.

source: Knowledge wiki url. Exemple: http://wiki/mywiki
de: Wiki-URL z.B.: http://wiki/mywiki
fr: URL d'accès au wiki. Pas exemple http://<CENTREON_IP>/mywiki

source: Wiki account with delete right.
de: Wiki-Benutzerkonto mit Löschberechtigung.
fr: Compte administrateur de la base de connaissance possédant les droits de suppression des articles.

source: Wiki account password.
de: Wiki-Benutzerkonto Passwort.
fr: Mot de passe du compte administrateur de la base de connaissance.

source: Directory of log files.
de: Verzeichnis für Log-Dateien.
fr: Répertoire des fichiers journaux.

source: Enables authentication debug.
de: Aktiviert das Authentifizierungsdebugging.
fr: Active le débogage de l'authentification des utilisateurs.

source: Enables Monitoring Engine import debug.
de: Aktiviert das Monitoring-Engine-Import-Debugging.
fr: Active le débogage de l'import du moteur de supervision.

source: Enables RRDTool debug.
de: Aktiviert das RRDTool-Debugging.
fr: Active le débogage de RRDTool.

source: Enables LDAP user import debug.
de: Aktiviert das LDAP-Benutzerimport-Debugging.
fr: Active le débogage de l'import des utilisateurs LDAP.

source: Enables SQL debug.
de: Aktiviert das SQL-Debugging.
fr: Active le débogage SQL.

source: Enables Centcore debug.
de: Aktiviert das Centcore-Debugging.
fr: Active le débogage Centcore.

source: Enables Centstorage debug.
de: Aktiviert das Centstorage-Debugging.
fr: Activer le débogage de Centstorage.

source: Enables Centreontrapd debug.
de: Aktiviert das Centreontrapd-Debugging.
fr: Active le débogage du processus centreontrapd.

source: Enables Centstorage Engine.
fr: Active le Moteur Centstorage.

source: Enables resource's insertion in index_data.
fr: Activer l'insertion de ressources dans index_data

source: Path to RRDTool database for graphs of metrics.
de: Pfad zur RRDTool-Datenbank für Graphen von Metriken.
fr: Chemin de la base de données RRDTool pour les graphiques et les métriques.

source: Path to RRDTool database for graphs of status.
de: Pfad zur RRDTool-Datenbank für Graphen von historischen Statuswerten.
fr: Chemin de la base de données RRDTool pour les graphiques de statuts.

source: Path to RRDTool database for graphs of monitoring engine stats.
de: Pfad zur RRDTool-Datenbank für Graphen der Monitoring Engine Statistiken.
fr: Chemin de la base de données RRDTool pour les graphiques des statistiques des moteurs de supervision.

source: RRDTool database size (in days).
de: RRDTool-Datenbankgröße (In Tagen).
fr: Taille de la base de données RRDTool (en jours).

source: Duration of retention regarding performance data stored in database. 0 means that no retention will be applied.
de: Aufbewahrungsdauer von Performance-Daten in der Datenbank. Ein Wert von 0 bedeutet, dass die Daten nicht aufbewahrt werden.
fr: Durée de rétention concernant les données de performance stockées en base de données. 0 signifie qu'aucune rétention n'est appliquée.

source: Duration of retention regarding downtimes stored in database. 0 means that no retention will be applied.
de: Aufbewahrungsdauer von Ausfallszeit-Daten in der Datenbank. Ein Wert von 0 bedeutet, dass die Daten nicht aufbewahrt werden.
fr: Durée de rétention concernant les plages de maintenance stockées en base de données. 0 signifie qu'aucune rétention n'est appliquée.
