Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: Define the number of "time units" between regularly scheduled checks of the service. With the default time unit of 60s, this number will mean multiples of 1 minute. "Regular" checks are those that occur when the service is in an OK state or when the service is in a non-OK state, but has already been rechecked max_check_attempts number of times. (default value: 5)
de: Geben Sie die Anzahl an Zeitintervallen zwischen regulär angesetzten Service-Überprüfungen an. Mit dem Standardwert von 60s für ein Zeitintervall, repräsentiert dieser Wert Minuten. Mit "regulären" Überprüfungen sind die gemeint, die ausgeführt werden, wenn sich der Service in einem OK-Status bzw. in einem Status anders als OK befindet, jedoch bereits max_check_attempts Überprüfungen ausgeführt wurden. (Standardwert: 5)
fr: Définit le nombre "d'unité de temps" entre les contrôles planifiés réguliers du service. Avec l'unité de temps par défaut de 60s, ce nombre signifiera un multiple de 1 minute.

source: Define the number of "time units" to wait before scheduling a re-check for this service after a non-OK state was detected. With the default time unit of 60s, this number will mean multiples of 1 minute. Once the service has been retried max_check_attempts times without a change in its status, it will revert to being scheduled at its "normal" check interval rate. (default value: 1)
de: Geben Sie die Anzahl an Zeitintervallen an die gewartet wird, bevor eine erneute Überprüfung ausgeführt wird, wenn ein anderer Status als OK erkannt wurde. Mit dem Standardwert von 60s für ein Zeitintervall, repräsentiert dieser Wert Minuten. Sobald die Überprüfung max_check_attempts Mal erneut ausgeführt wurde, ohne dass sich das Ergebnis verändert, wird wieder auf das normale Überprüfungsintervall gewechselt. (Standardwert: 1)
fr: Définit le nombre "d'unité de temps" devant s'écouler avant la programmation d'un nouveau contrôle de ce service après qu'un état non-disponible ait été détecté. Avec l'unité de temps par défaut de 60s, ce nombre correspondra à un multiple de 1 minute. Si le statut de ce service est identique après avoir été reprogrammé autant de fois que spécifié dans l'option "Nombre de contrôles avant validation de l'état", l'intervalle de contrôle redeviendra celui définit dans l'option intervalle de contrôle.

source: Enable or disable active checks (either regularly scheduled or on-demand) of this service here. By default active service checks are enabled.
de: Aktivieren bzw. Deaktvieren Sie aktive Überprüfungen für diesen Service durch diese Option (Entweder regelmäßig oder on-demand). Standardmäßig sind aktive Service-Überprüfungen aktiviert.
fr: Active ou désactive les contrôles actifs (même les contrôles réguliers ou ceux à la demande) de ce service. Par défaut les contrôles actifs de service sont activés.

source: Specify whether or not notifications for this service are enabled.
de: Geben Sie an, ob Benachrichtigungen für diesen Service aktiviert sind.
fr: Spécifie si oui ou non les notifications pour ce service sont activées.

source: Specify whether or not the service will inherit host's contacts and contactgroups (if no contacts or contactgroups are defined for the service).
de: Geben Sie an, ob dieser Service die Kontakte und Kontaktgruppen des Hosts erbt (wenn für diesen Service weder Kontakte noch Kontaktgruppen angegeben sind).
fr: Indique si oui ou non le service héritera de la définition des contacts et groupes de contacts de l'hôte (dans le cas où aucun contact ou groupes de contacts n'est défini pour ce service).

source: To fill
de: Auszufüllen
fr: A remplir

source: This is a list of contacts that should be notified whenever there are problems (or recoveries) with this service. Useful if you want notifications to go to just a few people and don't want to configure contact groups. You must specify at least one contact or contact group in each service definition (or indirectly through its template).
de: Dies ist eine Liste von Kontakten die benachrichtigt werden sollen, wenn Probleme oder andere Events bei diesem Service auftreten. Diese Liste ist nützlich wenn nur einige wenige Personen benachrichtigt werden sollen und dafür keine Kontaktgruppen genutzt werden sollen. In jeder Servicedefinition muss mindestens ein Kontakt bzw. eine Kontaktgruppe angegeben werden (Entweder explizit oder implizit durch ein Template).
fr: Il s'agit d'une liste de contacts qui devraient être notifiés quand il y a des problèmes (ou des retours à la normal) avec ce service. Utile si vous souhaitez envoyer des notifications vers quelques personnes et ne souhaitez pas configurer des groupes de contacts. Vous devez spécifier au moins un contact ou groupe de contacts dans chaque définition de service (ou indirectement par l'intermédiaire de son modèle).

source: This is a list of contact groups that should be notified whenever there are problems (or recoveries) with this service. You must specify at least one contact or contact group in each service definition.
de: Dies ist eine Liste von Kontaktgruppen, die benachrichtigt werden sollen, wenn Probleme oder andere Events bei diesem Service auftreten. In jeder Servicedefinition muss mindestens ein Kontakt bzw. eine Kontaktgruppe angegeben.
fr: Il s'agit d'une liste de groupes de contacts qui devraient être notifiés quand il y a des problèmes (ou des retours à la normal) avec ce service. Vous devez spécifier au moins un contact ou groupe de contacts dans chaque définition de service.

source: Define the number of "time units" to wait before re-notifying a contact that this service is still in a warning or critical condition. With the default time unit of 60s, this number will mean multiples of 1 minute. A value of 0 disables re-notifications of contacts about problems for this service - only one problem notification will be sent out. (default value: 30)
de: Geben Sie die Anzahl an Zeitintervallen zwischen wiederholten Benachrichtigungen an, wenn ein Service fortwährend im Warnung- bzw. Kritisch-Status ist. Mit dem Standardwert von 60s für ein Zeitintervall, repräsentiert dieser Wert Minuten. Ein Wert von 0 deaktiviert wiederholte Benachrichtigungen für diesen Service - es wird nur eine Problembenachrichtigung gesendet. (Standardwert: 30)
fr: Définit le nombre "d'unité de temps" devant s'écouler avant de notifier à nouveau un contact sur l'état indisponible ou injoignable de ce service. Avec l'unité de temps par défaut de 60s, ce nombre correspondra à un multiple d'1 minute. Une valeur de 0 désactive la re-notification des contacts à propos des problèmes de ce service - une notification unique sera envoyée lors de la détection d'un problème.

source: Specify the time period during which notifications of events for this service can be sent out to contacts. If a state change occurs during a time which is not covered by the time period, no notifications will be sent out.
de: Legen Sie den Zeitraum fest, in dem Benachrichtigungen zu diesem Service an Kontakte gesendet werden sollen. Wenn außerhalb dieses Zeitraums eine Statusänderungen auftritt, werden keine Benachrichtigungen gesendet.
fr: Spécifie la période durant laquelle les notifications d'événements concernant ce service peuvent être envoyées aux contacts. Si un changement d'état se produit pendant un temps qui n'est pas couvert par la période de temps, aucune notification ne sera envoyée.

source: Define the states of the service for which notifications should be sent out. If you specify None as an option, no service notifications will be sent out. If you do not specify any notification options, monitoring engine will assume that you want notifications to be sent out for all possible states.
de: Legen Sie die Statuswerte des Services fest, für die Benachrichtigungen gesendet werden sollen. Wenn der Wert Keine als Option angegeben wird, werden keine Service-Benachrichtigungen versendet. Wenn keine Benachrichtigungsoptionen angegeben werden, wird angenommen, dass für alle Statuswerte Benachrichtigungen gesendet werden sollen.
fr: Définir les états de service pour laquelle les notifications doivent être envoyées. Si vous ne spécifiez aucune comme une option, aucune notification ne sera envoyée. Si vous ne spécifiez pas les options de notification, le moteur de surveillance supposera que vous souhaitez que les notifications doivent être envoyées pour tous les états possibles.

source: If this option is enabled, use host's notification parameters instead of service or from template of service parameters inherited
de: Wenn diese Option aktiviert ist, werden statt den Parametern des Services bzw. dessen Templates die Parameter des Hosts genutzt
fr: Si cette option est activée, les paramètres de notification utilisés seront ceux de l'hôte plutôt que ceux paramétrés au niveau du service ou des modèles de service.

source: Specify one or multiple host templates, that should be linked to this template. A service, that uses this service template, will complete the missing host relation and result in a full service definition.
de: Geben Sie ein oder mehrere Hosttemplate(s) an, das/die mit diesem Template verknüpft werden soll(en). Ein Service, der dieses Servicetemplate verwendet, vervollständigt die fehlende Hostbeziehung und führt somit zu einer vollständigen Servicedefinition.
fr: Spécifie un ou plusieurs modèles d'hôte, qui doivent être lié à ce modèle. Un service qui utilise ce modèle de service, complétera la relation d'hôte manquant et aboutira à une définition de service complet.

source: Specify the host(s) that this service "runs" on or is associated with.
de: Geben Sie den/die Host(s) an, auf dem dieser Service ausgeführt wird bzw. zu dem/denen er eine Relation hat.
fr: Spécifie que ce service "tourne" sur ou est associé à l'hôte(s).

source: Specify the hostgroup(s) that this service "runs" on or is associated with. One or more hostgroup(s) may be used instead of, or in addition to, specifying hosts.
de: Geben Sie die Hostgruppe(n) an, auf der/denen dieser Service ausgeführt wird bzw. zu der/denen er eine Relation hat. Eine oder mehrere Hostgruppe(n) können statt bzw. zusätzlich zu der Angabe von Hosts verwendet werden.
fr: Spécifie que ce service "tourne" sur ou est associé au(x) groupe(s) d'hôtes. Un ou plusieurs groupe d'hôte (s) peut être utilisée à la place de, ou en plus de, spécifier les hôtes.

source: This directive is used to identify the short name(s) of the servicegroup(s) that the service belongs to. This directive may be used as an alternative to using the members directive in servicegroup definitions.
de: Diese Option wird dazu genutzt, um den/die Kurzname(n) der Servicegruppe(n) anzugeben, der/den dieser Service angehört. Diese Richtlinie kann als Alternative zu der Angabe von Mitgliedern in der Servicegruppendefinition verwendet werden.
fr: Cette directive est utilisée pour identifier le(s) nom(s) court(s) du groupe de services que le service appartient. Cette directive peut être utilisé comme une alternative à l'aide du paramètre membre des définitions des groupes de services.

source: Specify the relation of known SNMP traps to state changes of this service.
de: Legen Sie die Beziehung von bekannten SNMP-Traps zu Statusänderung von diesem Service fest.
fr: Spécifie la relation des remontées SNMP connues avec le changement d'état de ce service.

source: This directive determines whether or not checks for the service will be "obsessed" over. When enabled the obsess over service command will be executed after every check of this service.
de: Diese Option legt fest, ob Überprüfungen diesen Services überwacht werden. Wenn diese Option aktiviert ist, wird der Serviceüberwachungsbefehl nach jeder Service-Überprüfung ausgeführt.
fr: Cette directive détermine si oui ou non les vérifications pour le service seront plus «insistante». Lorsqu'elle est activée la commande sera exécutée après chaque vérification de ce service.

source: This directive is used to determine whether or not freshness checks are enabled for this service. When enabled monitoring engine will trigger an active check when last passive result is older than the value defined in the threshold. By default freshness checks are enabled.
de: Diese Option legt fest, ob für diesen Service Aktualitätsprüfungen ausgeführt werden. Wenn diese Option aktiviert ist und ein passives Überprüfungsergebnis älter als der Grenzwert ist, wird durch die Monitoring Engine eine aktive Überprüfung erzwungen. Standardmäßig sind Aktualitätsprüfungen aktiviert.
fr: Cette directive est utilisée pour déterminer si oui ou non les contrôles de fraîcheur sont activés pour ce service. Lorsqu'elle est activée le moteur de vérification déclenchera un contrôle actif si le résultat du dernier contrôle passif est plus ancien que la valeur de seuil défini. Par défaut les contrôles de fraîcheur sont activés.

source: This directive is used to specify the freshness threshold (in seconds) for this service. If you set this directive to a value of 0, monitoring engine will determine a freshness threshold to use automatically.
de: Legen Sie den Aktualitätsgrenzwert (in Sekunden) für diesen Service fest. Wenn dieser Wert auf 0 gesetzt wird, wird durch die Monitoring Engine automatisch ein Wert ermittelt.
fr: Cette directive est utilisée pour spécifier le seuil de fraîcheur (en secondes) pour ce service. Si vous définissez cette directive avec une valeur de 0, le moteur de vérification déterminera un seuil de fraîcheur à utiliser automatiquement.

source: This directive is used to determine whether or not flap detection is enabled for this service. A service is marked as flapping when frequent state changes occur.
de: Diese Richtlinie legt fest, ob die Erkennung des Flackern-Status für diesen Service aktiviert ist. Ein Service wird als flackernd markiert, wenn häufige Statusänderungen auftreten.
fr: Cette rubrique est utilisée pour activé ou non la détection d'oscillation pour ce service. Un service est marqué oscillant quand son état change fréquemment.

source: Specify the low state change threshold used in flap detection for this service. A service with a state change rate below this threshold is marked normal. By setting the value to 0, the program-wide value will be used.
de: Diese Richtlinie legt den unteren Statuswechselgrenzwert, der für die Erkennung des Flackern-Status genutzt wird, für diesen Service fest. Liegt die Statuswechselrate unter diesem Grenzwert, wird der Service als normal markiert. Wenn dieser Wert auf 0 gesetzt wird, wird der globale Wert genutzt.
fr: Spécifiez le seuil bas du taux de changement utilisé dans la détection d'état pour ce service. Un service avec un taux de changement d'état inférieure à ce seuil est marqué normal. En fixant la valeur à 0, la valeur sera utilisée dans l'ensemble du programme.

source: Specify the high state change threshold used in flap detection for this service. A service with a state change rate above or equal to this threshold is marked as flapping. By setting the value to 0, the program-wide value will be used.
de: Diese Richtlinie legt den oberen Statuswechselgrenzwert, der für die Erkennung des Flackern-Status genutzt wird, für diesen Service fest. Entspricht die Statuswechselrate diesem Grenzwert bzw. liegt sie darüber, wird der Service als flackernd markiert. Wenn dieser Wert auf 0 gesetzt wird, wird der globale Wert genutzt.
fr: Spécifiez le seuil haut de détection de changement d'état pour ce service. Un service avec un taux supérieur ou égal à ce seuil est marqué comme changeant (flapping). En fixant la valeur à 0, la valeur sera utilisée dans l'ensemble du programme.

source: Specify whether or not the processing of performance data is enabled for this service.
de: Diese Option legt fest, ob Leistungsdaten von diesem Service verarbeitet werden sollen.
fr: Spécifiez si oui ou non le traitement des données de performance est activé pour ce service.

source: Specify whether or not status-related information about the service is retained across program restarts. This is only useful if you have enabled state retention using the retain_state_information directive.
de: Diese Option legt fest, ob statusbezogene Informationen des Services über Programmneustarts hinaus aufbewahrt werden. Diese Option wirkt sich nur aus, wenn die globale Option retain_state_information aktiviert ist.
fr: Spécifiez si oui ou non l'information du statut sur le service est conservée après le redémarrage du programme. Ceci n'est utile que si vous avez activé la rétention d'états en utilisant la directive "retain_state_information".

source: Specify whether or not non-status information about the service is retained across program restarts. This is only useful if you have enabled state retention using the retain_state_information directive.
de: Diese Option legt fest, ob nicht statusbezogene Informationen des Services über Programmneustarts hinaus aufbewahrt werden. Diese Option wirkt sich nur aus, wenn die Option retain_state_information aktiviert ist.
fr: Détermine si l'état des services est mémorisé entre deux redémarrages. Cette option est seulement utile si vous activé l'option retain_state_information.

source: Define which service states "stalking" is enabled for.
de: Diese Richtlinie legt fest, für welche Service-Status die Nachverfolgung aktiviert ist.
fr: Détermine si le suivi précis des changements d'état est activé.

source: This directive is used to determine whether or not the event handler for this service is enabled.
de: Diese Richtlinie legt fest, ob der Event Handler für diesen Service aktiviert ist.
fr: Ce paramètre permet d'activer ou non le gestionnaire d’événements pour ce service.

source: This directive is used to specify the command that should be run whenever a change in the state of the service is detected (i.e. whenever it changes to non-OK or recovers).
de: Diese Option legt den Befehl fest, der immer dann ausgeführt wird, wenn eine Statusänderung beim Service erkannt wird. D.h. jedes mal wenn der Service in einen anderen Status als OK wechselt bzw. wieder OK ist.
fr: Ce paramètre permet de spécifier une commande qui devra être lancé lorsque d'un changement d'état du service est détecté (lorsque le service passe de l'état non OK ou rétablissement).

source: Specify a duration of acknowledgement for this service or service depending to this template. If you leave it blank, no timeout will be set.
de: Geben Sie eine Dauer der Inkenntnisnahme für diesen Service bzw. für Services, die dieses Template nutzen an. Wenn kein Wert angegeben wird, wird kein Timeout gesetzt.
fr: Permet de spécifier une durée maximale avant suppression de l'acquittement pour les acquittements pour ce services ou les services héritants de ce modèle. Laisser vide pour ne pas spécifier de durée maximale.

source: The optional definition of a graph template will be used as default graph template for this service.
de: Die optionale Definition eines Graphentemplates wird als Standard Graphentemplate für diesen Service genutzt.
fr: La définition facultative d'un modèle graphique sera utilisée comme le modèle graphique par défaut pour ce service.

source: Select the categories this service should be linked to. Categories are used for finer control in service ACL definitions.
de: Wählen Sie die Kategorien aus, mit denen dieser Service verbunden sein soll. Kategorien können für feinere Zugriffe in den Zugriffssteuerungslistendefinitionen für Services verwendet werden.
fr: Sélectionner la catégorie dans laquelle doit se trouver ce service. Les catégories peuvent être utilisées pour affiner les ACL d'un service.

source: Define an optional URL that can be used to provide more information about the service. Any valid URL can be used. This can be very useful if you want to make detailed information on the service, emergency contact methods, etc. available to other support staff.
de: Geben Sie eine optionale URL an, unter der weitere Informationen zu dem Service verfügbar sind. Jede valide URL kann genutzt werden. Diese Option ist nützlich, um detaillierte Informationen zu dem Service oder Notfallkontakten für andere Supportmitarbeiter zur Verfügung zu stellen.
fr: Définie une adresse web qui pourra être utilisé pour fournir plus d'information à propos du service. N'importe quelle adresse web valide peut être utilisée. Cette option peut-être très utile si vous voulez ajouter des informations détaillés au service, procédure et personnes à contacter en cas d'urgence, etc.

source: Define an optional string of notes pertaining to the service.
de: Optionale Notizen zum Service.
fr: Spécifie une note d'information optionnelle rattachée au service.

source: Define an optional URL that can be used to provide more actions to be performed on the service. You will see the link to the action URL in the service details.
de: Geben Sie eine optionale URL an, unter der weitere Aktionen für diesen Service verfügbar sind. Die Link zur Aktionen-URL wird in den Host-Details angezeigt.
fr: Définie une URL optionnelle fournissant des actions supplémentaires sur le service. Vous pourrait voir un lien vers l'URL dans les détails du service.

source: Define the image that should be associated with this service here. This image will be displayed in the various places. The image will look best if it is 40x40 pixels in size.
de: Definieren Sie hier das Bild, das diesem Service zugeordnet werden soll. Dieses Bild wird an den verschiedenen Stellen angezeigt. Das Bild sieht am besten aus, wenn es 40x40 Pixel groß ist.
fr: Définit ici l'image qui devrait être associée avec le service. L'image sera affichée à différents endroits. L'image aura un meilleur rendu si sa taille est de 40x40 pixels.

source: Macros are used as object-specific variables/properties, which can be referenced in commands and extended infos. A Macro named TECHCONTACT can be referenced as $_SERVICETECHCONTACT$.
de: Makros werden als objektspezifische Variablen bzw. Werte genutzt, die in Befehlen und erweiterten Informationen verwendet werden können. Beispiel: Ein Makro mit dem Namen TECHCONTACT kann mit $_SERVICETECHCONTACT$ referenziert werden.
fr: Les macros sont utilisées comme des variables/propriétés spécifiques, qui peuvent être utilisées dans les commandes et les informations supplémentaires. Une macro nommée TECHCONTACT pourra être référencée comme $_SERVICETECHCONTACT$.

source: This directive is used to define an alternate name that should be displayed in the web interface for this service. If not specified, this defaults to the value you specify as service description.
de: Dieser Wert wird dazu verwendet, einen alternativen Namen für diesen Service festzulegen, der im Web-Interface angezeigt werden soll. Wenn dieser Wert nicht angegeben wird, wird die Servicebeschreibung als Standard verwendet.
fr: Ce paramètre permet de définir un nom différent qui sera affiché dans l'interface web pour ce service. Si vous ne spécifiez rien, ce sera le nom définit dans la description du service qui sera affiché.

source: This directive is used to determine what service states the flap detection logic will use for this service.
de: Dieser Wert wird dazu verwendet festzulegen, welche Service-Status die Flackern-Status-Erkennung für diesen Service nutzt.
fr: Ce paramètre est utilisé pour déterminer pour quels états la détection des oscillations sera activée concernant ce service.

source: By default monitoring engine will assume that all services are in OK states when it starts. You can override the initial state for a service by using this directive.
fr: Par défaut, l'ordonnanceur considère que tous les services sont dans un état OK lors de son démarrage. Vous pouvez outrepasser ce comportement en utilisant cette directive.
