Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: This directive indicates whether or not the dependency inherits dependencies of the host that is being depended upon (also referred to as the master host). In other words, if the master host is dependent upon other hosts and any one of those dependencies fail, this dependency will also fail.
de: Diese Option gibt an, ob dieser Host Abhängigkeiten des Hosts erbt, von zu dem er selbst eine Abhängigkeit besitzt (auch als Masterhost bezeichnet). Mit anderen Worten, wenn der Masterhost von anderen Hosts abhängig ist und eine dieser Abhängigkeiten fehlschlägt, schlägt auch diese Abhängigkeit fehl.
fr: Cette variable indique si la dépendance hérite des dépendances de l'hôte dont on dépend (aussi appelé hôte maître). En d'autres termes, si l'hôte maître est dépendant de plusieurs autres hôtes et qu'une de ces dépendances échoue, alors cette dépendance échouera également.

source: Ignored by Centreon Engine.
de: Wird von der Centreon Engine ignoriert.
fr: Ignorée par Centreon Engine.

source: This directive is used to specify the criteria that determine when the dependent host should not be actively checked. If the master host is in one of the failure states we specify, the dependent host will not be actively checked. If you specify None as an option, the execution dependency will never fail and the dependent host will always be actively checked (if other conditions allow for it to be).
de: Diese Richtlinie legt Kriterien fest, die bestimmen, wann keine aktiven Überprüfungen für den abhängigen Host ausgeführt werden sollen. Wenn sich der Master-Host in einem der festgelegten Fehler-Status befindet, wird der abhäginge Host nicht aktiv überprüft. Wenn die Option Keine angegeben wird, wird die Ausführungsabhängigkeit nie fehlschlagen und der abhängige Host wird immer aktiv geprüft (sofern keine anderen Gründe dagegen sprechen).
fr: Cette variable est utilisée pour préciser les critères qui déterminent quand l'hôte dépendant ne doit pas être contrôlé activement. Si l'hôte maître est dans un état d'erreur que nous précisons, l'hôte dépendant ne sera pas contrôlé activement. Si l'option spécifiée est "Aucune", l'exécution de la dépendance n'échouera jamais et l'hôte dépendant sera toujours contrôlé activement (si d'autres conditions permettent qu'il le soit).

source: This directive is used to define the criteria that determine when notifications for the dependent host should not be sent out. If the master host is in one of the failure states we specify, notifications for the dependent host will not be sent to contacts. If you specify None as an option, the notification dependency will never fail and notifications for the dependent host will always be sent out.
de: Diese Richtlinie legt Kriterien fest, die bestimmen, wann keine Benachrichtigungen für den abhängigen Host gesendet werden sollen. Wenn sich der Master-Host in einem der festgelegten Fehler-Status befindet, werden für den abhägingen Host keine Benachrichtigungen gesendet. Wenn die Option Keine angegeben wird, wird die Ausführungsabhängigkeit nie fehlschlagen und Benachrichtigungen für den abhängigen Host werden immer gesendet.
fr: Cette variable est utilisée pour définir les critères qui déterminent quand les notifications pour l'hôte dépendant ne doivent pas être envoyées. Si l'hôte maître est dans un des états d'erreur que nous précisons, les notifications pour l'hôte dépendant ne seront pas envoyées aux contacts. Si vous ne spécifiez aucune comme option, l'exécution de la dépendance n'échouera jamais et l'hôte dépendant sera toujours contrôlé activement (si d'autres conditions permettent qu'il le soit).

source: This directive is used to identify the short name(s) of the host(s) that is being depended upon (also referred to as the master host).
de: Diese Richtlinie legt den/die Kurzname(n) des/der Host(s) fest, zu dem/zu denen eine Abhängigkeit besteht (Auch als Master-Host bezeichnet).
fr: Ce paramètre est utilisé pour identifier le nom court (s) de l'hôte (s) dépendant (aussi appelé hôte maître).

source: This directive is used to identify the short name(s) of the hostgroup(s) that is being depended upon (also referred to as the master host). The hostgroup_name may be used instead of, or in addition to, the host_name directive.
de: Diese Richtlinie legt den/die Kurzname(n) der Hostgruppe(n) fest, zu der/zu denen eine Abhängigkeit besteht (Auch als Master-Host bezeichnet). Der hostgroup_name kann statt bzw. zusätzlich zu host_name genutzt werden.
fr: Ce paramètre est utilisé pour identifier le(s) nom(s) court(s) de groupes d'hôtes dépendants (aussi appelé hôte maître). Le paramètre hostgroup_name peut être utilisé à la place ou en conjonction avec la variable host_name.

source: This directive is used to identify the dependent host(s).
de: Diese Richtlinie legt den/die abhängigen Host(s) fest.
fr: Ce paramètre est utilisé pour identifier l'hôte ou les hôtes dépendant(s).

source: This directive is used to identify the short name(s) of the dependent hostgroup(s). The dependent_hostgroup_name may be used instead of, or in addition to, the dependent_host_name directive.
de: Diese Richtlinie legt den/die Kurznamen der abhängigen Hostgruppe(n) fest. Der dependent_hostgroup_name kann statt bzw. zusätzlich zu dependent_host_name genutzt werden.
fr: Ce paramètre est utilisé pour identifier le(s) nom(s) court(s) de groupes d'hôtes dépendants. Le paramètre dependent_hostgroup_name peut être utilisé à la place ou en conjonction avec la variable dependent_host_name.

source: This directive is used to specify the short name of the time period during which this dependency is valid. If this directive is not specified, the dependency is considered to be valid during all times.
de: Diese Richtlinie legt den Kurznamen des Zeitraums fest, in der diese Abhängigkeit gültig ist. Wenn dieser Wert nicht gesetzt ist, ist die Abhängigkeit zu allen Zeiten gültig.
fr: Cette directive est utilisée pour spécifier le nom court de la période durant laquelle les dépendances sont valides. Si cette directive n'est pas spécifiée, la dépendance est considérée comme valide tout le temps.

source: This directive is used to identify the description of the dependent service.
de: Diese Richtlinie legt die Beschreibung des abhängigen Services fest.
fr: Cette variable est utilisée pour identifier la description d'un service dépendant.

source: Compatible with Centreon Broker only.
de: Nur mit Centreon Broker kompatibel.
fr: Compatible uniquement avec Centreon Broker.

source: Define a short name for this category. It will be displayed with this name in the ACL configuration.
de: Definieren Sie hier einen Kurznamen für diese Kategorie. Die Kategorie wird unter diesem Namen in ther Zugriffssteuerungslistenkonfiguration (ACL configuration) angezeigt.
fr: Définit un nom court pour cette catégorie. Il sera affiché avec ce nom dans la configuration des ACL.

source: Use this field for a longer description of this category.
de: In diesem Feld kann eine längere Beschreibung für diese Kategorie angegeben werden.
fr: Utiliser ce champ pour une description plus longue de cette catégorie.

source: Select the hosts that this category is linked to.
de: Legt die Hosts fest, die dieser Kategorie angehören.
fr: Sélectionner les hôtes à lier à cette catégorie.

source: Select the host templates that this category is linked to.
de: Legt die Host-Templates fest, die dieser Kategorie angehören.
fr: Sélectionner les modèles d'hôtes à lier à cette catégorie.

source: Whether this category is a severity. Severities appear on the monitoring consoles.
de: Legt fest, ob die Kategorie ein Schweregrad ist. Schweregrade erscheinen in der Überwachungskonsole.
fr: Si la catégorie est une criticité, elle apparaitra dans la console de supervision temps réel.

source: Severity level, must be a number. The items displayed will be sorted in ascending order. Thus the lowest severity is considered than the highest priority.
de: Schweregrad. Dieser Wert muss eine Zahl sein. Die Einträge werden in aufsteigender Reihenfolge angezeigt. Demnach hat der niedrigste Schweregrad die höchste Priorität.
fr: Niveau de gravité, doit être un nombre. Les éléments affichés seront triées par ordre croissant. Ainsi la criticité le plus basse est considérée comme de la plus prioritaire.

source: Icon for this severity.
de: Icon für diesen Schweregrad.
fr: Icône pour la sévérité.

source: Whether or not this category is enabled.
de: Legt fest, ob diese Kategorie aktiviert ist.
fr: Cette catégorie est active.

source: Comment regarding this category.
de: Kommentare zur Kategorie.
fr: Commentaire concernant cette catégorie.

source: Define a short name to identify the time period.
de: Legen Sie einen Kurznamen für den Zeitraum fest.
fr: Définit un nom court afin d'identifier la période de temps.

source: Use the alias as a longer name or description to identify the time period.
de: Legen Sie einen längeren Name bzw. eine Beschreibung für diesen Zeitraum fest.
fr: Utiliser l'alias comme nom long ou description afin d'identifier la période de temps.

source: The weekday directives are comma-delimited lists of time ranges that are "valid" times for a particular day of the week. Each time range is in the form of HH:MM-HH:MM, where hours are specified on a 24 hour clock. For example, 00:15-24:00 means 12:15am in the morning for this day until 12:00am midnight (a 23 hour, 45 minute total time range). If you wish to exclude an entire day from the timeperiod, simply do not include it in the timeperiod definition.
de: Die Wochentagsoptionen sind kommaseparierte Listen von Zeiträumen, die für einen bestimmten Wochentag "gültige" Zeiten sind. Jeder Zeitraum hat die Form HH:MM-HH:MM, wobei die Stunden im 24-Stunden-Format angegeben werden. 00:15-24:00 Uhr zum Beispiel bedeutet 12:15 Uhr morgens für diesen Tag bis 00:00 Uhr Mitternacht (eine Gesamtdauer von 23 Stunden und 45 Minuten). Wenn ein ganzer Tag ausgeschlossen werden soll, darf dieser nicht in der Definition des Zeitraums angegeben werden.
fr: Les définitions de périodes de temps journalières sont des intervalles temporels valides correspondant à un jour particulier de la semaine. Chaque intervalle est de la forme HH:MM-HH:MM où les heures sont spécifiées sur une horloge de 24h. Par exemple, la période 00:15-24:00 signifie de 00:15 le matin jusqu'à minuit (soit une période de 23 heures et 45 minutes). Pour exclure un jour entier, ne l'incluez simplement pas dans la définition de la période.

source: You can specify several different types of exceptions to the standard rotating weekday schedule. Exceptions can take a number of different forms including single days of a specific or generic month, single weekdays in a month, or single calendar dates. You can also specify a range of days/dates and even specify skip intervals to obtain functionality described by "every 3 days between these dates". Weekdays and different types of exceptions all have different levels of precedence, so it is important to understand how they can affect each other.
de: Für die wöchentliche Standardroutine können verschiedene Ausnahmen festgelegt werden. Darunter Ausnahmen für einzelne Tage eines bestimmten Monats, bestimmte Wochentage innerhalb eines Monats oder einzelne Tage. Auch kann ein Bereich von Tagen bzw. Daten oder Bereiche, die übersprungen werden sollen (z.B. Alle 3 Tage zwischen diesen Daten), angegeben werden. Wochentage und verschiedene Arten von Ausnahmen haben eine Rangfolge, nach der diese gelten. Daher ist es wichtig zu verstehen, wie sich diese beeinflussen können.
fr: Il est possible de spécifier types différents d’inclusion à la période temporelle. Ces inclusions surchargeront la définition du(ou des) jour(s) de la période classique. Ces définitions peuvent prendre un certain nombre de formes différentes tels qu’un intervalle horaire pour un jour spécifique, le premier jour de chaque mois, tous les trois jours pour une période spécifique. Il est important de vérifier les chevauchements d’inclusion pour éviter toute surprise.

source: This directive is used to specify other timeperiod used as a timeperiod model.
de: Durch diese Option können andere Zeiträume angegeben werden, die als Template für diesen Zeitraum verwendet werden sollen.
fr: Cette directive est utilisée pour ajouter d'autres périodes de temps complémentaires.

source: This directive is used to specify other timeperiod definitions whose time ranges should be excluded from this timeperiod.
de: Durch diese Option können andere Zeitraumdefinitionen angegeben werden, deren Zeitfenster in diesem Zeitraum exkludiert werden sollen.
fr: Cette directive est utilisée pour spécifier d'autres périodes de temps qui doivent être exclues de cette période de temps.

source: Enter the trap name as specified in the MIB file and send by the SNMP master agent.
de: Geben Sie den Trap-Namen an, wie er in der MIB-Datei angegeben und vom SNMP-Masteragent verwendet wird.
fr: Entrer le nom de la trap comme spécifié dans le fichier MIB et envoyé par l'agent SNMP.

source: Choose the matching mode.
de: Wählen Sie einen Abgleichsmodus.
fr: Choisir le mode de correspondance.

source: Enter the full numeric object identifier (OID) starting with .1.3.6 (.iso.org.dod).
de: Geben Sie den vollständigen numerischen Objektidentifikator (OID) an. Dieser beginnt mit .1.3.6 (.iso.org.dod).
fr: Entrer l'identifiant numérique complet de l'objet (OID) commençant par .1.3.6 (.iso.org.dod).

source: Choose a vendor from the list. The vendor must have been created beforehand.
de: Wählen Sie einen Hersteller aus der Liste. Dieser Hersteller muss vorher erstellt worden sein.
fr: Choisissez un fournisseur dans la liste. Le fournisseur doit avoir été créé au préalable.

source: Switch the submission of trap results to monitoring engine on or off.
de: (De)Aktivieren Sie die Weitergabe von Trap-Ergebnissen an die Monitoring Engine.
fr: Active ou désactive l'envoi des traps au moteur de supervision.

source: Enter the status message to be submitted to monitoring engine. The original trap message will be placed into the entered string at the position of the variable $*.
de: Geben Sie eine Statusnachricht an, die an die Monitoring Engine gegeben werden soll. Die ursprüngliche Trapnachricht kann in dieser Nachricht durch die Variable $* eingefügt werden.
fr: Entrez le message de status à envoyer au moteur de supervision. Le contenu de la "Trap" d'origine sera inséré dans le message entré précédemment, à la place de la variable $*.

source: Choose the service state to be submitted to monitoring engine together with the status message. This simple mode can be used if each trap can be mapped to exactly 1 monitoring engine status.
de: Geben Sie den Servicestatus an, der zusammen mit der Statusnachricht an die Monitoring Engine gegeben werden soll. Der vereinfachte Modus kann genutzt werden, wenn jede Trap genau einem Monitoring Engine Status zugeordnet werden kann.
fr: Choisissez le statut du service qui sera soumis au moteur de supervision avec le message d'état. Ce mode simple peut être utilisé si chaque trap peut être associé à exactement un état du moteur de supervision.

source: Severities are defined in the service category object.
de: Schweregrade werden im Servicekategorieobjekt angegeben.
fr: Les criticités sont définies au niveau des catégories d'objets.

source: Enable advanced matching mode for cases where a trap relates to multiple monitoring engine states and the trap message has to be parsed.
de: Aktivieren sie den fortgeschrittenen Abgleichsmodus wenn eine Trap mehreren Monitoring Engine Status entspricht und die Trapnachricht verarbeitet werden muss.
fr: Active le mode de recherche avancé dans les cas où un trap est relié à plusieurs moteurs de supervision et le message du trap a été analysé.

source: Define one or multiple regular expressions to match against the trap message and map it to the related monitoring engine service state. Use <a href='http://perldoc.perl.org/perlre.html'>perlre</a> for the format and place the expression between two slashes.
de: Legen Sie einen oder mehrere reguläre Ausdrücke fest, um die Trapnachricht abzugleichen und diese einem Monitoring Engine Servicestatus zuzuordnen. Für das Format kann <a href='http://perldoc.perl.org/perlre.html'>perlre</a> genutzt werden. Der reguläre Ausdrücke muss zwischen zwei Schrägstrichen stehen.
fr: Définir une ou plusieurs expressions régulières à faire correspondre le message de piège et de la carte à l'état de service du moteur de surveillance connexes. Utiliser <a href='http://perldoc.perl.org/perlre.html'>perlre</a> pour le format et placer l'expression entre deux barres obliques.

source: Choose whether or not the associated service should be actively rechecked after submission of this trap.
de: Legen Sie fest, ob der verbundene Service aktiv erneut überprüft werden soll, nachdem diese Trap ausgeführt wurde.
fr: Définit si il est nécessaire ou pas de contrôler le service de manière active après réception d'un trap SNMP.

source: Choose whether or not a special command should be run by centreontrapd when this trap was received.
de: Legen Sie fest, ob ein spezieller Befehl durch centreontrapd ausgeführt werden soll, wenn das Ergebnis dieser Trap eingegangen ist.
fr: Défini si oui ou non une commande spéciale doit être exécutée par le processus centreontrapd quand un trap SNMP est reçu.

source: Define the command to execute by centreontrapd's trap handler. The command must be located in the PATH of the centreontrapd user.
de: Legen Sie den Befehl fest, der durch centreontrapd's Trap-Handler ausgeführt werden soll. Der Befehl muss sich in der PATH Variable des centreontrapd Benutzers befinden.
fr: Défini la commande exécutée par le gestionnaire d'évènements du processus centreontrapd. Cette commande doit exécuter un binaire disponible dans le PATH de l'utilisateur centreontrapd.

source: Comment to describe per example the situation in which this trap will be send. Additionally the format and the parameters of the trap can be described.
de: Kommentar, der beschreibt, in welcher Situation die Trap gesendet wird. Zusätzlich kann das Format und die Parameter für die Trap beschrieben werden.
fr: Commentaire permettant de donner plus de précision sur la définition du trap SNMP par exemple en indiquant les paramètres contenus.

source: Enable/Disable routing definition
de: Aktiviert/Deaktiviert die Routingdefinition
fr: Active/Désactive le routage des traps SNMP

source: Routing definition to choose host(s)
de: Routingdefinition zur Auswahl von Host(s)
fr: Règle de routage permettant de sélectionner l'hôte final sur lequel transférer le trap SNMP

source: Permits to filter services of host(s). Skip if service_description not equals to the value set.
de: Durch diese Option können die Services von einem bzw. mehreren Hosts gefiltert werden. Diese Option wird ignoriert, wenn service_description nicht dem gesetzten Wert entspricht.
fr: Permet de filtrer par service. Ne réalise pas l'action si le champ "service_description" n'est pas égal à la valeur définie.

source: PREEXEC commands are executed after 'routing' and before 'matching', 'actions'
de: PREEXEC-Befehle werden nach 'routing' und vor 'abgleich', 'aktionen' ausgeführt
fr: Les commandes PREEXEC sont exécutées après les commandes de routage et avant les règles de correspondantes (REGEXP sur le statut) et les règles d'actions.

source: Whether or not traps will be inserted into database. Disabled by default
de: Legt fest, ob Traps in die Datenbank geschrieben werden. Standardmäßig deaktiviert
fr: Permet d'enregistrer en base de données chaque trap SNMP reçu. Cette option est désactivée par défaut.

source: Minimum delay necessary for a trap to be processed after another one
de: Minimale notwendige Verzögerung, bevor die nächste Trap verarbeitet wird
fr: Délai minimal nécessaire entre le traitement de 2 traps SNMP.

source: Whether execution interval will be applied to identical OIDs or identical OIDs and hosts
de: Diese Option legt fest, ob das Ausführungsintervall auch für identische OIDs oder identische OIDs und Hosts verwendet wird
fr: L'intervalle d'exécution sera appliqué pour des OIDs ou des couples OIDs/hôtes identiques

source: Defines the trap execution method
de: Legt die Trap-Ausführungsmethode fest
fr: Définit la méthode de traitement lors de la réception du trap SNMP

source: Skip trap if host or service is in downtime when centreontrapd proceeds. 'History' option is more accurate but needs more powers. The option works only with centreon-broker AND central mode.
de: Überspringe die Ausführung der Trap durch centreontrapd wenn sich der Host oder Service in einer Ausfallszeit befindet. 'Historie'-Option ist genauer, verursacht jedoch eine höhere CPU-Auslastung. Diese Option funktioniert nur mit centreon-broker UND zentralem Modus.
fr: N'exécute pas le traitement associé à la définition du trap SNMP si le service associé est en plage de maintenance (downtime). Dans le cas où la méthode "Historisé" est sélectionnée, le processus centreontrapd se connectera à la base de données pour récupérer cette information. Cette option ne fonctionne que pour le traitement des traps SNMP sur le serveur Centreon central avec le module Centreon Broker.

source: Regexp for removing or change some characters in output message (Example: s/\|/-/g).
de: Regulärer Ausdruck um Zeichen in der Outputnachricht zu entfernen bzw. ändern (Beispiel: s/\|/-/g).
fr: Expression rationnelle permettant de modifier certains caractères du statut détaillé (output). Exemple : s/\|/-/g

source: Submit or not the status to the monitoring engine, related to the rules
de: Legt fest, ob der Status an die Monitoring Engine gegeben werden soll, in Verbindung mit den Regeln
fr: Transmettre ou non le statut au moteur de supervision suivant les paramètres renseignés dans les règles

source: Maximum execution time of trap processing. This includes Preexec commands, submit command and special command
de: Maximale Ausführungszeit der Trap. Diese beinhaltet ebenfalls die Ausführung von PREEXEC-Befehlen, dem tatsächlichen und weiteren speziellen Befehlen
fr: Temps maximal d'exécution du processus de traitement des traps SNMP. Ce temps inclut les commandes PREEXEC, l'envoie du résultat et l'exécution des commandes spéciales.

source: Custom Perl code. Will be executed with no change (security issue. Need to set centreontrapd secure_mode to '1')
de: Benutzerdefinierter Perl-Code. Wird ohne Änderungen ausgeführt (Diese Option stellt ein Sicherheitsrisiko dar. centreontrapd's secure_mode muss auf '1' gesetzt werden)
fr: Code Perl personnalisé. Il sera exécuté sans changement (option de sécurité). Nécessite de positionner le l'option "secure_mode" à 1 dans la configuration du processus centreontrapd.

source: Choose a service from the list. The service must have been created beforehand.
de: Wählen Sie einen Service aus der Liste. Dieser Service muss vorher erstellt worden sein.
fr: Choisissez un service depuis la liste. Le service doit avoir été créé au préalable.

source: Choose a service template from the list. The service template must have been created beforehand.
de: Wählen Sie ein Servicetemplate aus der Liste. Dieses Servicetemplate muss vorher erstellt worden sein.
fr: Sélectionner un modèle de service depuis la liste. Ce modèle de service doit au préalable avoir été créé.

source: Choose the update mode for the below field: incremental adds the selected values, replacement overwrites the original values.
de: Legt das Aktualisierungsmodell für das untenstehende Feld fest: Inkrementell fügt die ausgewählten Werte an, Ersetzen überschreibt die ursprünglichen Werte.
fr: Choisir la méthode de mise à jour pour les champs ci-dessous: incrémentale (ajoute les valeurs sélectionnées), remplacement (écrase les valeurs originales).
