Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: When enabled, "Service Unknown" notification messages will be displayed.
de: Wenn diese Option aktiviert ist, werden "Service Unbekannt"-Benachrichtigungen angezeigt.
fr: Si cette option est activée, alors une fenêtre contextuelle apparaîtra pour signaler un service dans un statut inconnu.

source: RRDTOOL binary complete path.
de: Vollständiger Pfad zur Ausführungsdatei des RRDTools.
fr: Chemin complet de l'exécutable de RRDTool.

source: RRDTool version.
fr: Version de RRDTool.

source: Font style of titles.
fr: Style de la police des titres.

source: Font size of titles.
fr: Taille de la police des titres.

source: Font style of units.
fr: Style de la police des unités.

source: Font size of units.
fr: Taille de la police des unités.

source: Font style of X-axis and Y-axis.
fr: Style de la police des axes X et Y.

source: Font size of X-axis and Y-axis.
fr: Taille de la police des axes X et Y.

source: Font style of captions.
fr: Style de la police des légendes.

source: Font size of captions.
fr: Taille de la police des légendes.

source: Font style of watermarks.
fr: Style de la police des filigranes.

source: Font size of watermarks.
fr: Taille de la police des filigranes.

source: Name of resource rule.
de: Name der Ressourcenregel.
fr: Nom de la règle des ressources.

source: Description of resource rule.
de: Beschreibung der Ressourcenregel.
fr: Description de la règle des ressources.

source: Implied ACL groups.
de: Implizite Zugriffssteuerungslistengruppen (ACL Gruppen).
fr: Groupes d'accès liés.

source: Enable or disable the ACL resource rule.
de: (De)aktiviert die Zugriffssteuerungslisten (ACL) Ressourcenregel.
fr: Active ou désactive la règle d'accès aux ressources.

source: Comments regarding this resource rule.
de: Kommentare zu dieser Ressourcenregel.
fr: Commentaire concernant cette règle de ressources.

source: Hosts that will be displayed to users. Services that belong to these hosts will also be visible.
de: Hosts, die Benutzern angezeigt werden. Services, die zu diesen Hosts gehören, werden ebenfalls angezeigt.
fr: Hôtes qui seront affichés aux utilisateurs. Les services qui appartiennent à ces hôtes seront aussi visibles.

source: Host groups that will be displayed to users. Hosts that belong to these host groups will also be visible.
de: Hostgruppen, die Benutzern angezeigt werden. Hosts, die zu diesen Hostgruppen gehören, werden ebenfalls angezeigt.
fr: Groupes d'hôtes qui seront affichés aux utilisateurs. Les hôtes qui appartiennent à ces groupes d'hôtes seront aussi visibles.

source: Excluding hosts from the selected host groups will hide them from users.
de: Wenn Hosts von den ausgewählten Hostgruppen ausgenommen werden, werden diese dem Benutzer nicht angezeigt.
fr: L'exclusion d'hôtes de groupes d'hôtes permet de cacher ces derniers aux utilisateurs.

source: Service groups that will be displayed to users. Services that belong to these service groups will also be visible.
de: Servicegruppen, die Benutzern angezeigt werden. Services, die zu diesen Servicegruppen gehören, werden ebenfalls angezeigt.
fr: Groupes de services qui seront affichés aux utilisateurs. Les services qui appartiennent à ces groupes de services seront aussi visibles.

source: Meta services that will be displayed to users.
de: Meta-Services werden Benutzern angezeigt.
fr: Méta-services qui seront affichés aux utilisateurs.

source: Will only display resources that are monitored by these pollers. When blank, no filter is applied.
de: Zeigt nur Ressourcen an, die von diesen Pollern überwacht werden. Ist dieses Feld leer, wird kein Filter angewendet.
fr: N'affichera que les ressources supervisés pas ces collecteurs. Quand rien n'est sélectionné, aucun filtre n'est appliqué.

source: Will only display hosts that belong to these host categories. When blank, no filter is applied.
de: Zeigt nur Hosts an, die zu diesen Hostkategorien gehören. Ist dieses Feld leer, wird kein Filter angewendet.
fr: N'affichera que les hôtes qui appartiennent à ces catégories d'hôte. Quand rien n'est sélectionné, aucun filtre n'est appliqué.

source: Will only display services that belong to these service categories. When blank, no filter is applied.
de: Zeigt nur Services an, die zu diesen Servicekategorien gehören. Ist dieses Feld leer, wird kein Filter angewendet.
fr: N'affichera que les services qui appartiennent à ces catégories de service. Quand rien n'est sélectionné, aucun filtre n'est appliqué.

source: Name of action rule.
de: Name der Aktionsregel.
fr: Nom de la règle d'accès aux actions.

source: Description of action rule.
de: Beschreibung der Aktionsregel.
fr: Description de la règle d'accès aux actions.

source: The monitoring overview will be displayed at the top of all pages.
de: Die Überwachungsübersicht wird am oberen Rand von jeder Seite dargestellt.
fr: La vue d'ensemble du statut des hôtes et services sera affichée sur l'ensemble des pages sous forme de tableaux.

source: The monitoring poller status overview will be displayed at the top of all pages.
de: Die Überwachungs-Pollerstatus-Übersicht wird am oberen Rand von jeder Seite dargestellt.
fr: La vue d'ensemble du statut des collecteurs sera affichée sur l'ensemble des pages sous forme de tableaux.

source: The poller filter will be available to users in the monitoring consoles.
de: Die Pollerfilter sind für alle Nutzer in den Überwachungskonsolen verfügbar.
fr: Le filtre de sélection des collecteurs sera disponible pour les utilisateurs pour les pages "Supervision -> Hôtes" et "Supervision -> Services".

source: Allows users to stop the monitoring systems.
de: Erlaubt Benutzern den Stop des Überwachungssystems.
fr: Permet aux utilisateurs d'arrêter le moteur de supervision depuis l'interface.

source: Allows users to restart the monitoring systems.
de: Erlaubt Benutzern den Neustart des Überwachungssystems.
fr: Permet aux utilisateurs de redémarrer le moteur de supervision depuis l'interface.

source: Allows users to enable or disable notifications.
de: Erlaubt Benutzern Benachrichtigungen zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver les notifications.

source: Allows users to enable or disable service checks.
de: Erlaubt Benutzern Service-Überprüfungen zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver les contrôles de services.

source: Allows users to enable or disable passive service checks.
de: Erlaubt Benutzern passive Service-Überprüfungen zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver les contrôles passifs de services.

source: Allows users to enable or disable host checks.
de: Erlaubt Benutzern Host-Überprüfungen zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver les contrôles des hôtes.

source: Allows users to enable or disable passive host checks.
de: Erlaubt Benutzern passive Host-Überprüfungen zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver les contrôles passifs des hôtes.

source: Allows users to enable or disable event handlers.
de: Erlaubt Benutzern Event Handler zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver le gestionnaire d'évènement (event handler).

source: Allows users to enable or disable flap detection.
de: Erlaubt Benutzern die Erkennung des Flackern-Status zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver la détection des services en bagotage (flapping).

source: Allows users to enable or disable obsessive service checks.
de: Erlaubt Benutzern erzwungene Service-Überprüfungen zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver l'exécution de commande post contrôle des services (OCSP).

source: Allows users to enable or disable obsessive host checks.
de: Erlaubt Benutzern erzwungene Host-Überprüfungen zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver l'exécution de commande post contrôle des hôtes (OCHP).

source: Allows users to enable or disable performance data processing.
de: Erlaubt Benutzern die Leistungsdatenverarbeitung zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver le traitement des données de performance.

source: Allows users to enable or disable checks of a service.
de: Erlaubt Benutzern passive Service-Überprüfungen zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver le contrôle d'un service.

source: Allows users to enable or disable notifications of a service.
de: Erlaubt Benutzern Service-Benachrichtigungen zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver la notification d'un service.

source: Allows users to acknowledge a service.
de: Erlaubt Benutzern einen Service zur Kenntnis zu nehmen.
fr: Permet aux utilisateurs d'ajouter un acquittement pour un service.

source: Allows users to remove an acknowledgement from a service.
de: Erlaubt Benutzern die Inkenntnisnahme eines Services zu entfernen.
fr: Permet aux utilisateurs de supprimer l'acquittement d'un service.

source: Allows users to re-schedule next check of a service.
de: Erlaubt Benutzern die Ausführungszeit für die nächste Überprüfung eines Services neu festzulegen.
fr: Permet aux utilisateurs de replanifier le prochain contrôle d'un service.

source: Allows users to re-schedule next check of a service by placing its priority to the top.
de: Erlaubt Benutzern die Ausführungszeit für die nächste Überprüfung eines Services neu festzulegen, indem dessen Priorität an die Spitze gesetzt wird.
fr: Permet aux utilisateurs de reprogrammer le prochain contrôle d'un service en priorisant l'exécution de ce dernier en haut de la file d'exécution.

source: Allows users to schedule downtime on a service.
de: Erlaubt Benutzern eine Ausfallszeit für den Service anzusetzen.
fr: Permet aux utilisateurs de planifier une plage de maintenance pour un service.

source: Allows users to add or delete a comment of a service.
de: Erlaubt Benutzern einen Kommentar zu einem Service hinzuzufügen bzw. zu löschen.
fr: Permet aux utilisateurs d'ajouter ou supprimer des commentaires d'un service.

source: Allows users to enable or disable the event handler processing of a service.
de: Erlaubt Benutzern die Verarbeitung eines Services durch den Event-Handler zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver le gestionnaire d'évènements pour un service (event handler).

source: Allows users to enable or disable flap detection of a service.
de: Erlaubt Benutzern die Erkennung des Flackern-Status eines Services zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver la détection de bagotage pour un service (flapping).

source: Allows users to enable or disable passive checks of a service.
de: Erlaubt Benutzern passive Service-Überprüfungen zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver le contrôle passif d'un service.

source: Allows users to submit result to a service.
de: Erlaubt Benutzern Ergebnisse an einen Service einzureichen.
fr: Permet aux utilisateurs de soumettre un résultat pour un service.

source: Allows users to enable or disable checks of a host.
de: Erlaubt Benutzern Host-Überprüfungen zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver les contrôles d'un hôte.

source: Allows users to enable or disable notifications of a host.
de: Erlaubt Benutzern Host-Benachrichtigungen zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver la notification d'un hôte.

source: Allows users to acknowledge a host.
de: Erlaubt Benutzern einen Host zur Kenntnis zu nehmen.
fr: Permet aux utilisateurs d'ajouter un acquittement pour un hôte.

source: Allows users to remove an acknowledgement from a host.
de: Erlaubt Benutzern die Inkenntnisnahme eines Hosts zu entfernen.
fr: Permet aux utilisateurs de supprimer l'acquittement d'un hôte.

source: Allows users to re-schedule next check of a host.
de: Erlaubt Benutzern die Ausführungszeit für die nächste Überprüfung eines Hosts neu festzulegen.
fr: Permet aux utilisateurs de replanifier le contrôle d'un hôte.

source: Allows users to re-schedule next check of a host by placing its priority to the top.
de: Erlaubt Benutzern die Ausführungszeit für die nächste Überprüfung eines Hosts neu festzulegen, indem dessen Priorität an die Spitze gesetzt wird.
fr: Permet aux utilisateurs de reprogrammer le prochain contrôle d'un hôte en priorisant l'exécution de ce dernier en haut de la file d'exécution.

source: Allows users to schedule downtime on a host.
de: Erlaubt Benutzern eine Ausfallszeit für den Host anzusetzen.
fr: Permet aux utilisateurs de planifier une plage de maintenance pour un hôte.

source: Allows users to add or delete a comment of a host.
de: Erlaubt Benutzern einen Kommentar zu einem Host hinzuzufügen bzw. zu löschen.
fr: Permet aux utilisateurs d'ajouter ou supprimer des commentaires pour un hôte.

source: Allows users to enable or disable the event handler processing of a host.
de: Erlaubt Benutzern die Verarbeitung eines Hosts durch den Event-Handler zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver le gestionnaire d'évènements pour un hôte (event handler).

source: Allows users to enable or disable flap detection of a host.
de: Erlaubt Benutzern die Erkennung des Flackern-Status eines Hosts zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver la détection de bagotage pour un hôte (flapping).

source: Allows users to enable or disable all service checks of a host.
de: Erlaubt Benutzern alle Service-Überprüfungen eines Hosts zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver tous les services d'un hôte.

source: Allows users to enable or disable service notifications of a host.
de: Erlaubt Benutzern Service-Benachrichtigungen eines Hosts zu (de)aktivieren.
fr: Permet aux utilisateurs d'activer ou désactiver la notification des services d'un hôte.

source: Allows users to submit result to a host.
de: Erlaubt Benutzern Ergebnisse an einen Host einzureichen.
fr: Permet aux utilisateurs de soumettre un résultat pour un hôte.

source: Enable or disable the ACL action rule.
de: (De)aktiviert die Zugriffssteuerungslisten (ACL) Aktionsregel.
fr: Active ou désactive la règle d'accès aux actions.

source: Name of menu rule.
de: Name der Menüregel.
fr: Nom de la règle de menu.

source: Alias of menu rule.
de: Alias der Menüregel.
fr: Alias de la règle sur les menus.

source: Enable or disable the ACL menu rule.
de: (De)aktiviert die Zugriffssteuerungslisten (ACL) Menüregel.
fr: Activer ou désactiver la règle d'accès aux menus.

source: Comments regarding this menu rule.
de: Kommentare zu dieser Menüregel.
fr: Commentaire de la règle d'accès aux menus.

source: Name of access group.
de: Name der Zugriffsgruppe.
fr: Nom du groupe d'accès.

source: Alias of access group.
de: Alias der Zugriffsgruppe.
fr: Alias du groupe d'accès.

source: Implied users.
de: Implizite Benutzer.
fr: Utilisateurs liés.

source: Implied user groups.
de: Implizite Benutzergruppen.
fr: Groupes d'utilisateurs liés.

source: Enable or disable the access group.
de: Aktiviere bzw. Deaktiviere diese Zugriffsgruppe.
fr: Activer ou désactiver le groupe d'accès.

source: ACL resource rules that are linked to the access group.
de: Zugriffssteuerungslisten (ACL) Ressourcenregeln, die mit der Zugriffsgruppe verknüpft sind.
fr: Règles d'accès concernant les ressources qui seront liées à ce groupe.

source: ACL menu rules that are linked to the access group.
de: Zugriffssteuerungslisten (ACL) Menüregeln, die mit der Zugriffsgruppe verknüpft sind.
fr: Règles d'accès concernant les menus qui seront liées à ce groupe.

source: ACL action rules that are linked to the access group.
de: Zugriffssteuerungslisten (ACL) Aktionsregeln, die mit der Zugriffsgruppe verknüpft sind.
fr: Règles d'accès concernant les actions qui seront liées à ce groupe.

source: Enter a new name for the image.
de: Geben Sie einen neuen Namen für das Bild ein.
fr: Entrer un nouveau nom pour l'image.

source: Enter an already existing or a new directory to add the uploads to it. A non-existent directory name will be created first.
de: Geben Sie ein vorhandenes bzw. ein neues Verzeichnis an, in dem die Uploads abgelegt werden. Ein noch nicht vorhandenes Verzeichnis wird mit dem angegebenen Verzeichnisnamen neu erstellt.
fr: Entrer le nom d'un dossier déjà existant ou d'un nouveau dossier afin d'y ajouter les images envoyés. Un répertoire qui n'existe pas sera créé en premier.

source: Select a local file to upload. You can upload jpg, png, gif and gd2 files. Multiple images can be uploaded together inside archives like zip, tar, tar.gz or tar.bz2.
de: Wählen Sie eine Datei für den Upload. Es können jpg, png, gif und gd2-Dateien hochgeladen werden. Mehrere Bilder können in Archiven (zip, tar, tar.gz, tar.bz2) gleichzeitig hochgeladen werden.
fr: Sélectionner un fichier local à envoyer. Vous pouvez envoyer un fichier de type jpg, png, gif et gd2. Plusieurs images peuvent être envoyées à l'intérieur d'une archive de type zip, tar, tar.gz ou tar.bz2.

source: Destination directory.
de: Zielverzeichnis.
fr: Répertoire de destination.

source: Name of graph template.
de: Name des Graphentemplates.
fr: Nom du modèle de graphe.

source: Vertical Label (Y-axis).
de: Vertikales Label (Y-Achse).
fr: Étiquette Verticale (Axe Y).

source: Width of grid.
fr: Largeur de la grille.

source: Height of grid.
fr: Hauteur de la grille.

source: Lower limit of grid.
de: Untere Grenze des Rasters.
fr: Limite basse de la grille.

source: Upper limit of grid.
de: Obere Grenze des Rasters.
fr: Limite haute de la grille.

source: Base value.
de: Ausgangswert.
fr: Valeur de base.

source: Enables component split.
fr: Activer la séparation des composants.

source: Enables auto scale of graph.
de: Aktiviert die automatische Skalierung des Graphen.
fr: Activer l'échelle automatique du graphe.

source: Set as default graph template.
de: Als Standardgraph-Template verwenden.
fr: Modèle de graphe par défaut.

source: Comments regarding the graph template.
de: Kommentare zum Graphen-Template.
fr: Commentaire du modèle de graphique.

source: Name of virtual metric.
de: Name der virtuellen Metrik.
fr: Nom de la métrique virtuelle.

source: Host / Service Data Source.
de: Host / Service Datenquelle.
fr: Source de données Hôte / Service.

source: DEF Type.
de: DEF Typ.
fr: Type DEF.

source: RPN (Reverse Polish Notation) Function *.
de: RPN (Reverse Polish Notation) Funktion *.
fr: Fonction NPI (Notation Polonaise Inverse) *.

source: Metric unit.
de: Metrikeinheit.
fr: Unité de la Métrique.

source: Warning threshold.
de: Grenzwert für Warnung.
fr: Seuil Warning.

source: Critical threshold.
de: Grenzwert für Kritisch.
fr: Seuil Critique.

source: Hides curve and legend.
de: Blendet die Kurve und Legende aus.
fr: Cacher les courbes et les légendes.

source: Comments regarding the virtual metric.
de: Kommentare zur virtuellen Metrik.
fr: Commentaire concernant la métrique virtuelle.

source: Name of curve template.
de: Name des Kurventemplates.
fr: Nom du modèle de la courbe.

source: It is possible to define a specific service for the data source.
de: Es ist möglich, einen spezifischen Service als Datenquelle festzulegen.
fr: Il est possible de définir un service spécifique pour la source de données.

source: Must be the display name of the metric. Refer to the check plugin for more information.
de: Dieser Wert muss dem Anzeigewert der Metrik entsprechen. Im Überprüfungsplugin können dazu nähere Informationen eingesehen werden.
fr: Doit être le nom de la métrique. Se référer à la sonde pour plus d'informations.

source: Enables graph stacking.
de: Aktiviert die Graphenüberlagerung.
fr: Active l'empilement des graphes.

source: Display order.
de: Anzeigereihenfolge.
fr: Ordre d'affichage.

source: Inverted curve (with negative values).
de: Invertierte Kurve (mit negativen Werten).
fr: Courbe inversée (avec des valeurs négatives).

source: Curve thickness.
de: Kurvendicke.
fr: Épaisseur de la courbe.

source: Curve line color.
de: Kurvenlinienfarbe.
fr: Couleur de la courbe.

source: Curve area color.
fr: Couleur de la zone de remplissage de la courbe.

source: Curve transparency.
fr: Transparence de la courbe.

source: Enables area filling.
de: Aktiviert die Füllung des Bereichs unter der Kurve.
fr: Activer le remplissage.

source: Legend Name.
de: Legendenname.
fr: Nom de la légende.

source: Displays the legend only, thus hiding the curve.
de: Zeige nur die Legende, verstecke die Kurve.
fr: Affiche seulement la légende, cachant ainsi la courbe.

source: Number of line breaks after the legend.
de: Anzahl der Zeilenumbrüche nach der Legende.
fr: Nombre de retour à la ligne après la légende.

source: Prints maximum value.
de: Gibt den maximalen Wert aus.
fr: Affiche la valeur maximale.

source: Prints minimum value.
de: Gibt den minimalen Wert aus.
fr: Affiche la valeur minimale.

source: Rounds the value.
de: Rundet den Wert.
fr: Arrondit la valeur.

source: Prints average value.
de: Gibt den durchschnittlichen Wert aus.
fr: Affiche la valeur moyenne.

source: Prints last Value.
de: Gibt den letzten Wert aus.
fr: Affiche la dernière valeur.

source: Print total value.
de: Gebe den insgesamten Wert aus.
fr: Afficher la valeur totale.

source: Comments regarding the curve template.
de: Kommentare zum Kurventemplate.
fr: Commentaire sur le modèle de courbe.

source: This is the file that Monitoring Engine uses to store the current status, comment, and downtime information. This file is deleted every time Monitoring Engine stops and recreated when it starts.
de: In dieser Datei speichert die Monitoring Engine aktuelle Status, Kommentare und Ausfallszeiten. Diese Datei wird gelöscht, sobald die Monitoring Engine gestoppt wird und wird neu erstellt, wenn diese wieder gestartet wird.
fr: C'est le fichier qu'utilise le Moteur de Supervision pour stocker les statuts actuels, les commentaires, et les informations de la plage de maintenance. Ce fichier est effacé à chaque fois que le Moteur de Supervision s'arrête puis le recrée lorsqu'il redémarre.

source: Combined with the aggregate_status_updates option, this option determines the frequency (in seconds!) that Nagios will periodically dump program, host, and service status data. If you are not using aggregated status data updates, this option has no effect. The minimum update interval is 2 seconds.
de: Zusammen mit der Option Statusaktualisierungen zusammenfassen (aggregate_status_updates) legt diese Option die Frequenz (in Sekunden) fest, in dem Nagios kontinuierlich Programm-, Host- sowie Service-Status-Daten entsorgt. Falls aggregierte Statusdatenaktualisierungen nicht genutzt werden, hat diese Option keine Auswirkungen. Der minimale Aktualisierungsintervall beträgt zwei Sekunden.
fr: Combiné avec l'option aggregate_status_updates, cette option détermine la fréquence (en secondes) à laquelle le moteur de supervision va vider périodiquement le programme, l'hôte et les données d'état de service. Si vous n'utilisez pas les mises à jour cumulatives de données d'état, cette option n'a aucun effet. L'intervalle minimal est de 2 secondes.

source: Location (path and filename) where Monitoring Engine should create its main log file.
de: Speicherort (Pfad inkl. Dateiname), in dem die Monitoring Engine die Hauptprotokolldatei erstellen soll.
fr: Emplacement (chemin et nom de fichier) où le Moteur de Supervision devrait créer son fichier de log principal.
