Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: Monitoring Engine tries to be smart about how and when it checks the status of hosts. By default this option is disabled and will allow Monitoring Engine to make some smarter decisions and check hosts a bit faster. Enabling this option will increase the amount of time required to check hosts, but may improve reliability a bit. Unless you have problems with Monitoring Engine not recognizing that a host recovered, I would suggest not enabling this option.
fr: Le moteur de supervision essaie d'être intelligent quant à la manière et au moment de vérifier l'état des hôtes. Par défaut cette option est désactivée et permettra au moteur de supervision de prendre des décisions plus judicieuses et de vérifier plus rapidement les hôtes. L'activation de cette option permet d'augmenter le temps nécessaire pour vérifier les hôtes, mais peut aussi améliorer un peu la fiabilité. Cette option ne devrait pas être activée sauf si le moteur de supervision a des difficultés à détecter le retour à la normale d'un hôte.

source: This option determines whether or not Monitoring Engine will try and detect hosts and services that are "flapping". Flapping occurs when a host or service changes between states too frequently, resulting in a barrage of notifications being sent out. When Monitoring Engine detects that a host or service is flapping, it will temporarily suppress notifications for that host/service until it stops flapping. Flap detection is very experimental at this point, so use this feature with caution! More information on how flap detection and handling works can be found here. Note: If you have state retention enabled, Monitoring Engine will ignore this setting when it (re)starts and use the last known setting for this option (as stored in the state retention file), unless you disable the use_retained_program_state option. This option is disabled by default.
de: Diese Option legt fest, ob von der Monitoring Engine versucht wird, Hosts und Services zu identifizieren, die "flackern". Flackern tritt auf, wenn sich der Status eines Hosts bzw. Services zu häufig ändert, wodurch eine Vielzahl an Benachrichtigungen gesendet wird. Wenn die Monitoring Engine erkennt, dass sich ein Host bzw. Service im Flackern-Status befindet, werden die Benachrichtigungen für diesen Host bzw. Service temporär deaktiviert, bis der Host bzw. Service sich nicht mehr in dem Status befindet. Die Erkennung des Flackern-Status ist derzeit noch in einem experimentellen Zustand, deshalb sollte diese Option nur mit Vorsicht verwendet werden. Weitere Informationen zur Erkennung des Flackern-Status können unter diesem Link gefunden werden. Hinweis: Wenn die Statusbeibehaltung aktiviert ist ignoriert die Monitoring Engine diese Einstellung bei (Neu)Starts und verwendet die letzte bekannte Einstellung für diese Option (wie in der Statusbeibehaltungsdatei festgelegt). Das ist nicht der Fall, wenn die Option beibehaltenen Programmstatus verwenden (use_retained_program_state) deaktiviert wird. Diese Option ist standardmäßig deaktiviert.
fr: Cette option détermine si le moteur de supervision essaiera de détecter les hôtes et les services qui sont en "oscillation". L'oscillation c'est quand un hôte ou un service change d'état trop fréquemment, provoquant une grande quantité de notifications envoyées. Quand le moteur de supervision détecte qu'un hôte ou un service oscille, il supprime temporairement les notifications pour cet hôte / service jusqu'à ce qu'il arrête d'osciller. La détection de l'oscillation est très expérimentale, à ce stade, donc utilisez cette fonction avec précaution ! Pour plus d'informations sur la détection d'oscillation et les actions entreprises peuvent être trouvés dans la documentation du moteur de supervision. Remarque: Si la rétention d'état est ​​active, le moteur de supervision ignorera ce paramètre au (re)démarrage et utilisera sa dernière valeur connue pour cette option (telle qu'elle est stockée dans le fichier de rétention des états), sauf si vous désactivez l'option use_retained_program_state. Cette option est désactivée par défaut.

source: This option is used to set the low threshold for detection of service flapping. For more information read the Monitoring Engine section about flapping.
de: Diese Option legt den unteren Grenzwert für die Erkennung von Flackern von Services fest. Weitere Informationen finden Sie in der Dokumentation zur Monitoring Engine im Abschnitt flackern (flapping).
fr: Cette option permet de spécifier le seuil inférieur pour la détection de l'oscillation d'un service. Pour plus d'information, lisez la section gestion des oscillations de la documentation du moteur de supervision.

source: This option is used to set the high threshold for detection of service flapping. For more information read the Monitoring Engine section about flapping.
de: Diese Option legt den oberen Grenzwert für die Erkennung von Flackern von Services fest. Weitere Informationen finden Sie in der Dokumentation zur Monitoring Engine im Abschnitt flackern (flapping).
fr: Cette option permet de spécifier le seuil supérieur pour la détection de l'oscillation d'un service. Pour plus d'information, lisez la section gestion des oscillations de la documentation du moteur de supervision.

source: This option is used to set the low threshold for detection of host flapping. For more information read the Monitoring Engine section about flapping.
de: Diese Option legt den unteren Grenzwert für die Erkennung von Flackern von Hosts fest. Weitere Informationen finden Sie in der Dokumentation zur Monitoring Engine im Abschnitt flackern (flapping).
fr: Cette option permet de spécifier le seuil inférieur pour la détection de l'oscillation d'un hôte. Pour plus d'information, lisez la section gestion des oscillations de la documentation du moteur de supervision.

source: This option is used to set the high threshold for detection of host flapping. For more information read the Monitoring Engine section about flapping.
de: Diese Option legt den oberen Grenzwert für die Erkennung von Flackern von Services fest. Weitere Informationen finden Sie in der Dokumentation zur Monitoring Engine im Abschnitt flackern (flapping).
fr: Cette option permet de spécifier le seuil supérieur pour la détection de l'oscillation d'un hôte. Pour plus d'information, lisez la section gestion des oscillations de la documentation du moteur de supervision.

source: This option determines whether or not Monitoring Engine will use soft state information when checking host and service dependencies. Normally Monitoring Engine will only use the latest hard host or service state when checking dependencies. If you want it to use the latest state (regardless of whether its a soft or hard state type), enable this option.
de: Diese Option legt fest, ob die Monitoring Engine Soft-Status Informationen verwendet, wenn Host- und Serviceabhängigkeiten überprüft werden. Normalerweise verwendet die Monitoring Engine ausschließlich Hard-Host- bzw. -Service-Status bei der Überprüfung von Abhängigkeiten. Wenn unabhängig von der Statusart der letzte ermittelte Status verwendet werden soll, aktivieren Sie diese Option.
fr: Cette option détermine si le moteur de supervision utilisera les informations d'état soft des services lors du contrôle des dépendances de service. En temps normal, le moteur de supervision n'utilise que le dernier état hard du service lors du contrôle des dépendances. Si vous voulez utiliser le dernier état (que ce soit un état hard ou soft), activez cette option.

source: This is the maximum number of seconds that Monitoring Engine will allow service checks to run. If checks exceed this limit, they are killed and a CRITICAL state is returned. A timeout error will also be logged. This option is meant to be used as a last ditch mechanism to kill off plugins which are misbehaving and not exiting in a timely manner. It should be set to something high (like 60 seconds or more), so that each service check normally finishes executing within this time limit. If a service check runs longer than this limit, Monitoring Engine will kill it off thinking it is a runaway processes.
de: Maximale Zeit in Sekunden, die die Ausführung einer Service-Überprüfung in Anspruch nehmen darf. Wenn dieses Limit überschritten wird, werden sie von der Monitoring Engine beendet und ein KRITISCH-Status gemeldet. Zusätzlich wird ein Timeout-Error protokolliert. Diese Einstellung dient als letzte Option, um dysfunktionale Plugins zu beenden. Der Wert sollte relativ hoch gesetzt werden (60 Sekunden oder mehr), damit jede reguläre Service-Überprüfung in dieser Zeit ausgeführt werden kann.
fr: Ceci est le nombre maximum de secondes allouées par le moteur de supervision pour la vérification d'un service. Si la vérification dépasse ce délai, celle-ci est tuée et un état CRITIQUE est retourné. Une erreur de temporisation est également enregistrée dans le fichier de journalisation. Cette option est destinée à être utilisée comme dernier recours pour tuer les sondes qui se comportent mal et qui ne se terminent pas dans le temps imparti. La valeur doit être suffisamment élevée (quelque chose comme 60 secondes ou plus), de sorte que chaque vérification puisse se terminer avant ce délai. Si une vérification de service s'exécute au-delà de cette limite, le moteur de supervision la tuera, pensant que c'est un processus ayant des problèmes.

source: This is the maximum number of seconds that Monitoring Engine will allow host checks to run. If checks exceed this limit, they are killed and a CRITICAL state is returned and the host will be assumed to be DOWN. A timeout error will also be logged. This option is meant to be used as a last ditch mechanism to kill off plugins which are misbehaving and not exiting in a timely manner. It should be set to something high (like 60 seconds or more), so that each host check normally finishes executing within this time limit. If a host check runs longer than this limit, Monitoring Engine will kill it off thinking it is a runaway processes.
de: Maximale Zeit in Sekunden, die die Ausführung einer Host-Überprüfung in Anspruch nehmen darf. Wenn dieses Limit überschritten wird, werden sie von der Monitoring Engine beendet und ein KRITISCH-Status gemeldet; der Host wird als DOWN deklariert. Zusätzlich wird ein Timeout-Error protokolliert. Diese Einstellung dient als letzte Option, um dysfunktionale Plugins zu beenden. Der Wert sollte relativ hoch gesetzt werden (60 Sekunden oder mehr), damit jede reguläre Host-Überprüfung in dieser Zeit ausgeführt werden kann.
fr: Ceci est le nombre maximum de secondes allouées par le moteur de supervision pour la vérification d'un hôte. Si la vérification dépasse ce délai, celle-ci est tuée, un état CRITIQUE est retourné et l'hôte sera considéré INDISPONIBLE. Une erreur de temporisation est également enregistrée dans le fichier de journalisation. Cette option est destinée à être utilisée comme dernier recours pour tuer les sondes qui se comportent mal et qui ne se terminent pas dans le temps imparti. La valeur doit être suffisamment élevée (quelque chose comme 60 secondes ou plus), de sorte que chaque vérification puisse se terminer avant ce délai. Si une vérification d'hôte s'exécute au-delà de cette limite, le moteur de supervision la tuera, pensant que c'est un processus ayant des problèmes.

source: This is the maximum number of seconds that Monitoring Engine will allow event handlers to be run. If an event handler exceeds this time limit it will be killed and a warning will be logged. This option is meant to be used as a last ditch mechanism to kill off commands which are misbehaving and not exiting in a timely manner. It should be set to something high (like 60 seconds or more), so that each event handler command normally finishes executing within this time limit. If an event handler runs longer than this limit, Monitoring Engine will kill it off thinking it is a runaway processes.
de: Maximale Zeit in Sekunden, die die Ausführung eines Event-Handlers in Anspruch nehmen darf. Wenn dieses Limit überschritten wird, werden sie von der Monitoring Engine beendet und eine Warnungsmeldung protokolliert. Diese Einstellung dient als letzte Option, um dysfunktionale Befehle zu beenden. Der Wert sollte relativ hoch gesetzt werden (60 Sekunden oder mehr), damit jeder reguläre Event Handler in dieser Zeit ausgeführt werden kann.
fr: Ceci est le nombre maximum de secondes allouées par le moteur de supervision pour l'exécution des gestionnaires d'événement. Si le traitement d'un événement dépasse ce délai, celui-ci est arrêté et un avertissement est enregistré dans le fichier de journalisation. Cette option est destinée à être utilisée comme dernier recours pour tuer les commandes qui se comportent mal et qui ne se terminent pas dans le temps imparti. La valeur doit être suffisamment élevée (quelque chose comme 60 secondes ou plus), de sorte que chaque gestionnaire d'événement puisse se terminer avant ce délai. Si un traitement d'événement s'exécute au-delà de cette limite, le moteur de supervision le tuera, pensant que c'est un processus ayant des problèmes.

source: This is the maximum number of seconds that Monitoring Engine will allow notification commands to be run. If a notification command exceeds this time limit it will be killed and a warning will be logged. This option is meant to be used as a last ditch mechanism to kill off commands which are misbehaving and not exiting in a timely manner. It should be set to something high (like 60 seconds or more), so that each notification command finishes executing within this time limit. If a notification command runs longer than this limit, Monitoring Engine will kill it off thinking it is a runaway processes.
de: Maximale Zeit in Sekunden, die die Ausführung eines Benachrichtigungsbefehls in Anspruch nehmen darf. Wenn dieses Limit überschritten wird, werden sie von der Monitoring Engine beendet und eine Warnungsmeldung protokolliert. Diese Einstellung dient als letzte Option, um dysfunktionale Befehle zu beenden. Der Wert sollte relativ hoch gesetzt werden (60 Sekunden oder mehr), damit jeder reguläre Benachrichtigungsbefehl in dieser Zeit ausgeführt werden kann.
fr: Ceci est le nombre maximum de secondes allouées par le moteur de supervision pour l'exécution des commandes de notification. Si une commande de notification dépasse ce délai, celle-ci est tuée et un avertissement est enregistré dans le fichier de journalisation. Cette option est destinée à être utilisée comme dernier recours pour tuer les commandes qui se comportent mal et qui ne se terminent pas dans le temps imparti. La valeur doit être suffisamment élevée (quelque chose comme 60 secondes ou plus), de sorte que chaque commande de notification puisse se terminer avant ce délai. Si une commande de notification s'exécute au-delà de cette limite, le moteur de supervision la terminera, pensant que c'est un processus ayant des problèmes.

source: This is the maximum number of seconds that Monitoring Engine will allow an obsessive compulsive service processor command to be run. If a command exceeds this time limit it will be killed and a warning will be logged.
de: Maximale Zeit in Sekunden, die ein obligatorischer, erzwungener Serviceverarbeitungsbefehl zur Ausführung benötigen darf. Wenn diese Zeit überschritten wird, wird der Befehl beendet durch die Monitoring Engine und eine Warnung wird protokolliert.
fr: C'est le nombre maximal de secondes pendant lequel le moteur de supervision laissera tourner une commande de remontée de contrôle de service. Si une commande dépasse cette limite, elle sera tuée et une alerte sera journalisée.

source: This is the maximum number of seconds that Monitoring Engine will allow an obsessive compulsive host processor command to be run. If a command exceeds this time limit it will be killed and a warning will be logged.
de: Maximale Zeit in Sekunden, die ein obligatorischer, erzwungener Hostverarbeitungsbefehl zur Ausführung benötigen darf. Wenn diese Zeit überschritten wird, wird der Befehl durch die Monitoring Engine beendet und eine Warnung wird protokolliert.
fr: C'est le nombre maximal de secondes pendant lequel le moteur de supervision laissera tourner une commande de remontée de contrôle d'hôte. Si une commande dépasse cette limite, elle sera tuée et une alerte sera enregistrée dans le fichier de journalisation.

source: This is the maximum number of seconds that Monitoring Engine will allow a host performance data processor command or service performance data processor command to be run. If a command exceeds this time limit it will be killed and a warning will be logged.
de: Maximale Zeit in Sekunden, die ein Host- bzw. Serviceleistungsdatenverarbeitungsbefehl zur Ausführung benötigen darf. Wenn diese Zeit überschritten wird, wird der Befehl durch die Monitoring Engine beendet und eine Warnung wird protokolliert.
fr: C'est le nombre maximal de secondes pendant lequel le moteur de supervision laissera tourner une commande de traitement de données de performance d'un hôte ou d'un service .Si une commande dépasse cette limite, elle sera tuée et une alerte sera enregistrée dans le fichier de journalisation.

source: This value determines whether or not Monitoring Engine will "obsess" over service checks results and run the obsessive compulsive service processor command you define. This option is useful for performing distributed monitoring. This option is disabled by default. If you're not doing distributed monitoring, don't enable this option.
de: Diese Option legt fest, ob die Monitoring Engine die Ergebnisse von Service-Überprüfungen überwacht und definierte, obligatorische, erzwungene Serviceverarbeitungsbefehle ausführt. Diese Option ist für verteiltes Monitoring nützlich. Diese Option ist standardmäßig deaktiviert. Wenn kein verteiltes Monitoring eingesetzt wird, sollte diese Option nicht aktiviert werden.
fr: Cette valeur détermine si le moteur de supervision remontera les résultats de contrôles de service et lancera la commande de remontée de contrôle de service que vous avez définie. Cette option est utile dans le cadre de la supervision distribuée. Cette option est désactivée par défaut. Si vous ne faites pas de supervision distribuée, n'activez pas cette option.

source: This option allows you to specify a command to be run after every service check, which can be useful in distributed monitoring. This command is executed after any event handler or notification commands. The maximum amount of time that this command can run is controlled by the ocsp_timeout option. This command is only executed if the obsess_over_services option is enabled globally and if the obsess_over_service directive in the service definition is enabled.
de: Mit dieser Option kann ein Befehl festgelegt werden, der nach jeder Service-Überprüfung ausgeführt werden soll. Diese Option kann für eine verteilte Überwachungsumgebung nützlich sein. Dieser Befehl wird im Anschluss an Event Handler bzw. Benachrichtigungsbefehle ausgeführt. Die maximale Zeit, die dieser Befehl zur Ausführung benötigen darf, wird durch die Option ocsp_timeout festgelegt. Dieser Befehl wird nur ausgeführt, wenn die Services überwachen (obsess_over_services) Option global und die Service überwachen (obsess_over_service) Richtlinie in der Service-Definition aktiviert ist.
fr: Cette option vous permet de spécifier une commande à exécuter juste après le contrôle de chaque service, ce qui peut être très utile dans un environnement distribué. Cette commande est exécutée après chaque commande du gestionnaire d'événements ou de notification. Le nombre maximum de fois que cette commande peut être exécutée est contrôlé par l'option ocsp_timeout. Cette commande est exécutée uniquement si l'option obsess_over_services est activée de manière globale et que la directive obsess_over_service dans la définition du service est activée.

source: This value determines whether or not Monitoring Engine will "obsess" over host checks results and run the obsessive compulsive host processor command you define. This option is useful for performing distributed monitoring. This option is disabled by default. If you're not doing distributed monitoring, don't enable this option.
de: Diese Option legt fest, ob die Monitoring Engine die Ergebnisse von Host-Überprüfungen überwacht und definierte, obligatorische, erzwungene Hostverarbeitungsbefehle ausführt. Diese Option ist für verteiltes Monitoring nützlich. Diese Option ist standardmäßig deaktiviert. Wenn kein verteiltes Monitoring eingesetzt wird, sollte diese Option nicht aktiviert werden.
fr: Cette valeur détermine si le moteur de supervision remontera les résultats de contrôles d'hôte et lancera la commande de remontée de contrôle d'hôte que vous avez définie. Cette option est utile dans le cadre de la supervision distribuée. Cette option est désactivée par défaut. Si vous ne faites pas de supervision distribuée, n'activez pas cette option.

source: This option allows you to specify a command to be run after every host check, which can be useful in distributed monitoring. This command is executed after any event handler or notification commands. The maximum amount of time that this command can run is controlled by the ochp_timeout option. This command is only executed if the obsess_over_hosts option is enabled globally and if the obsess_over_host directive in the host definition is enabled.
de: Mit dieser Option kann ein Befehl festgelegt werden, der nach jeder Host-Überprüfung ausgeführt werden soll. Diese Option kann für eine verteilte Überwachungsumgebung nützlich sein. Dieser Befehl wird im Anschluss an Event Handler bzw. Benachrichtigungsbefehle ausgeführt. Die maximale Zeit, die dieser Befehl zur Ausführung benötigen darf, wird durch die Option ochp_timeout festgelegt. Dieser Befehl wird nur ausgeführt, wenn die Hosts überwachen (obsess_over_hosts) Option global und die Host überwachen (obsess_over_host) Richtlinie in der Host-Definition aktiviert ist.
fr: Cette option vous permet de spécifier une commande à exécuter juste après le contrôle de chaque hôte, ce qui peut être très utile dans un environnement distribué. Cette commande est exécutée après chaque commande du gestionnaire d'événements ou de notification. Le nombre maximum de fois que cette commande peut être exécutée est contrôlé par l'option ochp_timeout. Cette commande est exécutée uniquement si l'option obsess_over_hosts est activée de manière globale et que la directive obsess_over_host dans la définition de l'hôte est activée.

source: This value determines whether or not Monitoring Engine will process host and service check performance data. This option is disabled by default.
de: Diese Option legt fest, ob die Monitoring Engine Host- und Serviceüberprüfungsleistungsdaten verarbeitet. Diese Option ist standardmäßig deaktiviert.
fr: Cette valeur détermine si le moteur de supervision traitera les données de performances des contrôles d'hôtes et de services. Cette option est activée par défaut.
