Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: This is the file that Monitoring Engine will check for external commands to process. Centreon writes commands to this file. The external command file is implemented as a named pipe (FIFO), which is created when Monitoring Engine starts and removed when it shuts down. If the file exists when Monitoring Engine starts, the Monitoring Engine process will terminate with an error message.
de: Hier kann die Datei angegeben werden, die die Monitoring Engine nach externen Befehlen durchsucht, die verarbeitet werden sollen. Centreon schreibt Befehle in diese Datei. Die Datei für externe Befehle ist als Named Pipe (FIFO) implementiert, die beim Start der Monitoring Engine erstellt und beim Herunterfahren gelöscht wird. Wenn die Datei bereits existiert wenn die Monitoring Engine gestartet wird, wird der Prozess der Monitoring Engine mit einer Fehlermeldung beendet.
fr: Ceci est le fichier des commandes externes pouvant être exécutées par le moteur de supervision. Centreon enregistre les commandes dans ce fichier. Le fichier des commandes externes est organisé comme un canal nommé (FIFO), qui est créé quand le moteur de supervision démarre puis supprimé quand il s'arrête. Si le fichier existe déjà quand le moteur de supervision démarre, le moteur de supervision s'arrête avec un message d'erreur.

source: This is an advanced feature. This option determines how many buffer slots Monitoring Engine will reserve for caching external commands that have been read from the external command file by a worker thread, but have not yet been processed by the main thread of the Monitoring Engine daemon. This option essentially determines how many commands can be buffered. For installations where you process a large number of passive checks (e.g. distributed setups), you may need to increase this number. You should consider using MRTG to graph Monitoring Engine' usage of external command buffers.
de: Diese Option sollte nur von erfahrenen Nutzern verwendet werden. Diese Option legt fest, wie viele Bufferplätze die Monitoring Engine für die Zwischenspeicherung von externen Befehlen verwendet, die bereits durch einen Worker Thread aus der Datei für externe Befehle gelesen wurden, jedoch noch nicht vom Main Thread des Monitoring Engine Daemons verarbeitet wurden. Diese Option legt somit fest, wie viele Befehle in der Warteschlange gehalten werden können. In Umgebungen in der eine hohe Anzahl an passiven Überprüfungen ausgeführt werden (z.B. verteilte Umgebungen) kann es erforderlich sein, diese Zahl zu erhöhen. Es sollte in Betracht gezogen werden, MRTG für die Überwachung der Nutzung von externen Befehlsbuffern durch die Monitoring Engine zu verwenden.
fr: Ceci est une fonction avancée. Cette option détermine le nombre de tampons réservés par le moteur de supervision pour la mise en cache des commandes externes lues par le processus de travail de lecture du fichier de commandes externes, mais qui n'ont pas encore été lues par le processus d'arrière-plan principal du moteur de supervision. Cette option détermine principalement le nombre de commandes qui peuvent être mise dans le tampon. Pour les installations où il y a un grand nombre de vérifications passives (ex. environnements distribués), ce nombre doit être augmenté. Il faut envisager l'utilisation de MRTG pour produire un graphe d'utilisation des tampons de commandes externes.

source: This option specifies the location of the lock file that Monitoring Engine should create when it runs as a daemon. This file contains the process id (PID) number of the running Monitoring Engine process.
de: Speicherort für die Sperrdatei der Monitoring Engine, wenn diese als Daemon ausgeführt wird. Diese Datei enthält die Prozess-ID (PID) des Monitoring Engine Prozesses.
fr: Cette option permet de spécifier l'emplacement du fichier verrou qui sera créé lorsque le moteur de supervision est lancé en tant que démon. Ce fichier contient l'identifiant du processus (PID) du moteur de supervision qui tourne.

source: This option determines whether or not Monitoring Engine will retain state information for hosts and services between program restarts. If you enable this option, you should supply a value for the state_retention_file variable. When enabled, Monitoring Engine will save all state information for hosts and service before it shuts down (or restarts) and will read in previously saved state information when it starts up again. Option is enabled by default.
de: Diese Option legt fest, ob die Monitoring Engine Statusinformationen für Hosts und Services nach einem Neustart beibehält. Wenn diese Option aktiviert wird, sollte ein Wert für die Statusbeibehaltungsdatei (state_retention_file) festgelegt werden. Wenn diese Option aktiviert ist, werden Host- und Servicestatusinformationen vor dem Herunterfahren bzw. vor einem Neustart gespeichert und beim nächsten Start geladen. Diese Option ist standardmäßig aktiviert.
fr: Cette option détermine si le moteur de supervision mémorise ou non l'information de l'état des hôtes et des services entre les redémarrages du programme. Si l'option est activée, la valeur state_retention_file doit être définie. Dans ce cas, le système de supervision sauvegarde toute l'information d'état des hôtes et des services avant l'arrêt (ou le redémarrage) et la relit quand il démarre à nouveau. L'option est active par défaut.

source: This is the file that Monitoring Engine will use for storing status, downtime, and comment information before it shuts down. When Monitoring Engine is restarted it will use the information stored in this file for setting the initial states of services and hosts before it starts monitoring anything. In order to make Monitoring Engine retain state information between program restarts, you must enable the retain_state_information option.
de: In dieser Datei werden durch die Monitoring Engine Status, Ausfallszeiten und Kommentare gespeichert, bevor diese heruntergefahren wird. Wenn die Monitoring Engine neugestartet wird, werden die Informationen in dieser Datei für die initialen Status von Hosts und Services verwendet, bevor die Überwachung gestartet wird. Damit diese Informationen über Neustarts hinweg beibehalten werden, muss die Statusinformationen beibehalten (retain_state_information) Option aktiviert werden.
fr: C'est le fichier utilisé par le moteur de supervision pour stocker le statut, les temps d'indisponibilité et les commentaires avant son arrêt. Quand le moteur de supervision est redémarré, il utilise l'information enregistrée dans ce fichier pour définir, avant toute vérification, l'état initial des services et des hôtes. Pour permettre au moteur de supervision d'enregistrer les informations d'état entre les redémarrages du programme, l'option retain_state_information doit être activée.

source: This setting determines how often (in minutes) that Monitoring Engine will automatically save retention data during normal operation. If you set this value to 0, Monitoring Engine will not save retention data at regular intervals, but it will still save retention data before shutting down or restarting. If you have disabled state retention (with the retain_state_information option), this option has no effect.
de: Diese Option legt fest, wie häufig (in Minuten) die Monitoring Engine automatisch Aufbewahrungsdaten im normalen Betrieb speichert. Wenn dieser Wert auf 0 gesetzt wird, werden Aufbewahrungsdaten nicht in regelmäßigen Intervallen, sondern nur noch beim Neustart bzw. vor dem Herunterfahren gespeichert. Wenn die Aufbewahrung von Status mithilfe der Option Statusinformationen beibehalten (retain_state_information) deaktiviert wurde, hat diese Option keine Auswirkung.
fr: Ce paramètre définit la fréquence (en minutes) à laquelle le moteur de supervision sauvegardera automatiquement les données de rétention pendant son fonctionnement normal. Si la valeur est à 0, le moteur de supervision n'enregistrera pas à des intervalles réguliers les données de rétention, mais seulement avant l'arrêt ou le redémarrage. Si la rétention de l'état est désactivée (avec l'option retain_state_information), ce paramètre n'a pas d'effet.

source: This setting determines whether or not Monitoring Engine will set various program-wide state variables based on the values saved in the retention file. Some of these program-wide state variables that are normally saved across program restarts if state retention is enabled include the enable_notifications, enable_flap_detection, enable_event_handlers, execute_service_checks, and accept_passive_service_checks options. If you do not have state retention enabled, this option has no effect. This option is enabled by default.
de: Diese Option legt fest, ob von der Monitoring Engine verschiedene programmweite Statusvariablen auf Basis der in der Aufbewahrungsdatei gespeicherten Werte gesetzt werden. Einige dieser programmweiten Statusvariablen, die üblicherweise über Neustarts hinweg beibehalten werden, sind die Optionen Benachrichtigungen aktivieren (enable_notifications), Flackernerkennung aktivieren (enable_flap_detection), Event Handler aktivieren (enable_event_handlers), Serviceüberprüfungen ausführen (execute_service_checks) und Passive Serviceüberprüfungen akzeptieren (accept_passive_service_checks). Wenn die Aufbewahrung von Status mithilfe der Option Statusinformationen beibehalten (retain_state_information) deaktiviert wurde, hat diese Option keine Auswirkung. Diese Option ist standardmäßig aktiviert.
fr: Cette option détermine si le moteur de supervision définit diverses variables globales en se basant sur les valeurs du fichier de rétention. Les options enable_notifications, enable_flap_detection, enable_event_handlers, execute_service_checks et accept_passive_service_checks sont parmi ces variables globales et sont normalement conservées entre les redémarrages du programme si la rétention d'état est activée. Si la rétention d'état n'est pas active, cette option n'a pas d'effet. Cette option est activée par défaut.

source: This setting determines whether or not Monitoring Engine will retain scheduling info (next check times) for hosts and services when it restarts. If you are adding a large number (or percentage) of hosts and services, I would recommend disabling this option when you first restart Monitoring Engine, as it can adversely skew the spread of initial checks. Otherwise you will probably want to leave it enabled.
de: Diese Option legt fest, ob Planungsinformationen bezüglich der nächsten Überprüfung für Hosts und Services beibehalten werden sollen, wenn ein Neustart durchgeführt wird. Wenn eine große Anzahl (oder ein hoher Prozentsatz) an Hosts und Services hinzugefügt wird, wird empfohlen, diese Option beim ersten Neustart der Monitoring Engine zu deaktivieren, da ansonsten die Verteilung der initialen Überprüfungen verzerrt werden kann. Andernfalls sollte diese Option aktiviert bleiben.
fr: Ce paramètre détermine si le moteur de supervision mémorise la planification (heures des vérifications à venir) pour les hôtes et les services quand il redémarre. Si vous ajoutez un grand nombre (ou en pourcentage) d'hôtes ou de services, il est recommandé de désactiver cette option au premier redémarrage du moteur de supervision, car cela peut considérablement limiter la répartition dans le temps des premières vérifications. Par ailleurs il faudra laisser cette option activée.

source: This is an advanced feature. You'll need to read the Centreon Engine source code to use this option effectively. These options determine which service attributes are NOT retained across program restarts. By default, all host and service attributes are retained.
de: Diese Option sollte nur von erfahrenen Nutzern verwendet werden; es muss Einsicht in den Quellcode der Centreon Engine genommen werden, damit diese Option effektiv verwendet werden kann. Diese Option legt fest, welche Serviceattribute nach einem Programmneustart NICHT beibehalten werden. Standardmäßig werden alle Host- und Serviceattribute gespeichert.
fr: Ceci est une fonctionnalité avancée. Vous aurez besoin de lire le code source de Centreon Engine pour utiliser cette option efficacement. Ces options permettent de définir quels attributs du service NE SERONT PAS retenus lors du redémarrage du moteur. Par défaut tous les attributs sont récupérés.

source: This is an advanced feature. You'll need to read the Centreon Engine source code to use this option effectively. These options determine which host attributes are NOT retained across program restarts. By default, all host and service attributes are retained.
de: Diese Option sollte nur von erfahrenen Nutzern verwendet werden; es muss Einsicht in den Quellcode der Centreon Engine genommen werden, damit diese Option effektiv verwendet werden kann. Diese Option legt fest, welche Hostattribute nach einem Programmneustart NICHT beibehalten werden. Standardmäßig werden alle Host- und Serviceattribute gespeichert.
fr: Ceci est une fonctionnalité avancée. Vous aurez besoin de lire le code source de Centreon Engine pour utiliser cette option efficacement. Ces options permettent de définir quels attributs de l'hôte NE SERONT PAS retenus lors du redémarrage du moteur. Par défaut tous les attributs sont récupérés.

source: This is an advanced feature. You'll need to read the Centreon Engine source code to use this option effectively. These options determine which service process attributes are NOT retained across program restarts. By default, all host and service attributes are retained.
de: Diese Option sollte nur von erfahrenen Nutzern verwendet werden; es muss Einsicht in den Quellcode der Centreon Engine genommen werden, damit diese Option effektiv verwendet werden kann. Diese Option legt fest, welche Serviceprozessattribute nach einem Programmneustart NICHT beibehalten werden. Standardmäßig werden alle Host- und Serviceattribute gespeichert.
fr: Ceci est une fonctionnalité avancée. Vous aurez besoin de lire le code source de Centreon Engine pour utiliser cette option efficacement. Ces options permettent de définir quels processus liés au service (event handler, obsessive handler, flapping, etc.) NE SERONT PAS retenus lors du redémarrage du moteur. Par défaut tous les processus sont récupérés.

source: This is an advanced feature. You'll need to read the Centreon Engine source code to use this option effectively. These options determine which host process attributes are NOT retained across program restarts. By default, all host and service attributes are retained.
de: Diese Option sollte nur von erfahrenen Nutzern verwendet werden; es muss Einsicht in den Quellcode der Centreon Engine genommen werden, damit diese Option effektiv verwendet werden kann. Diese Option legt fest, welche Hostprozessattribute nach einem Programmneustart NICHT beibehalten werden. Standardmäßig werden alle Host- und Serviceattribute gespeichert.
fr: Ceci est une fonctionnalité avancée. Vous aurez besoin de lire le code source de Centreon Engine pour utiliser cette option efficacement. Ces options permettent de définir quels processus liés à l'hôte (event handler, obsessive handler, flapping, etc.) NE SERONT PAS retenus lors du redémarrage du moteur. Par défaut tous les processus sont récupérés.

source: This is an advanced feature. You'll need to read the Centreon Engine source code to use this option effectively. These options determine which service contact attributes are NOT retained across program restarts. By default, all host and service attributes are retained.
de: Diese Option sollte nur von erfahrenen Nutzern verwendet werden; es muss Einsicht in den Quellcode der Centreon Engine genommen werden, damit diese Option effektiv verwendet werden kann. Diese Optionen legen fest, welche Servicekontaktattribute nach einem Programmneustart NICHT beibehalten werden. Standardmäßig werden alle Host- und Serviceattribute gespeichert.
fr: Ceci est une fonctionnalité avancée. Vous aurez besoin de lire le code source de Centreon Engine pour utiliser cette option efficacement. Ces options permettent de définir quels attributs du contact NE SERONT PAS retenus lors du redémarrage du moteur. Par défaut tous les attributs sont récupérés.

source: This is an advanced feature. You'll need to read the Centreon Engine source code to use this option effectively. These options determine which host contact attributes are NOT retained across program restarts. By default, all host and service attributes are retained.
de: Diese Option sollte nur von erfahrenen Nutzern verwendet werden; es muss Einsicht in den Quellcode der Centreon Engine genommen werden, damit diese Option effektiv verwendet werden kann. Diese Optionen legen fest, welche Hostkontaktattribute nach einem Programmneustart NICHT beibehalten werden. Standardmäßig werden alle Host- und Serviceattribute gespeichert.
fr: Ceci est une fonctionnalité avancée. Vous aurez besoin de lire le code source de Centreon Engine pour utiliser cette option efficacement. Ces options permettent de définir quels processus liés au contact NE SERONT PAS retenus lors du redémarrage du moteur. Par défaut tous les attributs sont récupérés.

source: This option determines whether messages are logged to the syslog facility on your local host.
de: Diese Option legt fest, ob Nachrichten in das lokale syslog-Protokoll geschrieben werden.
fr: Cette option détermine si les messages sont enregistrés dans le fichier syslog de votre hôte local.

source: This option determines whether or not notification messages are logged. If you have a lot of contacts or regular service failures your log file will grow relatively quickly. Use this option to keep contact notifications from being logged.
de: Diese Option legt fest, ob Benachrichtigungen protokolliert werden. Wenn in Ihrer Umgebung eine hohe Anzahl von Benutzern mit Benachrichtigungen existieren oder Services regelmäßig ausfallen, wächst die Logdatei relativ schnell. Diese Option kann genutzt werden, um zu verhindern, dass Nutzerbenachrichtigungen protokolliert werden.
fr: Cette option détermine si oui ou non les messages de notifications sont journalisés. Si vous avez beaucoup de contacts ou qu'il y a beaucoup de services en erreur votre fichier de log grossira relativement rapidement. Utilisez cette option afin de journaliser ces notifications.

source: This option determines whether or not service check retries are logged. Service check retries occur when a service check results in a non-OK state, but you have configured Monitoring Engine to retry the service more than once before responding to the error. Services in this situation are considered to be in "soft" states. Logging service check retries is mostly useful when attempting to debug Monitoring Engine or test out service event handlers.
de: Diese Option legt fest, ob wiederholte Service-Überprüfungen protokolliert werden. Wiederholte Service-Überprüfungen treten auf, wenn eine Service-Überprüfung in einem anderen Status als OK resultiert, die Monitoring Engine jedoch so konfiguriert ist, dass der Service mehrere Male überprüft wird, bevor auf einen Fehler reagiert wird. Services befinden sich in dieser Situation im SOFT-Status. Die Protokollierung von wiederholten Service-Überprüfungen ist zum Debugging der Monitoring Engine bzw. zum Test von Service Event-Handlern nützlich.
fr: Cette option détermine si les tentatives répétées de contrôle d'un service sont journalisées. Ces tentatives ont lieu lorsqu'un service retourne un état différent de OK, mais que vous avez configuré le moteur de supervision pour essayer plus d'une fois avant de considérer cela comme une erreur. Les services dans cette situation sont dits en état soft. La journalisation des tentatives de contrôle permet de déboguer le moteur de supervision ou de tester le gestionnaire d’événements.

source: This option determines whether or not host check retries are logged. Logging host check retries is mostly useful when attempting to debug Monitoring Engine or test out host event handlers.
de: Diese Option legt fest, ob wiederholte Host-Überprüfungen protokolliert werden. Die Protokollierung von wiederholten Host-Überprüfungen ist zum Debugging der Monitoring Engine bzw. zum Test von Host Event-Handlern nützlich.
fr: Cette option détermine si les tentatives répétées de contrôle d'un hôte sont journalisées. La journalisation des tentatives de contrôle permet de déboguer le moteur de supervision ou de tester le gestionnaire d’événements.

source: This option determines whether or not service and host event handlers are logged. Event handlers are optional commands that can be run whenever a service or hosts changes state. Logging event handlers is most useful when debugging Monitoring Engine or first trying out your event handler scripts.
de: Diese Option legt fest, ob Host bzw. Service Event Handler protokolliert werden. Event Handler sind optionale Befehle, die ausgeführt werden können, wenn sich der Status eines Host bzw. Service ändert. Die Protokollierung von Event-Handlern ist zum Debugging der Monitoring Engine bzw. zum initialen Test der Event Handler Skripte nützlich.
fr: Cette option détermine si les gestions d'événements liés aux hôtes ou aux services sont journalisées. Les gestionnaires d'événements sont des commandes optionnelles qu'on peut lancer lors du changement d'état d'un hôte ou d'un service. La journalisation des gestions d'événements permet de déboguer le moteur de supervision ou de tester les scripts de gestion d'événements.

source: This option determines whether or not Monitoring Engine will force all initial host and service states to be logged, even if they result in an OK state. Initial service and host states are normally only logged when there is a problem on the first check. This option is disabled by default. Enabling it is useful if you are using an application that scans the log file to determine long-term state statistics for services and hosts. This option must be enabled to use reporting with Centreon.
fr: Cette variable détermine si le moteur de supervision forcera la journalisation de tous les états initiaux des hôtes et des services, même si leur état est OK. Les états initiaux sont normalement journalisés que s'il y a un problème lors du premier contrôle. Cette option peut se révéler utile si vous utilisez une application tierce qui lit le journal pour en tirer des statistiques à long terme pour les hôtes et services. Cette option doit être activée pour utiliser les rapports avec Centreon.

source: This option determines whether or not Monitoring Engine will log external commands that it receives from the external command file. This option is enabled by default.
de: Diese Option legt fest, ob die Monitoring Engine externe Befehle, die aus der Befehlsdatei stammen, protokolliert. Diese Option ist standardmäßig aktiviert.
fr: Cette option détermine si le moteur de supervision historise les commandes externes qu'il reçoit par le fichier de commandes externes. Cette option est activée par défaut.
