Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: Specify a pager number or an address at a pager gateway here. Any format is possible as long as it is supported by the notification command.
de: Geben Sie eine Pager Nummer oder die Adresse eines Pager Gateways hier an. Das Format ist unerheblich, solange dies durch den Benachrichtigungsbefehl unterstützt wird.
fr: Spécifie ici un numéro de bipeur ou une adresse de passerelle de bipeur. N'importe quel format est possible du moment qu'il est supporté par la commande de notification.

source: Link the contact to the contactgroup(s) the user should belong to. This is an alternative way to specifying the members in contactgroup definitions.
de: Nehmen Sie den Kontakt in die Kontaktgruppe(n) auf, der bzw. denen er angehören soll. Dies ist Alternative zur Angabe von Mitgliedern über die Kontaktgruppendefinition zu sehen.
fr: Lié le contact au(x) groupe(s) de contacts auxquels il devrait appartenir. C'est une manière alternative de spécifier les membres d'un groupe de contacts.

source: Enable notification form for this user. If you select "no" , this contact will never be generated into configuration files.
de: Aktiviert das Benachrichtigungsformular für diesen Benutzer. Wenn Sie "Nein" auswählen, wird dieser Kontakt in den Konfigurationsdateien nicht angelegt.
fr: Active les notifications pour cet utilisateur. Si vous sélectionnez "non", ce contact ne sera jamais généré dans les fichiers de configuration.

source: Define the host states for which notifications can be sent out to this contact. If you specify None as an option, the contact will not receive any type of host notifications.
de: Legen Sie die Host-Status fest, für die Benachrichtigungen an diesen Kontakt gesendet werden sollen. Wenn Sie Keine als auswählen, wird dieser Kontakt keinerlei Host-Benachrichtigungen erhalten.
fr: Définie les états des hôtes pour lesquels des notifications peuvent être envoyées à ce contact. Si vous spécifiez "Aucune" comme option, le contact ne recevra aucun type de notifications pour les hôtes.

source: Specify the time period during which the contact can be notified about host problems or recoveries. You can think of this as an "on call" time for host notifications for the contact.
de: Legen Sie den Zeitraum fest, in dem der Kontakt Benachrichtigungen für Host-Events erhalten soll. Diese Zeit kann als Anwesenheitszeit des Kontakts verstanden werden.
fr: Spécifie la période de temps pendant laquelle le contact peut être notifié à propos de problèmes ou de retours à la normale d'un hôte. Vous pouvez imaginer cela comme une "période d'appel" pour les notifications d'hôte pour ce contact.

source: Define one or more commands used to notify the contact of a host problem or recovery. All notification commands are executed when the contact needs to be notified.
de: Legen Sie einen oder mehrere Befehle fest, die für die Benachrichtigungen an den Kontakt bzgl. Host-Events verwendet werden soll(en). Wenn eine Benachrichtigung gesendet werden soll, werden alle Benachrichtigungsbefehle ausgeführt.
fr: Définie une ou plusieurs commandes utilisées afin de notifier un contact pour les problèmes ou les retours à la normale d'un hôte. Toutes les commandes de notification sont exécutées dès lors qu'un contact a besoin d'être notifié.

source: Define the service states for which notifications can be sent out to this contact. If you specify None as an option, the contact will not receive any type of service notifications.
de: Legen Sie die Service-Status fest, für die Benachrichtigungen an diesen Kontakt gesendet werden sollen. Wenn Sie Keine als auswählen, wird dieser Kontakt keinerlei Service-Benachrichtigungen erhalten.
fr: Définie les états des services pour lesquels des notifications peuvent être envoyées à ce contact. Si l'option "Aucune" est spécifiée, le contact ne recevra aucun type de notifications pour les services.

source: Specify the time period during which the contact can be notified about service problems or recoveries. You can think of this as an "on call" time for service notifications for the contact.
de: Legen Sie den Zeitraum fest, in dem der Kontakt Benachrichtigungen für Service-Events erhalten soll. Diese Zeit kann als Anwesenheitszeit des Kontakts verstanden werden.
fr: Spécifie la période de temps pendant laquelle le contact peut être notifié à propos de problèmes ou de retours à la normale d'un service. Vous pouvez imaginer cela comme une "période d'appel" pour les notifications de service pour ce contact.

source: Define one ore more commands used to notify the contact of a service problem or recovery. All notification commands are executed when the contact needs to be notified.
de: Legen Sie einen oder mehrere Befehle fest, die für die Benachrichtigungen an den Kontakt bzgl. Service-Events verwendet werden soll(en). Wenn eine Benachrichtigung gesendet werden soll, werden alle Benachrichtigungsbefehle ausgeführt.
fr: Définie une ou plusieurs commandes utilisées afin de notifier un contact pour les problèmes ou les retours à la normale d'un service. Toutes les commandes de notification sont exécutées dès lors qu'un contact a besoin d'être notifié.

source: Enter the LDAP Distinguished Name (DN) which identifies this user.
de: Geben Sie den LDAP Distinguished Name (DN) an, der den Nutzer identifiziert.
fr: Entrer le Distinguished Name (DN) LDAP identifiant l'utilisateur.

source: LDAP groups of user, for informative purpose.
de: LDAP-Gruppen des Benutzers. Dient lediglich als Information.
fr: Groupes LDAP de l'utilisateur, à des fins informatives.

source: Specify if the contact is allowed to login into centreon.
de: Legt fest, ob sich der Benutzer an Centreon anmelden kann.
fr: Spécifie si le contact est autorisé à se connecter à Centreon.

source: Define the password for the centreon login here.
de: Passwort für den Centreon-Login angeben.
fr: Défini ici le mot de passe pour se connecter à Centreon.

source: Enter the password again.
de: Passwort erneut angeben.
fr: Entrer le mot de passe de nouveau.

source: Define the default language for the user for the centreon front-end here.
de: Legt die Standardsprache für den Benutzer für das Centreon-Frontend fest.
fr: Défini ici la langue par défaut de l'utilisateur pour l'interface Centreon.

source: Specify if the user has administrative permissions. Administrators are not restricted by access control list (ACL) settings.
de: Legen Sie fest, ob der Benutzer über Administratorberechtigungen verfügt. Administratoren sind nicht durch Einstellungen für Zugriffssteuerungslisten (Access Control List, ACL) eingeschränkt.
fr: Spécifie si l'utilisateur à les droits d'administrateurs. Les administrateurs ne sont pas restreints par les listes de contrôle d'accès (ACL).

source: Token used for autologin. Refer to the Centreon documentation to know more about its usage.
de: Token, der für den Autologin genutzt wird. Nutzen Sie die Centreon-Dokumentation um weitere Details zur Verwendung zu erhalten.
fr: Jeton utilisé pour la connexion automatique à l'interface. Se référer à la documentation Centreon pour plus d'information.

source: Specify the source for user credentials. Choose between Centreon and LDAP, whereas LDAP is only available when configured in Administration Options.
de: Geben Sie die Quelle der Anmeldedaten des Nutzers an. Sie können zwischen Centreon und LDAP wählen. LDAP ist jedoch nur verfügbar, wenn die entsprechenden Einstellungen in den Administrationsoptionen konfiguriert wurden.
fr: Spécifie la source pour les identifiants de connexion. Choisissez entre Centreon et LDAP, bien que LDAP ne soit disponible uniquement après l'avoir configuré dans le menu "Administration > Paramètres".

source: Select the timezone, in which the user resides, from the list. The timezones are listed as time difference to Greenwich Mean Time (GMT) in hours.
de: Wählen Sie die Zeitzone aus, in der sich der Benutzer befindet. Die Zeitzonen sind als Zeitdifferenz im Vergleich zur Greenwich Mean Time (GMT) in Stunden dargestellt.
fr: Sélectionner dans la liste le fuseau horaire, dans lequel vit l'utilisateur. Les fuseaux horaires sont listés par heure de différence par rapport au méridien de Greenwich (GMT).

source: Allow this user to access to Centreon Rest API with its account.
de: Erlaubt diesem Benutzer den Zugriff auf die Centreon Rest API mit deren Account.
fr: Autoriser ce compte à accéder à l'API REST Centreon.

source: Addresses 1-6 are optional and used to define additional "addresses" for the contact. These addresses can be anything - cell phone numbers, instant messaging addresses, etc. - the format must be supported by your notification plugins.
de: Die Adressen 1-6 sind optional und können genutzt werden, um zusätzliche Kontaktinformationen für diesen Kontakt zu hinterlegen. Diese Felder können für alle möglichen Informationen genutzt werden: Handynummern, Messenger-Adresse, etc. Lediglich das Format muss von Ihren Benachrichtigungsplugins unterstützt werden.
fr: Les adresses 1-6 sont optionnelles et utilisées afin de définir des "adresses" supplémentaires pour le contact. Ces adresses peuvent être de n'importe quel type - numéro de téléphone portable, adresse de messagerie instantanée, etc. - Le format doit être supporté par vos plugins de notification.

source: This directive is used to determine whether or not the contact will receive notifications about host problems and recoveries.
de: Diese Richtlinie wird verwendet um festzulegen, ob der Kontakt Benachrichtigungen zu Host-Events erhält.
fr: Cette directive est utilisée afin de déterminer si oui ou non le contact recevra des notifications à propos des problèmes ou des retours à la normale d'un hôte.

source: This directive is used to determine whether or not the contact will receive notifications about service problems and recoveries.
de: Diese Richtlinie wird verwendet um festzulegen, ob der Kontakt Benachrichtigungen zu Service-Events erhält.
fr: Cette directive est utilisée afin de déterminer si oui ou non le contact recevra des notifications à propos des problèmes ou des retours à la normale d'un service.

source: This directive is used to determine whether or not the contact can submit external commands to monitoring engine from the CGIs.
de: Diese Richtlinie wird verwendet um festzulegen, ob der Kontakt externe Befehle an die Monitoring Engine von den CGIs aus senden kann.
fr: Cette directive est utilisée pour déterminer si le contact peut soumettre des commandes externes au moteur de supervision depuis les CGIs.

source: This directive is used to determine whether or not status-related information about the contact is retained across program restarts. This is only useful if you have enabled state retention using the retain_state_information directive.
de: Diese Richtlinie wird verwendet um festzulegen, ob statusbezogene Informationen des Kontakts über Programmneustarts hinaus aufbewahrt werden. Diese Option wirkt sich nur aus, wenn die Option retain_state_information aktiviert ist.
fr: Cette variable est utilisée pour déterminer si les informations différentes des états du contact sont conservées après redémarrage du programme. C'est seulement utile si vous avez activé la rétention d'états en utilisant la variable retain_state_information.

source: This directive is used to determine whether or not non-status information about the contact is retained across program restarts. This is only useful if you have enabled state retention using the retain_state_information directive.
de: Diese Richtlinie wird verwendet um festzulegen, ob nicht statusbezogene Informationen des Kontakts über Programmneustarts hinaus aufbewahrt werden. Diese Option wirkt sich nur aus, wenn die Option retain_state_information aktiviert ist.
fr: Cette variable est utilisée pour déterminer si les informations différentes des états du contact sont conservées après redémarrage du programme. C'est seulement utile si vous avez activé la rétention d'états en utilisant la variable retain_state_information.

source: ACL groups of user.
de: Zugriffssteuerungslistengruppen des Benutzers.
fr: Groupe d'utilisateurs utilisé pour la configuration des ACL.

source: Enter a short name for the escalation to identify it.
de: Legen Sie einen Kurznamen für die Eskalation fest.
fr: Entrer un nom court afin d'identifier l'escalade.

source: The alias is used to define a longer name or description for the escalation.
de: Der Alias ist ein längerer Name bzw. eine Beschreibung für die Eskalation.
fr: L'alias est utilisé afin de définir un long nom ou une description pour l'escalade.

source: Enter a number that identifies the first notification for which this escalation is effective. For instance, if you set this value to 3, this escalation will only be used if the host is down or unreachable long enough for a third notification to go out.
de: Geben Sie eine Zahl an, die die erste Benachrichtigung identifiziert, für die diese Eskalation gelten soll. Wenn Sie diesen Wert beispielsweise auf 3 setzen, wird diese Eskalation nur genutzt, wenn der Host lang genug down bzw. nicht erreichbar ist, dass eine dritte Benachrichtigung gesendet wird.
fr: Entrer un nombre qui identifie la première notification pour laquelle l'escalade est effective. Pour le moment, si vous fixez cette valeur à 3, l'escalade sera utilisée uniquement si l'hôte est down ou injoignable assez longtemps pour que la troisième notification soit envoyée.

source: Enter a number that identifies the last notification for which this escalation is effective. For instance, if you set this value to 5, this escalation will not be used if more than five notifications are sent out for the host. Setting this value to 0 means to keep using this escalation entry forever (no matter how many notifications go out).
de: Geben Sie eine Zahl an, die die letzte Benachrichtigung identifiziert, für die diese Eskalation gelten soll. Wenn Sie diesen Wert beispielsweise auf 5 setzen, wird diese Eskalation nicht mehr genutzt, nachdem eine fünfte Benachrichtigung gesendet wurde. Wenn dieser Wert auf 0 gesetzt wird, wird diese Eskalation für alle Benachrichtigungen genutzt, unabhängig davon wie viele gesendet werden.
fr: Entrer un nombre qui identifie la dernière notification pour laquelle l'escalade est effective. Pour le moment, si vous fixez cette valeur à 5, l'escalade ne sera pas utilisée si plus de cinq notifications sont envoyées pour cet hôte. Fixer cette valeur à 0 signifie de toujours garder l'utilisation de l'escalade (peu importe le nombre de notifications envoyées).

source: Select the interval at which notifications should be made while this escalation is valid. If you specify a value of 0 for the interval, Monitoring Engine will send the first notification when this escalation definition is valid, but will then prevent any more problem notifications from being sent out. Notifications are sent out again until the host or service recovers. This is useful if you want to stop having notifications sent out after a certain amount of time. Note: If multiple escalation entries overlap for one or more notification ranges, the smallest notification interval from all escalation entries is used.
de: Legen Sie das Intervall fest, in dem Benachrichtigungen gesendet werden sollen, solange diese Eskalation gültig ist. Wenn Sie einen Wert von 0 angeben, wird im Gültigkeitszeitraum der Eskalationsdefinition von der Monitoring Engine die erste Benachrichtigung gesendet. Nachfolgend wird jedoch verhindert, dass weitere Problembenachrichtigungen gesendet werden. Benachrichtigungen werden erneut gesendet, bis der Host oder Service wieder in einem verfügbar- bzw. OK-Status ist. Diese Option ist nützlich, wenn nach einer bestimmten Zeit keine Benachrichtigungen mehr versendet werden sollen. Hinweis: Wenn sich mehrere Eskalationseinträge für einen oder mehrere Benachrichtigungszeiträume überschneiden, wird das kleinste Benachrichtigungsintervall verwendet.
fr: Sélectionnez la fréquence à laquelle les notifications doivent être faites quand cette escalade est valide. Si vous spécifiez une valeur de 0 pour cet intervalle, le moteur de vérification enverra la première notification quand la définition d'escalade sera valide, mais arrêtera ensuite l'envoi des autres notifications. Les notifications sont envoyées jusqu'à ce que l'hôte ou le service soit rétablit. Ceci est utile si vous souhaitez arrêter l'envoi des notifications après un certain laps de temps. Remarque: Si de multiples entrées d'escalade se chevauchent pour une ou plusieurs plages de notifications, le plus petit des intervalles de notification sera utilisé.

source: Select the time period during which this escalation is valid. If no time period is specified, the escalation is considered to be valid during all times.
de: Legen Sie den Zeitraum fest, in dem diese Eskalation gültig ist. Wenn kein Zeitraum angegeben wird, wird angenommen, dass diese Eskalation immer gültig ist.
fr: Sélectionner la période de temps durant laquelle l'escalade est valide. Si aucune période n'est spécifiée, l'escalade est considérée comme valide tout le temps.

source: Define the criteria that determine when the host escalation is used. The escalation is used only if the host is in one of the states specified in these options. If no options are specified in a host escalation, the escalation is considered to be valid during all host states.
de: Legen Sie die Kriterien fest, die bestimmen, wann diese Host-Eskalation genutzt wird. Die Eskalation wird nur dann genutzt, wenn sich der Host in einem der in den Optionen festgelegten Status befindet. Wenn keine Optionen in einer Host-Eskalation festgelegt werden, wird angenommen, dass die Eskalation während allen Host-Status gültig ist.
fr: Définit le critère qui détermine quand l'escalade d'hôte est utilisée. L'escalade est utilisée seulement si l'hôte est dans un des états spécifié dans ces options. Si aucune option n'est spécifiée dans l'escalade de l'hôte, l'escalade est considérée comme valide pour tous les états de l'hôte.

source: Define the criteria that determine when the service escalation is used. The escalation is used only if the service is in one of the states specified in these options. If no options are specified in a service escalation, the escalation is considered to be valid during all service states.
de: Legen Sie die Kriterien fest, die bestimmen, wann diese Service-Eskalation genutzt wird. Die Eskalation wird nur dann genutzt, wenn sich der Service in einem der in den Optionen festgelegten Status befindet. Wenn keine Optionen in einer Service-Eskalation festgelegt werden, wird angenommen, dass die Eskalation während allen Service-Status gültig ist.
fr: Définit le critère qui détermine quand l'escalade de service est utilisée. L'escalade est utilisée seulement si le service est dans un des états spécifié dans ces options. Si aucune option n'est spécifiée dans l'escalade de service, l'escalade est considérée comme valide pour tous les états de du service.

source: Select the contact group(s) that should be notified when the notification is escalated. You must specify at least one contact group in each escalation definition.
de: Legen Sie die Kontaktgruppe(n) fest, die benachrichtigt werden soll(en), wenn eine Benachrichtigung eskaliert ist. Pro Eskalationsdefinition muss mindestens eine Kontaktgruppe angegeben werden.
fr: Sélectionner le(s) groupe(s) de contacts qui devraient être notifiés dès lors que la notification est escaladée. Vous devez spécifier au moins un groupe de contacts dans la définition de chaque escalade.

source: Select the host(s) that the escalation should apply to or is associated with.
de: Wählen Sie den/die Host(s) aus, für den/die diese Eskalation gültig sein soll bzw. mit dem/denen sie verknüpft ist.
fr: Sélectionner le(s) hôte(s) pour lesquels l'escalade devrait être appliquée ou associée avec.

source: Select the service(s) the escalation should apply to or is associated with.
de: Wählen Sie den/die Service(s) aus, für den/die diese Eskalation gültig sein soll bzw. mit dem/denen sie verknüpft ist.
fr: Sélectionner le(s) service(s) pour lesquels l'escalade devrait être appliquée ou associée avec.

source: Select the hostgroup(s) that the escalation should apply to. The escalation will apply to all hosts that are members of the specified hostgroup(s).
de: Wählen Sie die Hostgruppe(n) aus, für die diese Eskalation gültig sein soll. Diese Eskalation wird für alle Hosts, die Mitglied in dieser/diesen Hostgruppe(n) sind, übernommen.
fr: Sélectionner le(s) groupe(s) d'hôtes pour lesquels l'escalade devrait être appliquée. L'escalade sera appliquée à l'ensemble des hôtes membre du groupe d'hôtes spécifié.

source: Select the service group(s) the escalation should apply to or is associated with. The escalation will apply to all services that are members of the specified service group(s).
de: Wählen Sie die Servicegruppe(n) aus, für die diese Eskalation gültig sein soll oder mit der/denen sie verknüpft ist. Diese Eskalation wird für alle Services, die Mitglied in dieser/diesen Servicegruppe(n) sind, übernommen.
fr: Sélectionner le(s) groupe(s) de services pour lesquels l'escalade devrait être appliquée. L'escalade sera appliquée à l'ensemble des services membre du groupe de services spécifié.

source: Select the meta service(s) the escalation should apply to or is associated with.
de: Wählen Sie den/die Meta-Service(s) aus, für den/die diese Eskalation gültig sein soll bzw. mit dem/denen sie verknüpft ist.
fr: Sélectionner le(s) méta service(s) pour lesquels l'escalade devrait être appliquée ou associée avec.

source: Select contacts that should be notified whenever there are problems (or recoveries) with this host. Useful if you want notifications to go to just a few people and don't want to configure contact groups. You must specify at least one contact or contact group in each host escalation definition.
de: Legen Sie Kontakte fest, die benachrichtigt werden sollen, wenn Probleme oder andere Events bei diesem Host auftreten. Diese Liste ist nützlich wenn nur einige wenige Personen benachrichtigt werden sollen und dafür keine Kontaktgruppen genutzt werden sollen. In jeder Hosteskalationsdefinition muss mindestens ein Kontakt bzw. eine Kontaktgruppe angegeben werden.
fr: Sélectionner les utilisateurs qui pourront être notifié quand il y a des problèmes (ou retour à la normal) sur cet hôte. Cette option est utile si vous souhaitez notifier quelques utilisateurs sans configurer des groupes d'utilisateurs. Vous devez spécifier au moins un utilisateur ou un groupe d'utilisateurs pour chaque escalade d’hôte.

source: Define a short name for the service group here. The short name will be used to display the service group in monitoring, views and reporting.
de: Legen Sie einen Kurznamen für diese Servicegruppe fest. Dieser Kurzname wird dazu genutzt, die Servicegruppe in der Überwachung, in Ansichten und im Reporting anzuzeigen.
fr: Définit ici un nom court pour le groupe de services. Ce nom sera utilisé pour afficher le groupe de services dans supervision, vues et rapports.

source: Define a longer name or description for the service group here.
de: Legen Sie einen längeren Name bzw. eine Beschreibung für diese Servicegruppe fest.
fr: Définit ici un nom long ou une description pour le groupe de services.

source: This is a list of host-bound services that should be included in this service group.
de: Dies ist eine Liste der hostgebundenen Service, die Mitglied in dieser Servicegruppe sein sollen.
fr: C'est une liste de services liés aux hôtes et qui devraient être inclus dans ce groupe de services.
