Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: Define the number of "time units" to wait before sending out the first problem notification when this service enters a non-OK state. With the default time unit of 60s, this number will mean multiples of 1 minute. If you set this value to 0, monitoring engine will start sending out notifications immediately.
de: Geben Sie die Anzahl an Zeitintervallen an, die gewartet werden, bevor eine Problembenachrichtigung gesendet wird, sobald der Service einen anderen Status als OK annimmt. Mit dem Standardwert von 60s für ein Zeitintervall, repräsentiert dieser Wert Minuten. Ein Wert von 0 führt dazu, dass Benachrichtigungen sofort gesendet werden.
fr: Définit le nombre "d'unités de temps" à attendre avant l'envoi de la notification du premier problème lorsque ce service entre dans un état non-OK. Avec l'unité de temps par défaut de 60s, ce nombre représente un multiple de 1 minute. Si la valeur spécifiée est 0, le moteur de supervision commencera à envoyer des notifications immédiatement.

source: Define the number of "time units" to wait before sending out the recovery notification when this service enters an OK state. With the default time unit of 60s, this number will mean multiples of 1 minute. If you set this value to 0, monitoring engine will start sending out notifications immediately.
de: Geben Sie die Anzahl an Zeitintervallen fest, die gewartet werden, bevor eine Erholungsbenachrichtigung gesendet wird, sobald der Service den OK Status annimmt. Mit dem Standardwert von 60s für ein Zeitintervall, repräsentiert dieser Wert Minuten. Ein Wert von 0 führt dazu, dass Benachrichtigungen sofort gesendet werden.
fr: Définit le nombre "d'unités de temps" à attendre avant l'envoi de la notification du rétablissement lorsque ce service entre dans un état OK. Avec l'unité de temps par défaut de 60s, ce nombre représente un multiple de 1 minute. Si la valeur spécifiée est 0, le moteur de supervision commencera à envoyer des notifications immédiatement.

source: The command name is used to identify and display this command in contact, host and service definitions.
de: Der Befehlsname wird verwendet, um diesen Befehl in Kontakt-, Host- und Servicedefinitionen anzuzeigen.
fr: Le nom de la commande est utilisé afin d'identifier et d'afficher la commande dans les définitions d'un contact, d'un hôte et d'un service.

source: The command line specifies the real command line which is actually executed by Monitoring engine. Before execution, all valid macros are replaced with their respective values. To use the dollar sign ($) on the command line, you have to escape it with another dollar sign ($$). A semicolon (;) is used as separator for config file comments and must be worked around by setting a $USER$ macro to a semicolon and then referencing it here in place of the semicolon. If you want to pass arguments to commands during runtime, you can use $ARGn$ macros in the command line.
de: Diese Option legt den Befehl fest, der durch die Monitoring Engine ausgeführt wird. Vor der Ausführung werden alle validen Makros mit den entsprechenden Werten ersetzt. Um im Befehl ein Dollarzeichen ($) verwenden zu können, muss dieses mit einem weiteren Dollarzeichen escaped werden ($$). Ein Semikolon (;) wird als Separator für Konfigurationsdateikommentare genutzt. Um im Befehl ein Semikolon zu verwenden, muss ein $USER$-Makro mit einem Semikolon befüllt werden, und dieses Makro statt dem Semikolon genutzt werden. Wenn bei der Ausführung Parameter mitgegeben werden sollen, können dafür $ARGn$-Makros genutzt werden.
fr: La ligne de commande décrit la commande qui sera exécuté par le moteur de supervision. Avant exécution de cette commande par l’ordonnanceur, les macros correctement définies seront remplacées par leur valeur associée. Pour utiliser le symbole ‘$’ en tant que caractère, ce dernier doit être protégé par un autre symbole ‘$’ (‘$$’). Un point-virgule (‘ ;’) est un caractère spécial servant de séparateur dans la configuration de l’ordonnanceur. Pour utiliser un point-virgule, une macro de type $USER$ doit être créée et contenir ce caractère. Il est possible d’utiliser des macros de type $ARGn$, $USERn$ ou des macros personnalisées dans la ligne de commande.

source: If your command requires shell features like pipes, redirections, globbing etc. check this box. If you are using Monitoring Engine this option cannot be disabled. Note that commands that require shell are slowing down the poller server.
de: Wenn Ihr Befehl Shell-Features wie Pipes, Umleitungen, Globbing, etc. benötigt, sollte diese Option aktiviert werden. Wenn Sie die Monitoring Engine verwenden, kann diese Option nicht deaktiviert werden. Hinweis: Befehle die die Shell benötigen, verlangsamen den Poller-Server.
fr: Si votre commande nécessite les fonctions du shell comme les pipes, les redirections, jokers, etc., cochez cette case. Si vous utilisez Nagios cette option ne peut pas être désactivée. Notez que les commandes qui nécessitent le shell ralentissent le serveur de collecte.

source: The argument example defined here will be displayed together with the command selection and help in providing a hint of how to parametrize the command for execution.
de: Das hier definierte Parameterbeispiel wird zusammen mit der Befehlsauswahl angezeigt und hilft dabei, wie ein Befehl korrekt parametrisiert wird.
fr: L'exemple d'argument défini ici sera affiché lors de la sélection de commande et fournit de l'aide sur les options à définir pour l'exécution de la commande.

source: Define the type of the command. The type will be used to show the command only in the relevant sections.
de: Legen Sie den Typ des Befehls fest. Dieser Typ wird dazu verwendet, den Befehl nur in relevanten Abschnitten anzuzeigen.
fr: Définie le type de la commande. Le type sera utilisé afin d'afficher la commande uniquement dans les sections appropriées.

source: The optional definition of a graph template will be used as default graph template, when no other is specified.
de: Die optionale Definition eines Graphentemplates wird als Standard genutzt, wenn kein explizites angegeben ist.
fr: La définition optionnelle d'un modèle de graphique sera utilisée comme modèle de graphique par défaut, quand aucun autre ne sera spécifié.

source: The argument description provided here will be displayed instead of the technical names like ARGn.
de: Die hier angegebene Parameterbeschreibung wird statt technischen Begriffen wie ARGn angezeigt.
fr: La description de l'argument fournit ici sera affichée à la place du nom technique tel que ARGn.

source: The macro description provided here will be displayed instead of the technical name.
de: Die hier angegebene Makrobeschreibung wird statt dem technischen Namen angezeigt.
fr: La description de la macro renseignée ici sera affichée à la place de son nom technique.

source: Comments regarding the command.
de: Kommentare zu diesem Befehl.
fr: Commentaires concernant la commande

source: Connectors are run in background and execute specific commands without the need to execute a binary, thus enhancing performance. This feature is available in Centreon Engine (>= 1.3)
de: Diese Option wirkt sich nur mit Centreon Engine Version 1.3 oder höher aus. Konnektoren werden im Hintergrund ausgeführt und führen spezifische Befehle ohne die Notwendigkeit einer Ausführdatei aus und verbessern dadurch die Performance.
fr: Les connecteurs sont lancés en arrière-plan et exécutent des commandes spécifiques sans faire appel à un binaire, cela améliore les performances. Cette fonctionnalité est disponible avec Centreon Engine (>= 1.3)

source: Name used for identification of this meta service.
de: Name, der diesen Meta-Service identifiziert.
fr: Nom utilisé pour identifier ce méta service.

source: Optional format string used for displaying the status of this meta service. The variable '%d' may be used and will be replaced by the calculated value.
de: Optionale Formatierungszeichenfolge, die für die Anzeige des Status diesen Meta-Services verwendet wird. Die Variable '%d' kann genutzt werden und wird durch den berechneten Wert ersetzt.
fr: Chaîne de caractère optionnelle utilisée pour afficher le statut de ce méta service. La variable '%d' peut être utilisée et sera remplacée par la valeur calculée.

source: Absolute value for warning level (low threshold).
de: Absoluter Wert für die Warnungsebene (Niedriger Grenzwert).
fr: Valeur absolue pour le niveau warning (seuil bas).

source: Absolute value for critical level (low threshold).
de: Absoluter Wert für die kritische Ebene (Niedriger Grenzwert).
fr: Valeur absolue pour le niveau critique (seuil bas).

source: Function to be applied to calculate the meta service status.
de: Funktion, die zur Berechnung des Meta-Service-Status angewendet werden soll.
fr: Fonction à appliquer afin de calculer le statut du méta service.

source: Data source type of the meta service.
de: Datenquellentyp des Meta-Service.
fr: Source de données utilisées pour le méta service

source: Selection mode for services to be considered for this meta service. In service list mode, mark selected services in the options on meta service list. In SQL matching mode, specify a search string to be used in an SQL query.
de: Auswahlmodus für Services, die für diesen Meta-Service in Betracht gezogen werden sollen. Im Service-Listenmodus können ausgewählte Services in der Meta-Serviceliste ausgewählt werden. Im SQL-Abgleichsmodus muss ein Suchzeichenfolge angegeben werden, der in einer SQL-Abfrage verwendet werden soll.
fr: Mode de sélection des services à lier au méta-service. La première option permet de sélectionner manuellement les services tandis que la deuxième intégrera tous les services sélectionnés par la requête SQL (définir la chaine de recherche SQL).

source: Search string to be used in a SQL LIKE query for service selection.
de: Suchzeichenfolge, die in einer SQL LIKE-Abfrage für die Serviceauswahl verwendet werden soll.
fr: Chaîne de recherche à utiliser dans la requête de type SQL LIKE pour la sélection d'un service.

source: Select the metric to measure for meta service status.
de: Wählen Sie die Metrike aus, die für den Meta-Service-Status gemessen werden soll.
fr: Sélectionner la métrique à mesurer pour le statut du méta-service.

source: Specify the time period during which the meta service status is measured.
de: Geben Sie den Zeitraum an, in dem der Meta-Service-Status gemessen wird.
fr: Spécifie la période de temps pendant laquelle le statut du méta service est mesuré.

source: Define the number of times that Centreon will retry the service check command if it returns any state other than an OK state. Setting this value to 1 will cause Centreon to generate an alert without retrying the service check again.
de: Definieren Sie, wie oft Centreon den Service-Überprüfungsbefehl wiederholt, wenn er einen anderen Status als OK zurückgibt. Wenn Sie diesen Wert auf 1 setzen, generiert Centreon ein Alert, ohne die Service-Überprüfung erneut auszuführen.
fr: Définit le nombre de fois que Centreon va réessayer la commande de contrôle de service si elle renvoie un état différent de OK. Paramétrer cette valeur à 1 et Centreon va générer une alerte sans réessayer de vérifier le service à nouveau.

source: Define the number of minutes between regularly scheduled checks of the meta service. "Regular" checks are those that occur when the service is in an OK state or when the service is in a non-OK state, but has already been rechecked max check attempts number of times.
de: Definieren Sie die Zeit in Minuten zwischen regulär angesetzten Meta-Service-Überprüfungen. Mit "regulären" Überprüfungen sind die gemeint, die ausgeführt werden, wenn sich der Host in einem OK-Status bzw. in einem Status anders als OK befindet, jedoch bereits die maximale Anzahl an wiederholten Überprüfungen ausgeführt wurden.
fr: Définit le nombre de minutes entre les vérifications régulières du méta service. Les contrôles «réguliers» sont ceux qui se produisent lorsque le service est dans un état OK ou lorsque le service est dans un état non-OK, mais il a déjà été revérifié au nombre maximum de tentatives.

source: Define the number of minutes to wait before scheduling a re-check for this service after a non-OK state was detected. Once the service has been retried max check attempts times without a change in its status, it will revert to being scheduled at its "normal" check interval rate.
de: Definieren Sie die Zeit in Minuten die gewartet wird, bevor eine erneute Überprüfung ausgeführt wird, wenn ein Status anders als OK erkannt wurde. Sobald der Service max_check_attempts Mal erneut geprüft wurde, ohne dass sich das Ergebnis verändert, wird wieder auf das normale Überprüfungsintervall gewechselt.
fr: Définit le nombre de minutes à attendre avant de programmer une re-vérification pour ce service après qu'un état non-OK ait été détecté. Une fois que le service a été revérifié au nombre maximum de tentatives sans un changement dans son statut, il reviendra à être programmé à son intervalle "normal" de vérification.

source: Specify whether or not notifications for this meta service are enabled.
de: Geben Sie an, ob Benachrichtigungen für diesen Meta-Service aktiviert sind.
fr: Spécifie si oui ou non les notifications pour ce méta service sont activées.

source: This is a list of contact groups that should be notified whenever there are problems (or recoveries) with this service.
de: Dies ist eine Liste von Kontaktgruppen, die benachrichtigt werden sollen, wenn Probleme oder andere Events bei diesem Service auftreten.
fr: C'est une liste de groupe de contacts qui devraient être notifiés dès lors qu'il y a des problèmes (ou des retours à la normale) avec ce service.

source: Define the number of minutes to wait before re-notifying a contact that this service is still in a non-OK condition. A value of 0 disables re-notifications of contacts about problems for this service - only one problem notification will be sent out.
de: Geben Sie die Zeit in Minuten zwischen wiederholten Benachrichtigungen an, wenn dieser Service sich fortwährend in einem Status anders als OK befindet. Ein Wert von 0 deaktiviert wiederholte Benachrichtigungen für diesen Host - es wird nur eine Problembenachrichtigung gesendet.
fr: Définit l'intervalle en minutes avant de notifier à nouveau un contact dans le cas où le service est toujours dans un état non-OK. La valeur 0 désactive l'envoi de plusieurs notifications - une unique notification sera envoyée concernant le problème.

source: Define the states of the service for which notifications should be sent out. If you do not specify any notification options, Centreon will assume that you want notifications to be sent out for all possible states.
de: Legen Sie die Statuswerte des Services fest, für die Benachrichtigungen gesendet werden sollen. Wenn keine Benachrichtigungsoptionen angegeben werden, wird angenommen, dass für alle Statuswerte Benachrichtigungen gesendet werden sollen.
fr: Définit les états du service pour lesquels des notifications doivent être envoyées. Si vous ne spécifiez aucun de ces options de notifications, Centreon présume que vous souhaitez l'envoi de notifications pour tous les états.

source: The alias is a longer name or description for the vendor/manufacturer.
de: Der Alias ist ein längerer Name bzw. eine Beschreibung für den Hersteller.
fr: L'alias est un nom long ou une description pour le fournisseur/fabricant.

source: The name is used to identify the vendor/manufacturer with a short name.
de: Der Name wird dazu verwendet, den Hersteller anhand eines Kurznamens zu identifizieren.
fr: Le nom est utilisé afin d'identifier le fournisseur/fabricant avec un nom court.

source: Use this for an optional description or comments about the vendor/manufacturer.
de: In diesem Feld kann eine optionale Beschreibung bzw. Kommentare zu dem Hersteller angegeben werden.
fr: Utilisez ceci comme une description ou un commentaire optionnel à propos du fournisseur/fabricant.

source: Select the service templates this category should be linked to. Every service based on the selected templates will be automatically linked with this category.
de: Wählen Sie das Service-Template, mit dem diese Kategorie verbunden werden soll. Jeder Service der auf Basis diesen Templates erstellt wird, wird automatisch mit dieser Kategorie verbunden.
fr: Sélectionne les modèles de service auxquels cette catégorie devrait être liée. Chaque service basé sur les modèles sélectionnés sera automatiquement lié à cette catégorie.

source: This directive is used to define a short name used to identify the host group.
de: Diese Richtlinie legt den Kurznamen zur Identifikation der Hostgruppe fest.
fr: Cette directive est utilisée afin de définir un nom court utilisé pour identifier le groupe d'hôtes.

source: This directive is used to define is a longer name or description used to identify the host group. It is provided in order to allow you to more easily identify a particular host group.
fr: Cette directive est utilisée pour définir un nom long ou une description identifiant le groupe d'hôtes. Il est prévu pour vous permettre d'identifier plus facilement un groupe d'hôte en particulier.

source: This is a list of hosts that should be included in this group. This directive may be used as an alternative to (or in addition to) the hostgroups directive in host definitions.
de: Dies ist eine Liste der Hosts, die Mitglied in dieser Gruppe sind. Diese Richtlinie kann als Alternative bzw. in Kombination mit der Angabe der Hostgruppen in der Hostdefinition verwendet werden.
fr: C'est la liste des hôtes qui devraient être inclus dans ce groupe. Cette directive peut être utilisée comme une alternative de (ou en supplément de) la directive des groupes d'hôte dans la définition des hôtes.

source: This optional directive can be used to include hosts from other host groups in this host group.
de: Diese optionale Richtlinie kann genutzt werden, um Hosts einer anderen Hostgruppe in dieser einzuschließen.
fr: Cette directive optionnelle peut être utilisée afin d'inclure des hôtes depuis d'autres groupes d'hôtes dans ce groupe d'hôtes.

source: Define an optional string of notes pertaining to the host group.
de: Optionale Notizen zur Hostgruppe.
fr: Définit une chaine optionnelle pertinente pour le groupe d'hôtes.

source: Define an optional URL that can be used to provide more information about the host group. Any valid URL can be used. This can be very useful if you want to make detailed information on the host group, emergency contact methods, etc. available to other support staff.
de: Geben Sie eine optionale URL an, unter der weitere Informationen zu der Hostgruppe verfügbar sind. Jede valide URL kann genutzt werden. Diese Option ist nützlich, um detaillierte Informationen zu der Hostgruppe oder Notfallkontakten für andere Supportmitarbeiter zur Verfügung zu stellen.
fr: Définie une URL optionnelle qui peut être utilisé pour fournir plus d'informations à propos du groupe d'hôtes. N'importe quelle URL valide peut être utilisée. Cela peut être très utile si vous souhaitez donner des informations détaillées sur le groupe d'hôtes, les méthodes de contact d'urgence, etc. Disponibles pour les autres personnes de l'équipe support.

source: Define an optional URL that can be used to provide more actions to be performed on the host group. You will see the link to the action URL in the host group details.
de: Geben Sie eine optionale URL an, unter der weitere Aktionen für diese Hostgruppe verfügbar sind. Die Link zur Aktionen-URL wird in den Hostgruppen-Details angezeigt.
fr: Définit une URL optionnelle qui peut être utilisée pour fournir plus d'actions à exécuter sur le groupe d'hôtes. Vous verrez le lien vers l'URL d'action dans les détails du groupe d'hôtes.

source: Define the image that should be associated with this host group here. This image will be displayed in the various places. The image will look best if it is 40x40 pixels in size.
de: Definieren Sie hier das Bild, das dieser Hostgruppe zugeordnet werden soll. Dieses Bild wird an den verschiedenen Stellen angezeigt. Das Bild sieht am besten aus, wenn es 40x40 Pixel groß ist.
fr: Définit ici l'image qui devrait être associée avec le groupe d'hôtes. Cette image sera affichée à différents endroits. L'image aura un meilleur rendu si elle fait une taille de 40x40 pixels.

source: Define an image that should be associated with this host group in the statusmap CGI in monitoring engine. You can choose a JPEG, PNG, and GIF image. The GD2 image format is preferred, as other image formats must be converted first when the statusmap image is generated. The image will look best if it is 40x40 pixels in size.
de: Definieren Sie hier das Bild, das dieser Hostgruppe in der CGI-Statusmap in der Monitoring Engine zugeordnet werden soll. Verfügbare Formate sind JPEG, PNG und GIF. Das GD2-Bildformat ist präferiert. Andere Formate müssen bei Erzeugung der Statusmap erst konvertiert werden. Das Bild sieht am besten aus, wenn es 40x40 Pixel groß ist.
fr: Définit une image qui devrait être associée au groupe d'hôtes dans le CGI statusmap dans le moteur de supervision. Vous pouvez choisir une image au format JPEG, PNG et GIF. Le format GD2 est préféré, car les autres formats d'image devront être convertis avant que l'image statusmap soit générée. L'image aura un meilleur rendu si elle a une taille de 40x40 pixels.

source: RRD retention duration of all the services that are in this host group. If service is in multiple host groups, the highest retention value will be used.
de: RRD-Aufbewahrungsdauer aller Services, die sich in dieser Hostgruppe befinden. Wenn sich der Service in mehreren Hostgruppen befindet, wird die höchste Aufbewahrungsdauer verwendet.
fr: Durée de rétention des données dans les fichiers RRD pour tous les services liés au groupe d'hôte. Dans le cas où un service appartient à plusieurs groupes d'hôtes, la durée de rétention la plus haute sera appliquée.

source: Comments on this host group.
de: Kommentare zu dieser Host-Gruppe.
fr: Commentaires du groupe d'hôtes.

source: Whether this host group is enabled.
de: Legt fest, ob die Host-Gruppe aktiviert ist.
fr: Disponibilité du groupe d'hôtes.

source: The full name is used to identify the contact in contact group definitions and in notifications.
de: Der vollständige Name wird verwendet, um den Kontakt in Kontaktgruppendefinitionen und Benachrichtigungen anzuzeigen.
fr: Le nom complet est utilisé afin d'identifier le contact dans la définition du groupe de contacts et dans les notifications.

source: The alias is a short name used as login name in Centreon.
de: Der Alias ist eine Abkürzung und wird als Loginname in Centreon verwendet.
fr: L'alias est le nom utilisé en tant que login pour Centreon.

source: Specify the primary email address for the contact here. Additional (email) addresses can be defined under additional information of the contact. Depending on the notification command used, the email address can be used to send out email notifications.
de: Geben Sie die primäre E-Mail-Adresse des Kontakts hier an. Zusätzliche (E-Mail) Adressen können unter zusätzlichen Informationen des Kontakts angegeben werden. In Abhängigkeit des genutzten Benachrichtigungsbefehls kann die E-Mail-Adresse für E-Mail-Benachrichtigungen genutzt werden.
fr: Spécifie ici la première adresse mail du contact. D'autres adresses peuvent être définies dans l'onglet informations additionnelles du contact. Selon la commande de notification utilisée, l'adresse mail peut être utilisée afin d'envoyer des mails de notification.
