Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: The host name defined here is used in host group and service definitions to reference this particular host.
de: Der hier angegeben Hostname wird in Hostgruppen und Servicedefinitionen verwendet, um diesen Host zu referenzieren.
fr: Le nom de l'hôte défini ici est utilisé dans la définition du groupe d'hôtes et d'un service afin de se référencer à cet hôte particulier.

source: The alias is used to define a longer name or description for the host.
de: Der Alias ist ein längerer Name bzw. eine Beschreibung für den Host.
fr: L'alias est utilisé afin de définir un nom long ou une description pour l'hôte.

source: Define the address of the host here. Normally, this should be an IP address, but a FQDN can be used to identify the host instead. If DNS services are not reachable a FQDN could cause problems.
de: Geben Sie hier die Adresse des Hosts an. Normalerweise sollte hier eine IP-Adresse angegeben werden. Alternativ kann jedoch ein FQDN verwendet werden. Wenn kein DNS-Dienst erreichbar ist, können durch die Angabe eines FQDN Probleme entstehen.
fr: Définit l'adresse de l'hôte ici. Normalement, cela devrait être une adresse IP, mais un nom FQDN peut être utilisé afin d'identifier l'hôte à la place. Si les services DNS ne sont pas joignables un nom FQDN pourrait poser des problèmes.

source: The SNMP community and version specified here can be referenced in the check command by using the $_HOSTSNMPCOMMUNITY$ and $_HOSTSNMPVERSION$ macros.
de: Die hier angegebene SNMP-Community und -version können in Überprüfungsbefehlen durch $_HOSTSNMPCOMMUNITY$ und $_HOSTSNMPVERSION$ Makros verwendet werden.
fr: La communauté SNMP et la version spécifiée ici peuvent être référencées dans les commandes de contrôle en utilisant les macros $_HOSTSNMPCOMMUNITY$ et $_HOSTSNMPVERSION$.

source: In a distributed monitoring environment, the monitoring node (central or satellite) for this host can be specified here.
de: In einer verteilten Monitoringumgebung kann hiermit der Monitoring Endpunkt (Zentraler Server oder Poller) für diesen Host angegeben werden.
fr: Dans un environnement de supervision distribuée, le nœud de supervision (central ou satellite) pour cet hôte peut être spécifié ici.

source: Define the timezone of the host's location.
de: Legt die Zeitzone des Hosts fest.
fr: Définit le fuseau horaire de la localisation de l'hôte.

source: This is where you specify the template that you want to inherit properties/variables from. Inherited properties doesn't need to be specified again. "Local" object variables always take precedence over variables defined in the template object. Objects can inherit properties/variables from multiple levels of template objects. When defining multiple sources, the first template specified takes precedence over the later one, in the case where a property is defined in both.
de: Mit dieser Option wird das Template festgelegt, von dem Einstellungen bzw. Variablen geerbt werden sollen. Vererbte Einstellungen müssen nicht erneut angegeben werden. "Lokale" Objektvariablen haben stets Priorität über Variablen, die durch das Template vererbt wurden. Objekte können Einstellungen bzw. Variablen von mehreren Ebenen von Templates vererbt werden. Wenn mehrere Templates angegeben werden und eine Option in beiden definiert ist, erhält das zuerst angegebene Template Priorität über den später hinzugefügten.
fr: Ceci permet d'ajouter des modèles d'hôtes afin d'hériter des propriétés/variables de ces derniers. Les propriétés héritées ne doivent pas être redéfinies. En effet, des propriétés/variables définies localement sur cet objet écraseront celles prédéfinies dans les modèles liés. Les objets peuvent hériter de propriétés de niveaux multiples de modèles d'hôtes. En définissant plusieurs modèles, et dans le cas où une même propriété est définie à plusieurs endroit, la priorité sera données à celle du premier modèle lié.

source: By enabling this option, the services linked to the template will be created independent of the template and attached to this service.
de: Wenn diese Option aktiviert wird, werden die mit dem Template assoziierten Services unabhängig vom Template angelegt und an diesen Service angehängt.
fr: En activant cette option, des services seront créés et reliés à cet hôte en fonction des modèles de services liés au modèle.

source: This directive is used to specify the time period during which active checks of this host can be executed.
de: Mit dieser Richtlinie wird der Zeitraum festgelegt, in der aktive Überprüfungen auf diesem Host ausgeführt werden können.
fr: Ce paramètre est utilisé pour spécifier la période temporelle pendant laquelle les services actif peuvent-être exécutés pour cet hôte.

source: Specify the command that should be used to check if the host is up or down. Typically, this command would try and ping the host to see if it is "alive". On a non-OK state monitoring engine will assume the host is down. A blank argument disables active checks for the host status and Monitoring Engine will always assume the host is up. This is useful if you are monitoring printers or other devices that are frequently turned off.
de: Geben Sie den Befehl an, der genutzt werden soll, um zu prüfen, ob der Host verfügbar oder down ist. Typischerweise versucht dieser Befehl den Host anzupingen um zu überprüfen, ob dieser verfügbar ist. Bei einem Status anders als OK, nimmt die Monitoring Engine an, dass der Host down ist. Wird dieses Feld leer gelassen, so werden keine aktiven Überprüfungen auf den Host-Status ausgeführt und die Monitoring Engine nimmt an, dass der Host immer verfügbar ist. Diese Möglichkeit ist nützlich, wenn Drucker oder andere Geräte überwacht werden, die regelmäßig ausgeschaltet sind.
fr: Cette variable est utilisée pour identifier le nom court de la commande à utiliser pour contrôler si l'hôte répond ou non. Typiquement, cette commande essayera de faire un ping de l'hôte pour voir s'il est vivant. Pour un état non-OK le moteur de supervision pensera que l'hôte n'est pas joignable. Si vous laissez cette variable vide, cet hôte ne sera pas contrôlé activement. Du coup, le moteur de supervision partira certainement du principe que cet hôte répond (il peut être indiqué en état PENDING dans l'interface web). C'est très utile si vous supervisez des imprimantes ou des équipements qui sont fréquemment éteints.

source: Specify the parameters for the selected check command here. The format is: !ARG1!ARG2!...ARGn
de: Geben Sie die Parameter für den ausgewählten Überprüfungsbefehl an. Das Format ist: !ARG1!ARG2!...ARGn
fr: Spécifie les paramètres pour la commande de contrôle sélectionnée. Le format est : !ARG1!ARG2!...ARGn

source: Define the number of times that monitoring engine will retry the host check command if it returns any non-OK state. Setting this value to 1 will cause monitoring engine to generate an alert immediately. Note: If you do not want to check the status of the host, you must still set this to a minimum value of 1. To bypass the host check, just leave the check command option blank.
de: Geben Sie die Anzahl der Versuche an, die die Monitoring Engine einen Host-Überprüfungsbefehl wiederholt, wenn ein Status anders als OK zurückgegeben wird. Ein Wert von 1 führt dazu, dass die Monitoring Engine sofort einen Alert generiert. Hinweis: Wenn der Status eines Hosts nicht überprüft werden soll, muss dieser Wert trotzdem auf 1 belassen werden. Um die Host-Überprüfung zu umgehen, kann einfach der Überprüfungsbefehl leergelassen werden.
fr: Définit le nombre de fois que l'ordonnanceur va ré-exécuter la commande de contrôle de l'hôte si l'état retourné est non-OK. Choisir la valeur 1 force l'ordonnanceur à générer une notification immédiatement. Note : Si vous ne souhaitez pas contrôler le statut de l'hôte, vous devez tout de même choisir une valeur supérieure ou égale à 1. Pour contourner le contrôle de l'hôte, ne définissez pas de commande de contrôle.

source: Define the number of "time units" between regularly scheduled checks of the host. With the default time unit of 60s, this number will mean multiples of 1 minute.
de: Geben Sie die Anzahl an Zeitintervallen zwischen regulär angesetzten Host-Überprüfungen an. Mit dem Standardwert von 60s für ein Zeitintervall, repräsentiert dieser Wert Minuten.
fr: Définit le nombre "d'unité de temps" entre les contrôles planifiés réguliers de l'hôte. Avec l'unité de temps par défaut de 60s, ce nombre signifiera un multiple de 1 minute.

source: Define the number of "time units" to wait before scheduling a re-check for this host after a non-UP state was detected. With the default time unit of 60s, this number will mean multiples of 1 minute. Once the host has been retried max_check_attempts times without a change in its status, it will revert to being scheduled at its "normal" check interval rate.
de: Geben Sie die Anzahl an Zeitintervallen an die gewartet wird, bevor eine erneute Überprüfung ausgeführt wird, wenn ein nicht verfügbar Status erkannt wurde. Mit dem Standardwert von 60s für ein Zeitintervall, repräsentiert dieser Wert Minuten. Sobald die Überprüfung max_check_attempts Mal erneut geprüft wurde, ohne dass sich das Ergebnis verändert, wird wieder auf das normale Überprüfungsintervall gewechselt.
fr: Définit le nombre "d'unité de temps" devant s'écouler avant la programmation d'un nouveau contrôle de cet hôte après qu'un état non-disponible ait été détecté. Avec l'unité de temps par défaut de 60s, ce nombre correspondra à un multiple de 1 minute. Si le statut de l'hôte est identique après avoir été reprogrammé autant de fois que spécifié dans l'option max_check_attempts, l'intervalle de contrôle redeviendra celui définit dans l'option intervalle de contrôle.

source: Enable or disable active checks (either regularly scheduled or on-demand) of this host here. By default active host checks are enabled.
de: Aktivieren bzw. Deaktvieren Sie aktive Überprüfungen durch diese Option (Entweder regelmäßig oder on-demand). Standardmäßig sind aktive Host-Überprüfungen aktiviert.
fr: Active ou désactive les contrôles actifs (même les contrôles réguliers ou ceux à la demande) de cet hôte. Par défaut les contrôles actifs d'hôte sont activés.

source: Enable or disable passive checks here. When disabled submitted states will be not accepted.
de: Aktivieren bzw. Deaktivieren Sie passive Überprüfungen durch diese Option. Wenn diese Option deaktiviert ist, werden eingereichte Status nicht akzeptiert.
fr: Active ou désactive les contrôles passifs. Quand l'option est désactivée les états soumis ne seront pas acceptés.

source: Specify whether or not notifications for this host are enabled.
de: Geben Sie an, ob Benachrichtigungen für diesen Host aktiviert sind.
fr: Spécifie si oui ou non les notifications pour cet hôte sont activées.

source: When enabled, the contact definition will not override the definitions on template levels, it will be appended instead.
de: Wenn diese Option aktiviert ist, wird die Kontaktdefinition auf Templateebene nicht überschrieben. Stattdessen werden die Kontakte kumuliert.
fr: Lorsqu'activé, la définition des contacts additionnels ne remplace pas les définitions issues des modèles, elle sera complétée.

source: When enabled, the contactgroup definition will not override the definitions on template levels, it will be appended instead.
de: Wenn diese Option aktiviert ist, wird die Kontaktgruppendefinition auf Templateebene nicht überschrieben. Stattdessen werden die Kontaktgruppen kumuliert.
fr: Lorsqu'activé, la définition des groupes de contacts additionnels ne remplace pas les définitions issues des modèles, elle sera complétée.

source: This is a list of contacts that should be notified whenever there are problems (or recoveries) with this host. Useful if you want notifications to go to just a few people and don't want to configure contact groups. You must specify at least one contact or contact group in each host definition (or indirectly through its template).
de: Dies ist eine Liste von Kontakten, die benachrichtigt werden sollen, wenn Probleme oder andere Events bei diesem Host auftreten. Diese Liste ist nützlich wenn nur einige wenige Personen benachrichtigt werden sollen und dafür keine Kontaktgruppen genutzt werden sollen. In jeder Hostdefinition muss mindestens ein Kontakt bzw. eine Kontaktgruppe angegeben (Entweder explizit oder implizit durch ein Template).
fr: Ceci est la liste de contacts qui doivent être notifiés à chaque fois qu'il y a un problème (ou un rétablissement) avec cet hôte. Utile si vous souhaitez des notifications uniquement vers peu de personnes et que vous ne souhaitez pas configurer de groupes de contacts. Vous devez spécifier au moins un contact ou groupe de contacts dans chaque définition d'hôte (ou indirectement via son modèle).

source: When enabled, the contact group definition will not override the definitions on template levels, it will be appended instead.
de: Wenn diese Option aktiviert ist, wird die Kontaktgruppendefinition auf Templateebene nicht überschrieben. Stattdessen werden die Kontaktgruppen kumuliert.
fr: Lorsqu'activé, la définition des groupes de contacts additionnels ne remplace pas les définitions issues des modèles, elle sera complétée.

source: This is a list of contact groups that should be notified whenever there are problems (or recoveries) with this host. You must specify at least one contact or contact group in each host definition.
de: Dies ist eine Liste von Kontaktgruppen, die benachrichtigt werden sollen, wenn Probleme oder andere Events bei diesem Host auftreten. In jeder Hostdefinition muss mindestens ein Kontakt bzw. eine Kontaktgruppe angegeben.
fr: Ceci est la liste de groupes de contacts qui doivent être notifiés à chaque fois qu'il y a un problème (ou un rétablissement) avec cet hôte. Vous devez spécifier au moins un contact ou groupe de contacts dans chaque définition d'hôte.

source: Define the number of "time units" to wait before re-notifying a contact that this host is still down or unreachable. With the default time unit of 60s, this number will mean multiples of 1 minute. A value of 0 disables re-notifications of contacts about problems for this host - only one problem notification will be sent out.
de: Geben Sie die Anzahl an Zeitintervallen zwischen wiederholten Benachrichtigungen an, wenn ein Host fortwährend down bzw. nicht erreichbar ist. Mit dem Standardwert von 60s für ein Zeitintervall, repräsentiert dieser Wert Minuten. Ein Wert von 0 deaktiviert wiederholte Benachrichtigungen für diesen Host - es wird nur eine Problembenachrichtigung gesendet.
fr: Définit le nombre "d'unité de temps" devant s'écouler avant de notifier à nouveau un contact sur l'état indisponible ou injoignable de cet hôte. Avec l'unité de temps par défaut de 60s, ce nombre correspondra à un multiple d'1 minute. Une valeur de 0 désactive la re-notification des contacts à propos des problèmes de cet hôte - une notification unique sera envoyée lors de la détection d'un problème.

source: Specify the time period during which notifications of events for this host can be sent out to contacts. If a state change occurs during a time which is not covered by the time period, no notifications will be sent out.
de: Legen Sie den Zeitraum fest, in dem Benachrichtigungen an Kontakte gesendet werden sollen. Wenn außerhalb dieses Zeitraums eine Statusänderungen auftritt, werden keine Benachrichtigungen gesendet.
fr: Spécifie les périodes de temps durant lesquelles les notifications d'événements doivent être envoyées aux contacts. Si un changement d'état intervient à un moment exclut de cette période temporelle, aucune notification ne sera envoyée.

source: Define the states of the host for which notifications should be sent out. If you specify None as an option, no host notifications will be sent out. If you do not specify any notification options, monitoring engine will assume that you want notifications to be sent out for all possible states.
de: Legen Sie die Statuswerte des Hosts fest, für die Benachrichtigungen gesendet werden sollen. Wenn der Wert Keine als Option angegeben wird, werden keine Host-Benachrichtigungen versendet. Wenn keine Benachrichtigungsoptionen angegeben werden, wird angenommen, dass für alle Statuswerte Benachrichtigungen gesendet werden sollen.
fr: Définit les états de l'hôte pour lesquels des notifications seront envoyées. Si vous sélectionnez l'option "None", aucunes notifications ne seront envoyées pour les hôtes. Si vous ne définissez aucune des options, l'ordonnanceur présumera que vous souhaitez que des notifications soient envoyées pour tous les états possibles.

source: Define the number of "time units" to wait before sending out the first problem notification when this host enters a non-UP state. With the default time unit of 60s, this number will mean multiples of 1 minute. If you set this value to 0, monitoring engine will start sending out notifications immediately.
de: Geben Sie die Anzahl an Zeitintervallen an, die gewartet werden, bevor eine Problembenachrichtigung gesendet wird, sobald der Host einen anderen Status als verfügbar annimmt. Mit dem Standardwert von 60s für ein Zeitintervall, repräsentiert dieser Wert Minuten. Ein Wert von 0 führt dazu, dass Benachrichtigungen sofort gesendet werden.
fr: Définit le nombre "d'unités de temps" à attendre avant l'envoi de la notification du premier problème lorsque cet hôte entre dans un état non-UP. Avec l'unité de temps par défaut de 60s, ce nombre représente un multiple de 1 minute. Si la valeur spécifiée est 0, le moteur de supervision commencera à envoyer des notifications immédiatement.

source: Define the number of "time units" to wait before sending out the recovery notification when this host enters an UP state. With the default time unit of 60s, this number will mean multiples of 1 minute. If you set this value to 0, monitoring engine will start sending out notifications immediately.
de: Geben Sie die Anzahl an Zeitintervallen an, die gewartet werden, bevor eine Erholungsbenachrichtigung gesendet wird, sobald der Host den verfügbar Status annimmt. Mit dem Standardwert von 60s für ein Zeitintervall, repräsentiert dieser Wert Minuten. Ein Wert von 0 führt dazu, dass Benachrichtigungen sofort gesendet werden.
fr: Définit le nombre "d'unités de temps" à attendre avant l'envoi de la notification du rétablissement lorsque cet hôte entre dans un état UP. Avec l'unité de temps par défaut de 60s, ce nombre représente un multiple de 1 minute. Si la valeur spécifiée est 0, le moteur de supervision commencera à envoyer des notifications immédiatement.

source: Define the hostgroup(s) that this host belongs to. This directive may be used as an alternative to (or in addition to) defining the members in hostgroup definitions.
de: Geben Sie die Hostgruppe(n) an, die dieser Host angehört. Dies ist Alternative zur Angabe von Mitgliedern über die Hostgruppendefinition zu sehen.
fr: Définit le groupe d'hôtes auquel appartient cet hôte. Cette option peut être utilisé comme une alternative (ou en supplément) du choix des membres réalisé dans les définitions des groupes d'hôtes.

source: Define categories in which this host belongs to. You can add this later by editing the host or the category you want to add it to.
de: Legen Sie Kategorien fest, denen dieser Host angehört. Diese Kategorisierung kann auch später festgelegt werden, indem der Host bzw. die gewünschte Kategorie bearbeitet wird.
fr: Définit les catégories auxquelles cet hôte appartient. Vous pouvez ajouter cela plus tard en éditant l'hôte ou la catégorie à laquelle vous souhaitez l'ajouter.

source: Parent hosts are typically routers, switches, firewalls, etc. that lie between the monitoring host and a remote hosts. A router, switch, etc. which is closest to the remote host is considered to be that host\'s "parent". If this host is on the same network segment as the host doing the monitoring (without any intermediate routers, etc.) the host is considered to be on the local network and will not have a parent host. Leave this value blank if the host does not have a parent host (i.e. it is on the same segment as the Monitoring Engine host). The order in which you specify parent hosts has no effect on how things are monitored. Note that notification features based on host inheritance will not work if the hosts are not monitored by the same poller.
de: Übergeordnete Hosts sind üblicherweise Router, Switches, Firewalls, etc. die sich zwischen dem Überwachungsserver und dem Remote-Host befinden. Ein Router, Switch, etc. der sich netzwerktechnisch am nächsten am Remote-Host befindet, ist als dessen übergeordneter Host zu verstehen. Wenn sich dieser Host im gleichen Netzwerksegment befindet wie der Monitoring-Server (ohne zwischengeschaltete Router, etc.), wird dieser als Mitglied des lokalen Netzwerks deaklariert und hat selbst keine übergeordneten Host. Dieses Feld kann leer gelassen werden, wenn der Host keinen übergeordneten Host hat (d.h. sich im gleichen Netzwerksegment wie der Monitoring-Server befindet). Die Reihenfolge, in der übergeordnete Hosts angegeben werden, hat keine Auswirkungen darauf, wie das Monitoring erfolgt. Hinweis: Benachrichtigungs-Features, die auf der Host-Vererbung basieren, funktionieren nur, wenn alle der angegebenen Hosts vom gleichen Poller überwacht werden.
fr: Les hôtes parents sont généralement des routeurs, commutateurs, pare-feux, etc. qui sont située entre l’hôte supervisé et le serveur de supervision. L’élément réseau qui est le plus proche de l’élément supervisé est considéré comme son parent. Si cet équipement est situé dans le même segment réseau que l’hôte supervisé, alors il n’est pas considéré comme son parent. L’idée est de décrire tous les liens physiques entre équipements situées entre le serveur de collecte et l’hôte supervisé. Pour chaque équipement intermédiaire, il faudra superviser ce dernier et renseigner ses parents. Dans le cas où plusieurs liaisons physique existent pour atteindre l’équipement à superviser, il faut renseigner ces dernières pour indiquer au moteur de collecte qu’il existe un chemin pour atteindre l’élément. Les relations de parentés permettent de désactive la supervision d’éléments située derrière un équipement dans un statut \ »Down\ ». Ainsi, la console mettra en avant l’équipement \ »Down\ » et considérera ses fils comme injoignable. Tous les hôtes doivent être supervisés par le même collecteur de supervision pour prendre en compte les relations de parentés.

source: Instead of specifying the parent hosts in the child's parent definition, it's possible to do it the other way round and specify all child hosts in the parent's definition.
de: Statt den übergeordneten Host im untergeordneten Host anzugeben, kann diese Option auch andersrum festgelegt werden, d.h. die untergeordneten Hosts können im übergeordneten Host definiert werden.
fr: Au lieu de spécifier les hôtes parents dans la définition des relations parentés, il est possible de le faire dans l'autre sens et de préciser tous les enfants de l'hôte dans la définition du parent.

source: This directive determines whether or not checks for this host will be "obsessed" over. When enabled the obsess over host command will be executed after every check of this host.
de: Diese Option legt fest, ob Überprüfungen diesen Hosts überwacht werden. Wenn diese Option aktiviert ist, wird der Hostüberwachungsbefehl nach jeder Host-Überprüfung ausgeführt.
fr: Ce paramètre détermine si les commandes de remontées de contrôles seront activées. Lorsqu'elle est activée la commande de remontée de contrôle de l'hôte sera exécutée après chaque contrôle de cette machine.
