Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: This option allows you to specify illegal characters that cannot be used in host names, service descriptions, or names of other object types. Monitoring Engine will allow you to use most characters in object definitions, but I recommend not using the characters set by default. Doing may give you problems in the web interface, notification commands, etc.
de: Mit dieser Option können Zeichen angegeben werden, die in Host-Namen, Service-Beschreibungen oder Namen von anderen Objekttypen nicht verwendet werden dürfen. Die Monitoring Engine ermöglicht es zwar ein Großteil der Zeichen in Objektdefinitionen zu verwenden, es wird jedoch davon abgeraten, die Zeichen zu verwenden, die standardmäßig hier angegeben sind. Werden diese trotzdem verwendet, können Probleme im Web-Interface, bei Benachrichtigungsbefehlen und in weiteren Bereichen entstehen.
fr: Cette option vous permet de spécifier quels sont les caractères illégaux qui ne pourront pas être utilisés dans les noms d'hôtes, description de services ou noms des autres types d'objets. Le moteur de supervision vous autorisera la plupart des caractères dans les définitions d'objets, mais je recommande de ne pas utiliser les caractères fixés par défaut. Le faire vous expose à des problèmes dans l'interface web, les notifications de commandes, etc.

source: This option allows you to specify illegal characters that should be stripped from macros before being used in notifications, event handlers, and other commands. This DOES NOT affect macros used in service or host check commands. Some of these characters are interpreted by the shell (i.e. the backtick) and can lead to security problems.
de: Mit dieser Option können Zeichen angegeben werden, die von Makros entfernt werden sollen, bevor diese in Benachrichtigungen, Event Handlern oder anderen Befehlen verwendet werden. Diese Option hat KEINE Auswirkungen auf Makros, die in Host- bzw. Service-Überprüfungen verwendet werden. Einige Zeichen werden von der Shell als Befehl interpretiert (z.B. der Gravis) und können zu Sicherheitsproblemen führen.
fr: Cette option vous permet de spécifier des caractères illégaux qui devront enlevés des macros avant d'être utilisés dans les notifications, la gestion des événements, et les autres commandes. Cela n'affecte pas les macros utilisées dans les commandes de vérification des services et des hôtes. Certains de ces caractères sont interprétés par le terminal (exemple l'accent grave) et peut amener des problèmes de sécurité.

source: This option determines whether or not various directives in your object definitions will be processed as regular expressions. More information on how this works can be found in Monitoring Engine section on object tricks. This option is disabled by default.
de: Diese Option legt fest, ob verschiedene Einstellungen in den Objektdefinitionen als reguläre Ausdrücke verarbeitet werden sollen. Mehr Informationen zu der Funktionsweise dieser Option können in dem Monitoring Engine Abschnitt der Objekttricks gefunden werden. Diese Option ist standardmäßig deaktiviert.
fr: Cette option détermine si les paramètres dans vos définitions d'objets seront traités comme des expressions régulières. Un complément d'information sur le fonctionnement peut-être trouvé dans la documentation du moteur de supervision à la section trucs et astuces des objets. Cette option est désactivée par défaut.

source: If you've enabled regular expression matching of various object directives using the use_regexp_matching option, this option will determine when object directives are treated as regular expressions. If this option is disabled (the default), directives will only be treated as regular expressions if they contain *, ?, +, or \.. If this option is enabled, all appropriate directives will be treated as regular expression.
de: Wenn aktiviert wurde, dass mithilfe der use_regexp_matching Option verschiedene Einstellungen in den Objektdefinitionen als reguläre Ausdrücke interpretiert werden, legt diese Option fest, wann das der Fall ist. Wenn diese Option deaktiviert ist (Standardeinstellung), werden Einstellungen nur dann als reguläre Ausdrücke interpretiert, wenn sie *,?,+ oder \. enthalten. Wenn diese Option aktiviert ist, werden alle entsprechenden Einstellungen as reguläre Ausdrücke interpretiert.
fr: Si vous avez activé la concordance par expression régulière, cette option va déterminer quand les paramètres vont être traités comme des expressions régulières. Si cette option est désactivée (par défaut), les paramètres seront traités comme des expression rationnelles uniquement si elles contiennent un *, ?, +, ou un \.. Si cette option est activée, tous les paramètres seront traités comme des expressions régulières.

source: This option controls what (if any) data gets sent to the event broker and, in turn, to any loaded event broker module. Centreon relies heavily on the broker and needs this value to be set as -1.
de: Diese Option legt fest, welche und ob überhaupt Daten an den Event Broker und somit an jedes geladene Event Broker Modul gesendet werden. Centreon ist stark abhängig vom Broker und dieser Wert muss auf -1 gesetzt sein.
fr: Cette option contrôle que les données (si plusieurs) seront envoyées au broker d’événements et, ensuite, chargées dans le module du broker d’événements. Centreon s'appuie en grande partie sur le broker et a besoin que cette valeur soit fixée à -1.

source: This directive is used to specify an event broker module that should by loaded by Monitoring Engine at startup. Use multiple directives if you want to load more than one module. Arguments that should be passed to the module at startup are separated from the module path by a space.
de: Diese Richtlinie spezifiziert ein Event Broker Modul, dass von der Monitoring Engine beim Start geladen wird. Um mehrere Module zu laden, kann pro Modul eine Richtlinie erstellt werden. Parameter, die an ein Modul weitergegeben werden sollen, müssen durch ein Leerzeichen vom Pfad getrennt sein.
fr: Ce paramètre est utilisé pour spécifier le module du broker d'événements afin qu'il soit chargé au démarrage du moteur de supervision. On peut utiliser plusieurs de ces mêmes paramètres si l'on veut en charger plus d'un. Les arguments passés au module seront séparés par un espace.

source: This option determines whether or not Monitoring Engine will execute predictive checks of hosts that are being depended upon (as defined in host dependencies) for a particular host when it changes state. Predictive checks help ensure that the dependency logic is as accurate as possible. This option is enabled by default.
de: Diese Option legt fest, ob von der Monitoring Engine vorausschauende Überprüfungen für Hosts ausgeführt werden, von denen andere Hosts abhängig sind und deren Status sich ändert (wie in den Hostabhängigkeiten definiert). Vorausschauende Überprüfungen helfen dabei die Abhängigkeitslogik so genau wie möglich abzubilden. Diese Option ist standardmäßig aktiviert.
fr: Cette option détermine si le moteur de supervision exécutera ou non des contrôles prédictifs sur les hôtes dépendants (comme définit dans les dépendances d'hôtes) d'un hôte particulier quand celui-ci change d'état. Les contrôles prédictifs permettent de s'assurer que la logique de dépendance est aussi précise que possible. Cette option est activée par défaut.

source: This option determines whether or not Monitoring Engine will execute predictive checks of services that are being depended upon (as defined in service dependencies) for a particular service when it changes state. Predictive checks help ensure that the dependency logic is as accurate as possible. More information on how predictive checks work can be found here. This option is enabled by default.
de: Diese Option legt fest, ob von der Monitoring Engine vorausschauende Überprüfungen für Services ausgeführt werden, von denen andere Services abhängig sind und deren Status sich ändert (wie in den Serviceabhängigkeiten definiert). Vorausschauende Überprüfungen helfen dabei die Abhängigkeitslogik so genau wie möglich abzubilden. Mehr Informationen zur Funktionsweise von vorausschauenden Überprüfungen finden Sie unter diesem Link. Diese Option ist standardmäßig aktiviert.
fr: Cette option détermine si le moteur de supervision exécutera ou non des contrôles prédictifs sur les services dépendants (comme définit dans les dépendances de services) d'un service particulier quand celui-ci change d'état. Les contrôles prédictifs permettent de s'assurer que la logique de dépendance est aussi précise que possible. Plus d'informations sur le fonctionnement des contrôles prédictifs peuvent être trouvées dans la documentation du moteur de supervision. Cette option est activée par défaut.

source: This option determines the maximum amount of time (in seconds) that the state of a previous host check is considered current. Cached host states (from host checks that were performed more recently than the time specified by this value) can improve host check performance immensely. Too high of a value for this option may result in (temporarily) inaccurate host states, while a low value may result in a performance hit for host checks. Use a value of 0 if you want to disable host check caching.
de: Maximale Zeit in Sekunden, die der Status einer ausgeführten Host-Überprüfung als aktuell gilt. Gecachte Host-Überprüfungsstatus (Die von Host-Überprüfungen stammen, die aktueller sind als die von diesem Wert angebene Zeit) können die Host-Überprüfungsperformance signifikant verbessern. Wenn der Wert für diese Option zu hoch gewählt wird, kann das temporär unzutreffende Host-Status zur Folge haben. Wenn der Wert zu niedrig gewählt wird, kann die Performance von Host-Überprüfungen beeinträchtigt werden. Ein Wert von 0 deaktiviert das Caching von Host-Überprüfungsstatus.
fr: Cette option détermine le temps maximum (en secondes) pour que l'état d'un précédent contrôle d'hôte soit considéré comme courant. Le cache d'état d'hôtes (du point de vue des contrôles d'hôtes qui ont été effectués plus récemment que le temps spécifié par cette valeur) peut améliorer considérablement les performances pour les contrôles d'hôtes. Une valeur trop élevée pour cette option peut se traduire par des états d'hôtes (temporairement) erronés, alors qu'une valeur trop basse se traduira par un écroulement des performances pour les contrôles d'hôtes. Utiliser la valeur 0 pour désactiver le cache de contrôle des hôtes.

source: This option determines the maximum amount of time (in seconds) that the state of a previous service check is considered current. Cached service states (from service checks that were performed more recently than the time specified by this value) can improve service check performance when a lot of service dependencies are used. Too high of a value for this option may result in inaccuracies in the service dependency logic. Use a value of 0 if you want to disable service check caching.
de: Maximale Zeit in Sekunden, die der Status einer ausgeführten Service-Überprüfung als aktuell gilt. Gecachte Service-Überprüfungsstatus (Die von Service-Überprüfungen stammen, die aktueller sind als die von diesem Wert angebene Zeit) können die Service-Überprüfungsperformance signifikant verbessern wenn eine hohe Anzahl an Serviceabhängigkeiten verwendet wird. Wenn der Wert für diese Option zu hoch gewählt wird, kann das Ungenauigkeiten in der Serviceabhängigkeitslogik zur Folge haben. Ein Wert von 0 deaktiviert das Caching von Service-Überprüfungsstatus.
fr: Cette option permet de définir le temps maximum (en secondes) pour que l'état d'un précédent contrôle de service soit considéré comme courant. Le cache d'état de service (Pour les contrôles de services qui sont effectués en avance par rapport à l'intervalle spécifié par cette valeur) peut améliorer la performance des contrôles quand un nombre important de dépendances de services est utilisé. Une valeur trop haute pour cette option se soldera par un manque de précision dans la logique de dépendance des services. Positionnez cette valeur à 0 si vous voulez désactiver le cache de contrôle de service.

source: This option determines whether or not the Monitoring Engine daemon will take several shortcuts to improve performance. These shortcuts result in the loss of a few features, but larger installations will likely see a lot of benefit from doing so. This option is disabled by default.
de: Diese Option legt fest, ob der Monitoring Engine Daemon einige Abkürzungen nutzt um die Performance zu verbessern. Diese Abkürzungen resultieren im Verlust von einigen Features, größere Umgebungen sollten jedoch einige Vorteile davon erzielen. Diese Option ist standardmäßig deaktiviert.
fr: Cette option détermine si le moteur de supervision utilisera différents raccourcis pour améliorer les performances. Ces raccourcis font perdre quelques fonctionnalités, mais ils apportent de gros gains sur des grands environnements. Cette option est désactivée par défaut.

source: This option determines whether or not Monitoring Engine will free memory in child processes when they are fork()ed off from the main process. By default, Monitoring Engine frees memory. However, if the use_large_installation_tweaks option is enabled, it will not. By defining this option in your configuration file, you are able to override things to get the behavior you want.
de: Diese Option legt fest, ob die Monitoring Engine Arbeitsspeicher von Subprozessen freigibt, wenn diese vom Hauptprozess fork()ed werden. Standardmäßig gibt die Monitoring Engine Arbeitsspeicher frei. Das ist jedoch nicht der Fall, wenn die Option use_large_installation_tweaks aktiviert ist. Wenn diese Option in der Konfigurationsdatei gesetzt wird, kann diese so überschrieben werden, damit das gewünschte Verhalten erreicht wird.
fr: Cette option permet de déterminer si le moteur de supervision libérera la mémoire utilisée par les processus enfant quand ils seront arrivés en fin de traitement. Par défaut, le moteur de supervision libère la mémoire. Cependant, si l'option use_large_installation_tweaks est activée, il ne fera qu'un fork. En déclarant cette option dans votre fichier de configuration, vous avez la possibilité de changer ce comportement.

source: This option determines whether or not Monitoring Engine will fork() child processes twice when it executes host and service checks. By default, Monitoring Engine fork()s twice. However, if the use_large_installation_tweaks option is enabled, it will only fork() once. By defining this option in your configuration file, you are able to override things to get the behavior you want.
de: Diese Option legt fest, ob die Monitoring Engine Subprozesse zweimal fork()ed, wenn Host- und Service-Überprüfungen ausgeführt werden. Standardmäßig fork()ed die Monitoring Engine zweimal. Das ist jedoch nicht der Fall, wenn die Option use_large_installation_tweaks aktiviert ist. In diesem Fall wird nur einmal fork()ed. Wenn diese Option in der Konfigurationsdatei gesetzt wird, kann diese so überschrieben werden, damit das gewünschte Verhalten erreicht wird.
fr: Cette option détermine si le moteur de supervision doit dupliquer son processus ou non en double les processus enfants quand il exécute des contrôles d'hôte et de service. Par défaut, le moteur de supervision fork en double. Cependant, si l'option use_large_installation_tweaks est activée, il ne fera qu'un fork. En déclarant cette option dans votre fichier de configuration, vous avez la possibilité de changer ce comportement.

source: This option determines whether or not the Monitoring Engine daemon will make all standard macros available as environment variables to your check, notification, event hander, etc. commands. In large Monitoring Engine installations this can be problematic because it takes additional memory and (more importantly) CPU to compute the values of all macros and make them available to the environment. This option is enabled by default.
de: Diese Option legt fest, ob der Monitoring Engine Daemon alle Standard-Makros als Umgebungsvariablen für Überprüfungen, Benachrichtigungen, Event Handler und weitere Befehle zur Verfügung stellt. In größeren Monitoring Engine Umgebungen kann diese Option problematisch sein, da sie nicht nur zusätzlichen Arbeitsspeicher, sondern vorallem auch eine höhere CPU-Auslastung benötigt, um die Werte der Makros zu berechnen und diese zur Verfügung zu stellen. Diese Option ist standardmäßig aktiviert.
fr: Cette option détermine si le démon du moteur de supervision peut considérer toutes les macros standards comme des variables d'environnements pour vos contrôles, notifications, déclencheur d’événements, etc. Commandes. Dans de très grands environnements, ceci peut être problématique car une utilisation mémoire et CPU supplémentaire est utile pour convertir ces macros en variables d'environnements. Cette option est activée par défaut.

source: Only works with Centreon Engine (>= 1.3). For better performance, set this to 'No'. But it is safer to leave it to 'Default' ('Yes'), for a few native plugins could trigger a monitoring crash.
de: Diese Option wirkt sich nur mit Centreon Engine Version 1.3 oder höher aus. Für bessere Perfomance kann dieser Wert auf 'Nein' gesetzt werden. Es ist jedoch sicherer, diesen auf 'Standard' ('Ja') zu belassen, da durch einige native Plugins ansonsten ein Absturz der Überwachungsaktivität ausgelöst werden könnte.
fr: Cette option, seulement compatible avec une version de Centreon Engine >= 1.3, permet de désolidariser les processus fils du processus principal. Il est préférable de laisser cette option à la valeur "Défaut" ('Oui').

source: This option determines where Monitoring Engine should write debugging information. What (if any) information is written is determined by the debug_level and debug_verbosity options. You can have Monitoring Engine automaticaly rotate the debug file when it reaches a certain size by using the max_debug_file_size option.
de: Diese Option legt fest, wo Debugging-Informationen von der Monitoring Engine hingeschrieben werden. Welche (wenn überhaupt) Informationen geschrieben werden, wird durch die Optionen debug_level und debug_verbosity festgelegt. Durch die Option max_debug_file_size kann eine maximale Größe für die Debugdatei festgelegt werden. Wenn dieser Wert erreicht wird, wird die Datei durch Monitoring Engine automatisch rotiert.
fr: Cette option détermine si le moteur de supervision peut écrire des informations de débogage. La précision des informations que le moteur de supervision écrit dépend des options debug_level et debug_verbosity. Vous pouvez automatiquement gérer la rotation du fichier de débogage en fonction de sa taille en utilisant l'option max_debug_file_size.

source: This option determines the maximum size (in bytes) of the debug file. If the file grows larger than this size, it will be renamed with a .old extension. If a file already exists with a .old extension it will automatically be deleted. This helps ensure your disk space usage doesn't get out of control when debugging Monitoring Engine.
de: Diese Option legt die maximale Größe (in Bytes) der Debugdatei fest. Wenn die Datei größer als die angegebene Größe wird, wird diese mit .old erweitert und eine neue Datei erstellt. Wenn bereits eine Datei mit der .old-Erweiterung existiert, wird diese automatisch gelöscht. Dadurch wird sichergestellt, dass das Debugging der Monitoring Engine nicht zu viel Festplattenplatz belegt.
fr: Cette option détermine la taille maximum (en octets) du fichier de débogage .Si le fichier dépasse la taille que vous avez indiqué, il sera renommé avec une extension en .old. Si le fichier .old existe déjà, il sera automatiquement effacé. Cette option vous permet de garder un contrôle sur l'espace disque que le moteur de supervision prend quand il se trouve en mode de débogage.

source: This option allows dumping core in case a segmentation fault occurs. Warning: Make sure that server has sufficient disk space for these dumps (ulimit). This option is discarded when using Centreon Engine.
de: Diese Option legt fest, ob CPU-Kern und Arbeitsspeicherdaten gedumpt werden, wenn eine Segmentierungsfehler auftritt. Warnung: Stellen Sie sicher, dass ausreichend Speicher für diese Dumps zur Verfügung steht (ulimit). Diese Option wird verworfen, wenn Centreon Engine verwendet wird.
fr: Cette option autorise la création d'un fichier de débogage si une erreur de segmentation se produit. Avertissement: Assurez-vous que le serveur dispose d'un espace disque suffisant pour ces fichiers (ulimit). Cette option n'est pas utilisable avec l'ordonnanceur Centreon Engine.

source: This option determines how much debugging information Monitoring Engine should write to the debug_file. By default the verbosity is set to level 1.
de: Diese Option legt fest, wie ausführlich Debugging-Informationen von der Monitoring Engine in debug_file geschrieben werden. Standardmäßig ist die Ausführlichkeit auf Stufe 1 gesetzt.
fr: Cette option détermine la quantité d'information de débogage que le moteur de supervision doit écrire dans le fichier de débogage. Par défaut la verbosité est fixée à 1.

source: This option determines what type of information Monitoring Engine should write to the debug_file.
de: Diese Option legt fest, welche Art von Informationen von der Monitoring Engine in debug_file geschrieben werden sollen.
fr: Cette option détermine le type d'information que devrait écrire le moteur de supervision au fichier de débogage.

source: Description or name used to identify this configuration set.
de: Beschreibung oder Name, der dieses Konfigurationsset identifiziert.
fr: Description ou nom utilisé afin d'identifier cette configuration.

source: Specify whether this configuration is currently active or not. This way you can test different configuration sets for one monitoring node.
de: Legt fest, ob diese Konfiguration aktiv ist. Über diese Option können verschiedene Konfigurationssets für den gleichen Überwachungsendpunkt getestet werden.
fr: Spécifie si cette configuration est actuellement active ou non. De cette manière vous pouvez tester différentes configurations pour un seul noeud de supervision.

source: Choose the Monitoring Engine server instance this configuration is defined for.
de: Legt die Monitoring Engine Server-Instanz fest, für die diese Konfiguration bestimmt ist.
fr: Choisissez l'instance du moteur de supervision qui est définie pour cette configuration.

source: Enable the possibility to log pid information in engine log file (option only for Centreon Engine)
de: Aktiviert die Möglichkeit, PID-Informationen in die Engine-Protokolldatei zu speichern (Diese Option ist ausschließlich für Centreon Engine gedacht).
fr: Active la possibilité de journaliser le PID du processus dans le journal d'évènement du moteur de supervision. Cette option ne fonctionne que pour le moteur Centreon Engine.

source: Define a short name for this dependency.
de: Definieren Sie einen Kurznamen für diese Abhängigkeit.
fr: Définit un nom court pour cette dépendance.

source: Define a description for this dependency for easier identification and differentiation.
de: Definieren Sie eine Beschreibung für diese Abhängigkeit, damit diese einfacher identifiziert und auseinandergehalten werden kann.
fr: Définit une description pour cette dépendance afin de l'identifier et de la différencier plus facilement.
