Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/help.po
Languages: de, fr

source: This directive is used to determine whether or not freshness checks are enabled for this host. When enabled monitoring engine will trigger an active check when last passive result is older than the value defined in the threshold. By default freshness checks are enabled.
de: Diese Option legt fest, ob für diesen Host Aktualitätsprüfungen ausgeführt werden. Wenn diese Option aktiviert ist und ein passives Überprüfungsergebnis älter als der Grenzwert ist, wird durch die Monitoring Engine eine aktive Überprüfung erzwungen. Standardmäßig sind Aktualitätsprüfungen aktiviert.
fr: Cette option est utilisée afin de déterminer si oui ou non, les contrôles de fraîcheur doivent être activés pour cet hôte. Quand elle est activée, l'ordonnanceur va déclencher un contrôle actif dès lors que la date du dernier résultat passif reçu est obsolète par rapport à la valeur seuil définie. Les contrôles de fraîcheur sont activés par défaut.

source: Specify the freshness threshold (in seconds) for this host. If you set this directive to a value of 0, monitoring engine will determine a freshness threshold to use automatically.
de: Legen Sie den Aktualitätsgrenzwert (in Sekunden) für diesen Host fest. Wenn dieser Wert auf 0 gesetzt wird, wird durch die Monitoring Engine automatisch ein Wert ermittelt.
fr: Spécifie le seuil de fraîcheur (en secondes) de l'état de l'hôte. Si cette option est définit à 0, l'ordonnanceur va déterminer automatiquement un seuil de fraîcheur à utiliser.

source: This directive is used to determine whether or not flap detection is enabled for this host.
de: Diese Richtlinie legt fest, ob die Erkennung des Flackern-Status für diesen Host aktiviert ist.
fr: Cette directive est utilisée afin de déterminer si oui ou non la détection de bagotage est activée pour cet hôte.

source: This directive is used to specify the low state change threshold used in flap detection for this host. If you set this directive to a value of 0, the program-wide value will be used.
de: Diese Richtlinie legt den unteren Statuswechselgrenzwert, der für die Erkennung des Flackern-Status genutzt wird, für diesen Host fest. Wenn dieser Wert auf 0 gesetzt wird, wird der globale Wert genutzt.
fr: Cette directive est utilisée pour spécifier le seuil bas d'état utilisée dans la détection d'oscillation pour cet hôte. Si vous définissez cette directive pour une valeur de 0, la valeur sera utilisée pour l'ensemble de l'hôte.

source: This directive is used to specify the high state change threshold used in flap detection for this host. If you set this directive to a value of 0, the program-wide value will be used.
de: Diese Richtlinie legt den oberen Statuswechselgrenzwert, der für die Erkennung des Flackern-Status genutzt wird, für diesen Host fest. Wenn dieser Wert auf 0 gesetzt wird, wird der globale Wert genutzt.
fr: Cette directive est utilisée pour spécifier le seuil bas d'état utilisée dans la détection d'oscillation pour cet hôte. Si vous définissez cette directive pour une valeur de 0, la valeur sera utilisée pour l'ensemble de l'hôte.

source: This directive is used to determine whether or not the processing of performance data is enabled for this host.
de: Diese Richtlinie legt fest, ob Leistungsdaten von diesem Host verarbeitet werden sollen.
fr: Cette directive est utilisée pour activer ou désactiver le traitement des données de performances pour cet hôte.

source: This directive is used to determine whether or not status-related information about the host is retained across program restarts. This is only useful if you have enabled the global state retention option.
de: Diese Richtlinie wird verwendet um festzulegen, ob statusbezogene Informationen des Hosts über Programmneustarts hinaus aufbewahrt werden. Diese Option wirkt sich nur aus, wenn die globale Option zur Statusbeibehaltung aktiviert ist.
fr: Cette directive est utilisée pour déterminer si les informations liées au statut de l'hôte sont conservés après chaque redémarrage du programme. Ce n'est utile que si vous avez activé l'option de rétention globale des états.

source: This directive is used to determine whether or not non-status information about the host is retained across program restarts. This is only useful if you have enabled state retention using the retain_state_information directive.
de: Diese Richtlinie wird verwendet um festzulegen, ob nicht statusbezogene Informationen des Hosts über Programmneustarts hinaus aufbewahrt werden. Diese Option wirkt sich nur aus, wenn die Option retain_state_information aktiviert ist.
fr: Cette directive est utilisée pour déterminer si les informations non liées au statut de l'hôte sont conservés après chaque redémarrage du programme. Ce n'est utile que si vous avez activé l'option de rétention globale des états.

source: This directive determines which host states "stalking" is enabled for.
de: Diese Richtlinie legt fest, für welche Host-Status die Nachverfolgung aktiviert ist.
fr: Cette directive permet de mettre à jour le fichier de rétention dans le cas où le message de sortie (output) change même si le statut de l'objet reste identique.

source: This directive is used to determine whether or not the event handler for this host is enabled.
de: Diese Richtlinie legt fest, ob der Event Handler für diesen Host aktiviert ist.
fr: Cette directive est utilisée pour déterminer si le gestionnaire d'événements pour cet hôte est activé.

source: The event handler command is triggered whenever a change in the state of the host is detected, i.e. whenever it goes down or recovers.
de: Der Event-Handler Befehl wird immer dann ausgeführt, wenn eine Statusänderung beim Host erkannt wird. D.h. jedes mal wenn der Host in den down Status wechselt bzw. wieder verfügbar ist.
fr: La commande de gestionnaire d'événement est déclenchée chaque fois qu'un changement dans l'état de l'hôte est détecté, c'est à dire quand il tombe en panne ou se rétablit.

source: This parameters are passed to the event handler commands in the same way check command parameters are handled. The format is: !ARG1!ARG2!...ARGn
de: Diese Parameter werden an den Event Handler Befehl weitergegeben, ähnlich wie bei Überprüfungsbefehl-Parametern. Das Format ist: !ARG1!ARG2!...ARGn
fr: Ces paramètres sont passés aux commandes du gestionnaire d’événement de la même façon qu'on les utilise paramètres des commandes de contrôles. Le format est le suivant : !ARG1!ARG2!...ARGn

source: Specify a duration of acknowledgement for this host or host depending to this template. If you leave it blank, no timeout will be set.
de: Geben Sie eine Dauer der Inkenntnisnahme für diesen Host bzw. für Hosts, die dieses Template nutzen an. Wenn kein Wert angegeben wird, wird kein Timeout gesetzt.
fr: Permet de spécifier une durée maximale avant suppression de l'acquittement pour les acquittements pour cet hôte ou les hôtes héritants de ce modèle. Laisser vide pour ne pas spécifier de durée maximale.

source: Define an optional URL that can be used to provide more information about the host. Any valid URL can be used. This can be very useful if you want to make detailed information on the host, emergency contact methods, etc. available to other support staff.
de: Geben Sie eine optionale URL an, unter der weitere Informationen zu dem Host verfügbar sind. Jede valide URL kann genutzt werden. Diese Option ist nützlich, um detaillierte Informationen zu dem Host oder Notfallkontakten für andere Supportmitarbeiter zur Verfügung zu stellen.
fr: Définit une URL optionnelle qui peut être utilisée afin de fournir plus d'informations à propos de l'hôte. N'importe quelle URL valide peut être utilisée. Cela peut s'avérer très utile si vous souhaitez mettre à disposition des informations détaillées sur l'hôte, les contacts pour les procédures d'urgence, etc. aux autres personnes de l'équipe support.

source: Define an optional string of notes pertaining to the host.
de: Optionale Notizen zum Host.
fr: Définie des notes optionnelles concernant cet hôte.

source: Define an optional URL that can be used to provide more actions to be performed on the host. You will see the link to the action URL in the host details.
de: Geben Sie eine optionale URL an, unter der weitere Aktionen für diesen Host verfügbar sind. Die Link zur Aktionen-URL wird in den Host-Details angezeigt.
fr: Définie une URL optionnelle qui peut être utilisée afin de fournir plus d'actions à effectuer sur l'hôte. Vous verrez le lien dans les détails de l'hôte.

source: Define the image that should be associated with this host here. This image will be displayed in the various places. The image will look best if it is 40x40 pixels in size.
de: Definieren Sie hier das Bild, das diesem Host zugeordnet werden soll. Dieses Bild wird an den verschiedenen Stellen angezeigt. Das Bild sieht am besten aus, wenn es 40x40 Pixel groß ist.
fr: Définie l'image qui devrait être associée avec cet hôte. Cette image sera affichée à différents endroits. L'image aura un meilleur rendu si elle fait 40x40 pixels.

source: Define an optional string that is used in the alternative description of the icon image.
de: Definieren Sie eine optionale Zeichenfolge, die in der alternativen Beschreibung des Icons verwendet wird. Dieser Text wird nur angezeigt, wenn das Bild nicht verfügbar ist.
fr: Définit une chaîne optionnelle qui sera utilisée dans la description alternative de l'image.

source: Define the VRML image that should be associated with this host. This image will be used as the texture map for the specified host in the 3D statuswrl CGI in monitoring engine.
fr: Défini l'image VRML qui devrait être associé à cet hôte. Cette image sera utilisée comme logo pour l'hôte spécifié dans le CGI statuswrl 3D du moteur de supervision.

source: Define an image that should be associated with this host in the statusmap CGI in monitoring engine. You can choose a JPEG, PNG, and GIF image. The GD2 image format is preferred, as other image formats must be converted first when the statusmap image is generated. The image will look best if it is 40x40 pixels in size.
de: Definieren Sie hier das Bild, das diesem Host in der CGI-Statusmap in der Monitoring Engine zugeordnet werden soll. Verfügbare Formate sind JPEG, PNG und GIF. Das GD2-Bildformat ist präferiert. Andere Formate müssen bei Erzeugung der Statusmap erst konvertiert werden. Das Bild sieht am besten aus, wenn es 40x40 Pixel groß ist.
fr: Définit une image qui devrait être associé à cet hôte dans le CGI statusmap dans le moteur de supervision. Vous pouvez choisir une image JPEG, PNG et GIF. Le format d'image GD2 est préférable, comme d'autres formats d'images doivent être convertis en premier lorsque l'image statusmap est généré. L'image aura une meilleur résolution si elle à une taille de 40x40 pixels.

source: Geographical coordinates use by Centreon Map module to position element on map. Define "Latitude,Longitude", for example for Paris coordinates set "48.51,2.20"
de: Geographische Koordinaten die von Centreon Map zur Positionierung eines Elements auf der Karte verwendet werden. Geben Sie diese im Format "Breitengrad,Längengrad" an (z.B. für Paris: "48.51,2.20")
fr: Coordonnées géographiques utilisées par le module Centreon Map pour positionner les éléments. Exprimées en "Latitude,Longitude", par exemple pour les coordonnées de Paris saisir "48.51,2.20"

source: Define the coordinates to use when drawing the host in the statusmap CGI. Coordinates should be given in positive integers, as they correspond to physical pixels in the generated image. The origin for drawing (0,0) is in the upper left hand corner of the image and extends in the positive x direction (to the right) along the top of the image and in the positive y direction (down) along the left hand side of the image. For reference, the size of the icons drawn is usually about 40x40 pixels (text takes a little extra space). The coordinates you specify here are for the upper left hand corner of the host icon that is drawn. Note: Don't worry about what the maximum x and y coordinates that you can use are. The CGI will automatically calculate the maximum dimensions of the image it creates based on the largest x and y coordinates you specify.
de: Definieren Sie hier die Koordinaten, die verwendet werden sollen, um den Host auf der CGI-Statusmap anzuzeigen. Koordinaten sollten als positive Integer angegeben werden, da diese den tatsächlichen Pixeln im generierten Bild entsprechen. Der Ausgangspunkt (0,0) ist die obere linke Ecke. Die positive X-Richtung verläuft nach rechts entlang der oberen Kante des Bilds. Die positive Y-Richtung verläuft nach unten entlang der linken Seite des Bilds. Als Referenzwert: Icons werden normalerweise mit einer Größe von 40x40 Pixeln angezeigt (Text benötigt etwas zusätzlichen Platz). Die Koordinaten die hier angegeben werden, entsprechen der Position der oberen linken Ecke des Host-Icons. Hinweis: Sie müssen sich keine Gedanken darüber machen, welcher maximale X- und Y-Wert genutzt werden kann. Die CGI-Statusmap errechnet automatisch die maximalen Dimensionen des Bilds auf Basis der höchsten X- und Y-Koordinaten, die von Ihnen angegeben werden.
fr: Cette variable est utilisée pour définir les coordonnées à utiliser pour l'hôte dans le CGI statusmap. Les coordonnées doivent être données en entier positif car ils correspondent aux pixels dans l'image générée. Le départ de la carte (0,0) se trouve dans le coin supérieur gauche de l'image et s'étend en positif dans la direction x (à droite) à partir du haut de l'image et en positif dans la direction y (bas) à partir du bord gauche de l'image. Pour référence, la taille des icônes est habituellement de 40x40 pixels (le texte prend un peu d'espace supplémentaire). Les coordonnées que vous précisez ici sont pour le coin supérieur gauche de l'icône de l'hôte à dessiner. Note: Ne vous inquiétez pas du nombre maximal de coordonnées que vous pouvez utiliser ici. Le CGI va automatiquement calculer les dimensions maximales de l'image qu'il crée en se basant sur les plus grandes valeurs x et y que vous avez précisé.

source: Define the coordinates to use when drawing the host in the statuswrl CGI. Coordinates can be positive or negative real numbers. The origin for drawing is (0.0,0.0,0.0). For reference, the size of the host cubes drawn is 0.5 units on each side (text takes a little more space). The coordinates you specify here are used as the center of the host cube.
de: Definieren Sie hier die Koordinaten, die verwendet werden sollen, um den Host auf der CGI-Statuswrl anzuzeigen. Die Koordinaten können sowohl positiven wie auch negativen reellen Zahlen entsprechen. Als Referenzwert: Host-Würfel werden normalerweise mit einer Größe von 0.5 Einheiten auf jeder Seite angezeigt (Text benötigt etwas zusätzlichen Platz). Die hier angegebenen Koordinaten werden als Mitte des Host-Würfels genutzt.
fr: Définit les coordonnées de l'hôte à utiliser dans le CGI statuswrl. Les coordonnées peuvent être des nombres positifs ou négatifs. Le départ du dessin est (0.0,0.0,0.0). Pour référence, la taille des cubes pour les hôtes est de 0,5 unités de chaque côté. Les coordonnées que vous utilisez sont le centre du cube de l'hôte.

source: Severity level use to sort issue in Monitoring menu.
de: Schweregrad, der für die Sortierung von Problemen im Überwachungsmenü genutzt wird.
fr: Criticité, utilisée pour trier les objets dans le menu de Supervision.

source: This is required so that you can access your host after creation. Some selected resource groups may contain filter, thus still preventing you from seeing the new host. In this case, make sure to link your Host to a Host Category.
de: Dieser Wert ist Voraussetzung, damit auf den Host nach der Erstellung zugegriffen werden kann. Einige der ausgewählten Ressourcengruppen könnten Filter enthalten, wodurch der neue Host ggf. nicht angezeigt wird. In diesem Fall sollte sichergestellt werden, dass der Host mit einer Host-Kategorie verbunden ist.
fr: Ce paramètre est nécessaire pour accéder à l'hôte après sa création car votre compte est soumis à des contrôles d'accès. Dans le cas contraîre, seuls des comptes administrateur de Centreon web pourront voir et modifier cet hôte.

source: Macros are used as object-specific variables/properties, which can be referenced in commands and extended infos. Example: a macro named MACADDRESS can be referenced as $_HOSTMACADDRESS$.
de: Makros werden als objektspezifische Variablen bzw. Werte genutzt, die in Befehlen und erweiterten Informationen verwendet werden können. Beispiel: Ein Makro mit dem Namen MACADDRESS kann mit $_HOSTMACADDRESS$ referenziert werden.
fr: Les macros sont utilisées comme des variables/propriétés spécifiques, qui peuvent être utilisées dans les commandes et les informations supplémentaires. Exemple : une macro nommée MACADDRESS pourra être référencée comme $_HOSTMACADDRESS$.

source: This directive is used to define an alternate name that should be displayed in the web interface for this host. If not specified, this defaults to the value you specify as host name.
de: Dieser Wert wird dazu verwendet, einen alternativen Namen für diesen Host festzulegen, der im Web-Interface angezeigt werden soll. Wenn dieser Wert nicht angegeben wird, wird der Hostname als Standard verwendet.
fr: Cette directive est utilisée afin de définir un nom alternatif qui pourrait être affiché dans l'interface web pour cet hôte. Si non spécifié, le nom de l'hôte sera utilisé par défaut.

source: This directive is used to determine what host states the flap detection logic will use for this host.
de: Dieser Wert wird dazu verwendet festzulegen, welche Host-Status die Flackern-Status-Erkennung für diesen Host nutzt.
fr: Cette directive est utilisée afin de déterminer quels états d'hôte la détection de bagotage utilisera pour cet hôte.

source: By default monitoring engine will assume that all hosts are in UP states when it starts. You can override the initial state for a host by using this directive.
de: Standardmäßig nimmt die Monitoring Engine an, dass sich alle Hosts im verfügbar Status befinden, wenn diese startet. Dieses Verhalten kann überschrieben werden, indem hier der gewünschte Host-Status angegeben wird.
fr: Par défaut le moteur de supervision supposera que tous les hôtes sont dans un état UP lorsqu'il démarre. Vous pouvez écraser l'état initial pour un hôte en utilisant cette directive.

source: Name used for service in auto-deploy by template.
de: Name der für diesen Services verwendet wird, wenn dieser automatisch über ein Template erstellt wird.
fr: Nom utilisé pour le service en auto-déploiement par modèle.

source: Define the description of the service. It may contain spaces, dashes, and colons (semicolons, apostrophes, and quotation marks should be avoided). Services must have a unique description on a per host basis.
de: Legen Sie eine Beschreibung für diesen Service fest. Die Beschreibung kann Leerzeichen, Dashes und Punkte enthalten (Semikolon, Apostrophes und Anführungszeichen sollten vermieden werden). Servicebeschreibungen müssen auf Hostebene einzigartig sein.
fr: Définit la description du service. Il peut contenir des espaces, des tirets et deux-points (points-virgules, apostrophes et les guillemets doivent être évités). Les services doivent avoir une description unique par hôte sur lesquels ils se basent.

source: This is where you specify the name of the template object that you want to inherit properties/variables from. Inherited properties doesn't need to be specified again. "Local" object variables always take precedence over variables defined in the template object. Objects can inherit properties/variables from multiple levels of template objects. When defining multiple sources, the first template specified takes precedence over the later one, in the case where a property is defined in both.
de: Mit dieser Option wird das Template festgelegt, von dem Einstellungen bzw. Variablen geerbt werden sollen. Vererbte Einstellungen müssen nicht erneut angegeben werden. "Lokale" Objektvariablen haben stets Priorität über Variablen, die durch das Template vererbt wurden. Objekte können Einstellungen bzw. Variablen von mehreren Ebenen von Templates vererbt werden. Wenn mehrere Templates angegeben werden und eine Option in beiden definiert ist, erhält das zuerst angegebene Template Priorität über den später hinzugefügten.
fr: C'est ici que vous indiquez le nom du modèle que vous souhaitez hériter des propriétés/variables. Les propriétés héritées n'ont pas besoin d'être spécifiés à nouveau. Les variables "locales" ont toujours autorité sur les variables définies dans un modèle. Les objets peuvent hériter des propriétés/variables de multiples niveaux de modèles. Lors de la définition de plusieurs sources, le premier modèle spécifiée a autorité sur le dernier, dans le cas où une propriété est définie dans les deux à fois.

source: This directive is used to denote whether the service is "volatile". A volatile service resets its state to OK with every query. Services are normally not volatile.
de: Legt fest, ob dieser Service als "volatil" deklariert wird. Ein volatiler Service setzt seinen Status mit jeder Abfrage auf OK zurück. Services sind üblicherweise nicht volatil.
fr: Cette directive est utilisée pour préciser si le service est "volatile". Un service volatile réinitialise son état à OK à chaque requête. Les services ne sont normalement pas volatiles.

source: Specify the time period during which active checks of this service can be made.
de: Geben Sie den Zeitraum an, in der aktive Überprüfungen für diesen Service ausgeführt werden können.
fr: Spécifie la période de temps pendant laquelle les contrôles actifs sur ce service seront faits.

source: Specify the command that monitoring engine will run in order to check the status of the service.
de: Geben Sie den Befehl an, den die Monitoring Engine nutzt, um den Status eines Service zu überprüfen.
fr: Spécifie la commande que le moteur de supervision exécutera afin de vérifier le statut du service.

source: Specify the parameters for the selected check command here.
de: Geben Sie die Parameter für den Überprüfungsbefehl an.
fr: Spécifie les paramètres pour la commande de surveillance sélectionnée ici.

source: Define the number of times that monitoring engine will retry the service check command if it returns any state other than an OK state. Setting this value to 1 will cause monitoring engine to generate an alert without retrying the service check again. (default value: 0)
de: Definieren Sie, wie oft die Monitoring Engine den Service-Überprüfungsbefehl wiederholt, wenn er einen anderen Status als OK zurückgibt. Wenn Sie diesen Wert auf 1 setzen, generiert die Monitoring Engine einen Alert, ohne die Service-Überprüfung erneut auszuführen. (Standardwert: 0)
fr: Défini le nombre de fois où le moteur de supervision réessayera la commande de contrôle du service s'il retourne n'importe quel autre état qu'un état OK. Fixer cette valeur à 1générera une alerte sans nouvelle tentative. (par défaut : 0)
