Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: Downtime command sent
fr: Commande de configuration de plage de maintenance envoyée

source: Check command sent
fr: Commande de contrôle envoyée

source: Type of resource
fr: Type de ressource

source: Unhandled problems
fr: Problèmes non acquittés

source: Oops, something went wrong
fr: Oups, quelque chose s'est mal passé

source: Seems that your Apache configuration is not up-to-date
fr: Il semble que votre configuration Apache ne soit pas à jour

source: Contact your Centreon administrator or update the following file
fr: Contactez votre administrateur Centreon ou mettez à jour le fichier suivant

source: See Documentation
fr: Voir la documentation

source: Services will not be affected because you don't have sufficient permission
fr: Les services ne seront pas affectés car vous ne disposez pas de droits suffisants

source: Hosts will not be affected because you don't have sufficient permission
fr: Les hôtes ne seront pas affectés car vous ne disposez pas de droits suffisants

source: Protocol %s is not allowed
de: Das Protokoll %s ist nicht zulässig
fr: Le protocole %s n'est pas autorisé

source: The port can only be between 0 and 65535 inclusive
de: Der Port muss zwischen 0 und 65535 (inklusive) liegen
fr: Le port ne peut être compris qu'entre 0 et 65535 inclus

source: No results found
fr: Aucun résultat trouvé

source: Error when decoding sent data
de: Fehler bei der Dekodierung der gesendeten Daten
fr: Erreur lors du décodage des données envoyées

source: Error when retrieving selected options
de: Fehler beim Ermitteln der ausgewählten Optionen
fr: Erreur lors de la récupération des options selectionnées

source: Filter id %d not found
de: Filter id %d konnte nicht gefunden werden
fr: Filtre id %s non trouvé

source: Filter already exists
de: Der Filter existiert bereits
fr: Le filtre existe déjà

source: Error when adding filter %s
de: Fehler beim Hinzufügen des Filters %s
fr: Erreur lors de l'ajout du filtre %s

source: Error when updating filter %s
de: Fehler beim Aktualisieren des Filters %s
fr: Erreur lors de la mise à jour du filtre %s

source: Error when deleting filter %s
de: Fehler beim Löschen des Filters %s
fr: Erreur lors de la suppression du filtre %s

source: Error when searching filters
de: Fehler bei der Suche von Filtern
fr: Erreur lors de la recherche des filtres

source: Error when searching filter id %d
de: Fehler bei der Suche des Filters mit ID %d
fr: Erreur lors de la recherche du filtre id %d

source: Save filter
fr: Sauvegarder le filtre

source: Save as new
fr: Créer un nouveau filtre

source: My filters
fr: Mes filtres

source: New filter
fr: Nouveau filtre

source: Filter created
fr: Filtre créé

source: Filter saved
fr: Filtre sauvegardé

source: Edit filters
fr: Éditer les filtres

source: Rename
fr: Renommer

source: Delete filter?
fr: Supprimer le filtre?

source: Filter deleted
fr: Filtre supprimé

source: Filter updated
fr: Filtre actualisé

source: Name cannot be empty
fr: Le nom ne peut pas être vide

source: Timeline
fr: Historique

source: by
fr: par

source: Notification sent to
fr: Notification envoyée à

source: Unable to convert in remote server, no Central to link provided
fr: Impossible de convertir en remote, aucun Central à lier renseigné

source: Unable to update the platform information
fr: Impossible de mettre à jour les informations de la plateforme

source: An error occured while converting your platform
fr: Une erreur est survenue lors de la conversion de la plateforme

source: An error occured while searching any remote children
fr: Une erreur est survenue lors de la recherche de remote enfants

source: An error occured while your platform update
fr: Une erreur est survenue lors de la mise à jour de la platforme

source: An error occured while disabling the central menus
fr: Une erreur est survenue lors de la désactivation des menus du central

source: An error occured while enabling the central menus
fr: Une erreur est survenue lors de l'activation des menus du central

source: An error occured while updating the platform topology
fr: Une erreur est survenue lors de la mise à jour de la topology de la plateforme

source: Your Central is linked to another remote(s), conversion in Remote isn't allowed
de: Der zentrale Server ist mit (einer) anderen Remote-Plattforme(n) verbunden, eine Umwandlung in Remote ist nicht zulässig
fr: Votre central est lié a d'autre remote(s), la conversion en Remote n'est pas autorisée

source: Additional properties are not allowed
fr: Les propriétés additionnelles ne sont pas autorisées

source: Nullable property is not allowed
fr: Les propriétés nullable ne sont pas autorisées

source: Missing required property: %s
fr: propriété requise manquante: %s

source: Invalid property type %s for %s, type %s expected
fr: Type de propriétés invalide %s pour %s, type %s attendu

source: Bad JSON schema format
fr: Mauvais format de JSON schema

source: Bad JSON schema path
fr: Mauvais chemin de JSON Schema

source: the address %s is already used in the topology and can't be provided as Central Server Address
de: Die Adresse %s ist bereits in Nutzung in der Topologie und kann nicht als Adresse des zentralen Servers verwendet werden
fr: l'adresse %s est déjà utilisé dans la topology et ne peut pas être renseigné comme Adresse de Serveur Central

source: the address %s is already used has proxy address and can't be provided as Central Server Address
de: Die Adresse %s ist bereits als Proxy-Adresse eingetragen und kann nicht als Adresse des zentralen Servers verwendet werden
fr: l'adresse %s est déjà utilisé comme addresse de proxy et ne peut pas être renseigné comme Adresse de Serveur Central

source: The address '%s' of '%s' is not valid or not resolvable
de: Die Adresse '%s' von '%s' ist ungültig bzw. kann nicht aufgelöst werden
fr: L'adresse '%s' de la plateforme '%s' n'est pas valide ou ne peut être résolue

source: The platform type of '%s'@'%s' is not consistent
de: Der Plattformtyp von '%s'@'%s' ist nicht konsistent
fr: Le type de la plateforme '%s'@'%s' n'est pas cohérent

source: The address of the parent platform '%s'@'%s' is not consistent
fr: L'adresse de la plateforme parente '%s'@'%s' n'est pas cohérente

source: A platform using the name : '%s' or address : '%s' already exists
de: Eine Plattform mit dem Namen: '%s' oder der Adresse: '%s' existiert bereits
fr: Une plateforme avec le nom : '%s' ou l'adresse : '%s' existe déjà

source: No parent platform was found for : '%s'@'%s'
de: Für '%s'@'%s' konnte keine übergeordnete Plattform gefunden werden
fr: Aucune plateforme parente n'a été trouvée pour : '%s'@'%s'

source: Cannot register the '%s' platform : '%s'@'%s' behind a '%s' platform
de: Die '%s' Plattform: '%s'@'%s' kann nicht hinter einer '%s' Plattform registriert werden
fr: Impossible d'enregistrer la plateforme '%s' : '%s'@'%s' derrière un '%s'

source: Error when adding in topology the platform : '%s'@'%s'
de: Fehler beim Hinzufügen der Plattform: '%s'@'%s' zur Topologie
fr: Erreur lors de l'ajout dans la topologie de la plateforme : '%s'@'%s'

source: Cannot use parent address on a Central server type
de: Für einen zentralen Server kann keine übergeordnete Adresse angegeben werden
fr: Il n'est pas possible d'utiliser l'adresse d'une plateforme parente sur un serveur de type Central

source: Cannot set parent id on a central server
fr: Il n'est pas possible d'assigner un id parent à un serveur central

source: Cannot link a 'remote': '%s'@'%s' to another Remote server type
fr: Il n'est pas possible de lier un 'remote': '%s'@'%s' à un autre serveur de type 'Remote'

source: A '%s': '%s'@'%s' is already saved
de: Ein '%s': '%s'@'%s' wurde bereits gespeichert
fr: Un '%s': '%s'@'%s' est déjà enregistré

source: The server type '%s' : '%s'@'%s' does not match the one configured in Centreon or is disabled
de: Der Servertyp '%s': '%s'@'%s' entspricht nicht dem in Centreon konfigurierten oder ist deaktiviert
fr: Le serveur du type '%s' : '%s'@'%s' ne correspond pas à celui configuré dans Centreon ou est désactivé

source: Missing mandatory parent address, to link the platform : '%s'@'%s'
de: Fehlende erforderliche übergeordnete Adresse, um die Plattform zu verbinden: '%s'@'%s'
fr: Adresse du server parent manquante, pour pouvoir lier la plateforme : '%s'@'%s'

source: Missing mandatory platform address of: '%s'
de: Fehlende erforderliche Plattformadresse von: '%s'
fr: Adresse de la plateforme: '%s' manquante

source: Missing mandatory platform name
de: Fehlender erforderlicher Plattformname
fr: Nom de la plateforme manquant

source: Same address and parent_address for platform : '%s'@'%s'
de: Die Adresse (address) und übergeordnete Adresse (parent_address) sind identisch für die Plattform: '%s'@'%s'
fr: Les adresses de la plateforme : '%s'@'%s' et de son parent sont les mêmes

source: Central platform's API port is not consistent. Please check the 'Remote Access' form.
fr: Le port de l'API vers le Central n'est pas cohérent. Veuiller vérifier le formulaire 'Accès du Remote'.

source: At least one illegal character in '%s' was found in platform's name: '%s'
de: Mindestens ein nicht zulässiges Zeichen aus '%s' wurde im Plattformnamen gefunden: '%s'
fr: Au moins un caractère illégal parmi '%s' a été trouvé dans le nom de la plateforme: '%s'

source: At least one non RFC compliant character was found in platform's hostname: '%s'
de: Mindestens ein Zeichen, dass nicht der RFC entspricht, wurde im Plattformhostnamen gefunden: '%s'
fr: Au moins un caractère ne respecte pas la norme RFC dans le nom de domaine de la plateforme: '%s'

source: Platform : '%s'@'%s' mandatory data are missing. Please check the Remote Access form
de: Plattform: '%s'@'%s' erforderliche Daten fehlen. Bitte überprüfen Sie das 'Fernzugriff'-Formular
fr: Données indispensables manquantes pour la plateforme : '%s'@'%s'. Veuillez vérifier le formulaire 'Accès du Remote'

source: Central platform's data are not consistent. Please check the 'Remote Access' form
fr: Des données de la plateforme ne sont pas cohérentes. Veuillez vérifier le formulaire 'Accès du Remote'.

source: Unable to retrieve platform information's data.
de: Die Plattforminformationsdaten konnten nicht gefunden werden.
fr: Impossible de récupérer les données d'information sur la plateforme.

source: Unable to find local monitoring server name
de: Der lokale Monitoring Servername konnte nicht gefunden werden
fr: Impossible de trouver le nom du serveur local de supervision

source: Error when searching monitoring server name
fr: Erreur lors de la recherche du nom du serveur de supervision

source: The platform: '%s'@'%s' is not declared as a 'remote'
de: Die Plattform: '%s'@'%s' ist nicht als 'remote' deklariert
fr: La plateforme: '%s'@'%s' n'est pas déclarée comme un 'remote'

source: The platform: '%s'@'%s' is not linked to a Central. Please use the wizard first
de: Die Plattform: '%s'@'%s' is nicht mit dem zentralen Server verbunden. Bitte verwenden Sie zuerst den Einrichtungsassistent
fr: La plateforme: '%s'@'%s n'est pas liée à un Central. Veuillez d'abord utiliser l'assistant

source: Central's protocol port is missing on: '%s'@'%s'. Please check the Remote Access form
de: Auf '%s'@'%s' fehlt der Protokollport des zentralen Servers. Bitte überprüfen Sie das 'Fernzugriff'-Formular
fr: Le port du Central, de la plateforme: '%s'@'%s est manquant. Veuillez vérifier le formulaire 'Accès du Remote'

source: Central's protocol scheme is missing on: '%s'@'%s'. Please check the Remote Access form
de: Auf '%s'@'%s' fehlt das Protokollschema des zentralen Servers. Bitte überprüfen Sie das 'Fernzugriff'-Formular
fr: Le schéma du Central, de la plateforme: '%s'@'%s est manquant. Veuillez vérifier le formulaire 'Accès du Remote'

source: Central's path is missing on: '%s'@'%s'. Please check the Remote Access form.
fr: Le chemin vers le Central, de la plateforme: '%s'@'%s est manquant. Veuillez vérifier le formulaire 'Accès du Remote'.

source: Central's credentials are missing on: '%s'@'%s'. Please check the Remote Access form
de: Auf '%s'@'%s' fehlen die Anmeldeinformationen des zentralen Servers. Bitte überprüfen Sie das 'Fernzugriff'-Formular
fr: Les identifiants du Central sont manquants pour: '%s'@'%s'. Veuillez vérifier le formulaire 'Accès du Remote'

source: Unable to decipher central's credentials. Please check the credentials in the 'Remote Access' form
de: Die Anmeldeinformationen des zentralen Servers konnten nicht entschlüsselt werden. Bitte überprüfen Sie die Zugangsdaten in dem 'Fernzugriff'-Formular
fr: Impossible de déchiffrer les identifiants du Central. Veuillez vérifier le formulaire 'Accès du Remote'

source: Failed to get the auth token from Central : '%s'
fr: Echec d'obtention du token d'auth. sur le Central: '%s'@'%s'

source: The platform: '%s'@'%s' cannot be found on the Central
de: Die Plattform: '%s'@'%s' kann nicht auf dem zentralen Server gefunden werden
fr: La plateforme: '%s'@'%s' ne peut pas être trouvé sur le Central

source: The platform: '%s'@'%s' cannot be delete from the Central
de: Die Plattform: '%s'@'%s' kann nicht vom zentralen Server gelöscht werden
fr: La plateforme: '%s'@'%s' ne peut pas être supprimé depuis le Central

source: Request to the Central's API failed
de: Bei der Anfrage an die API des zentralen Servers ist ein Fehler aufgetreten
fr: Echec de la requète vers l'API du Central

source: API calling the Central returned a Client exception
de: Der API-Aufruf zum zentralen Server hat eine Client-Ausnahme zurückgegeben
fr: L'API du Central a renvoyé une exception Client

source: API calling the Central returned a Redirection exception
de: Der API-Aufruf zum zentralen Server hat eine Umleitungs-Ausnahme zurückgegeben
fr: L'API du Central a renvoyé une exception de Redirection

source: API calling the Central returned a Server exception
de: Der API-Aufruf zum zentralen Server hat eine Server-Ausnahme zurückgegeben
fr: L'API du Central a renvoyé une exception Server

source: Please check the 'Centreon UI' and 'Remote access' forms
fr: Veuillez vérifier les formulaires 'Centreon Web' et 'Accès du Remote'

source: Unable to decode Central's API response
de: Die API-Antwort vom zentralen Server konnte nicht decodiert werden
fr: Impossible de décoder la réponse de L'API provenant du Central

source: Error from Central's register API :
fr: Erreur de l'API d'enregistrement sur le Central :

source: The platform: '%s'@'%s' cannot be added to the Central linked to this Remote
de: Die Plattform: '%s'@'%s' kann nicht zu dem zentralen Server, der mit diesem Remote-Server verbunden ist, hinzugefügt werden
fr: La plateforme: '%s'@'%s' ne peut pas être ajoutée au Central lié à ce Remote

source: Central's response :
fr: Réponse du Central :

source: Unable to find the encryption key. Please check the '.env.local.php' file.
fr: Impossible de trouver la clef de déchiffrement. Veuillez vérifer le fichier '.env.local.php'.

source: No Platform Topology found.
de: Keine Plattformtopologie gefunden.
fr: Aucune Topologie trouvée.

source: No top level platform found to link the child platforms
de: Es wurde keine Top-Level-Plattform gefunden, mit der die untergeordneten Plattformen verbunden werden können
fr: Aucune platforme principale trouvée pour lier les plateformes enfants

source: An error occurred while deleting the platform
de: Fehler beim Löschen der Plattform
fr: Une erreur est survenue lors de la suppression de la plateforme

source: An error occurred while updating the platform
de: Fehler beim Aktualisieren der Plattform
fr: Une erreur est survenue lors de la mise à jour de la plateforme

source: platform not found
fr: plateforme non trouvée

source: The platform '%s'@'%s' cannot be found on the Central
de: Die Plattform '%s'@'%s' kann nicht auf dem zentralen Server gefunden werden
fr: La plateforme '%s'@'%s' n'a pas été trouvée sur le Central

source: You are not authorized to access this resource
fr: Vous n'êtes pas autorisé à accéder à cette ressource

source: Shortcuts
fr: Raccourcis

source: View logs
fr: Voir les logs

source: Configure
fr: Configurer

source: View report
fr: Voir le rapport

source: An error occurred while retrieving users linked to ViewId on database
de: Beim Ermitteln von mit der Ansichts-ID (ViewId) verknüpften Benutzern auf der Datenbank ist ein Fehler aufgetreten
fr: Une erreur est survenue lors de la récupération en DB des utilisateurs liés à ViewId

source: An error occurred while retrieving groups linked to ViewId on database
de: Beim Ermitteln von mit der Ansichts-ID (ViewId) verknüpften Gruppen auf der Datenbank ist ein Fehler aufgetreten
fr: Une erreur est survenue lors de la récupération en DB des groupes liés à ViewId

source: Resources Status
de: Ressourcenstatus
fr: Statut des ressources

source: Error when searching for services by host
de: Fehler bei der Suche von Services pro Host
fr: Erreur lors de la recherche de services par hôte

source: The host id cannot be null
de: Die Host-ID kann nicht NULL sein
fr: L'id de l'hôte ne peut pas être nul

source: Error when searching for host templates
de: Fehler bei der Suche von Hosttemplates
fr: Erreur lors de la recherche de modèles d'hôtes

source: The public method %s::%s was not found
de: Die öffentliche Methode %s::%s wurde nicht gefunden
fr: La méthode publique %s::%s n'a pas été trouvée

source: The public method %s::%s has no parameters
de: Die öffentliche Methode %s::%s hat keine Parameter
fr: La méthode publique %s::%s n'a pas de paramètres

source: This host is not a host template
de: Dieser Host ist kein Hosttemplate
fr: Cet hôte n'est pas un modèle d'hôte

source: Error when searching for host and related service templates
de: Fehler bei der Suche nach dem Host und verbundenen Service-Templates
fr: Erreur lors de la recherche d'hôtes et de modèles de service liés

source: deprecated
fr: déprécié

source: Show deprecated pages
fr: Afficher les pages dépréciées

source: Error when adding services to the host %d
de: Fehler beim Hinzufügen von Service zum Host %d
fr: Erreur lors de l'ajout de services à l'hôte %d

source: Error when changing host status (%d to %s)
de: Fehler beim Ändern des Hoststatus (%d auf %s)
fr: Erreur lors du changement de statut de l'hôte (%d à %s)

source: Error when searching for already used host names
de: Fehler bei der Suche nach bereits genutzten Hostnamen
fr: Erreur lors de la recherche de noms d'hôtes déjà utilisés

source: Cannot build uri to unknown tab : %s
de: Die URI zum unbekannten Tab %s kann nicht erstellt werden
fr: Impossible de construire une uri vers un onglet inconnu : %s

source: Copy the link to this resource
fr: Copier le lien vers cette ressource

source: Resource link copied to the clipboard
fr: Lien vers la ressource copiée dans le presse-papier

source: The password cannot be crypted. Please re-submit the form
de: Das Passwort konnte nicht verschlüsselt werden. Bitte speichern Sie das Formular erneut
fr: Le mot de passe ne peut pas être chiffré. Merci de soumettre à nouveau le formulaire

source: The password cannot be decrypted. Please re-enter the account password and submit the form
de: Das Passwort kann nicht entschlüsselt werden. Bitte geben Sie das Benutzerkontopasswort erneut ein und speichern Sie das Formular erneut ab
fr: Le mot de passe ne peut pas être déchiffré. Merci de vérifier ce champs et de soumettre le formuaire

source: Central's API credentials
de: API-Anmeldeinformationen des zentralen Servers
fr: Identifiants de l'API du Central

source: Build full URI (SCHEME://IP:PORT/PATH).
de: Vollständige Build-URI (SCHEMA://IP:PORT/PFAD).
fr: construction de l'URI complete (SCHEME://IP:PORT/PATH).

source: Central's API URI.
fr: URI de l'API du central

source: Allow self signed certificate.
fr: Autoriser le certificat auto-signé.

source: Must be a number between 1 and 65335 included.
de: Muss eine Zahl zwischen 1 und 65335 inklusive sein.
fr: Doit être un nombre compris entre 1 et 65335 inclus

source: Remote access
de: Remotezugriff
fr: Accès du Remote

source: Disacknowledge services attached to hosts
fr: Désacquitter les services attachés aux hôtes

source: Disacknowledgement command sent
fr: Commande de désacquittement envoyée

source: Unable to find the Engine configuration
de: Die Engine-Konfiguration kann nicht gefunden werden
fr: Impossible de trouver la configuration du moteur de supervision

source: Ip address can not be empty
fr: L'adresse IP ne peut pas être vide

source: Monitoring server is not correctly defined
de: Monitoring Server ist nicht korrekt definiert
fr: Le serveur de supervision n'est pas correctement défini

source: Submit a status
fr: Soumettre un statut

source: Status submitted
fr: Statut soumis

source: No resource found
fr: Pas de ressource trouvée

source: Error when searching for the Engine configuration (%s)
de: Fehler bei der Suche nach der Engine-Konfiguration (%s)
fr: Erreur lors de la recherche de la configuration du moteur (%s)

source: Host id cannot be null
de: Die Host-ID kann nicht NULL sein
fr: L'id de l'hôte ne peut être nul

source: Host name cannot be null
de: Der Hostname kann nicht NULL sein
fr: Le nom de l'hôte ne peut être nul

source: Action log id cannot be null
de: Aktionsprotokoll-ID kann nicht NULL sein
fr: L'id du journal des actions ne peut être nul

source: Error when adding details for the action log %d
de: Fehler beim Hinzufügen von Details für das Aktionsprotokoll %d
fr: Erreur lors de l'ajout de détails pour le journal des actions %d

source: Error when adding an entry in the action log
de: Fehler beim Hinzufügen eines Eintrags in das Aktionsprotokoll
fr: Erreur lors de l'ajout d'une entrée dans le journal des actions

source: FQDN / Address
fr: FQDN / Adresse

source: Service id cannot be null
de: Die Service-ID kann nicht NULL sein
fr: L'id du service ne peut pas être nul

source: Configuration has changed
de: Die Konfiguration hat sich geändert
fr: La configuration a changé

source: Macro passwords cannot be detected
de: Makro-Passwörter können nicht erkannt werden
fr: Les macros de type mot de passe ne peuvent pas être détectées

source: Configuration command cannot be splitted by macros
de: Konfigurationsbefehl kann nicht von Makros aufgeteilt werden
fr: La commande de configuration ne peut être séparée par macros

source: Unable to hide passwords in command (Reason: %s)
de: Die Passwörter im Befehl konnten nicht entfernt werden (Begründung: %s)
fr: Impossible de cacher les mots de passe dans la commande (Raison: %s)

source: Check command of host id %d not found
de: Überprüfungsbefehl des Hosts mit ID %d konnte nicht gefunden werden
fr: Commande de contrôle de l'id d'hôte %d non trouvée

source: Check command of service id %d not found
de: Überprüfungsbefehl des Service mit ID %d konnte nicht gefunden werden
fr: Commande de contrôle de l'id de service %d non trouvée

source: Error while searching for the command of host
de: Fehler bei der Suche des Befehls des Hosts
fr: Erreur lors de la recheche de la commande de l'hôte

source: Monitoring server
fr: Serveur de supervision

source: Error when adding a host macro
de: Fehler beim Hinzufügen eines Hostmakros
fr: Erreur lors de l'ajout d'une macro hôte

source: Error when adding a host
fr: Erreur lors de l'ajout d'un hôte

source: Error when adding a host category
de: Fehler beim Hinzufügen einer Hostkategorie
fr: Erreur lors de l'ajout d'une catégorie hôte

source: Error when adding a host group
fr: Erreur lors de l'ajout d'un groupe d'hôte

source: Check duration
fr: Temps d'exécution

source: Please choose a date before %d
de: Bitte wählen Sie ein Datum vor %d
fr: Veuillez choisir une date avant %d

source: Year must be less than %d (%s)
fr: L'année doit être inférieure à %d (%s)
