Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: _Module_ is not a legal expression
de: _Module_ ist kein gültiger Ausdruck
es: _Module_ no es una expresión permitida
fr: _Module_ n'est pas une expression autorisée
pt_pt: _Module_ não é uma expressão autorizada

source: Compulsory Address
de: Erforderliche Adresse
es: Dirección obligatoria
fr: Adresse obligatoire
pt_pt: Endereço obrigatorio

source: Access groups
de: Zugriffsgruppen
es: Grupo de acceso
fr: Groupe d'accès
pt_pt: Grupos de acesso

source: Deploy Service
de: Service bereitstellen
es: Implementar servicios
fr: Déployer les services
pt_pt: Aplica Serviço

source: Display all Services for this host
de: Alle Services für diesen Host anzeigen
es: Ver todos los servicios de este host.
fr: Afficher tous les services de cet hôte
pt_pt: Mostra todos os Serviços para este Host

source: You are not allowed to access this host category
de: Sie sind nicht dazu berechtigt, auf diese Hostkategorie zuzugreifen
es: No se le permite acceder a esta categoría de host
fr: Vous n'êtes pas autorisé à accéder à cette catégorie d'hôte
pt_pt: Você não tem permissão para acessar esta categoria de host

source: Add a host category
de: Hostkategorie hinzufügen
es: Añadir una categoría de host
fr: Ajouter une catégorie d'hôte
pt_pt: Adiciona uma categoria de host

source: Modify a host category
de: Hostkategorie bearbeiten
es: Editar una categoría de host
fr: Modifier une catégorie d'hôte
pt_pt: Modifica uma categoria de host

source: View a host category
de: Hostkategorie anzeigen
es: Ver una categoría de host
fr: Visualiser une catégorie d'hôte
pt_pt: Visualiza uma categoria de host

source: Linked Host Template
de: Verknüpfte Hosttemplates
es: Vinculado al modelo de host.
fr: Lié au modèle d'hôte
pt_pt: Modelo de Host associado

source: Host Names
de: Hostnamen
es: Nombres de invitados
fr: Noms d'hôtes
pt_pt: Nomes de Hosts

source: Dependent Host Names
de: Namen der abhängigen Hosts
es: Nombres de host relacionados
fr: Noms d'hôte liés
pt_pt: Nomes de Host dependentes

source: Values
de: Werte
es: valor
fr: Valeur
pt_pt: Valores

source: Associated pollers
de: In Verbindung stehende Poller
es: Coleccionista asociado
fr: Collecteur associé
pt_pt: Coletores associados

source: Add a Resource
de: Ressource hinzufügen
es: Agregar un recurso
fr: Ajouter une ressource
pt_pt: Adicionar um recurso

source: Modify a Resource
de: Ressource bearbeiten
es: Editar un recurso
fr: Modifier une ressource
pt_pt: Modificar um Recurso

source: View Resource
de: Ressource anzeigen
es: Ver un recurso
fr: Visualiser une ressource
pt_pt: Visualizar um Recurso

source: Resource Name
de: Ressourcenname
es: Nombre del recurso
fr: Nom de la ressource
pt_pt: Nome do Recurso

source: MACRO Expression
de: Makro-Ausdruck
es: Valor del recurso
fr: Valeur de la ressource
pt_pt: Expressão MACRO

source: Linked Instances
de: Verknüpfte Instanzen
es: Vinculado al coleccionista
fr: Lié au collecteur
pt_pt: Instancias associadas

source: Compulsory Instance
de: Erforderliche Instanz
es: Coleccionista obligatorio
fr: Collecteur obligatoire
pt_pt: Instancia obrigratoria

source: Resource used by one of the instances
de: Ressource wird von einer der Instanzen verwendet
es: Recurso utilizado por una de las instancias.
fr: Ressource utilisée par une des instances
pt_pt: Recurso usado por uma das instancias

source: Run monitoring engine debug (-v)
de: Monitoring-Engine Debugging ausführen (-v)
es: Iniciar la depuración del motor de monitoreo (-v)
fr: Lancer le débogage du moteur de supervision (-v)
pt_pt: Executa depuração do motor de monitoramento (-v)

source: Move Export Files
de: Exportdateien verschieben
es: Mover archivos generados
fr: Deplacer les fichiers générés
pt_pt: Move ficheiros exportados

source: Post generation command
de: Post-Erzeugungsbefehl
es: Comando ejecutado post-generación.
fr: Commande exécutée post-génération
pt_pt: Comando de pós geração

source: Method
de: Methode
es: método
fr: Méthode
pt_pt: Método

source: You need to select a least one polling instance.
de: Sie müssen mindestens eine Polling-Instanz auswählen.
es: Debe seleccionar al menos una instancia de colección.
fr: Vous devez sélectionner au moins une instance de collecte.
pt_pt: Você precisa selecionar ao menos uma instancia de coletor.

source: Export
es: Exportador
fr: Exporter
pt_pt: Exportar

source: Compulsory Poller
de: Erforderlicher Poller
es: Selección obligatoria del coleccionista
fr: Sélection du collecteur obligatoire
pt_pt: Coletor obrigatorio

source: Progress
de: Fortschritt
es: Progresión
fr: Progression
pt_pt: Progresso

source: Preparing environment
de: Umgebung wird vorbereitet
es: Preparación del medio ambiente
fr: Préparation de l'environnement
pt_pt: Preparando ambiente

source: Generating files
de: Dateien werden erzeugt
es: Generando archivos
fr: Génération des fichiers
pt_pt: Gerando ficheiros

source: Running debug mode
de: Debugmodus wird ausgeführt
es: Ejecutando en modo debug
fr: Exécution en mode débogage
pt_pt: Executando modo de depuração

source: Moving files
de: Dateien werden verschoben
es: Mover archivos
fr: Déplacement des fichiers
pt_pt: Movendo ficheiros

source: Restarting engine
de: Monitoring Engine wird neugestartet
es: Reinicie el planificador
fr: Redémarrage de l'ordonnanceur
pt_pt: Reiniciando motor

source: Aborted.
de: Abgebrochen.
es: Abortada.
fr: Avorté.
pt_pt: Abortado.

source: No poller selected
de: Kein Poller ausgewählt
es: Ningún satélite seleccionado
fr: Pas de satellite sélectionné
pt_pt: Nenhum coletor selecionado

source: Executing command
de: Befehl wird ausgeführt
es: Ejecución de la orden.
fr: Exécution de la commande
pt_pt: Execução de comando

source: Post execution command results
de: Ergebnisse des Post-Ausführungsbefehls
es: Resultado del comando post-generación.
fr: Résultat de la commande post-génération
pt_pt: Resultados do comando de Pós-Execução

source: Could not write into centcore.cmd. Please check file permissions.
de: Es konnte nicht in die Datei centcore.cmd geschrieben werden. Bitte überprüfen Sie die Dateiberechtigungen.
es: No se puede escribir en el archivo centcore.cmd. Compruebe los permisos en este archivo.
fr: Impossible d'écrire dans le fichier centcore.cmd. Vérifier les permissions sur ce fichier.
pt_pt: Não foi possivel escrever no ficheiro centcore.cmd, Verifique as pemissões do ficheiro.

source: <br><b>Centreon : </b>A reload signal has been sent to
de: <br><b>Centreon: </b> Ein neu laden Signal wurde gesendet an
es: <br><b>Centreon:</b> Se ha enviado un comando de recarga a
fr: <br><b>Centreon : </b>Une commande de rechargement a été envoyée vers
pt_pt: <br><b>Centreon : </b>Um sinal de recarregamento foi enviado para

source: <br><b>Centreon : </b>Cannot send signal to
es: <br><b>Centreon:</b> No se puede enviar la señal a
fr: <br><b>Centreon : </b>Impossible d'envoyer le signal vers
pt_pt: <br><b>Centreon : </b>Não foi possivel enviar o sinal para

source: <br><b>Centreon : </b>A restart signal has been sent to
de: <br><b>Centreon: </b> Ein Neustart Signal wurde gesendet an
es: <br><b>Centreon:</b> Se ha enviado un comando de reinicio a
fr: <br><b>Centreon : </b>Une commande de redémarrage a été envoyée vers
pt_pt: <br><b>Centreon : </b>Um sinal de reinicio foi enviado para

source: Could not find configuration directory '%s' for monitoring engine '%s'. Please check it's path or create it
de: Das Konfigurationsverzeichnis '%s' für die Monitoring Engine '%s' konnte nicht gefunden werden. Bitte überprüfen Sie den Pfad oder erstellen Sie diesen
es: No se pudo encontrar el directorio de configuración '%s' para el motor de supervisión '%s'. Por favor, compruebe su camino o créelo
fr: Impossible de trouver le répertoire de configuration '%s' du moteur de supervision '%s'. Merci de vérifier le chemin du répertoire ou de le créer
pt_pt: Não foi possivel encontrar o diretorio de configuração '%s' do motor de monitoramento '%s'. Por favor, verifique o caminho ou se ele existe

source: Could not write to file '%s' for monitoring engine '%s'. Please add writing permissions for the webserver's user
de: In die Datei '%s' konnte für die Monitoring Engine '%s' nicht geschrieben werden. Bitte fügen Sie Schreibberechtigungen für den Benutzer des Webservers hinzu
es: No se pudo escribir en el archivo '%s' para monitorear el motor '%s'. Por favor agregue la escritura permisos para el usuario del servidor web
fr: Impossible d'écrire dans le fichier '%s' du moteur de supervision '%s'. Merci de vérifier les permissions d'écriture pour l'utilisateur du serveur Wev
pt_pt: Não foi possivel escrever no ficheiro '%s' do motor de monitoramento '%s'. Por favor, adicione permissões de escrita do usuário do webserver no mesmo.

source: Centreon Broker's configuration directory '%s' does not exist and could not be created for monitoring engine '%s'. Please check it's path or create it
de: Das Konfigurationsverzeichnis '%s' für die Monitoring Engine '%s' existiert nicht und konnte nicht erstellt werden. Bitte überprüfen Sie den Pfad oder erstellen Sie diesen
es: El directorio de configuración de Centreon Broker '%s' no existe y no pudo ser creado para monitorear el motor '%s'. Por favor, compruebe su camino o créelo
fr: Le répertoire '%s' de configuration de Centreon Broker n'existe pas et ne peut être créé pour le moteur de supervision '%s'. Merci de vérifier le chemin du répertoire ou de le créer
pt_pt: O diretorio de configuração '%s' do Centreon Broker não existe ou não pôde ser criado pelo o motor de monitoramento '%s'. Por favor, verifique o caminho

source: Could not write to Centreon Broker's configuration file '%s' for monitoring engine '%s'. Please add writing permissions for the webserver's user
de: In die Centreon Broker Konfigurationsdatei '%s' konnte für die Monitoring Engine '%s' nicht geschrieben werden. Bitte fügen Sie Schreibberechtigungen für den Benutzer des Webservers hinzu
es: No se pudo escribir en el archivo de configuración de Centreon Broker '%s' para la supervisión motor '%s'. Por favor agregue permisos de escritura para el usuario del servidor web
fr: Le fichier '%s' de configuration de Centreon Broker n'est pas accessible en écriture pour le moteur de supervision '%s'. Merci de vérifier le chemin du répertoire ou de le créer
pt_pt: Não foi possivel escrever no ficheiro de configuração '%s' do Centreon Broker para o motor de monitoramento '%s'. Por favor verifique as permissões para o usuário do webserver.

source: <br><b>Centreon : </b>All configuration will be send to
de: <br><b>Centreon: </b> Alle Konfigurationsdateien werden gesendet an
es: <br><b>Centreon: </b> Toda la configuración se enviará a
fr: <br><b>Centreon : </b>Toute la configuration sera envoyée vers
pt_pt: <br><b>Centreon : </b>Toda a configuração foi enviada para

source: Add a Monitoring Engine Configuration File
de: Monitoring Engine Konfigurationsdatei hinzufügen
es: Agregar el archivo de configuración del motor supervisor
fr: Ajouter le fichier de configuration du moteur de supervision
pt_pt: Adicionar um ficheiro de configuração do motor de monitoramento

source: Modify a Monitoring Engine Configuration File
de: Monitoring Engine Konfigurationsdatei bearbeiten
es: Editar el archivo de configuración del motor supervisor
fr: Modifier le fichier de configuration du moteur de supervision
pt_pt: Modificar um ficheiro de configuração do motor de monitoramento

source: View a Monitoring Engine Configuration File
de: Monitoring Engine Konfigurationsdatei anzeigen
es: Ver el archivo de configuración del motor supervisor
fr: Visualiser le fichier de configuration du moteur de supervision
pt_pt: Visualizar ficheiro de configuração do motor de monitoramento

source: Configuration Name
de: Konfigurationsname
es: Nombre de configuración
fr: Nom de la configuration
pt_pt: Nome da Configuração

source: Linked poller
de: Verknüpfter Poller
es: Coleccionista vinculado
fr: Collecteur lié
pt_pt: Coletor associado

source: Status file
de: Statusdatei
es: Archivo de estado
fr: Fichier d'état
pt_pt: Ficheiro de Estado

source: Status File Update Interval
de: Statusdatei Updateintervall
es: Intervalo de actualización del archivo de estado.
fr: Intervalle de mise à jour du fichier des statuts
pt_pt: Intervalo de atualização do ficheiro de Estado

source: Log file
de: Protokolldatei
es: Archivo de registro
fr: Fichier de journalisation
pt_pt: Ficheiro de Registro

source: Object Configuration Directory
de: Objektkonfigurationsverzeichnis
es: Directorio de configuracion de objetos
fr: Répertoire de configuration des objets
pt_pt: Diretorio de Configuração de Objetos

source: Object Configuration File
de: Objektkonfigurationsdatei
es: Archivo de configuracion principal
fr: Fichier de configuration principal
pt_pt: Ficheiro de Configuração de Objeto

source: Temp File
de: Temporäre Datei
es: Archivo temporal
fr: Fichier temporaire
pt_pt: Ficheiro Temporario

source: Monitoring system User
de: Monitoringsystembenutzer
es: Sistema de supervisión del usuario
fr: Utilisateur system de supervision
pt_pt: Usuário de sistema de Monitoramento

source: Monitoring system Group
de: Monitoringsystemgruppe
es: Grupo de sistemas de supervisión.
fr: Groupe system de supervision
pt_pt: Grupo de sistema do Monitoramento

source: Notification Option
de: Benachrichtigungsoption
es: Notificación
fr: Notification
pt_pt: Opção de Notificação

source: Service Check Execution Option
de: Service-Überprüfungsausführungsoption
es: Control activo de servicios.
fr: Contrôle actif des services
pt_pt: Opção de Execução de Checagem de Serviço

source: Passive Service Check Acceptance Option
de: Passive Service-Überprüfungsakzeptanzoption
es: Control pasivo de servicios.
fr: Contrôle passif des services
pt_pt: Opção de Checagem Passiva aceita para Serviço

source: Host Check Execution Option
de: Host-Überprüfungsausführungsoption
es: Control activo de hosts.
fr: Contrôle actif des hôtes
pt_pt: Opção de Execução de Checagem de Host

source: Passive Host Check Acceptance Option
de: Passive Host-Überprüfungsakzeptanzoption
es: Control pasivo de hosts.
fr: Contrôle passif des hôtes
pt_pt: Opção de Checagem Passiva aceita para Host

source: Event Handler Option
es: Gerente de eventos
fr: Gestionnaire d'évènements
pt_pt: Opção de Manipulação de Evento

source: Hourly
de: Stündlich
es: Cada hora
fr: Toutes les heures
pt_pt: De hora em hora

source: Daily
de: Täglich
es: diario
fr: Quotidienne
pt_pt: Diariamente

source: Weekly
de: Wöchentlich
es: semanal
fr: Hebdomadaire
pt_pt: Semanalmente

source: Monthly
de: Monatlich
es: mensual
fr: Mensuelle
pt_pt: Mensalmente

source: Log Rotation Method
de: Protokollrotationsmethode
es: Método de rotación de registro
fr: Méthode de rotation des logs
pt_pt: Metodo de rotação de registros

source: Log Archive Path
de: Protokollarchivpfad
es: Ruta de archivo de los registros
fr: Chemin d'archivage des logs
pt_pt: Caminho do ficheiro de Registros

source: External Command Check Option
de: Externer Befehl Überprüfungsoption
es: Lectura de comandos externos
fr: Lecture des commandes externes
pt_pt: Opção de Comando Externo de Checagem

source: External Command Check Interval
de: Externer Befehl Überprüfungsintervall
es: Intervalo de lectura de comandos externos.
fr: Intervalle de lecture des commandes externes
pt_pt: Intervalo de Comando Externo de Checagem

source: External Command Buffer Slots
de: Externer Befehl Pufferslots
es: Buffer de Comando Externo
fr: Mémoire tampon des commandes externes
pt_pt: Slots de Buffer de Comando Externo

source: External Command File
de: Externer Befehlsdatei
es: Archivo de comando externo
fr: Fichier de commande externe
pt_pt: Ficheiro de Comando Externo

source: Lock File
de: Sperrdatei
es: Archivo de bloqueo
fr: Fichier de verrou
pt_pt: Bloquear Ficheiro

source: State Retention Option
de: Zustandsbeibehaltungsoption
es: Retención del estado
fr: Rétention d'états
pt_pt: Opção de Retenção de Estado

source: State Retention File
de: Zustandsbeibehaltungsdatei
es: Archivo de retención del estado
fr: Fichier de rétention des états
pt_pt: Ficheiro de Retenção de Estado

source: Automatic State Retention Update Interval
de: Automatisches Zustandsbeibehaltungsaktualisierungsintervall
es: Intervalo de actualización para retención de estado
fr: Intervalle de mise à jour de la rétention des états
pt_pt: Intervalo de atualização automatica de Retenção de Estado

source: Use Retained Program State Option
de: Option zur Programmzustandbeibehaltung nutzen
es: Retención del estado del programa
fr: Rétention du statut du programme
pt_pt: Use a opção de estado do programa retido

source: Use Retained Scheduling Info Option
de: Option zur Planungsinformationsbeibehaltung nutzen
es: Retención de datos de pedido
fr: Rétention des données d'ordonnancement
pt_pt: Use a opção Retained Scheduling Info

source: Retained Contact Host Attribute Mask
de: Maske für beizubehaltende Kontakt Hostattribute
es: Máscara de retención de atributos de los contactos de hosts.
fr: Masque de rétention des attributs des contacts d'hôtes
pt_pt: Máscara de Atributo do Host de Contacto Retido

source: Retained Contact Service Attribute Mask
de: Maske für beizubehaltende Kontakt Serviceattribute
es: Máscara para la retención de atributos de contacto de servicio
fr: Masque de rétention des attributs des contacts de services
pt_pt: Máscara de Atributos do Serviço de Contacto Retido

source: Retained Process Host Attribute Mask
de: Maske für beizubehaltende Prozess Hostattribute
es: Máscara para retención de atributos de procesos host
fr: Masque de rétention des attributs des processus d'hôtes
pt_pt: Máscara de Atributo do Host do Processo Retido

source: Retained Process Service Attribute Mask
de: Maske für beizubehaltende Prozess Serviceattribute
es: Máscara para la retención de los atributos del proceso de servicio
fr: Masque de rétention des attributs des processus de services
pt_pt: Máscara de Atributo do Serviço de Processo Retido

source: Retained Host Attribute Mask
de: Maske für beizubehaltende Hostattribute
es: Máscara para retener atributos de hosts.
fr: Masque de rétention des attributs des hôtes
pt_pt: Máscara de Atributo do Host Retido

source: Retained Service Attribute Mask
de: Maske für beizubehaltende Serviceattribute
es: Máscara de retención de los atributos del servicio.
fr: Masque de rétention des attributs du service
pt_pt: Máscara de Atributo de Serviço Retido

source: Syslog Logging Option
de: Protokollierungsoptionen für Syslog
es: Registro de syslog
fr: Journalisation syslog
pt_pt: Opção de registro em Syslog

source: Notification Logging Option
de: Protokollierungsoptionen für Benachrichtigungen
es: Registro de notificaciones
fr: Journalisation des notifications
pt_pt: Opções de registro de Notificação

source: Service Check Retry Logging Option
de: Protokollierungsoptionen für Service-Überprüfungswiederholungen
es: Registro de pruebas de confirmación de servicio.
fr: Journalisation des tests de confirmation de service
pt_pt: Opção de Registro de Tentiva de Checagem de Serviço

source: Host Retry Logging Option
de: Protokollierungsoptionen für Host-Überprüfungswiederholungen
es: Registro de pruebas de confirmación de host
fr: Journalisation des tests de confirmation d'hôte
pt_pt: Opção de registro de Tentativa de Host

source: Event Handler Logging Option
de: Protokollierungsoptionen für Event Handler
es: Registro de acciones del gestor de eventos.
fr: Journalisation des actions du gestionnaire d'évènements
pt_pt: Opção de registro de Manipulação de Evento

source: External Command Logging Option
de: Protokollierungsoptionen für externe Befehle
es: Registro de comando externo
fr: Journalisation des commandes externes
pt_pt: Opção de registro de Comando Externo

source: Passive Check Logging Option
de: Protokollierungsoptionen für passive Überprüfungen
es: Registro de estados pasivos.
fr: Journalisation des états passifs
pt_pt: Opção de registro de Checagem Passiva

source: Enable logging pid information
de: PID-Informationen in der Protokollierung aktivieren
es: Habilitar la grabación de información pid
fr: Activer l'enregistrement des informations du pid
pt_pt: Ativa Informação de registro de PID

source: Global Host Event Handler
de: Globale Host Event Handler
es: Gestor de eventos de host global
fr: Gestionnaire global d’évènements d'hôte
pt_pt: Manipulação de Evento Global de Host

source: Global Service Event Handler
de: Globale Service Event Handler
es: Gerente de eventos de servicio global
fr: Gestionnaire global d’évènements de service
pt_pt: Manipulação de Evento Global de Serviço

source: Inter-Check Sleep Time
de: Inter-Überprüfungsverzögerung
es: Tiempo de sueño entre cheques
fr: Temps de sommeil entre les contrôles
pt_pt: Tempo de espera para inter-checagem

source: Maximum Concurrent Service Checks
de: Maximale gleichzeitige Service-Überprüfungen
es: Número máximo de controles de servicio simultáneos
fr: Nombre maximum de contrôles de service simultanés
pt_pt: Checagens concorrentes máximas para Serviço

source: Maximum Host Check Spread
de: Maximale Zeit, in der die initialen Hostüberprüfungen verteilt werden
es: Tiempo máximo de distribución de los controles iniciales de hosts.
fr: Délai maximum de répartition des contrôles initiaux d'hôtes
pt_pt: Propagação máxima de checagem de Host

source: Maximum Service Check Spread
de: Maximale Zeit, in der die initialen Serviceüberprüfungen verteilt werden
es: Tiempo máximo de distribución de controles iniciales de servicios.
fr: Délai maximum de répartition des contrôles initiaux de services
pt_pt: Propagação máxima de checagem de Serviço

source: Service Interleave Factor
de: Serviceverschachtelungsfaktor
es: Factor de entrelazado de servicios
fr: Facteur d'entrelacement des services
pt_pt: Fator de intercalação de Serviço

source: Host Inter-Check Delay Method
de: Host Inter-Überprüfungsverzögerungsmethode
es: Método de retardo entre cheques de hosts
fr: Méthode du délai inter-contrôles des hôtes
pt_pt: Metodo de atraso para inter-checagem de Host

source: Service Inter-Check Delay Method
de: Service Inter-Überprüfungsverzögerungsmethode
es: Método de retardo de tiempo entre servicios
fr: Méthode de délai inter-contrôles de services
pt_pt: Metodo de atraso para inter-checagem de Serviço

source: Check Result Reaper Frequency
de: Überprüfungsergebnis Reaperfrequenz
es: Frecuencia de consolidación de resultados de control.
fr: Fréquence de consolidation des résultats de contrôle
pt_pt: Frequencia de consolidação de resultado de checagem

source: Maximum Check Result Reaper Time
de: Maximale Überprüfungsergebnis Reaperzeit
es: Temperatura máxima de control de resultados
fr: Temp du contrôle des résultats maximal
pt_pt: Tempo máximo de consolidação de resultado de checagem

source: Translate Passive Host Checks Option
de: Passive Host-Überprüfungsoptionen übersetzen
es: Opción de traducir cheques de host pasivos
fr: Option de traduction des contrôles d'hôte passif
pt_pt: Opção de tradução de checagem passiva de Host

source: Passive Host Checks Are SOFT Option
de: Passive Host-Überprüfungen sind SOFT Option
es: Las comprobaciones pasivas de host son de tipo SOFT
fr: Les contrôles d'hôte passifs sont de type SOFT
pt_pt: Opção de checagem de Host do tipo SOFT

source: Auto-Rescheduling Option
de: Automatisches erneutes Ansetzen Option
es: Reordenación automática
fr: Ré-ordonnancement automatique
pt_pt: Opções de Auto-agendamento

source: Auto-Rescheduling Interval
de: Intervall für das automatische erneute Ansetzen
es: Intervalo de reordenación automática
fr: Intervalle de ré-ordonnancement automatique
pt_pt: Intervalo de Auto-Agendamento

source: Auto-Rescheduling Window
de: Fenster für das automatische erneute Ansetzen
es: Ventana de reprogramación automática
fr: Fenêtre de ré-ordonnancement automatique
pt_pt: Janela de Auto-Agendamento
