Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: Aggressive Host Checks
es: Control agresivo de los anfitriones.
fr: Contrôle agressif des hôtes
pt_pt: Checagem agressiva de Host

source: Flap Detection Option
de: Flackernerkennungsoption
es: Detección de estatutos en bagotage.
fr: Détection de bagotage des statuts
pt_pt: Opções de Detecção de Variação

source: Low Service Flap Threshold
de: Unterer Grenzwert für das Serviceflackern
es: Umbral bajo para la detección del bagotage estado del servicio.
fr: Seuil bas de détection de bagotage des statuts de service
pt_pt: Limite para baixa variação de Serviço

source: High Service Flap Threshold
de: Oberer Grenzwert für das Serviceflackern
es: Alto umbral de detección de estados de servicio del folleto.
fr: Seuil haut de détection de bagotage des statuts de service
pt_pt: Limite para alta variação de Serviço

source: Low Host Flap Threshold
de: Unterer Grenzwert für das Hostflackern
es: Umbral bajo para detectar bagotage de estados de invitados
fr: Seuil bas de détection de bagotage des statuts d'hôte
pt_pt: Limite para baixa variação de Host

source: High Host Flap Threshold
de: Oberer Grenzwert für das Hostflackern
es: Alto umbral para detectar bagotage de estado de invitado
fr: Seuil haut dedétection de bagotage des statuts d'hôte
pt_pt: Limite para alta variação de Host

source: Soft Service Dependencies Option
de: Weiche Serviceabhängigkeiten Option
es: Verificando dependencias de servicio
fr: Vérification des dépendances de service
pt_pt: Verificando dependencias de Serviço

source: Service Check Timeout
de: Service-Überprüfungstimeout
es: Tiempo máximo para ejecutar una verificación de servicio.
fr: Temps maximum d'exécution d'un contrôle de service
pt_pt: Tempo máximo de checagem de Serviço

source: Host Check Timeout
de: Host-Überprüfungstimeout
es: Tiempo máximo para ejecutar una verificación de host
fr: Temps maximum d'exécution d'un contrôle d'hôte
pt_pt: Tempo máximo de checagem de Host

source: Event Handler Timeout
es: Tiempo máximo para ejecutar un comando de controlador de eventos
fr: Temps maximum d'exécution d'une commande du gestionnaire d'évènements
pt_pt: Tempo máximo de Manipulação de Evento

source: Notification Timeout
de: Benachrichtigungstimeout
es: Tiempo máximo para ejecutar un comando de notificación.
fr: Temps maximum d'exécution d'une commande de notification
pt_pt: Tempo máximo de Notificação

source: Obsessive Compulsive Service Processor Timeout
de: Timeout für obligatorische, erzwungene Serviceverarbeiter
es: Tiempo máximo para ejecutar un comando de control posterior al servicio
fr: Temps maximum d'exécution d'une commande post contrôle de service
pt_pt: Tempo máximo de execução de um comando de controle pós-checagem de Serviço

source: Obsessive Compulsive Host Processor Timeout
de: Timeout für obligatorische, erzwungene Hostverarbeiter
es: Tiempo máximo para ejecutar un comando de control posterior al host
fr: Temps maximum d'exécution d'une commande post contrôle d'hôte
pt_pt: Tempo máximo de execução de um comando de controle pós-checagem de Host

source: Performance Data Processor Command Timeout
de: Timeout für den Leistungsdatenverarbeitungsbefehl
es: Tiempo máximo para ejecutar un comando de gestión de datos de rendimiento.
fr: Temps maximum d'exécution d'une commande de gestion des données de performances
pt_pt: Tempo máximo de comando para processamento de dados de Performance

source: Obsess Over Services Option
de: Services überwachen Option
es: Habilitar la ejecución de comandos de control post-servicio.
fr: Activation de l'exécution des commandes post contrôle de service
pt_pt: Opção de pós-checagem de Serviço

source: Obsessive Compulsive Service Processor Command
de: Obligatorischer, erzwungener Serviceverarbeitungsbefehl
es: Orden de servicio post control
fr: Commande post contrôle de service
pt_pt: Comando de processamento pós-checagem de Serviço

source: Obsess Over Hosts Option
de: Hosts überwachen Option
es: Habilitar la ejecución de comandos post-control.
fr: Activation de l'exécution des commandes post contrôle d'hôte
pt_pt: Opção de pós-checagem de Hosts

source: Obsessive Compulsive Host Processor Command
de: Obligatorischer, erzwungener Hostverarbeitungsbefehl
es: Comando de control posterior al host
fr: Commande post contrôle d'hôte
pt_pt: Comando de processamento pós-checagem de Host

source: Performance Data Processing Option
de: Leistungsdatenverarbeitungsoption
es: Procesamiento de datos de rendimiento
fr: Traitement des données de performance
pt_pt: Opção de processamento de dados de Performance

source: Host Performance Data Processing Command
de: Host-Leistungsdatenverarbeitungsbefehl
es: Comando de procesamiento de datos de rendimiento del host
fr: Commande de traitement des données de performance d'hôte
pt_pt: Comando de processamento de dados de performance de Host

source: Service Performance Data Processing Command
de: Service-Leistungsdatenverarbeitungsbefehl
es: Comando de procesamiento de datos de rendimiento del servicio
fr: Commande de traitement des données de performance du service
pt_pt: Comando de processamento de dados de performance de Serviço

source: Host Performance Data File
de: Host-Leistungsdatendatei
es: Archivo de datos de rendimiento del host
fr: Fichier de données de performance d'hôte
pt_pt: Ficheiro de dados de Performance de Host

source: Service Performance Data File
de: Service-Leistungsdatendatei
es: Archivo de datos de rendimiento del servicio
fr: Fichier de données de performance de service
pt_pt: Ficheiro de dados de Performance de Serviço

source: Host Performance Data File Template
de: Host-Leistungsdatendateitemplate
es: Plantilla de archivo de datos de rendimiento de host
fr: Modèle de fichier de données de performance d'hôte
pt_pt: Modelo de ficheiro de dados de Performance de Host

source: Service Performance Data File Template
de: Service-Leistungsdatendateitemplate
es: Plantilla de archivo de datos de rendimiento del servicio
fr: Modèle de fichier de données de performance de service
pt_pt: Modelo de ficheiro de dados de Performance de Serviço

source: Append
de: Anhängen
es: añadiendo
fr: Ajout
pt_pt: Acrescentar

source: Write
de: Schreiben
es: escritura
fr: Écriture
pt_pt: Escrita

source: Host Performance Data File Mode
de: Host-Leistungsdatendateimodus
es: Modo de archivo de datos de rendimiento del host
fr: Mode du fichier de données de performance d'hôte
pt_pt: Modo de Ficheiro de Dados de Performance do Host

source: Service Performance Data File Mode
de: Service-Leistungsdatendateimodus
es: Modo de archivo de datos de rendimiento del servicio
fr: Mode du fichier de données de performance de service
pt_pt: Modo de Ficheiro de Dados de Performance do Serviço

source: Host Performance Data File Processing Interval
de: Host-Leistungsdatendatei Verarbeitungsintervall
es: Intervalo para procesar datos de rendimiento del host
fr: Intervalle de traitement des données de performance d'hôte
pt_pt: Intervalo de processamento de Ficheiro de Dados de Performance do Host

source: Service Performance Data File Processing Interval
de: Service-Leistungsdatendatei Verarbeitungsintervall
es: Intervalo de procesamiento de datos de rendimiento del servicio
fr: Intervalle de traitement des données de performance de service
pt_pt: Intervalo de processamento de Ficheiro de Dados de Performance do Serviço

source: Host Performance Data File Processing Command
de: Host-Leistungsdatendatei Verarbeitungsbefehl
es: Comando de procesamiento de archivos de datos de rendimiento del host
fr: Commande de traitement du fichier des données de performance d'hôte
pt_pt: Comando de processamento de Ficheiro de Dados de Performance do Host

source: Service Performance Data File Processing Command
de: Service-Leistungsdatendatei Verarbeitungsbefehl
es: Servicio Performance File File Processing Command
fr: Commande de traitement du fichier des données de performance du service
pt_pt: Comando de processamento de Ficheiro de Dados de Performance do Serviço

source: Orphaned Service Check Option
de: Überprüfungsoption für einen verwaisten Service
es: Verificación de servicios huérfanos.
fr: Vérification des services orphelins
pt_pt: Opção de Checagem de Serviço Órfão

source: Orphaned Host Check Option
de: Überprüfungsoption für einen verwaisten Host
es: Comprobación de huéspedes huérfanos
fr: Vérification des hôtes orphelins
pt_pt: Opção de Checagem de Host Órfão

source: Service Freshness Check Option
de: Serviceaktualität Überprüfungsoption
es: Opción para comprobar la frescura del resultado del servicio.
fr: Option de contrôle de la fraicheur du résultat du service
pt_pt: Opção de Checagem de Atualização de Resultado do Serviço

source: Service Freshness Check Interval
de: Serviceaktualität Überprüfungsintervall
es: Intervalo de control de la frescura del resultado del servicio.
fr: Intervalle de contrôle de la fraicheur du résultat du service
pt_pt: Intervalo de Checagem de Atualização de Resultado do Serviço

source: Host Freshness Check Option
de: Hostaktualität Überprüfungsoption
es: Opción para comprobar la frescura del resultado del anfitrión.
fr: Option de contrôle de la fraicheur du résultat de l'hôte
pt_pt: Opção de Checagem de Atualização de Resultado do Host

source: Host Freshness Check Interval
de: Hostaktualität Überprüfungsintervall
es: Intervalo de control de la frescura del resultado del huésped.
fr: Intervalle contrôle de la fraicheur du résultat de l'hôte
pt_pt: Intervalo de Checagem de Atualização de Resultado do Host

source: Additional freshness latency
de: Zusätzlich Aktualitätslatenz
es: Latencia adicional de control de frescura.
fr: Latence additionnelle du contrôle de fraicheur
pt_pt: Latencia Adicional de Atualização de Resultado

source: Date Format
de: Datumsformat
es: Formato de fecha
fr: Format de date
pt_pt: Formato da Data

source: Administrator Email Address
de: E-Mail-Adresse des Administrators
es: Dirección de correo electrónico del administrador
fr: Adresse mail de l'administrateur
pt_pt: Endereço de e-mail do Administrador

source: Administrator Pager
de: Pager des Administrators
es: Número de teléfono móvil del administrador.
fr: Numéro de téléphone mobile de l'administrateur
pt_pt: Bip do Administrador

source: Illegal Object Name Characters
de: Unzulässige Objektnamen Zeichen
es: Caracteres ilegales en el nombre del objeto.
fr: Caractères illégaux dans le nom de l'objet
pt_pt: Nome do objeto com caracteres invalidos

source: Illegal Macro Output Characters
de: Unzulässige Makrooutput Zeichen
es: Caracteres ilegales en el valor de las macros.
fr: Charactères illégaux dans la valeur des macros
pt_pt: Saída da Macro com caracteres ilegais

source: Regular Expression Matching Option
de: Abgleichsoption für reguläre Ausdrücke
es: Habilitar la gestión de expresiones regulares
fr: Activation de la gestion des expressions rationnelles
pt_pt: Opção de correspondencia com Expressão Regular

source: True Regular Expression Matching Option
de: Abgleichsoption für echte reguläre Ausdrücke
es: Permitiendo la gestión sistemática de expresiones regulares.
fr: Activation de la gestion systématique des expressions rationnelles
pt_pt: Ativar correspondencia com Expressão Regular

source: Multiple Broker Module
de: Modul für mehrere Broker
es: Broker de multiples módulos
fr: Multiple module broker
pt_pt: Multiplo modulo Broker

source: This directive can be used multiple times, see nagios documentation.
de: Diese Einstellung kann mehrfach verwendet werden, überprüfen Sie die Nagios-Dokumentation.
es: Esta directiva se puede utilizar varias veces, consulte la documentación de nagios.
fr: Cette directive peut être utilisée plusieurs fois, se reporter à la documentation de nagios.
pt_pt: Esta diretiva pode ser utilizada várias vezes, veja a documentação do Nagios.

source: Event broker directive
de: Eventbroker Einstellung
es: Directiva du módulo broker
fr: Directive du module broker
pt_pt: Diretiva do Broker

source: Broker Module Options
de: Brokermoduloptionen
es: Opción para lanzar el módulo.
fr: Option de lancement du module
pt_pt: Opções do Modulo Broker

source: Predictive Host Dependency Checks
de: Vorausschauende Hostabhängigkeitsüberprüfungen
es: Predicción de dependencias del host.
fr: Prédiction des dépendances d'hôte
pt_pt: Checagens preditivas de dependência de Host

source: Predictive Service Dependency Checks
de: Vorausschauende Serviceabhängigkeitsüberprüfungen
es: Predicción de dependencias de servicio.
fr: Prédiction des dépendances de service
pt_pt: Checagens preditivas de dependência de Serviço

source: Cached Host Check
de: Gecachte Hostüberprüfungen
es: Control de host de caché
fr: Contrôle d'hôte en cache
pt_pt: Checagem de Host em Cache

source: Cached Service Check
de: Gecachte Serviceüberprüfungen
es: Control de servicio de caché
fr: Contrôle de service en cache
pt_pt: Checagem de Serviço em Cache

source: Use large installation tweaks
de: Anpassungen für große Umgebungen verwenden
es: Habilitación de optimizaciones para instalaciones de alto volumen.
fr: Activation des optimisations pour les installations de forte volumétrie
pt_pt: Use ajustes de instalação grande

source: Enable environment macros
de: Umgebungsmakros aktivieren
es: Habilitar macros de entorno
fr: Activer les macros d'environnement
pt_pt: Ativa macros de ambiente

source: Debug file (Directory + File)
de: Debugdatei (Verzeichnis + Datei)
es: Archivo de depuración (directorio de archivos)
fr: Fichier de débogage (répertoire + fichier)
pt_pt: Ficheiro de Depuração (Diretorio + Ficheiro)

source: Debug file Maximum Size
de: Maximale Größe der Debugdatei
es: Tamaño máximo del archivo de depuración
fr: Taille maximale du fichier de débogage
pt_pt: Tamanho máximo do ficheiro de depuração

source: Daemon core dumps
es: Habilitar la posibilidad de lograr un 'volcado de núcleo' (no compatible con Centreon Engine)
fr: Activer la possibilité de réaliser un 'core dump' (non compatible avec Centreon Engine)
pt_pt: Ativa a possibilidade de obter um "core dump" (não compatível com o Centreon Engine)

source: Basic information
de: Grundlegende Informationen
es: Information de base
fr: Information de base
pt_pt: Informação Básica

source: More detailed information
de: Detailliertere Informationen
es: Informacion detallada
fr: Informations détaillées
pt_pt: Informações mais detalhadas

source: Highly detailed information
de: Sehr detaillierte Informationen
es: Informacion muy detallada
fr: Informations très détaillées
pt_pt: Informações com mais detalhes

source: Debug Verbosity
de: Debugausführlichkeit
es: Nivel de detalle de depuración.
fr: Niveau de détail du débogage
pt_pt: Nível de Depuração

source: Log everything
de: Alles protokollieren
es: Guardar todos los registros
fr: Enregistrer tous les logs
pt_pt: Registrar tudo

source: Log nothing (default)
de: Nichts protokollieren (Standard)
es: Sin registro (por defecto)
fr: Aucun enregistrement (par défaut)
pt_pt: Sem registros (por padrão)

source: Function enter/exit information
de: Einstiegs-/Ausstiegsinformation der Funktion
es: Nagios función de entrada / salida de información
fr: Informations sur les entrées/sorties des fonctions de Nagios
pt_pt: Função do Nagios informação de entrada/saída

source: Config information
de: Konfigurationsinformationen
es: Informacion de configuracion
fr: Informations sur la configuration
pt_pt: Informação de Configuração

source: Process information
de: Prozessinformationen
es: Información del proceso
fr: Informations sur le processus
pt_pt: Informação de Processamento

source: Scheduled event information
de: Information zu einem angesetzten Event
es: Información de pedido
fr: Informations sur l'ordonnancement
pt_pt: Informações de Eventos Agendados

source: Host/service check information
de: Host / Serviceüberprüfungsinformationen
es: Información de Control de Hosts / Servicios
fr: Informations sur le contrôle des Hôtes/Services
pt_pt: Informação de checagem de Host/Serviço

source: Event broker information
de: Event Broker Informationen
es: Información del módulo
fr: Informations sur le module
pt_pt: Informações de evento do Broker

source: External Commands
de: Externe Befehle
es: Comandos externos
fr: Commandes externes
pt_pt: Comandos Externo

source: Commands
de: Befehle
es: comandos
fr: Commandes
pt_pt: Comandos

source: Downtimes
de: Ausfallszeiten
es: Tiempo de parada
fr: Planifier des plages de maintenance
pt_pt: Manutenções

source: Debug Level
es: Nivel de depuración
fr: Niveau de débogage
pt_pt: Nível de Depuração

source: Broker need options to be loaded
es: El broker necesita opciones para ser lanzado
fr: Le broker a besoin d'options pour être lancé
pt_pt: O Broker precisa de opções para ser carregado

source: Files
de: Dateien
es: archivos
fr: Fichiers
pt_pt: Ficheiros

source: Check Options
de: Überprüfungsoptionen
es: Opciones de control
fr: Options de contrôle
pt_pt: Opções de Checagem

source: Log Options
de: Protokolloptionen
es: Opciones de registro
fr: Options des logs
pt_pt: Opções de Log

source: Data
de: Daten
es: datos
fr: Données
pt_pt: Dados

source: Tuning
es: optimización
fr: Optimisation
pt_pt: Otimização

source: Folders
de: Ordner
es: directorios
fr: Répertoires
pt_pt: Pastas

source: Host Check Options
de: Host-Überprüfungsoptionen
es: Opciones de control de host
fr: Options de contrôle des hôtes
pt_pt: Opções de Checagem de Host

source: Service Check Options
de: Service-Überprüfungsoptionen
es: Opciones de control de servicio
fr: Options de contrôle des services
pt_pt: Opções de checagem de Serviço

source: Freshness
de: Aktualität
es: frescura
fr: Fraicheur
pt_pt: Atualização

source: Flapping Options
de: Flackern-Optionen
es: Detección de estatutos en bagotage.
fr: Détection de bagotage des statuts
pt_pt: Opções de Detecção de Variação

source: Post Check
de: Post-Überprüfung
es: Acciones despues de control
fr: Actions après contrôle
pt_pt: Pós checagem

source: Cached Check
de: Gecachte Überprüfung
es: Cachear la verificación
fr: Mise en cache de la vérification
pt_pt: Checagem em cache

source: Misc Options
de: Sonstige Optionen
es: Otras opciones
fr: Autres options
pt_pt: Opções Diversas

source: Passive host checking Options
de: Passive Host-Überprüfungsoptionen
es: Opciones de control pasivo para hosts.
fr: Options de contrôle passive des hôtes
pt_pt: Opções de checagem Passiva de Host

source: Logging Options
de: Protokollierungsoptionen
es: Opciones de registro
fr: Options des logs
pt_pt: Opções de Registro

source: Timeouts
es: Tiempo máximo de ejecución
fr: Temps maximums d'exécution
pt_pt: Tempos limites

source: Archives
de: Archive
es: Archivo
pt_pt: Ficheiros

source: States Retention
de: Zustandsbeibehaltung
es: Retención del estado
fr: Rétention des états
pt_pt: Estado de Retenção

source: Broker Module
de: Brokermodul
es: Módulo de comando de inicio
fr: Commande de lancement du module
pt_pt: Modulo Broker

source: Perfdata
de: Leistungsdaten
es: Datos de rendimiento
fr: Données de performances
pt_pt: Performance de Dados

source: Time Unit
de: Zeiteinheit
es: Unidad de tiempo de referencia
fr: Unité de temps de référence
pt_pt: Unidade de Tempo

source: Host Check Scheduling Options
de: Host-Überprüfung Planungsoptionen
es: Opciones de alojamiento
fr: Options d'ordonnancement des hôtes
pt_pt: Opções de agendamento de Checagem de Host

source: Service Check Scheduling Options
de: Service-Überprüfung Planungsoptionen
es: Opciones de orden de servicio
fr: Options d'ordonnancement des services
pt_pt: Opções de agendamento de Checagem de Serviço

source: Auto Rescheduling
de: Automatisches erneutes Ansetzen
es: Reordenación automática
fr: Ré-ordonnancement automatique
pt_pt: Reagendamento Automatico

source: Optimization
de: Optimierung
es: optimización
fr: Optimisation
pt_pt: Otimização

source: Admin information
de: Admin Informationen
es: Información del administrador
fr: Informations de l'administrateur
pt_pt: Informação de Administrador

source: Debug Configuration
de: Debugkonfiguration
es: Configuración de depuración
fr: Configuration de débogage
pt_pt: Configuração de Depuração

source: Warning: this value can be dangerous, use -1 if you have any doubt.
de: Warnung: Dieser Wert kann gefährlich sein, verwenden Sie -1 wenn Sie sich nicht sicher sind.
es: Atención: el cambio de este valor puede tener importantes consecuencias. Usa `-1` si tienes alguna duda.
fr: Attention : le changement de cette valeur peut avoir des conséquences importantes. Utiliser '-1' si vous avez le moindre doute
pt_pt: Aviso : Este valor pode ser perigoso, use -1 se você tem dúvidas.

source: This option must be enabled for Centreon Dashboard module.
de: Diese Option muss für das Centreon Dashboard aktiviert sein.
es: Esta opción debe estar habilitada para el módulo del módulo de Centreon Dashboard
fr: Cette option doit être activée pour le module module de Tableau de bord Centreon
pt_pt: Esta opção deve ser ativa para o modulo de Painel de Controle do Centreon.

source: This option must be disable in order to avoid latency problem.
de: Diese Option muss zwecks Vermeidung von Latenzproblemen deaktiviert sein.
es: Esta opción debe estar deshabilitada para evitar problemas de latencia.
fr: Cette option doit être désactiver pour prévenir les problèmes liés à la latence.
pt_pt: Esta opção deve ser desativada para evitar problemas de latencia.

source: Satellites
de: Poller
es: colectores
fr: Collecteurs
pt_pt: Coletores

source: Host state
de: Hostzustand
es: Estado del anfitrión
fr: Etat de l'hôte
pt_pt: Estado do Host

source: Export in CSV format
de: Im CSV-Format exportieren
es: Exportadores en formato CSV
fr: Exporter au format CSV
pt_pt: Exportar em formato CSV

source: This Week
de: Diese Woche
es: Esta semana
fr: Cette Semaine
pt_pt: Esta Semana

source: This Month
de: Diesen Monat
es: Este mes
fr: Ce mois ci
pt_pt: Este Mês

source: Last Month
de: Letzter Monat
es: Mes pasado
fr: Le mois dernier
pt_pt: Último Mês

source: This Year
de: Dieses Jahr
es: Este año
fr: Cette année
pt_pt: Este Ano

source: Hosts group state
de: Hostgruppenzustand
es: Estado del grupo de invitados
fr: Statut du groupe d'hôtes
pt_pt: Estado do Grupo de Hosts

source: UP
de: VERFÜGBAR
es: DISPONIBLE
fr: DISPONIBLE
pt_pt: DISPONIVEL

source: UNDETERMINED
de: UNBESTIMMT
es: DESCONOCIDO
fr: INDÉTERMINÉ
pt_pt: INDETERMINÁVEL

source: Actual
de: Tatsächlich
es: ahora
fr: Actuellement
pt_pt: Atual

source: Host name
es: Nombre del anfitrión
fr: Nom de l'hôte
pt_pt: Nome do Host

source: Undetermined
de: Unbestimmt
es: no especificado
fr: Indéterminé
pt_pt: Indeterminável

source: Scheduled downtime
de: Angesetzte Ausfallszeit
es: Tiempo de inactividad planificado
fr: Plage de maintenance planifiée
pt_pt: Manutenção Agendada

source: Total Time
de: Insgesamte Zeit
es: tiempo total
fr: Temps total
pt_pt: Tempo Total

source: Mean Time
de: Durchschnittliche Zeit
es: Tiempo significativo
fr: Temps significatif
pt_pt: Tempo médio

source: Date
de: Datum
es: Fecha
pt_pt: Data

source: Event
es: evento
fr: Évènement
pt_pt: Evento

source: Info
es: Información
fr: Information
pt_pt: Informação

source: Reporting Period
de: Berichtszeitraum
es: Periodo de generacion
fr: Période de génération
pt_pt: Periodo do Relatorio

source: Today's Host log
de: Heutiges Hostprotokoll
es: Registro del día del anfitrión.
fr: Log du jour de l'hôte
pt_pt: Registro de Hoje do Host

source: State Breakdowns For Host Services
de: Statusaufschlüsselung der Services des Hosts
es: Estatutos de los elementos del informe.
fr: Statuts des éléments du rapport
pt_pt: Estados de Separação para Serviços de Hosts

source: SCHEDULED DOWNTIME
de: ANGESETZTE AUSFALLSZEIT
es: TIEMPO LIBRE PLANEADO
fr: TEMPS EN ARRÊT PLANIFIÉ
pt_pt: MANUTENÇÃO AGENDADA

source: Service state
de: Servicezustand
es: Estado del servicio
fr: Etat du service
pt_pt: Estado do Serviço
