Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: seconds
de: Sekunden
es: segundo
fr: secondes
pt_pt: segundos

source: The form has not been submitted since 15 minutes. Please retry to resubmit
de: Das Formular wurde seit 15 Minuten nicht abgespeichert. Bitte versuchen Sie das Speichern erneut
es: El formulario no ha sido registrado durante 15 minutos. Trate de devolver este
fr: Le formulaire n'a pas été envoyé depuis 15 minutes. Essayer de renvoyer celui-ci
pt_pt: O formulário não foi enviado depois de 15 minutos. Por favor, tente reenviar

source: here
de: hier
es: aquí
fr: ici
pt_pt: aqui

source: From
de: Ab
es: de los
fr: Du
pt_pt: De

source: To
de: Bis
es: la
fr: Au
pt_pt: Para

source: Graph
es: Grafico
fr: Graphique
pt_pt: Gráfico

source: Connection failed, please contact your administrator
de: Verbindung fehlgeschlagen, bitte kontaktieren Sie Ihren Administrator
es: Error de inicio de sesión, póngase en contacto con su administrador
fr: Connexion échouée, contactez votre administrateur
pt_pt: Conexão falhou, por favor entre em contacto com o seu administrador

source: Your credentials are incorrect.
de: Ihre Anmeldeinformationen sind falsch.
es: Sus credenciales son incorrectas.
fr: Vos informations d'identification sont incorrectes.
pt_pt: Suas credencias estão incorretas.

source: No
de: Nein
fr: Non
pt_pt: Não

source: Yes
de: Ja
es: Sí
fr: Oui
pt_pt: Sim

source: Host Check Execution Time
de: Host-Überprüfungsausführungszeit
es: Duración del cheque de acogida
fr: Durée de contrôle de l'hôte
pt_pt: Tempo máximo de checagem de Host

source: Hosts Actively Checked
de: Aktiv überprüfte Hosts
es: Actualmente verificados hosts
fr: Hôtes actuellement contrôlés
pt_pt: Hosts atualmente checados

source: Host check latency
de: Host-Überprüfungslatenz
es: Latencia del control del host.
fr: Latence du contrôle de l'hôte
pt_pt: Latência de checagem de Host

source: Service Check Execution Time
de: Service-Überprüfungsausführungszeit
es: Período de verificación de servicio
fr: Durée de contrôle du service
pt_pt: Duração da checagem de Serviço

source: Services Actively Checked
de: Aktiv überprüfte Services
es: Servicios actualmente controlados
fr: Services actuellement contrôlés
pt_pt: Serviços atualmente checados

source: Service check latency
de: Service-Überprüfungslatenz
es: Latencia del control de servicio.
fr: Latence du contrôle du service
pt_pt: Latência de checagem de Serviço

source: Commands in buffer
de: Befehle im Puffer
es: Comandos en el buffer
fr: Commandes dans le tampon
pt_pt: Comandos em buffer

source: Host status
es: Estado de acogida
fr: Etat des hôtes
pt_pt: Estado de Host

source: Service status
es: Estado del servicio
fr: Etat du service
pt_pt: Estado do Serviço

source: OK: A reload signal has been sent to '
de: OK: Ein Neuladesignal wurde gesendet an '
es: OK: un comando de recarga fue enviado a
fr: OK: Une commande de rechargement a été envoyée vers '
pt_pt: OK: Um sinal de releitura foi enviada para '

source: OK: A restart signal has been sent to '
de: OK: Ein Neustartsignal wurde gesendet an '
es: OK: se envió un comando de reinicio a
fr: OK: Une commande de redémarrage a été envoyée vers '
pt_pt: OK: O sinal de reinicio foi enviado para '

source: movement
de: Bewegung
es: movimiento
fr: mouvement
pt_pt: movimento

source: Centreon Broker's configuration directory '%s' does not exist and could not be created for monitoring engine '%s'. Please check it's path or create it
de: Das Konfigurationsverzeichnis '%s' des Centreon Brokers existiert nicht und konnte für die Monitoring Engine '%s' nicht erstellt werden. Bitte überprüfen Sie den Pfad oder erstellen Sie das Verzeichnis
es: El directorio de configuración de Centreon Broker '%s' no existe y no se pudo crear para monitorear el motor '%s'. Por favor, compruebe su camino o créelo
fr: Le répertoire '%s' de configuration de Centreon Broker n'existe pas et ne peut être créé pour le moteur de supervision '%s'. Merci de le chemin du répertoire ou de le créer
pt_pt: O diretorio '%s' de configuração do Centreon Broker não existe ou não foi criado para o motor de monitoramento '%s'. Por favor verifique o caminho ou crie ele

source: Could not write to Centreon Broker's configuration file '%s' for monitoring engine '%s'. Please add writing permissions for the webserver's user
de: In die Konfigurationsdatei '%s' des Centreon Brokers für die Monitoring Engine '%s' konnte nicht geschrieben werden. Bitte fügen Sie Schreibrechte für den Benutzer des Webservers hinzu
es: No se pudo escribir en el archivo de configuración de Centreon Broker '%s' para monitorear el motor '%s'. Por favor agregue permisos de escritura para el usuario del servidor web
fr: Le fichier '%s' de configuration de Centreon Broker n'est pas accessible en écriture pour le moteur de supervision '%s'. Merci de le chemin du répertoire ou de le créer
pt_pt: Não foi possivel escrever dados para o Centreon Broker no ficheiro de configuração '%s' do motor de monitoramento '%s'. Por favor adicione permissão de escrita para o usuário do serviço web

source: OK: All configuration files copied with success.
de: OK: Alle Konfigurationsdateien wurden erfolgreich kopiert.
es: OK: Todas las configuraciones se han copiado correctamente.
fr: OK: Toutes les configurations ont été copiées avec succès.
pt_pt: OK: Todos os ficheiros de configuração foram copiados com sucesso.

source: OK: All configuration will be send to '
de: OK: Alle Konfigurationen werden gesendet an '
es: OK: Todas las configuraciones han sido enviadas a
fr: OK: Toutes les configurations ont été envoyées vers '
pt_pt: OK: Toda a configuração será enviada para '

source: Name
es: apellido
fr: Nom
pt_pt: Nome

source: Available
de: Verfügbar
es: Disponible
fr: Disponible
pt_pt: Disponivel

source: Selected
de: Ausgewählt
es: seleccionado
fr: Sélectionné
pt_pt: Selecionado

source: Add
de: Hinzufügen
es: añadir
fr: Ajouter
pt_pt: Adicionar

source: Remove
de: Entfernen
es: eliminar
fr: Supprimer
pt_pt: Remover

source: The name of block configuration
de: Der Name der Blockkonfiguration
es: Nombre del objeto configurado.
fr: Nom de l'objet configuré
pt_pt: Nome do bloco de configuração

source: The type of block configuration
de: Der Typ der Blockkonfiguration
es: El tipo de bloque de configuración.
fr: Le type du bloc de configuration
pt_pt: O tipo de bloco de configuração

source: All
de: Alle
es: todos
fr: Tous
pt_pt: Todos

source: No widget configured in this view. Please add a new widget with the "Add widget" button.
de: In dieser Ansicht wurden keine Widgets konfiguriert. Bitte fügen Sie über den "Widget hinzufügen" Button ein neues Widget hinzu.
es: Ningún widget está configurado para esta vista. Para agregar un widget, use el botón "Agregar widget".
fr: Aucun widget n'est configuré pour cette vue. Pour ajouter un widget, utiliser le bouton "Ajouter widget".
pt_pt: Nenhuma ferramenta foi configurada para esta visão. Por favor, adicione uma nova ferramenta com o botão "Adicionar ferramenta".

source: Load a public view
de: Öffentliche Ansicht laden
es: Cargar una vista pública
fr: Charger une vue publique
pt_pt: Carrega uma visão pública

source: No action
de: Keine Aktion
es: Sin acciones
fr: Pas d'actions
pt_pt: Sem ação

source: General Information
de: Allgemeine Informationen
es: Información general
fr: Informations générales
pt_pt: informação Geral

source: Public views list
de: Liste der öffentlichen Ansichten
es: Lista de vistas publicas
fr: List des vues publiques
pt_pt: List des vues publiques

source: Submit
de: Speichern
es: presentar
fr: Soumettre
pt_pt: Enviar

source: Reset
de: Zurücksetzen
es: reajustar
fr: Réinitialiser
pt_pt: Reiniciar

source: Show/Hide edit mode
de: Bearbeitungsmodus anzeigen/ausblenden
es: Mostrar / ocultar modo de edición
fr: Afficher/Cacher le mode édition
pt_pt: Mostra/Oculta o modo de edição

source: default
de: Standard
es: culpa
fr: défaut
pt_pt: padrão

source: Views
de: Ansichten
es: vistas
fr: Vues
pt_pt: Visões

source: Create new view
de: Neue Ansicht erstellen
es: Crear una nueva vista
fr: Créer une nouvelle vue
pt_pt: Criar uma nova visão

source: Load from existing view
de: Von bestehender Ansicht laden
es: Desde una vista existente
fr: A partir d'une vue existante
pt_pt: Carregar a partir de uma visão existente

source: create or load
de: Erstellen oder laden
es: crear o cargar
fr: créer ou charger
pt_pt: criar ou carregar

source: 1 Column
de: 1 Zeile
es: 1 columna
fr: 1 Colonne
pt_pt: 1 Coluna

source: 2 Columns
de: 2 Zeilen
es: 2 columnas
fr: 2 Colonnes
pt_pt: 2 Colunas

source: 3 Columns
de: 3 Zeilen
es: 3 columnas
fr: 3 Colonnes
pt_pt: 3 Colunas

source: Public
de: Öffentlich
es: Público
pt_pt: Público

source: Unlocked users
de: Entsperrte Benutzer
pt_pt: Utilizadores desbloqueados

source: Locked users
de: Gesperrte Benutzer
pt_pt: Utilizadores bloqueados

source: Unlocked user groups
de: Entsperrte Benutzergruppen
pt_pt: Grupos de utilizadores desbloqueados

source: Locked user groups
de: Gesperrte Benutzergruppen
pt_pt: Grupos de utilizadores bloqueados

source: Share
de: Teilen
es: compartir
fr: Partage
pt_pt: Compartilhar

source: Title
de: Titel
es: título
fr: Titre
pt_pt: Título

source: Widget
pt_pt: Ferramenta

source: Deleting this widget might impact users with whom you are sharing this view. Are you sure you want to do it?
de: Wenn Sie dieses Widget löschen, könnte das Auswirkungen auf andere Nutzer haben, mit denen diese Ansicht geteilt wird. Sind Sie sich sicher, dass Sie diese Ansicht löschen wollen?
es: La eliminación de este widget podría afectar a los usuarios con los que comparte esta vista.\n¿Estás seguro de que quieres hacer eso?
fr: Supprimer ce widget pourrait impacter les utilisateurs avec lesquels vous partagez cette vue. Êtes-vous sûr de vouloir faire cela?
pt_pt: Removendo esta ferramenta irá impactar utilizadores que compartilham desta visão. Você tem certeza que quer fazer isso ?

source: Deleting this view might impact other users. Are you sure you want to do it?
de: Wenn Sie diese Ansicht löschen, könnte das Auswirkungen auf andere Nutzer haben. Sind Sie sich sicher, dass Sie diese Ansicht löschen wollen?
es: Eliminar esta vista podría afectar a otros usuarios.\n¿Estás seguro de que quieres hacer eso?
fr: Supprimer cette vue pourrait impacter les autres utilisateurs. Êtes-vous sûr de vouloir faire cela ?
pt_pt: Removendo essa visão irá impactar outros utilizadores. Você tem certeza que quer fazer isso ?

source: Set this view as your default view?
de: Diese Ansicht als persönliche Standardansicht setzen?
es: ¿Configurar esta vista como la predeterminada?
fr: Configurer cette vue comme celle par défaut?
pt_pt: Configurar esta visão como uma visão padrão ?

source: Add an ACL
de: Zugriffssteuerungsliste (ACL) hinzufügen
es: Añadir un ACL
fr: Ajouter une ACL
pt_pt: Adiciona permissionamento (ACL)

source: Modify an ACL
de: Zugriffssteuerungsliste (ACL) bearbeiten
es: Editar un ACL
fr: Modifier une ACL
pt_pt: Modifica permissionamento (ACL)

source: View an ACL
de: Zugriffssteuerungsliste (ACL) anzeigen
es: Ver un ACL
fr: Visualiser une ACL
pt_pt: Visualiza permissionamento (ACL)

source: ACL Definition
de: Zugriffssteuerungslistendefinition (ACL Definition)
es: Nombre de l`ACL
fr: Nom de l'ACL
pt_pt: Definição do permissionamento (ACL)

source: Linked Groups
de: Verknüpfte Gruppen
es: Grupos vinculados
fr: Groupes liés
pt_pt: Grupos associados

source: Enabled
de: Aktiviert
es: activado
fr: Activé
pt_pt: Ativado

source: Disabled
de: Deaktiviert
es: discapacitado
fr: Désactivé
pt_pt: Desativado

source: Status
es: estatus
fr: Statut
pt_pt: Estado

source: Additional Information
de: Weitere Informationen
es: informaciones suplementarias
fr: Informations supplémentaires
pt_pt: Informação Adicional

source: Comments
de: Kommentare
es: comentarios
fr: Commentaires
pt_pt: Comentários

source: Accessible Pages
de: Seiten auf die Sie Zugriff haben
es: Paginas disponibles
fr: Pages disponibles
pt_pt: Páginas disponiveis

source: Main Menu
de: Hauptmenü
es: Menu principal
fr: Menu principal
pt_pt: Menu principal

source: Visible page
de: Sichtbare Seite
es: Paginas visibles
fr: Pages visibles
pt_pt: Página Visivel

source: Required
de: Erforderlich
es: necesario
fr: Requis
pt_pt: Requerido

source: Already exists
de: Existiert bereits
es: Ya existente
fr: Déjà éxistant
pt_pt: Já existe

source: Required field
de: Erforderliches Feld
es: Campo obligatorio
fr: Champ requis
pt_pt: Campo Requerido

source: Modify
de: Bearbeiten
es: Editar
fr: Modifier
pt_pt: Modificar

source: Save
de: Speichern
es: guardar
fr: Sauvegarder
pt_pt: Salvar

source: Delete
de: Löschen
es: eliminar
fr: Supprimer
pt_pt: Remover

source: Resources
de: Ressourcen
es: recursos
fr: Ressources
pt_pt: Recursos

source: Topology
de: Topologie
es: topología
fr: Topologie
pt_pt: Topologia

source: No access
de: Kein Zugriff
es: Sin acceso
fr: Pas d'accès
pt_pt: Sem acesso

source: Read/Write
de: Lesen/Schreiben
es: Lectura / Escritura
fr: Lecture/Ecriture
pt_pt: Leitura/Escrita

source: Read Only
de: Nur Lesen
es: Solo lectura
fr: Lecture seulement
pt_pt: Somente Leitura

source: Description
de: Beschreibung
es: Descripción
pt_pt: Descrição

source: Options
de: Optionen
es: Opciones
pt_pt: Opções

source: Do you confirm the deletion ?
de: Bestätigen Sie die Löschung?
es: ¿Confirma usted esta eliminación?
fr: Confirmez-vous cette suppression ?
pt_pt: Você confirma esta remoção ?

source: Do you confirm the duplication ?
de: Bestätigen Sie die Duplizierung?
es: ¿Confirma usted la duplicación?
fr: Confirmez-vous la duplication ?
pt_pt: Você confirma a duplicação ?

source: More actions...
de: Weitere Aktionen...
es: Otras acciones ...
fr: Plus d'actions...
pt_pt: Mais ações ...

source: Duplicate
de: Duplizieren
es: duplicar
fr: Dupliquer
pt_pt: Duplicado

source: Enable
de: Aktivieren
es: activar
fr: Activer
pt_pt: Ativar

source: Disable
de: Deaktivieren
es: desactivar
fr: Désactiver
pt_pt: Desativar

source: Contacts
de: Kontakte
es: Contactos
pt_pt: Contactos

source: Contact Groups
de: Kontaktgruppen
es: Grupos de contactos
fr: Groupes de contacts
pt_pt: Grupos de Contacto

source: Add a Group
de: Gruppe hinzufügen
es: Agregar un grupo
fr: Ajouter un groupe
pt_pt: Adicionar um Grupo

source: Modify a Group
de: Gruppe bearbeiten
es: Editar un grupo
fr: Modifier un groupe
pt_pt: Modificar um Grupo

source: View a Group
de: Gruppe anzeigen
es: Ver un grupo
fr: Visualiser un groupe
pt_pt: Visualizar um Grupo

source: Group Name
de: Gruppenname
es: Nombre del grupo
fr: Nom du groupe
pt_pt: Nome do Grupo

source: Relations
de: Beziehungen
es: Relaciones
pt_pt: Relações

source: Menu access list link
de: Menüzugriffslisten
es: Enlaces al menú de acceso
fr: Liens vers les accès aux menus
pt_pt: Link para lista de acesso de Menu

source: Resources access list link
de: Ressourcenzugriffslisten
es: Enlaces de acceso a recursos
fr: Liens vers les accès aux ressources
pt_pt: Link para lista de acesso de Recursos

source: Action access list link
de: Aktionszugriffslisten
es: Enlaces a acciones autorizadas.
fr: Liens vers les actions autorisées
pt_pt: Link para lista de acesso de Ação

source: Linked Contacts
de: Verknüpfte Kontakte
es: Contactos vinculados
fr: Contacts liés
pt_pt: Contactos associados

source: Linked Contact Groups
de: Verknüpfte Kontaktgruppen
es: Grupos vinculados de contactos
fr: Groupes de contacts liés
pt_pt: Grupos de Contactos associados

source: Menu access
de: Zugriff auf Menüs
es: Acceso a los menús.
fr: Accès aux menus
pt_pt: Acessos de Menu

source: Actions access
de: Zugriff auf Aktionen
es: Acciones autorizadas
fr: Actions autorisées
pt_pt: Actions autorisées

source: Resources access
de: Zugriff auf Ressourcen
es: Acceso a recursos
fr: Accès aux ressources
pt_pt: Acessos de Recursos

source: List
de: Liste
es: lista
fr: Liste
pt_pt: Lista

source: Form
de: Formular
es: formulario
fr: Formulaire
pt_pt: Formulário

source: Post Validation
de: Post-Validierung
es: Post validación
pt_pt: Pós Validação

source: Compulsory Name
de: Erforderlicher Name
es: Nombre obligatorio
fr: Nom obligatoire
pt_pt: Nome obrigatorio

source: Compulsory Alias
de: Erforderlicher Alias
es: Alias ​​obligatorio
fr: Alias obligatoire
pt_pt: Apelido obrigatorio

source: Name is already in use
de: Name wird bereits verwendet
es: El nombre ya está en uso.
fr: Le nom est déjà utilisé
pt_pt: Nome já esta em uso

source: Required fields
de: Benötigte Felder
es: Campos obligatorios
fr: Champs requis
pt_pt: Campos obrigatorios

source: Contactgroups exists. If you try to use a LDAP contactgroup, please verified if a Centreon contactgroup has the same name.
de: Kontaktgruppe existiert bereits. Wenn Sie versuchen eine LDAP-Kontaktgruppe zu verwenden, stellen Sie bitte sicher, dass nicht bereits eine Centreon Kontaktgruppe mit dem gleichen Namen existiert.
es: Este grupo de contactos existe. Si utiliza un grupo de contactos LDAP, asegúrese de que un grupo de contactos local de Centreon no use el mismo nombre.
fr: Ce groupe de contacts existe. Si vous utiliser un group de contact LDAP, vérifier qu'un groupe de contact local à Centreon n'utilise pas le même nom.
pt_pt: Grupos de Contacto já existe. Se você esta tentando usar um grupo de contacto do LDAP, verifique se ele não tem o mesmo nome de um grupo de contacto do Centreon.

source: Group Information
de: Gruppeninformationen
es: Información general
fr: Informations générales
pt_pt: Informações do Grupo

source: Authorizations information
de: Autorisierungsinformationen
es: permisos
fr: Autorisations
pt_pt: Informações de Autorizações

source: Add an Action
de: Aktion hinzufügen
es: Añadir una acción
fr: Ajouter une action
pt_pt: Adiciona uma Ação

source: Modify an Action
de: Aktion bearbeiten
es: Editar una acción
fr: Modifier une action
pt_pt: Modifica uma Ação

source: View an Action
de: Aktion anzeigen
es: Ver una acción
fr: Visualiser une action
pt_pt: Visualiza uma Ação

source: Action Name
de: Aktionsname
es: Nombre de la acción.
fr: Nom de l'action
pt_pt: Nome da Ação

source: Enable/Disable Checks for a service
de: Überprüfungen für einen Service (de)aktivieren
es: Habilitar / deshabilitar cheques para un servicio
fr: Activer/Désactiver les vérifications pour un service
pt_pt: Ativa/Desativa Checagem para um serviço

source: Enable/Disable Notifications for a service
de: Benachrichtigungen für einen Service (de)aktivieren
es: Habilitar / deshabilitar notificaciones para un servicio
fr: Activer/Désactiver les notifications pour un service
pt_pt: Ativa/Desativa Notificações para um serviço

source: Acknowledge a service
de: Service zur Kenntnis nehmen
es: Pagar un servicio
fr: Acquitter un service
pt_pt: Conhecimento de um serviço

source: Disacknowledge a service
de: Inkenntnisnahme eines Services entfernen
es: Eliminar servicio de compensación de incidentes
fr: Supprimer l'acquittement de l'incident du service
pt_pt: Remove Conhecimento de um serviço

source: Re-schedule the next check for a service
de: Nächste Überprüfung für einen Service neu ansetzen
es: Reprogramar la próxima verificación de un servicio
fr: Re-planifier la prochaine vérification d'un service
pt_pt: Reagenda a próxima checagem para um serviço

source: Re-schedule the next check for a service (Forced)
de: Nächste Überprüfung für einen Service neu ansetzen (erzwungen)
es: Reprogramar la próxima verificación de un servicio (Forzado)
fr: Re-planifier la prochaine vérification d'un service (Forcé)
pt_pt: Reagenda a próxima checagem para um serviço (Forçar)

source: Schedule downtime for a service
de: Ausfallszeit für einen Service ansetzen
es: Programar un tiempo de espera para un servicio
fr: Planifier une plage de maintenance pour un service
pt_pt: Agendamento de tempo de baixa para um serviço

source: Add/Delete a comment for a service
de: Kommentar für einen Service hinzufügen/löschen
es: Añadir / Eliminar comentario para un servicio
fr: Ajouter/Supprimer un commentaire pour un service
pt_pt: Adiciona/Remove um comentario para um serviço

source: Enable/Disable Event Handler for a service
de: Event Handler für einen Service (de)aktivieren
es: Habilitar / deshabilitar el Administrador de eventos para un servicio
fr: Activer/Désactiver le gestionnaire d'événements pour un service
pt_pt: Ativa/Desativa Manipulação de Evento para um serviço

source: Enable/Disable Flap Detection of a service
de: Flackernerkennung für einen Service (de)aktivieren
es: Activar / desactivar la detección de bagotage de un servicio
fr: Activer/Désactiver la détection de bagotage d'un service
pt_pt: Ativa/Desativa Detecção de Alternância para um serviço

source: Enable/Disable passive checks of a service
de: Passive Überprüfungen für einen Service (de)aktivieren
es: Habilitar / deshabilitar el control pasivo de un servicio
fr: Activer/Désactiver le contrôle passif d'un service
pt_pt: Ativa/Desativa checagem passiva de um serviço

source: Submit result for a service
de: Ergebnis für einen Service einreichen
es: Enviar un resultado para un servicio
fr: Soumettre un résultat pour un service
pt_pt: Envia resultado para um serviço

source: Display executed command by monitoring engine
de: Angezeigten Befehl durch die Monitoring Engine ausführen lassen
es: Ver el comando ejecutado por el motor de supervisión.
fr: Afficher la commande exécutée par le moteur de supervision
pt_pt: Mostra o comando executado pelo o motor de monitoramento

source: Enable/Disable Checks for a host
de: Überprüfungen für einen Host (de)aktivieren
es: Habilitar / deshabilitar cheques para un host
fr: Activer/Désactiver les vérifications pour un hôte
pt_pt: Ativa/Desativa Checagens para um host

source: Enable/Disable Notifications for a host
de: Benachrichtigungen für einen Host (de)aktivieren
es: Habilitar / deshabilitar notificaciones para un host
fr: Activer/Désactiver les notifications pour un hôte
pt_pt: Ativa/Desativa Notificações para um host

source: Acknowledge a host
de: Host zur Kenntnis nehmen
es: Reconocer un anfitrión
fr: Acquitter un hôte
pt_pt: Reconhecimento de host

source: Disaknowledge a host
de: Inkenntnisnahme eines Hosts entfernen
es: Eliminar el acuse de recibo del incidente del host.
fr: Supprimer l'acquittement de l'incident de l'hôte
pt_pt: Remove o reconhecimento de host

source: Schedule the check for a host
de: Überprüfung für einen Host ansetzen
es: Verificación de horarios para un host
fr: Planifier la vérification pour un hôte
pt_pt: Agenda a checagem para um host

source: Schedule the check for a host (Forced)
de: Überprüfung für einen Host ansetzen (erzwungen)
es: Verificación de horarios para un host (Forzado)
fr: Planifier la vérification pour un hôte (Forcé)
pt_pt: Agenda a checagem para um host (Forçado)

source: Schedule downtime for a host
de: Ausfallszeit für einen Host ansetzen
es: Programar un tiempo de espera para un anfitrión
fr: Planifier une plage de maintenance pour un hôte
pt_pt: Agenda manutenção para um host

source: Add/Delete a comment for a host
de: Kommentar für einen Host hinzufügen/löschen
es: Añadir / Eliminar un comentario para un host
fr: Ajouter/Supprimer un commentaire pour un hôte
pt_pt: Adiciona/Remove um comentário para um host

source: Enable/Disable Event Handler for a host
de: Event Handler für einen Host (de)aktivieren
es: Habilitar / deshabilitar el administrador de eventos para un host
fr: Activer/Désactiver le gestionnaire d'événements pour un hôte
pt_pt: Ativa/Desativa Manipulação de Evento para um host

source: Enable/Disable Flap Detection for a host
de: Flackernerkennung für einen Host (de)aktivieren
es: Habilitar / deshabilitar la detección de equipaje para un host
fr: Activer/Désactiver la détection de bagotage pour un hôte
pt_pt: Ativa/Desativa Detecção de Variação para um host
