Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: View a Connector
de: Konnektor anzeigen
es: Ver un conector
fr: Visualiser un connecteur
pt_pt: Visualizar Conector

source: Connector Name
de: Konnektorname
es: Nombre del conector
fr: Nom du connecteur
pt_pt: Nome do Conector

source: Connector Description
de: Konnektorbeschreibung
es: Descripción del conector
fr: Description du connecteur
pt_pt: Descrição do Conector

source: Used by command
de: Verwendet von Befehl
es: Utilizado por el comando
fr: Utilisé par la commande
pt_pt: Usado pelo o comando

source: Connector Status
de: Konnektorstatus
es: Estado del conector
fr: Statut du connecteur
pt_pt: Estado do Conector

source: Add Vendor
de: Hersteller hinzufügen
es: Añadir un constructor
fr: Ajouter un constructeur
pt_pt: Adicionar Fabricante

source: Modify Vendor
de: Hersteller bearbeiten
es: Editar un constructor
fr: Modifier un constructeur
pt_pt: Modificar Fabricante

source: View Vendor
de: Hersteller anzeigen
es: Visualizar un constructor
fr: Visualiser un constructeur
pt_pt: Visualizar Fabricante

source: Add a Service Template Model
de: Servicetemplatemodell hinzufügen
es: Agregar una plantilla de servicio
fr: Ajouter un modèle de service
pt_pt: Adicionar Modelo de Serviço

source: Modify a Service Template Model
de: Servicetemplatemodell bearbeiten
es: Modificar una plantilla de servicio
fr: Modifier un modèle de service
pt_pt: Modificar Modelo de Serviço

source: View a Service Template Model
de: Servicetemplatemodell anzeigen
es: Visualizar un modelo de servicio.
fr: Visualiser un modèle de service
pt_pt: Visualizar Modelo de Serviço

source: Using a Template Model allows you to have multi-level Template connections
de: Die Verwendung eines Templatemodells erlaubt Templateverbindungen über mehrere Stufen
es: Puedes combinar varios modelos para generar uno nuevo.
fr: Vous pouvez combiner plusieurs modèles pour en générer un nouveau
pt_pt: Usando um modelo permite que você tenha conexões de modelos de vários níveis

source: Linked to host templates
de: Mit Hosttemplates verbunden
es: Vinculado a los modelos de hosts.
fr: Liés aux modèles d'hôtes
pt_pt: Modelos associados ao Host

source: Is volatile
de: Ist volatil
es: Es volátil
fr: Est volatile
pt_pt: é volatil

source: Parallel Check
de: Parallele Überprüfung
es: Controles paralelos
fr: Contrôles parallèles
pt_pt: Checagem Paralela

source: Process Perf Data
de: Leistungsdaten verarbeiten
es: Procesamiento de datos de rendimiento
fr: Traitement des données de performance
pt_pt: Processamento de dados de Performance

source: Service Configuration
de: Servicekonfiguration
es: Configuración del servicio
fr: Configuration du service
pt_pt: Configuração de Serviço

source: Service Extended Info
de: Erweiterte Serviceinformationen
es: Información adicional del servicio
fr: Informations supplémentaires du service
pt_pt: Informações extendidas de Serviço

source: Perfdata Options
de: Leistungsdaten Optionen
es: Opciones de datos de rendimiento
fr: Options des données de performance
pt_pt: Opções de Performance

source: Select Timeperiod...
de: Zeitraum auswählen...
es: Elige el periodo de tiempo ...
fr: Choisissez la période de temps...
pt_pt: Selecione Período de Tempo...

source: Resulting Time Period with inclusions
de: Resultierender Zeitraum mit Inklusionen
es: Período de tiempo resultante con inclusiones
fr: Période Temporelle résultante avec les inclusions
pt_pt: Período de tempo resultante com inclusões

source: Time Range
de: Zeitspanne
es: Periodo de tiempo
fr: Période de temps
pt_pt: Período de Tempo

source: Exception List
de: Ausnahmenliste
es: Lista de excepciones
fr: Liste d'exceptions
pt_pt: Lista de Excessões

source: Timeperiod Name
de: Zeitraumname
es: Nombre del período de tiempo
fr: Nom de la période temporelle
pt_pt: Nome do Periodo de Tempo

source: Timeperiod Alias
de: Zeitraumalias
es: Alias ​​del periodo de tiempo
fr: Alias de la période temporelle
pt_pt: Atalho para Periodo de Tempo

source: Unset Timerange
de: Zeitspanne zurücksetzen
es: Períodos de tiempo ilimitados
fr: Périodes temporelles indéfinies
pt_pt: Desconfigurar Intervalo de Tempo

source: Included Timerange
de: Inkludierte Zeitspanne
es: Períodos de tiempo incluidos
fr: Périodes temporelles inclues
pt_pt: Intervalo de Tempo incluido

source: Excluded Timerange
de: Exkludierte Zeitspanne
es: Períodos de tiempo excluidos
fr: Périodes temporelles exclues
pt_pt: Intervalo de Tempo excluido

source: Timerange Overlaps
de: Zeitspannenüberlappungen
es: Los períodos de tiempo están superpuestos.
fr: Les périodes temporelles se superposent
pt_pt: Sobreposições de Intervalo de Tempo

source: Hover on timeline to see more information
de: Fahren Sie mit der Maus über die Timeline um weitere Informationen anzuzeigen
es: Pase el cursor sobre la línea de tiempo para obtener más información.
fr: Survoler la chronologie pour obtenir plus d'informations
pt_pt: Passe o cursor sobre a linha do tempo para ver mais informações

source: No time period selected
de: Kein Zeitraum ausgewählt
es: Ningún período de tiempo seleccionado
fr: Aucune période temporelle sélectionnée
pt_pt: Nenhum período de tempo selecionado

source: Do you confirm this deletion?
de: Bestätigen Sie die Löschung?
es: ¿Confirma usted la eliminación?
fr: Confirmez-vous la suppression ?
pt_pt: Você confirma essa remoção ?

source: Add a Time Period
de: Zeitraum hinzufügen
es: Añadir un período de tiempo
fr: Ajouter une période de temps
pt_pt: Adiciona um Período de Tempo

source: Modify a Time Period
de: Zeitraum bearbeiten
es: Cambiar un periodo de tiempo
fr: Modifier une période de temps
pt_pt: Modifica um Período de Tempo

source: View a Time Period
de: Zeitraum anzeigen
es: Visualizar un periodo de tiempo
fr: Visualiser une période de temps
pt_pt: Visualiza um Período de Tempo

source: Time Period Name
de: Zeitraumname
es: Nombre del período de tiempo
fr: Nom de la période temporelle
pt_pt: Nome do Período de Tempo

source: Extended Settings
de: Erweiterte Einstellungen
es: Opciones avanzadas
fr: Options avancées
pt_pt: Opções Extendidas

source: Timeperiod templates
de: Zeitraumtemplates
es: Modelo de periodo de tiempo
fr: Modèle de période temporelle
pt_pt: Modelos de Período de Tempo

source: Error in hour definition
de: Fehler in der Stundendefinition
es: Error en la definición del tiempo.
fr: Erreur dans la définition de l'heure
pt_pt: Erro na definição de Hora

source: GMT is activated on your system. Exceptions will not be generated.
de: GMT ist auf ihrem System aktiviert. Es werden keine Ausnahmen erzeugt.
es: GMT está habilitado en su sistema. No se generarán excepciones.
fr: GMT est activé sur votre système. Les exceptions ne seront pas générées.
pt_pt: GMT esta ativado no seu sistema. Excessões não serão geradas.

source: Exceptions
de: Ausnahmen
es: Excepciones
pt_pt: Exceções

source: Add a Host Template
de: Hosttemplate hinzufügen
es: Agregar una plantilla de host
fr: Ajouter un modèle d'hôte
pt_pt: Adiciona um Modelo de Host

source: Modify a Host Template
de: Hosttemplate bearbeiten
es: Editar una plantilla de host
fr: Modifier un modèle d'hôte
pt_pt: Modifica Modelo de Host

source: View a Host Template
de: Hosttemplate anzeigen
es: Ver una plantilla de host
fr: Visualiser un modèle d'hôte
pt_pt: Visualiza Modelo de Host

source: IP Address / DNS
de: IP-Adresse / DNS
es: Dirección IP / DNS
fr: Adresse IP / DNS
pt_pt: Endereço IP / DNS

source: SNMP Community
es: Comunidad SNMP
fr: Communauté SNMP
pt_pt: Comunidade SNMP

source: A host can have multiple templates, their orders have a significant importance
de: Ein Host kann mehrere Templates verwenden, die Reihenfolge der Templates ist wichtig
es: Un host puede tener varios modelos, su orden tiene un significado significativo
fr: Un hôte peut avoir plusieurs modèles, leurs ordre à une importance significative
pt_pt: Um host pode ter múltiplos modelos, a ordem deles tem importância significativa

source: Here is a self-explanatory image.
de: Dieses Bild erklärt die Funktionsweise der Templatereihenfolge.
es: Aquí, una imagen de explicación.
fr: Ici, une image d'explication.
pt_pt: Aqui, uma imagem que fala por si.

source: Using a Template allows you to have multi-level Template connection
de: Die Verwendung eines Templates erlaubt Templateverbindungen über mehrere Stufen
es: Puedes combinar varios modelos para generar uno nuevo.
fr: Vous pouvez combiner plusieurs modèles pour en générer un nouveau
pt_pt: Usando um Modelo, permite que vocẽ tenha multiplos nives de conexão com outros Modelos

source: Macro name
de: Makroname
es: Nombre de la macro
fr: Nom de la macro
pt_pt: Nome da macro

source: Macro value
de: Makrowert
es: Valor de la macro
fr: Valeur de la macro
pt_pt: Valor da macro

source: Host Check Properties
de: Hostüberprüfungseigenschaften
es: Propiedades de control de host
fr: Propriétés du contrôle de l'hôte
pt_pt: Propriedades de Checagem de Host

source: Parent Host Categories
de: Übergeordnete Hostkategorien
es: Categoría de padres
fr: Catégorie d'hôtes parents
pt_pt: Categorias de Parentes de Host

source: Notification Options
de: Benachrichtigungsoptionen
es: Opciones de notificación
fr: Options de notifications
pt_pt: Opções de Notificação

source: Add a Host Extended Info
de: Erweiterte Hostinformationen hinzufügen
es: Añade información adicional al anfitrión
fr: Ajouter des informations supplémentaires à l'hôte
pt_pt: Adicionar informação Estendida de Host

source: Modify a Host Extended Info
de: Erweiterte Hostinformationen bearbeiten
es: Editar información adicional del anfitrión.
fr: Modifier les informations supplémentaires de l'hôte
pt_pt: Modificar informação Extendida de Host

source: View a Host Extended Info
de: Erweiterte Hostinformationen anzeigen
es: Ver información adicional del anfitrión
fr: Visualiser les es informations supplémentaires de l'hôte
pt_pt: Visualizar informação Estendida de Host

source: Monitoring engine
es: Motor de supervisión
fr: Moteur de supervision
pt_pt: Motor de Monitoramento

source: Status Map Image
de: Bild für die Statusmap
es: Imagen del mapa del estado.
fr: Image de la carte des états
pt_pt: Imagem para Mapa de Estado

source: 2d Coords
de: 2d Koordinaten
es: Coordenadas 2D
fr: Coordonnées 2D
pt_pt: Coordenadas 2D

source: 3d Coords
de: 3d Koordinaten
es: Coordenadas 3D
fr: Coordonnées 3D
pt_pt: Coordenadas 3D

source: Template name is already in use
de: Templatename wird bereits verwendet
es: Este nombre de modelo ya está en uso.
fr: Ce nom de modèle est déjà utilisé
pt_pt: Nome do Modelo já esta em uso

source: Host name is already in use
de: Hostname wird bereits verwendet
es: El nombre del host ya existe.
fr: Le nom de l'hôte existe déjà
pt_pt: Nome do Host já esta em uso

source: Host Configuration
de: Hostkonfiguration
es: Configuración del host
fr: Configuration de l'hôte
pt_pt: Configuração de Host

source: Host Extended Infos
de: Erweiterte Hostinformationen
es: Información detallada del anfitrión.
fr: Informations détaillées de l'hôte
pt_pt: Informações extendidas de Host

source: Add a template
de: Template hinzufügen
es: Añadir una plantilla
fr: Ajouter un modèle
pt_pt: Adicionar um Modelo

source: Linked Services Templates
de: Verknüpfte Servicetemplates
es: Plantillas de servicio relacionadas
fr: Modèles de service liés
pt_pt: Modelos de Serviços associados

source: Meta Service Names
de: Meta-Service Namen
es: Nombre de los meta-servicios.
fr: Nom du méta-services
pt_pt: Nome do Meta-Serviço

source: Dependent Meta Service Names
de: Namen der abhängigen Meta-Services
es: Nombre de los Meta-servicios relacionados
fr: Nom des Meta-services liés
pt_pt: Nome do Meta-Serviço dependente

source: Enabled Hosts
de: Aktivierte Hosts
es: Hosts habilitados
fr: Hôtes activés
pt_pt: Hosts Ativos

source: Disabled Hosts
de: Deaktivierte Hosts
es: Hosts desactivados
fr: Hôtes désactivés
pt_pt: Hosts Desativados

source: You are not allowed to access this host group
de: Sie sind nicht dazu berechtigt, auf diese Hostgruppe zuzugreifen
es: No tienes permiso para acceder a este grupo host
fr: Vous n'êtes pas autorisé à accéder à ce groupe d'hôte
pt_pt: Você não tem permissão de acessar este grupo de Host

source: Add a Host Group
de: Hostgruppe hinzufügen
es: Añadir un grupo de invitados
fr: Ajouter un groupe d'hôtes
pt_pt: Adicionar Grupo de Host

source: Modify a Host Group
de: Hostgruppe bearbeiten
es: Editar un grupo de invitados
fr: Modifier un groupe d'hôtes
pt_pt: Modificar Grupo de Host

source: View a Host Group
de: Hostgruppe anzeigen
es: Ver un grupo de invitados
fr: Visualiser un groupe d'hôtes
pt_pt: Visualizar Grupo de Host

source: Host Group Name
de: Hostgruppenname
es: Nombre del grupo de invitados.
fr: Nom du groupe d'hôtes
pt_pt: Nome do Grupo de Host

source: Linked Hosts
de: Verknüpfte Hosts
es: Hosts enlazados
fr: Hôtes liés
pt_pt: Hosts Associados

source: Linked Host Groups
es: Grupos relacionados de hosts
fr: Groupes d'hôtes liés
pt_pt: Grupos de Host Associado

source: Extended Information
de: Erweiterte Informationen
es: Información adicional
fr: Informations additionnelles
pt_pt: Informações Extendidas

source: Notes URL
de: Notizen-URL
es: URL
fr: URL
pt_pt: URL de Notas

source: Map Icon
es: Icono de la tarjeta
fr: Icône pour la carte
pt_pt: Ícone do Mapa

source: RRD retention
de: RRD-Aufbewahrungsdauer
es: Retención de archivos RRD
fr: Rétention des fichiers RRD
pt_pt: Retenção RRD

source: Output Message
de: Outputnachricht
es: Mensaje de salida
fr: Message de sortie
pt_pt: Mensagem de saída

source: Add a Trap definition
de: Trapdefinition hinzufügen
es: Añadir una definición de trampa
fr: Ajouter une définition de Trap
pt_pt: Adiciona uma definição de Trap

source: Modify a Trap definition
de: Trapdefinition bearbeiten
es: Modificar una definición de trampa
fr: Modifier une définition de Trap
pt_pt: Modifica definição de Trap

source: View a Trap definition
de: Trapdefinition anzeigen
es: Ver una definición de trampa
fr: View une définition de Trap
pt_pt: Visualiza definição de Trap

source: Trap name
es: Nombre de la trampa
fr: Nom du Trap
pt_pt: Nome do Trap

source: Default Status
de: Standardstatus
es: Estado por defecto
fr: Statut par défaut
pt_pt: Estado por padrão

source: Default Severity
de: Standardschweregrad
es: Criticidad por defecto
fr: Criticité par défaut
pt_pt: Severidade por padrão

source: Advanced matching mode
de: Fortgeschrittener Abgleichsmodus
es: Modo de correspondencia avanzada
fr: Mode de correspondance avancé
pt_pt: Modo avançado de combinação (match)

source: Submit result
de: Ergebnis einreichen
es: Enviar el resultado
fr: Envoyer le résultat
pt_pt: Enviar resultado

source: Reschedule associated services
de: In Verbindung stehende Services neu ansetzen
es: Reprogramar servicios asociados.
fr: Reprogrammer les services associés
pt_pt: Reagendar serviços associados

source: Special Command
de: Spezieller Befehl
es: Orden especial
fr: Commande spéciale
pt_pt: Comando Especial

source: Execute special command
de: Speziellen Befehl ausführen
es: Ejecutar una orden especial
fr: Executer une commande spéciale
pt_pt: Executar comando especial

source: Linked Services
de: Verknüpfte Services
es: Servicios relacionados
fr: Services liés
pt_pt: Serviços Associados

source: Route definition
de: Routendefinition
es: Regla de enrutamiento
fr: Régle de routage
pt_pt: Definição de Rota

source: Filter services
de: Services filtern
es: Servicios de filtro
fr: Filtrer les services
pt_pt: Filtro de serviços

source: Enable routing
de: Routing aktivieren
es: Habilita el enrutamiento de trampa
fr: Active le routage des traps
pt_pt: Ativa roteamento

source: Regexp
de: Regulärer Ausdruck
es: Expresión regular
fr: Expression régulière
pt_pt: Expressão Regular

source: Timeout
es: Tiempo máximo de ejecución
fr: Temps d'exécution maximum
pt_pt: Tempo Limite

source: Execution interval
de: Ausführungsintervall
es: Intervalo de ejecución
fr: Intervalle d'exécution
pt_pt: Intervalo de execução

source: Insert trap's information into database
de: Trap-Informationen in die Datenbank einfügen
es: Insertar capturas SNMP recibidas en la base de datos
fr: Insérer les traps SNMP reçu en base de données
pt_pt: Insere informação de traps no banco de dados

source: Output Transform
de: Outputtransformation
es: Regla detallada de transformación de estado (regexp)
fr: Règle de transformation du statut détaillé (regexp)
pt_pt: Transforma saída

source: Custom code
de: Benutzerdefinierter Modus
es: Código personalizado
fr: Code personnalisé
pt_pt: Código personalizado

source: Advanced matching behavior
de: Fortgeschrittenes Abgleichsverhalten
es: Modo de correspondencia avanzada
fr: Mode de correspondance avancé
pt_pt: Modo de correspondência avançada

source: If no match, submit default status
de: Wenn kein Treffer gefunden wird, Standardstatus einreichen
es: Si no coincide, envía el resultado por defecto.
fr: Si pas de correspondance, envoyer le résultat par défaut
pt_pt: Se não encontrado, envia status padrão

source: If no match, disable submit
de: Wenn kein Treffer gefunden wird, keinen Status einreichen
es: Si no hay partido, no envíe el resultado.
fr: Si pas de correspondance, ne pas envoyer le résultat
pt_pt: Se não encontrado, envio desativado

source: If match, disable submit
de: Wenn ein Treffer gefunden wird, keinen Status einreichen
es: Si encuentra el partido, no envíe el resultado
fr: Si correspondance trouvée, ne pas envoyer le résultat
pt_pt: Se encontrado, envio desativado

source: By OID
de: Nach OID
es: Por OID
fr: Par OID
pt_pt: Por OID

source: By OID and Host
de: Nach OID und Host
es: Por OID y host
fr: Par OID et hôte
pt_pt: Por OID e Host

source: Execution type
de: Ausführungstyp
es: Tipo de ejecución
fr: Type d'exécution
pt_pt: Tipo de execução

source: Parallel
es: en paralelo
fr: Parallèlement
pt_pt: Paralelo

source: Sequential
de: Sequentiell
es: secuencialmente
fr: Séquentiellement
pt_pt: Sequencial

source: Execution method
de: Ausführungsmethode
es: Método de tratamiento
fr: Méthode de traitement
pt_pt: Método de execução

source: Real-Time
de: Echtzeit
es: Tiempo real
fr: Temps réel
pt_pt: Tempo-Real

source: History
de: Historie
es: Historisé (recherche en base)
fr: Historisé (recherche en base)
pt_pt: Historico

source: Check Downtime
de: Ausfallszeit überprüfen
es: Compruebe si el servicio está parado
fr: Contrôle si le service est en plage de maintenance
pt_pt: Checagem de Manutenção

source: Preexec definition
es: Definiendo el comando PREEXEC
fr: Définition de la commande PREEXEC
pt_pt: Definição de pré-execução

source: The same OID element already exists
de: Die OID existiert bereits
es: El mismo OID ya existe.
fr: Le même OID existe déjà
pt_pt: O mesmo OID já existe

source: Advanced matching rules
de: Fortgeschrittene Abgleichsregeln
es: Reglas de correspondencia avanzadas
fr: Règles de correspondance avancées
pt_pt: Regras de correspondencia avançada

source: Main
de: Haupt
es: Opciones generales
fr: Options générales
pt_pt: Principal

source: Advanced
de: Erweitert
es: avanzado
fr: Avancé
pt_pt: Avançado

source: Main information
de: Hauptinformation
es: Informacion principal
fr: Informations principales
pt_pt: Informação Principal

source: Convert Trap information
de: Trap-Informationen konvertieren
es: Convertir información de trampas
fr: Convertir les informations des traps
pt_pt: Converter informações de Trap

source: Action 1 : Submit result to Monitoring Engine
de: Aktion 1: Ergebnis an die Monitoring Engine weitergeben
es: Acción 1: Presentar el resultado al motor de supervisión.
fr: Action 1 : Soumettre le résultat au moteur de supervision
pt_pt: Ação 1 : Enviar resultado para o motor de Monitoramento

source: Action 2 : Force rescheduling of service check
de: Aktion 2: Erneutes Ansetzen einer Serviceüberprüfung erzwingen
es: Acción 2: Force Replanning Service Control
fr: Action 2 : Forcer la replanification du contrôle du service
pt_pt: Ação 2 : Forçar o reagendamento da checagem de serviço

source: Action 3 : Execute a Command
de: Aktion 3: Befehl ausführen
es: Acción 3: Ejecutar una orden.
fr: Action 3 : Exécuter une commande
pt_pt: Ação 3 : Executar um comando

source: Trap description
de: Trapbeschreibung
es: Descripción du Trap SNMP
fr: Description du Trap SNMP
pt_pt: Descrição do Trap (SNMP)

source: Route parameters
de: Routenparameter
es: Configuraciones de enrutamiento
fr: Paramètres de routage
pt_pt: Parametros de Rota

source: Pre execution commands
de: Pre-Ausführungsbefehle
es: Orden de pre-tratamiento
fr: Commande pré-traitement
pt_pt: Pré-execução de comandos

source: Linked services
de: Verknüpfte Services
es: Servicios relacionados
fr: Services liés
pt_pt: Serviços associados

source: Linked service templates
de: Verknüpfte Servicetemplates
es: Plantillas de servicio relacionadas
fr: Modèles de service liés
pt_pt: Modelos de serviços associados

source: PREEXEC command
de: PREEXEC-Befehl
es: Comando PREEXEC (tipo SNMPTT)
fr: Commande PREEXEC (de type SNMPTT)
pt_pt: Comando de Pré-Execução (do tipo SNMPTT)

source: You are not allowed to access this host
de: Sie sind nicht dazu berechtigt, auf diesen Host zuzugreifen
es: No tienes permiso para acceder a este host
fr: Vous n'êtes pas autorisé à accéder à cet hôte
pt_pt: Você não tem permissão para acessar este host

source: Add a Host
de: Host hinzufügen
es: Agregar un host
fr: Ajouter un hôte
pt_pt: Adicionar um Host

source: Modify a Host
de: Host bearbeiten
es: Editar un host
fr: Modifier un hôte
pt_pt: Modificar um Host

source: View a Host
de: Host anzeigen
es: Ver un host
fr: Visualiser un hôte
pt_pt: Visualizar um Host

source: Monitored from
de: Überwacht von
es: Monitoreado desde el colector.
fr: Surveillé depuis le collecteur
pt_pt: Monitorado de

source: Checks Enabled
de: Überprüfungen aktiviert
es: Cheques habilitados
fr: Vérifications activées
pt_pt: Checagem Ativa

source: Create Services linked to the Template too
de: Mit diesem Template verknüpfte Services ebenfalls erstellen
es: Crea servicios modelo también
fr: Créer aussi les services liés aux modèles
pt_pt: Cria Serviços associados com o modelo também

source: Hostgroup Relations
de: Hostgruppenbeziehungen
es: Grupos de anfitriones
fr: Groupes d'hôtes d'appartenance
pt_pt: Relações de Grupo de Hosts

source: Host Categories Relations
de: Hostkategorienbeziehungen
es: Relación con las categorías de hosts.
fr: Relation avec les catégories d'hôtes
pt_pt: Relação de Categorias de Hosts

source: Parent Hosts
de: Übergeordnete Hosts
es: Anfitriones
fr: Hôtes parents
pt_pt: Hosts Parentes

source: Child Hosts
de: Untergeordnete Hosts
es: Anfitriones de niños
fr: Hôtes enfants
pt_pt: Hosts Filhos

source: Parent Host Groups
de: Übergeordnete Hostgruppen
es: Grupos de padres
fr: Groupes d'hôtes parents
pt_pt: Parente de Grupo de Hosts

source: ACL Resource Groups
de: Zugriffslisten (ACL) Ressourcengruppen
es: Grupo de acceso a recursos
fr: Groupe d'accès aux ressources
pt_pt: Grupos de recursos de permissionamento (ACL)

source: Mandatory field for ACL purpose.
de: Erforderliches Feld für den Zugriffslistenzweck (ACL Zweck)
es: Este campo es obligatorio para el uso de ACLs.
fr: Ce champs est obligatoire pour l'utilisation des ACL
pt_pt: Campo obrigatório para fins de permissionamento (ACL).

source: Impossible to change server due to parentship with other hosts
de: Aufgrund einer Relation mit übergeordneten Hosts ist ein Serverwechsel nicht möglich
es: No se puede cambiar el servidor debido a una relación con otros hosts
fr: Impossible de changer le serveur à cause d'une relation avec d'autres hôtes
pt_pt: Impossível mudar de servidor devido ao parentesco com outros hosts
