Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: snmpttconvertmib Directory + Binary
pt_pt: Caminho completo para o executável snmpttconvertmib

source: SNMPTT log file
pt_pt: Nome do Ficheiro de Log SNMPTT

source: Can't read in directory
pt_pt: Não é possível ler no diretório

source: Reporting time period
pt_pt: Período de relatório

source: Start Hour
pt_pt: Hora de início

source: Start Minute
pt_pt: Comece minuto

source: End Hour
pt_pt: Hora final

source: End Minute
pt_pt: Minuto final

source: Centreon Broker socket path
pt_pt: Caminho do soquete Centreon Broker Unix

source: Add a Service comment
pt_pt: Adicionar para um serviço

source: Add a Service downtime
pt_pt: Plano para um serviço

source: Add a service downtime
pt_pt: Plano de serviço

source: Add a host downtime
pt_pt: Plano para um host

source: Add a Host downtime
pt_pt: Adicionar um tempo de inatividade para um host

source: Select a downtime type
pt_pt: Selecione um tipo de tempo de parada

source: Connection Error to NDO DataBase !
pt_pt: Erro ao conectar-se ao banco de dados NDO!

source: Active Check
pt_pt: Controle ativo

source: Last time up
pt_pt: A última vez em um estado

source: Last time unreachable
pt_pt: Última vez em um estado inacessível

source: Last ok time
pt_pt: Última vez em um estado ok

source: Last warning time
pt_pt: Última vez em estado de alerta

source: Last unknown time
pt_pt: Última vez em um estado desconhecido

source: Last critical time
pt_pt: Última vez em estado crítico

source: Services: Set Downtime
pt_pt: Serviços: planeje um tempo limite

source: Hosts: Set Downtime
pt_pt: Hosts: planeje um tempo de parada

source: Disacknowledge
fr: Désacquitter
pt_pt: Sem Conhecimento

source: Enable Notification
pt_pt: Ativar notificação

source: Disable Notification
pt_pt: Desativar notificação

source: Enable Check
pt_pt: Ativar verificação

source: Disable Check
pt_pt: Desativar verificação

source: Sort by Name
pt_pt: Ordenar por nome

source: Host Category Name
pt_pt: Nome da categoria do host

source: Parent Template
pt_pt: Modelos pai

source: Service Template Name
pt_pt: Nome do modelo de serviço

source: Service Templates names
pt_pt: Nomes de modelos de serviço

source: Parent Templates
pt_pt: Modelos pai

source: Host Templates name
pt_pt: Nome dos modelos de hosts

source: Host Template Name
pt_pt: Nome do modelo de host

source: Host Parallel Templates
pt_pt: Modelos de host paralelo

source: Include Timeperiods
pt_pt: Incluir períodos

source: Meta Service Name
pt_pt: Nome do Meta Serviço

source: Compulsory Contact Group
pt_pt: Grupo de Contacto Obrigatório

source: Service Group Name
pt_pt: Nome do Grupo de Serviço

source: Include Comments
pt_pt: Incluir comentários

source: Monitoring Engine Configuration Files Export
pt_pt: Exportando ficheiros de configuração do Supervisor Engine

source: Generate Files
pt_pt: Gerar ficheiros

source: Dependencies Management
pt_pt: Gerenciamento de Dependência

source: Current Activation
pt_pt: Ativação atual

source: Relations between Elements
pt_pt: Relações entre os elementos

source: Export in XML too
pt_pt: Exportar também em XML

source: Run debug (-v)
pt_pt: Iniciar a depuração (-v)

source: Run Optimisation test (-s)
pt_pt: Executar um teste de otimização (-s)

source: External Command
pt_pt: Pedido externo

source: Correlation
pt_pt: Ativar correlação

source: Apply configuration
pt_pt: Aplicar configuração

source: SSH Private key
pt_pt: Chave privada SSH

source: Object Cache File
pt_pt: Ficheiro de cache de objetos

source: Precached Object File
pt_pt: Ficheiro de objeto de pré-cache

source: Free child process memory
pt_pt: Memória livre de processos filhos

source: Child processes fork twice
pt_pt: Criando dois processos filhos para cada controle

source: Enable embedded Perl
pt_pt: Usando o interpretador Perl interno

source: Use embedded Perl implicitly
pt_pt: Uso implícito do interpretador Perl integrado

source: Embedded Perl initialisation file
pt_pt: Intérprete Perl Integrado

source: Centstorage debug
pt_pt: Depuração do Centstorage

source: Mminutes
pt_pt: Minutos

source: Disable submit result if no matched rules
pt_pt: Desativar atualização de serviço se nenhuma regra for válida

source: The list of pollers is <a href="./main.php?p=60901">here</a>.
pt_pt: A lista de coletores esta em <a href="./main.php?p=60901">ici</a>.

source: <br><b>Centreon : </b>A force-reload signal has been sent to
pt_pt: <br><b>Centreon : </b>Une commande de redémarrage forcée a été envoyée vers

source: ACL rules
pt_pt: Regras de acesso

source: All Graphs
pt_pt: Todos os gráficos

source: Check Version
pt_pt: Verifique a versão

source: Donate
pt_pt: Doação

source: Host comments
pt_pt: Comentários relacionados ao host

source: Interactive View
pt_pt: Visualização interativa

source: Interactive view access
pt_pt: Visualização interativa

source: Manage
pt_pt: Gerenciar

source: Monitoring Engine Statistics
pt_pt: Estatísticas do agendador

source: Pre-Update
pt_pt: Pré-atualização

source: Service comments
pt_pt: Comentários para este serviço

source: Support
pt_pt: Apoio, suporte

source: Web Site
pt_pt: Site web

source: The CSRF * token is invalid, please click
pt_pt: O token * CSRF é inválido, por favor clique aqui

source: * Cross-Site Request Forgery : unauthorized commands are transmitted
pt_pt: * Cross-Site Request Forgery: pedidos não autorizados foram encaminhados

source: Please wait...
pt_pt: Por favor espere ...

source: Exclude Timeperiods
pt_pt: Períodos excluídos

source: Monitoring Engine configuration upload
pt_pt: Enviando a configuração do mecanismo do supervisor

source: Poller/Centreon Server
pt_pt: Collector

source: Upload Options
pt_pt: Opções de envio

source: Delete all configuration for the chosen type of files
pt_pt: Excluir toda a configuração dos tipos de ficheiro selecionados

source: Update definition in case of double definition
pt_pt: Atualizar definição quando definição duplicada

source: Include comments
pt_pt: Incluir comentários

source: File Type
pt_pt: Tipo de ficheiro

source: For archive upload, be sure that the first line of each file has no importance because it is not handled.<br />Avoid to begin with a definition.
pt_pt: Ao enviar um ficheiro, certifique-se de que a primeira linha de cada ficheiro não seja importante, porque não é levada em conta. <br /> Evite começar com uma definição.

source: Template based method file
pt_pt: Ficheiro de método baseado em modelo

source: Notification Command
pt_pt: Comando de notificação

source: It is recommended to upload all the Command definitions first by specifying their types.
pt_pt: É recomendável que você primeiro envie as definições de comando especificando seu tipo.

source: Indeed, it's the only way to make a difference between Check and Notification Commands.
pt_pt: De fato, essa é a única maneira de diferenciar os comandos de notificação e verificação.

source: File (zip, tar or cfg)
pt_pt: Ficheiro (zip, tar ou cfg)

source: Manual Filling
pt_pt: Preenchimento manual

source: Increment
pt_pt: Incremento

source: Replace
pt_pt: Substituição

source: Group member update behavior
pt_pt: Atualizar o comportamento dos membros do grupo

source: Create new object with prefix
pt_pt: Criar um novo objeto com um prefixo

source: Replace existing ones
pt_pt: Substituir ficheiros existentes

source: Behavior on duplicate names
pt_pt: Comportamento em nomes duplicados

source: Prefix
pt_pt: Prefixo de tabelas

source: Load
pt_pt: Carregador

source: Not supported extension
pt_pt: Extensão não suportada

source: File loading OK
pt_pt: Carregando o ficheiro OK

source: Manual filling OK
pt_pt: Preenchimento manual OK

source: File loading KO
pt_pt: Carregando o ficheiro KO

source: Data recovery OK
pt_pt: Recuperação de dados OK

source: Data recovery KO
pt_pt: KO Recuperação de Dados

source: Entries are registered
pt_pt: As entradas são salvas

source: Could not import ndo2db
pt_pt: Impossível importar ndo2db

source: Could not import ndomod
pt_pt: Impossível importar ndomod

source: Import behavior
pt_pt: Resultado da importação

source: Display Options
pt_pt: Opções de exibição

source: Archive logs of monitoring engine
pt_pt: Registros de ficheiro do mecanismo de supervisão

source: Centstorage Configuration
pt_pt: Configuração do Centstorage

source: in seconds - Must be higher than 10
pt_pt: em segundos - deve ser maior que 10

source: in seconds - Must be higher than 2
pt_pt: em segundos - deve ser maior que 2

source: Retain Satus Information
pt_pt: Informações do status de retenção

source: Additionnal Information
pt_pt: Informação adicional

source: Choose a host, then its associated service.
pt_pt: Escolha um host e, em seguida, seu serviço associado.

source: Host / Service Data Source
pt_pt: Fonte de Dados do Host / Serviço

source: Required Fields 'Host' and 'Service' list
pt_pt: Campos obrigatórios na lista de` Hosts` e `Services`

source: Required Field 'Service' list
pt_pt: Campo obrigatório na lista" Service`

source: Grid background color
pt_pt: Cor de fundo da grade

source: Main grid color
pt_pt: Cor principal da grade

source: Secondary grid color
pt_pt: Cor secundária da grade

source: Outline color
pt_pt: Esquema de cores

source: Background color
pt_pt: Cor de fundo

source: Text color
pt_pt: Cor do texto

source: Arrow color
pt_pt: Cor da seta do eixo

source: Top color
pt_pt: Cor do topo

source: Bottom color
pt_pt: Cor do fundo

source: Data Source Choice
pt_pt: Escolhendo a fonte de dados

source: Data Source List
pt_pt: Lista de fontes de dados

source: Hosts list
pt_pt: hosts

source: Graph List
pt_pt: Lista de gráficos

source: Force Reload
pt_pt: Forçar o recarregamento

source: Low Flap threshold
pt_pt: Limiar baixo de detecção de status de bagotage

source: Implied Hosts
pt_pt: Anfitriões ligados

source: Implied Services
pt_pt: Serviços relacionados

source: Implied Host Groups
pt_pt: Grupos relacionados de hosts

source: Implied Meta Services
pt_pt: Meta Serviços Relacionados

source: Implied Service Groups
pt_pt: Grupos de serviços relacionados

source: Meta Services Escalation
pt_pt: Escalades des Méta-Services

source: Servicegroups Escalation
pt_pt: Escalonamentos de grupos de serviço

source: Default Engine
pt_pt: Mecanismo padrão

source: Enable strict mode for host parentship management
pt_pt: Ativar o modo estrito de gerenciamento de relacionamento

source: Configuration UI behavior
pt_pt: Configurando o comportamento da interface

source: Censtorage Core Options
pt_pt: Opções do Processo Censtorage

source: Drop possibility after parsing performance data
pt_pt: Ações após o processamento de dados de desempenho

source: Logs Integration Properties
pt_pt: Propriedades dos logs do Nagios

source: Enable Centstorage Engine (require restart of centstorage)
pt_pt: Active le Moteur de Centstorage (requiert le redémarrage de centstorage)

source: RRDTool auto delete
pt_pt: Exclusão automática de ficheiros RRD não utilizados

source: Purge check interval
pt_pt: Intervalo de controle de limpeza

source: Drop Data in another file
pt_pt: Copie os dados para outro ficheiro

source: Drop file
pt_pt: Copiar para ficheiro

source: RRDTool & MySQL
pt_pt: RRDTool e MySQL

source: Hosts status colors
pt_pt: Cores para o status dos convidados

source: Services status colors
pt_pt: Cores para o status dos serviços

source: Specifics for hosts
pt_pt: Especificidades de hosts

source: Host UP Color
pt_pt: Host color AVAILABLE

source: Host DOWN Color
pt_pt: Cor do host não disponível

source: Host UNREACHABLE Color
pt_pt: Cor do hospedeiro INJOIGNABLE

source: Service OK Color
pt_pt: Cor do serviço OK

source: Service WARNING Color
pt_pt: ATENÇÃO cor de serviço

source: Service CRITICAL Color
pt_pt: COR DE SERVIÇO CRÍTICO

source: Row Color for Service CRITICAL
pt_pt: Cor da linha para um serviço CRÍTICO

source: Service PENDING Color
pt_pt: Aguardando cor de serviço

source: Service UNKNOWN Color
pt_pt: Cor do serviço DESCONHECIDO

source: Acknowledge host or service Color
pt_pt: Cor dos anfitriões ou serviços pagos

source: Downtime host or service Color
pt_pt: Cor dos hosts ou serviços paralisados

source: Color for host Down (Service view)
pt_pt: Cor para hosts em status problemático (página de supervisão de serviço)

source: Color for host Unreachable (Service view)
pt_pt: Cor para hosts não alcançáveis (página de supervisão de serviço)

source: Status Color Properties
pt_pt: Definição de cor

source: Browser detected
pt_pt: Browser detectado

source: Status summarized by Hostgroups
pt_pt: Resumo de estados por grupos de hosts

source: Scheduling Queue
pt_pt: Fila

source: All Logs
pt_pt: Todos os logs

source: Warnings
pt_pt: Alertas

source: resources
pt_pt: Recursos

source: Optimize
pt_pt: Otimizar

source: Global Health
pt_pt: Saúde global

source: Directories
pt_pt: Diretórios

source: Process Info
pt_pt: Informação do processo

source: Process Control
pt_pt: Informação do processo

source: System Information
pt_pt: Informação do Sistema

source: Monitoring Engines
pt_pt: Motores de supervisão

source: command
pt_pt: Control

source: timeperiod
pt_pt: período de tempo

source: contact
pt_pt: contacto

source: contactgroup
pt_pt: grupo de contactos

source: hostgroup
pt_pt: grupo de hosts

source: servicegroup
pt_pt: grupo de serviço

source: snmp traps
pt_pt: armadilhas snmp

source: escalation
pt_pt: Escalada

source: host dependency
pt_pt: dependência de host

source: hostgroup dependency
pt_pt: dependência de grupo

source: service dependency
pt_pt: dependência de serviço

source: servicegroup dependency
pt_pt: dependência do grupo de serviços

source: Yearly
pt_pt: Anual

source: Private key file.
pt_pt: Chave privada SSH

source: Informational messages
pt_pt: Eventos de Informação

source: Centreon Broker information
pt_pt: Informações sobre o Broker Centreon

source: Centreon-Broker Correlation
pt_pt: Correlação Centreon-Broker

source: Centreon-Broker Input
pt_pt: Entradas do Broker Centreon

source: Centreon-Broker Logger
pt_pt: Centreon Broker Registrador

source: Centreon-Broker Output
pt_pt: Centreon Broker Saída

source: Centreon-Broker Stats
pt_pt: Centreon Broker Estatisticas

source: Centreon-Broker Temporary
pt_pt: Buffer Centreon Broker

source: No Comment for hosts.
pt_pt: Sem comentários para convidados.

source: View comments of services
pt_pt: Ver comentários do serviço

source: Useres
pt_pt: Utilizadores

source: Compulsory Contact
pt_pt: Contacto obrigatório

source: External commands
pt_pt: Comandos externos

source: Contact templace
pt_pt: Modelo de contacto

source: You are
pt_pt: Você é

source: Orphan hosts
pt_pt: Órfãos

source: ServiceGroups
pt_pt: Grupos de serviço

source: Orphan Hosts
pt_pt: Hosts sozinho

source: Acknowledge/Disacknowledge a service
pt_pt: Conhecimento / Sem Conhecimento de um serviço

source: Acknowledge/Disaknowledge a host
pt_pt: Acquitar / Desativar o Som de um Host

source: Cannot get last version
pt_pt: Não é possível obter a versão mais recente

source: Security patch available
pt_pt: Patch de segurança disponível

source: Update patch available
pt_pt: Atualizar patch disponível

source: Centreon is updated.
pt_pt: O Centreon foi atualizado.

source: Execution start
pt_pt: Início da execução

source: Can't get list of files.
pt_pt: Não é possível obter a lista de ficheiros.

source: Can't open configuration file : /etc/oreon.conf
pt_pt: Não foi possível abrir o ficheiro de configuração: /etc/oreon.conf

source: Can't get file'
pt_pt: Não é possível obter o ficheiro

source: In order to complete your upgrade (%s), unzip the downloaded file, and follow the instructions in README
pt_pt: Para concluir a atualização (%s), descompacte o ficheiro baixado e siga as instruções no ficheiro README

source: Can't open patch
pt_pt: Não é possível abrir a correção

source: Change update options
pt_pt: Alterar opções de atualização

source: Check stable versions
pt_pt: Verificar atualizações de versão estáveis

source: Check patches
pt_pt: Verifique se há atualizações de patch

source: Check secu-patches
pt_pt: Verificar atualizações de patch de segurança

source: Check Release candidate
pt_pt: Verificar atualizações de versão candidatas

source: Check Beta
pt_pt: Verifique as atualizações da versão beta

source: Patch Download path
pt_pt: Diretório para baixar os patches

source: Broker engine used by Centreon
pt_pt: Corretor usado pelo Centreon

source: Refresh Interval
pt_pt: Intervalo de atualização

source: First Refresh delay for statistics
pt_pt: Primeiro tempo de atualização para a página de estatísticas

source: First Refresh delay for monitoring
pt_pt: Primeiro tempo de atualização para a página de supervisão

source: Default host timezone
pt_pt: Fuso horário padrão do host

source: Enable resources's insertion in index_data by Centreon
pt_pt: Ativar a inserção de recursos em index_data pelo Centreon

source: Enable Perfdata Synchronisation
pt_pt: Ativar sincronização de dados de desempenho

source: Enable Logs Synchronisation
pt_pt: Ativar sincronização de log

source: On Problem Host
pt_pt: Sobre o problema do host

source: Unhandled
fr: Non traité
pt_pt: Sem tratados

source: No unhandled service problem
pt_pt: Nenhum problema de serviço não pago

source: Service Name
pt_pt: Nome do serviço

source: Status Output
pt_pt: Informação de status

source: No unhandled host problem
pt_pt: Nenhum problema de host não pago

source: View name
pt_pt: Ver nome

source: Warning:
pt_pt: Aviso:

source: Do you confirm the cancelation?
pt_pt: Você confirma o cancelamento?

source: Hosts Downtimes
pt_pt: Stop time of hosts

source: No downtime scheduled for hosts
pt_pt: Nenhum tempo de inatividade programado para convidados

source: View downtimes of services
pt_pt: Visualize o tempo de inatividade dos serviços

source: PENDING
fr: EN ATTENTE
pt_pt: PENDENTE

source: Sort by criticality
pt_pt: Classificar por criticidade

source: Poller :
pt_pt: Colecionador:

source: Period :
pt_pt: Períodos:

source: Scheduling Process Information
pt_pt: Informação do processo de encomenda

source: Program Version
pt_pt: Versão do programa

source: Program Start Time
pt_pt: Hora de início do programa

source: Last Log File Rotation:
pt_pt: Última rotação do ficheiro de log:

source: Last External Command Check:
pt_pt: Hora da última encomenda externa:

source: Monitoring Engine PID
pt_pt: Supervisor Engine ID

source: Currently running?
pt_pt: No processo de execução?

source: Host Checks Being Executed?
pt_pt: Controle de host ativado?

source: Passive Host Checks Being Accepted?
pt_pt: Controle de host passivo passivo ativado?

source: Service Checks Being Executed?
pt_pt: Controle de serviço ativado?

source: Passive Service Checks Being Accepted?
pt_pt: Controle passivo de serviços ativado?

source: Event Handlers Enabled?
pt_pt: Gerenciador de eventos ativado?

source: Obsessing Over Hosts?
pt_pt: Execução das ordens pós controle dos hosts?

source: Obsessing Over Services?
pt_pt: Execução de ordens de serviços pós-controle?

source: Performance Data Being Processed?
pt_pt: Processamento de dados de desempenho ativado?

source: Flap detection enabled?
pt_pt: Status de detecção de bagotagem ativado?

source: Shutdown the Monitoring Engine process
pt_pt: Pare o motor de supervisão

source: Start the Monitoring Engine process
pt_pt: Iniciar o mecanismo de supervisão

source: Restart the Monitoring Engine process
pt_pt: Reinicie o processo de supervisão

source: Disable notifications
pt_pt: Desativar notificações

source: Start executing service checks
pt_pt: Iniciar a execução de verificações de serviço

source: Stop executing service checks
pt_pt: Parar a execução de verificações de serviço

source: Start accepting passive service checks
pt_pt: Iniciar o controle passivo dos serviços

source: Stop accepting passive service checks
pt_pt: Pare o controle passivo de serviços

source: Start executing host checks
pt_pt: Iniciar Controle de Host

source: Stop executing host checks
pt_pt: Pare o controle de hosts

source: Start accepting passive host checks
pt_pt: Iniciar o controle de host passivo

source: Stop accepting passive host checks
pt_pt: Parar o controle passivo de hosts

source: Enable event handlers
pt_pt: Ativar gerenciador de eventos

source: Disable event handlers
pt_pt: Pare o gerente do evento

source: Start obsessing over hosts
pt_pt: Iniciar o rastreamento preciso dos hosts

source: Stop obsessing over hosts
pt_pt: Pare o rastreamento preciso de hosts

source: Start obsessing over services
pt_pt: Inicia checagem de pós-comando de serviços

source: Stop obsessing over services
pt_pt: Para checagem de pós-comando de serviços

source: Enable flap detection
pt_pt: Ativa detecção de variação

source: Disable flap detection
pt_pt: Desabilita detecção de variação

source: Enable performance data
pt_pt: Ativar o processamento de dados de Performance

source: Disable performance data
pt_pt: Desativar o processamento de dados de Performance

source: Process Commands
pt_pt: Processos de Comandos

source: To use additional Remote Servers a Master Remote Server must be selected.
de: Um weitere Remote-Server zu verwenden, muss ein Master Remote-Server ausgewählt werden.
es: Para usar Remote Server adicionales, se debe seleccionar un Remote Server maestro.
fr: Un Remote Server principal doit être sélectionné, avant d'utiliser des Remote Server additionnels.
pt_pt: Para usar Remote Server adicionais, um Remote Server mestre deve ser selecionado.

source: Attach additional Remote Servers
de: Weitere Remote-Server anfügen
es: Adjunte Remote Servers adicionales
fr: Lier à des Remote Server additionnels
pt_pt: Anexar Remote Server adicionais

source: IP address or hostname
de: IP-Adresse oder Hostname
es: Dirección IP o nombre de host
fr: Adresse IP ou nom d'hôte
pt_pt: Endereço IP ou nome do host

source: Allow self signed certificate
de: Selbstsigniertes Zertifikat erlauben
es: Permitir certificado autofirmado
fr: Autoriser les certificats auto-signés
pt_pt: Permitir certificado autoassinado

source: Invalid json message received
de: Ungültige JSON-Nachricht erhalten
fr: Json invalide reçu
pt_pt: Mensagem json inválida recebida

source: Host %d not found
de: Host %d konnte nicht gefunden werden
fr: Hôte %d non trouvé
pt_pt: Host %d não encontrado

source: Service %d not found
de: Service %d konnte nicht gefunden werden
fr: Service %d non trouvé
pt_pt: Host %d não encontrado

source: Invalid date given for parameter "%s".
fr: Date invalide pour le paramètre "%s".
pt_pt: Data inválida fornecida para o parâmetro "%s".

source: End date must be greater than start date.
fr: La date de fin doit être supérieure à la date de début.
pt_pt: Data final deve ser maior que a data inicial.

source: Incorrect resource type for disacknowledgement
fr: Type de ressource incorrect pour le désacquittement
pt_pt: Tipo de recurso incorreto para desconhecimento

source: Incorrect resource type for acknowledgement
de: Falscher Ressourcentyp für die Inkenntnisnahme
fr: Type de ressource incorrect pour l'acquittement
pt_pt: Tipo de recurso incorreto para reconhecimento

source: Invalid credentials
fr: Identifiants invalides
pt_pt: Credenciais Invalidas

source: Service %d on host %d not found
de: Service %d auf Host %d konnte nicht gefunden werden
fr: Service %d de l'hôte %d non trouvé
pt_pt: Serviço %d no host %d não encontrado

source: Unrecognized Command
fr: Commande non reconnue
pt_pt: Comando não reconhecido

source: Commands containing a request body are not allowed at the moment
fr: Les commandes contenant un corp ne sont pas autorisées pour le moment
pt_pt: Os comandos contém uma requisição no corpo não aceito no momento

source: Host not found
de: Host konnte nicht gefunden werden
fr: Hôte non trouvé
pt_pt: Host não encontrado
