Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: Generating application cache
de: Applikationscache wird erzeugt

source: Module
de: Modul

source: Login
es: Iniciar sesión

source: Centreon Map
es: Mapa de Centreon

source: Active Directory
es: Directorio Activo

source: Dump
es: Tugurio

source: LVM Snapshot
es: Instantánea de LVM

source: OK
es: DE ACUERDO

source: Ok
es: De acuerdo

source: Active Directory :
es: Directorio Activo :

source: LDAP DN (Distinguished Name)
es: DN LDAP (Nombre Distinguido)

source: SOFT
es: SUAVE

source: HARD
es: DIFÍCIL
