Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: Modify relations
de: Beziehungen bearbeiten
es: Editar relaciones
fr: Modifier des relations
pt_pt: Modificar relações

source: View relations
de: Beziehungen anzeigen
es: Visualizar relaciones
fr: Visualiser les relations
pt_pt: Visualizar relações

source: Linked with Servicegroups
de: Verknüpft mit Servicegruppe(n)
es: Vinculado con grupos de servicio
fr: Lié avec les groupes de services
pt_pt: Grupo de Serviços associados

source: SNMP Traps
es: Trampas SNMP
fr: Traps SNMP
pt_pt: Traps SNMP

source: Service Trap Relation
de: Service Trap Beziehung
es: Trampas relacionadas con el servicio SNMP
fr: Traps SNMP reliés au service
pt_pt: Relação com Trap de Serviço

source: Add Data Processing
de: Datenverarbeitung hinzufügen
es: Agregar procesamiento de datos
fr: Ajouter le traitement des données
pt_pt: Adicionar Processamento de Dados

source: Modify Data Processing
de: Datenverarbeitung bearbeiten
es: Modificar el procesamiento de datos.
fr: Modifier le traitement des données
pt_pt: Modificar processamento de dados

source: View Data Processing
de: Datenverarbeitung anzeigen
es: Visualizar el procesamiento de datos.
fr: Visualiser le traitement des données
pt_pt: Visualizar Processamento de Dados

source: Data Processing
de: Datenverarbeitung
es: Tratamiento de datos
fr: Traitement des données
pt_pt: Processamento de Dados

source: Check Freshness
de: Überprüfungsaktualität
es: Comprueba la frescura del resultado.
fr: Contrôler la fraicheur du résultat
pt_pt: Checagem de atualização

source: Flap Detection Enabled
de: Flackern-Erkennung aktiviert
es: Detección de estatutos en bagotage.
fr: Détection de bagotage des statuts
pt_pt: Ativa Detecção de Variação

source: Freshness Threshold
de: Aktualitätsgrenzwert
es: Umbral de frescura del resultado.
fr: Seuil de fraicheur du résultat
pt_pt: Limiar de Atualização

source: Low Flap Threshold
de: Unterer Grenzwert für das Flackern
es: Umbral inferior de detección de bagotage de los estatutos.
fr: Seuil bas de détection de bagotage des statuts
pt_pt: Limiar de Variação Baixa

source: High Flap Threshold
de: Oberer Grenzwert für das Flackern
es: Alto umbral de detección de apuestas de estado.
fr: Seuil haut de détection de bagotage des statuts
pt_pt: Limiar de Variação Alta

source: Retain Status Information
de: Statusinformationen beibehalten
es: Mantener información de estado
fr: Conserver les informations d'état
pt_pt: Informação de retenção de Estado

source: Retain Non Status Information
de: Non-Statusinformationen beibehalten
es: Retención de información no de estado
fr: Rétention des informations ne concernant pas le statut
pt_pt: Informação de retenção Sem Estado

source: Add an Extended Info
de: Erweiterte Information hinzufügen
es: Añadir informacion adicional
fr: Ajouter une information supplémentaire
pt_pt: Adicionar uma informação extendida

source: Modify an Extended Info
de: Erweiterte Information bearbeiten
es: Editar información adicional
fr: Modifier une information supplémentaire
pt_pt: Editar informações adicionais

source: View an Extended Info
de: Erweiterte Information anzeigen
es: Ver información adicional
fr: Visualiser une information supplémentaire
pt_pt: Visualizar informações adicionais

source: Icon
es: icono
fr: Icône
pt_pt: Icone

source: Alt icon
de: Alternativer Text
es: Icono alternativo
fr: Icône alternative
pt_pt: Ícone Alternativo

source: Severity level
de: Schweregrad
es: Nivel de criticidad
fr: Niveau de criticité
pt_pt: Nível de Severidades

source: Graph Template
de: Graphentemplate
es: Plantilla de gráfico
fr: Modèle de graphique
pt_pt: Modelo de Gráfico

source: Categories
de: Kategorien
es: categorías
fr: Catégories
pt_pt: Categorias

source: Add macros
de: Makros hinzufügen
es: Añadir macros
fr: Ajouter des macros
pt_pt: Adicionar macros

source: Modify macros
de: Makros bearbeiten
es: Editar macros
fr: Modifier les macros
pt_pt: Modificar macros

source: View macros
de: Makros anzeigen
es: Visualizar las macros
fr: Visualiser les macros
pt_pt: Visualizar macros

source: Add a new macro
de: Makro hinzufügen
es: Añadir una nueva macro
fr: Ajouter une nouvelle macro
pt_pt: Adicionar nova macro

source: Compulsory Command
de: Erforderlicher Befehl
es: Orden obligatoria
fr: Commande obligatoire
pt_pt: Comando obrigatorio

source: HostGroup or Host Required
de: Hostgruppen oder Host erforderlich
es: Grupo de invitados o anfitrión requerido
fr: Groupe d'hôtes ou hôte requis
pt_pt: Grupo de Host ou Host requerido

source: This description is in conflict with another one that is already defined in the selected relation(s)
de: Diese Beschreibung steht mit einer anderen im Konflikt, die bereits in der/den ausgewählte(n) Beziehung(en) definiert ist/sind
es: Esta descripción entra en conflicto con otra descripción que ya está definida en la (s) relación (es) seleccionada (s)
fr: Cette description est en conflit avec une autre description qui est déjà définie dans la(les) relation(s) sélectionnée(s)
pt_pt: Esta descrição está em conflito com outra que já está definida na(s) relação(ões) selecionada(s)

source: You must either fill all the arguments or leave them all empty
de: Es müssen entweder alle oder keine Argumente ausgefüllt werden
es: Debes ingresar todos los argumentos o dejar en blanco.
fr: Vous devez saisir tous les arguments ou laisser vide
pt_pt: Você deve preencher todos os argumentos ou deixá-los todos vazios

source: You cannot override reserved macros
de: Reservierte Makros können nicht überschrieben werden
es: No puedes redefinir macros reservadas
fr: Vous ne pouvez pas redéfinir les macros réservées
pt_pt: Você não pode sobrepor macros reservadas

source: Warning, unconventional use of interval check. You should prefer to use an interval lower than 24h, if needed, pair this configuration with the use of timeperiods
de: Warnung: Unkonventielle Verwendung einer Intervallüberprüfung. Das Intervall sollte kleiner als 24 Stunden sein. Falls nötig, kann diese Konfiguration mit Zeiträumen kombiniert werden
es: Atención, particular intervalo de control. Debe seleccionar un intervalo inferior a 24 horas. Si es necesario, combine esta configuración con el uso de períodos de tiempo
fr: Attention, intervalle de contrôle particulier. Vous devriez sélectionner un intervalle inférieur à 24h. Si nécessaire, coupler cette configuration avec l'utilisation de périodes de temps
pt_pt: Aviso, uso não convencional de verificação de intervalo. Você deve preferir usar um intervalo menor que 24h, se necessário, emparelhar essa configuração com o uso de períodos de tempo

source: Custom macros
de: Benutzerdefinierte Makros
es: Macros personalizadas
fr: Macros personnalisées
pt_pt: Macros personalizadas

source: Template inheritance
de: Templatevererbung
es: Heredado de una plantilla
fr: Hérité depuis un modèle
pt_pt: Herança de Modelo

source: Command inheritance
de: Befehlsvererbung
es: Heredado desde el pedido.
fr: Hérité depuis la commande
pt_pt: Herança de Comando

source: Freshness Control options
de: Aktualitätsüberprüfungsoptionen
es: Opciones de control para la frescura del resultado.
fr: Options de contrôle de la fraicheur du résultat
pt_pt: Opções de Controle de Atualização

source: Flapping options
de: Flackern-Optionen
es: Opciones de detección de bagotage.
fr: Options de détection de bagotage des statuts
pt_pt: Opções de Variação

source: History Options
de: Historienoptionen
es: Opciones de historial
fr: Options de l'historique
pt_pt: Opções de Historico

source: Dependent Servicegroups
de: Abhängige Servicegruppen
pt_pt: Grupos de serviços dependentes

source: Import SNMP traps from MIB file
de: SNMP-Traps aus MIB-Datei importieren
es: Importación de capturas SNMP desde archivos MIB
fr: Importation des Traps SNMP depuis les fichiers MIB
pt_pt: Importação de traps SNMP de ficheiro MIB

source: Vendor Name
de: Herstellername
es: Nombre del fabricante
fr: Nom du constructeur
pt_pt: Nome do Fabricante

source: File (.mib)
de: Datei (.mib)
es: Archivo (.mib)
fr: Fichier (.mib)
pt_pt: Ficheiro (.mib)

source: Import
es: Importador
fr: Importer
pt_pt: Importar

source: Message truncated (exceeded %s characters)
de: Nachricht gekürzt (Länge war über %s Zeichen)
es: Mensaje truncado (excedió %s caracteres)
fr: Message tronqué (dépassant les %s caractères)
pt_pt: Mensagem truncada (excedido %s caracteres)

source: View contact group notifications
de: Kontakgruppenbenachrichtigungen anzeigen
es: Ver grupos de contacto de notificación
fr: Afficher les groupes de contacts de notification
pt_pt: Visualizar Notificações de Grupo de Contacto

source: Escalated Hosts
de: Eskalierte Hosts
es: Hôtes escaladés
fr: Hôtes escaladés
pt_pt: Hosts escalados

source: Escalated Services
de: Eskalierte Services
es: Services escaladés
fr: Services escaladés
pt_pt: Serviços escalados

source: Host escalations
de: Hosteskalationen
es: Escaladas d`hôtes
fr: Escalades d'hôtes
pt_pt: Escalas de Host

source: Service escalations
de: Serviceeskalationen
es: Escaladas de service
fr: Escalades de service
pt_pt: Escalas de Serviços

source: Host notifications
de: Hostbenachrichtigungen
es: Notificaciones de host
fr: Notifications d'hôte
pt_pt: Notificações de Host

source: Service notifications
de: Servicebenachrichtigungen
es: Notificaciones de servicio
fr: Notifications de service
pt_pt: Notificações de Serviço

source: Please select a user in order to view his notifications
de: Bitte wählen Sie einen Benutzer, um dessen Benachrichtigungen einzusehen
es: Por favor seleccione un usuario para ver sus notificaciones.
fr: Veuillez sélectionner un utilisateur pour visualiser ses notifications
pt_pt: Por favor, selecione um usuário na ordem para visualizar estas notificações

source: You are not allowed to access this contact group
de: Sie sind nicht dazu berechtigt, auf diese Kontaktgruppe zuzugreifen
es: No estás autorizado para acceder a este grupo de contactos.
fr: Vous n'êtes pas autorisé à accéder à ce groupe de contacts
pt_pt: Você não esta autorizado a acessar este grupo de contacto

source: Add a Contact Group
de: Kontaktgruppe hinzufügen
es: Agregar un grupo de contacto
fr: Ajouter un groupe de contact
pt_pt: Adicionar Grupo de Contacto

source: Modify a Contact Group
de: Kontaktgruppe bearbeiten
es: Editar un grupo de contactos
fr: Modifier un groupe de contact
pt_pt: Modificar Grupo de Contacto

source: View a Contact Group
de: Kontaktgruppe anzeigen
es: Ver un grupo de contacto
fr: Visualiser un groupe de contact
pt_pt: Visualizar Grupo de Contacto

source: Contact Group Name
de: Kontaktgruppenname
es: Nombre del grupo de contacto
fr: Nom du groupe de contacts
pt_pt: Nome do Grupo de Contacto

source: Linked ACL groups
de: Verknüpfte Zugriffskontrolllistengruppen (ACL Gruppen)
es: Grupos de acceso vinculados
fr: Groupes d'accès liés
pt_pt: Grupos de permissionamento (ACL) associado

source: Dependent Services
de: Namen der abhängigen Services
es: Servicios dependientes
fr: Services dépendants
pt_pt: Serviços Dependentes

source: Dependent Hosts
de: Abhängige Hosts
es: Anfitriones dependientes
fr: Hôtes dépendants
pt_pt: Hosts dependentes

source: Number of linked services
de: Anzahl der verknüpften Services
es: Número de servicios relacionados
fr: Nombre de services liés
pt_pt: Número de serviços associados

source: Regular
de: Regulär
es: ordinario
fr: Ordinaire
pt_pt: Comum

source: You are not allowed to access this service category
de: Sie sind nicht dazu berechtigt, auf diese Servicekategorie zuzugreifen
es: No está permitido acceder a esta categoría de servicios.
fr: Vous n'êtes pas autorisé à accéder à cette catégorie de services
pt_pt: Você não tem permissão para acessar esta categoria de serviço

source: Add a Service Category
de: Servicekategorie hinzufügen
es: Añadir una categoría de servicio
fr: Ajouter une catégorie de service
pt_pt: Adicionar Categoria de Serviço

source: Modify a Service Category
de: Servicekategorie bearbeiten
es: Modificar una categoría de servicio
fr: Modifier une catégorie de service
pt_pt: Modificar Categoria de Serviço

source: View a Service Category
de: Servicekategorie anzeigen
es: Ver una categoría de servicio
fr: Visualiser une catégorie de service
pt_pt: Visualizar Categoria de Serviço

source: Severity type
de: Schweregradtyp
es: Tipo de criticidad
fr: Type de criticité
pt_pt: Tipo de Severidade

source: Level
es: nivel
fr: Niveau
pt_pt: Nível

source: Linked Templates
de: Verknüpfte Templates
es: Modelos vinculados
fr: Modèles liés
pt_pt: Modelos associados

source: Can't be equal to 0
de: Kann nicht 0 entsprechen
es: No puede ser igual a 0
fr: Ne peut être égal à 0
pt_pt: Não pode ser igual a 0

source: Add Group
de: Gruppe hinzufügen
es: Agregar un grupo
fr: Ajouter un groupe
pt_pt: Adicionar Grupo

source: Modify Group
de: Gruppe bearbeiten
es: Editar un grupo
fr: Modifier un groupe
pt_pt: Modificar Grupo

source: View Group
de: Gruppe anzeigen
es: Ver un grupo
fr: Visualiser un groupe
pt_pt: Visualizar Grupo

source: Traps
es: Trampas SNMP
fr: Traps SNMP
pt_pt: Traps SNMP

source: You are not allowed to access this contact
de: Sie sind nicht dazu berechtigt, auf diesen Kontakt zuzugreifen
es: No estás autorizado para acceder a este contacto.
fr: Vous n'êtes pas autorisé à accéder à ce contact
pt_pt: Você não tem permissão para acessar este contacto

source: Add a User
de: Benutzer hinzufügen
es: Agregar un usuario
fr: Ajouter un utilisateur
pt_pt: Adicionar usuário

source: Modify a User
de: Benutzer bearbeiten
es: Editar un usuario
fr: Modifier un utilisateur
pt_pt: Modificar usuário

source: View a User
de: Benutzer anzeigen
es: Ver un usuario
fr: Visualiser un utilisateur
pt_pt: Visualizar usuário

source: Add a User Template
de: Benutzertemplate hinzufügen
es: Agregar un modelo de usuario
fr: Ajouter un modèle utilisateur
pt_pt: Adicionar um modelo de usuário

source: Modify a User Template
de: Benutzertemplate bearbeiten
es: Editar un modelo de usuario
fr: Modifier un modèle utilisateur
pt_pt: Modificar um modelo de usuário

source: View a User Template
de: Benutzertemplate anzeigen
es: Ver un modelo de usuario
fr: Visualiser un modèle utilisateur
pt_pt: Visualizar um modelo de usuário

source: Centreon Authentication
de: Centreon Authentifizierung
es: Autenticación de Centreon
fr: Authentification Centreon
pt_pt: Autenticação Centreon

source: Access lists
de: Zugriffslisten
es: Listas de acceso
fr: Listes d'accès
pt_pt: Listas de Acesso

source: Full Name
de: Vollständiger Name
es: nombre completo
fr: Nom complet
pt_pt: Nome Completo

source: Contact template used
de: Verwendetes Kontakttemplate
es: Modelo de contacto utilizado
fr: Modèle de contact utilisé
pt_pt: Modelo de Contacto usado

source: Additional Addresses
de: Zusätzliche Adressen
es: Direcciones adicionales
fr: Adresses complémentaires
pt_pt: Endereço adicional

source: Address1
de: Adresse1
es: Dirección n ° 1
fr: Adresse n°1
pt_pt: Endereço 1

source: Address2
de: Adresse2
es: Dirección 2
fr: Adresse n°2
pt_pt: Endereço 2

source: Address3
de: Adresse3
es: Dirección n ° 3
fr: Adresse n°3
pt_pt: Endereço 3

source: Address4
de: Adresse4
es: Dirección n ° 4
fr: Adresse n°4
pt_pt: Endereço 4

source: Address5
de: Adresse5
es: Dirección n ° 5
fr: Adresse n°5
pt_pt: Endereço 5

source: Address6
de: Adresse6
es: Dirección n ° 6
fr: Adresse n°6
pt_pt: Endereço 6

source: Group Relations
de: Gruppenbeziehungen
es: Miembro del grupo
fr: Membre des groupes
pt_pt: Relação de Grupos

source: Linked to Contact Groups
de: Mit Kontaktgruppen verknüpft
es: Vinculado con el grupo de contacto.
fr: Lié avec le groupe de contacts
pt_pt: Associar a Grupos de Contacto

source: Reach Centreon Front-end
de: Zugriff auf das Centreon Front-end
es: Permitir que el usuario se conecte a la interfaz web
fr: Autoriser l'utilisateur à se connecter à l'interface web
pt_pt: Autorizar acesso a interface Web do Centreon

source: Default Language
de: Standardsprache
es: Idioma por defecto
fr: Langue par défaut
pt_pt: Linguagem padrão

source: Mail Type
de: Mailtyp
es: Tipo de correo
fr: Type de courrier
pt_pt: Tipo de E-mail

source: Admin
es: administrador
fr: Administrateur
pt_pt: Administrador

source: Reach API Configuration
de: Zugriff auf die API-Konfiguration
fr: Accès à l'API de configuration
pt_pt: Configuração de API de alcance

source: Reach API Realtime
de: Zugriff auf die Realtime-API
fr: Accès à l'API de temps réel
pt_pt: Alcance a API em tempo real

source: Access list groups
de: Zugriffslistengruppen
es: Grupos de lista de acceso
fr: Groupes de liste d'accès
pt_pt: Grupos de lista de acesso

source: Authentication Source
de: Authentifizierungsquelle
es: Fuente de autentificación
fr: Source d'authentification
pt_pt: Fonte de Autenticação

source: Enable Notifications
de: Benachrichtigungen aktivieren
es: Habilitar notificaciones
fr: Activer les notifications
pt_pt: Ativar Notificações

source: Host Notification Options
de: Hostbenachrichtigungsoption
es: Opciones de notificación de host
fr: Options de notification d'hôte
pt_pt: Opções de Notificação de Host

source: Host Notification Period
de: Hostbenachrichtigungszeitraum
es: Periodo de notificación del host.
fr: Période de notification d'hôte
pt_pt: Período de Notificação de Host

source: Host Notification Commands
de: Hostbenachrichtigungsbefehl
es: Comandos de notificación de host
fr: Commandes de notification d'hôte
pt_pt: Comandos de Notificação de Host

source: Service Notification Options
de: Servicebenachrichtigungsoption
es: Opciones de notificación de servicio
fr: Options de notifications de service
pt_pt: Opções de Notificação de Serviço

source: Service Notification Period
de: Servicebenachrichtigungszeitraum
es: Periodo de notificación de servicio
fr: Période de notification de service
pt_pt: Período de Notificação de Serviço

source: Service Notification Commands
de: Servicebenachrichtigungsbefehl
es: Comandos de notificación de servicio
fr: Commandes de notification de service
pt_pt: Comandos de Notificação de Serviço

source: Compulsory Period
de: Erforderlicher Zeitraum
es: Periodo obligatorio
fr: Période obligatoire
pt_pt: Período obrigatorio

source: Compulsory Option
de: Erforderliche Option
es: Opcion obligatoria
fr: Option obligatoire
pt_pt: Opção obrigatoria

source: Contact already exists
de: Kontakt existiert bereits
es: El contacto ya existe.
fr: Le contact existe déjà
pt_pt: Contacto já existe

source: Alias already exists
de: Alias existiert bereits
es: El alias ya existe
fr: L'alias existe déjà
pt_pt: Apelido já existe

source: You have to keep at least one contact to access to Centreon
de: Sie müssen mindestens einen Kontakt erhalten, der Zugriff auf Centreon hat
es: Debe tener al menos un contacto para acceder a Centreon
fr: Vous devez avoir au moins un contact pour accéder à Centreon
pt_pt: Você precisa manter pelo menos um contacto para acessar o Centreon

source: Group Ldap
de: LDAP-Gruppe
es: Grupo Ldap
fr: Groupe Ldap
pt_pt: Grupo LDAP

source: Services Notification Period
de: Servicebenachrichtigungszeitraum
es: Periodos de notificación de servicio
fr: Périodes de notification de service
pt_pt: Período de Notificações de Serviço

source: Access
de: Zugriff
es: acceso
fr: Accès
pt_pt: Acesso

source: This user is an administrator.
de: Dieser Benutzer ist ein Administrator.
es: Este usuario es un administrador.
fr: Cet utilisateur est un administrateur.
pt_pt: Este usuário é um Administrador

source: This user is a simple user.
de: Dieser Benutzer ist ein Standardbenutzer.
es: Este usuario es un usuario simple.
fr: Cet utilisateur est un simple utilisateur.
pt_pt: Este usuário é um usuário simples.

source: This is a contact template.
de: Dies ist ein Kontakttemplate.
es: Esta es una plantilla de contacto.
fr: Ceci est un modèle de contact.
pt_pt: Este contacto é um modelo.

source: LDAP Import
es: Importación LDAP
fr: Importation LDAP
pt_pt: Importação LDAP

source: View contact notifications
de: Kontaktbenachrichtigungen anzeigen
es: Ver notificaciones de contacto
fr: Afficher les notifications du contact
pt_pt: Visualizar notificações do contacto

source: Search Filter
de: Suchfilter
es: Filtro de búsqueda
fr: Filtre de recherche
pt_pt: Filtro de Busca

source: Search Result
de: Suchergebnis
es: Resultado de la investigación
fr: Résultat de la recherche
pt_pt: Resultado de Busca

source: Result
de: Ergebnis
es: resultado
fr: Résultat
pt_pt: Resultado

source: Filter Examples
de: Filterbeispiele
es: Ejemplos de filtros
fr: Exemples de filtre
pt_pt: Exemplos de Filtro

source: Filter
es: filtro
fr: Filtre
pt_pt: Filtro

source: Import from LDAP servers
de: Von LDAP-Servern importieren
es: Importar desde un servidor LDAP
fr: Importer à partir d'un serveur LDAP
pt_pt: Importar de servidores LDAP

source: Add a Meta Service indicator
de: Meta-Service Indikator hinzufügen
es: Añadir un indicador de Meta-Service.
fr: Ajouter un indicateur de Méta-Service
pt_pt: Adicionar indicador de Meta-Serviço

source: Modify a Meta Service indicator
de: Meta-Service Indikator bearbeiten
es: Modificar un indicador de meta-servicio
fr: Modifier un indicateur de Méta-Service
pt_pt: Modificar indicador de Meta-Serviço

source: Compulsory Field
de: Erforderliches Feld
es: Campo obligatorio
fr: Champ Obligatoire
pt_pt: Campo Obrigatorio

source: Average
de: Durchschnitt
es: promedio
fr: Moyenne
pt_pt: Média

source: Sum
de: Summe
es: suma
fr: Somme
pt_pt: Soma

source: Add a Meta Service
de: Meta-Service hinzufügen
es: Añadir un servicio Meta
fr: Ajouter un Méta-Service
pt_pt: Adicionar um Meta-Serviço

source: Modify a Meta Service
de: Meta-Service bearbeiten
es: Editar un servicio meta
fr: Modifier un Méta-Service
pt_pt: Modificar Meta-Serviço

source: View a Meta Service
de: Meta-Service anzeigen
es: Ver un Meta-Servicio
fr: Visualiser un Méta-Service
pt_pt: Visualizar Meta-Serviço

source: Output format string (printf-style)
de: Formatierungsstring für den Output (printf-Stil)
es: Formato de la cadena de salida (formateo printf)
fr: Format de la chaîne de sortie (Formatage printf)
pt_pt: Formato da string de saída (estilo printf)

source: Warning Level
de: Warnungslevel
es: Nivel de alerta
fr: Niveau d'alerte
pt_pt: Nível de Alerta

source: Critical Level
de: Kritisches Level
es: Nivel critico
fr: Niveau critique
pt_pt: Nível de Criticidade

source: Calculation Type
de: Berechnungstyp
es: Tipo de calculo
fr: Type de calcul
pt_pt: Tipo de Calculo

source: Data Source Type
de: Datenquellentyp
es: Tipo de fuente de datos
fr: Type de source de données
pt_pt: Tipo da origem de dados

source: Service List
de: Serviceliste
es: Seleccionar servicios manualmente
fr: Sélectionner les services manuellement
pt_pt: Lista de Serviço

source: SQL matching
de: SQL Abgleich
es: Búsqueda de SQL
fr: Recherche SQL
pt_pt: Correspondência SQL

source: Selection Mode
de: Auswahlmodus
es: Modo de selección
fr: Mode de sélection
pt_pt: Modo de Seleção

source: SQL LIKE-clause expression
de: SQL LIKE-Klausel Ausdruck
es: Expresión SQL para buscar tipo LIKE
fr: Expression SQL à rechercher de type LIKE
pt_pt: Expressão SQL do tipo LIKE

source: Meta Service State
de: Meta-Service Zustand
es: Estado del Servicio Meta
fr: Etat du Meta Service
pt_pt: Estado do Meta-Serviço

source: You are not allowed to access this meta service
de: Sie sind nicht dazu berechtigt, auf diesen Meta-Service zuzugreifen
es: No tienes permiso para acceder a este meta-servicio.
fr: Vous n'êtes pas autorisé à accéder à ce méta-service
pt_pt: Você não tem permissão para acessar este meta-serviço

source: View
de: Ansicht
es: visualización
fr: Visualiser
pt_pt: Visualizar

source: Add a Connector
de: Konnektor hinzufügen
es: Agregar un conector
fr: Ajouter un connecteur
pt_pt: Adicionar Conector

source: Modify a Connector
de: Konnektor bearbeiten
es: Editar un conector
fr: Modifier un connecteur
pt_pt: Modificar Conector
