Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: User group attribute
de: Benutzer Gruppenattribut
es: El atributo para la relación grupal a un usuario.
fr: L'attribut pour la relation des groupes à un utilisateur
pt_pt: Atributo de grupo de usuário

source: User displayname attribute
de: Benutzer Anzeigenamenattribut
es: El atributo para el nombre del usuario.
fr: L'attribut pour le nom de l'utilisateur
pt_pt: Atributo de nome de usuário (displayname)

source: User firstname attribute
de: Benutzer Vornamenattribut
es: El atributo para el primer nombre del usuario.
fr: L'attribut pour le prénom de l'utilisateur
pt_pt: Atributo de primeiro nome de usuário

source: User lastname attribute
de: Benutzer Nachnamenattribut
es: El atributo para el apellido del usuario.
fr: L'attribut pour le nom de famille de l'utilisateur
pt_pt: Atributo de último nome de usuário

source: User email attribute
de: Benutzer E-Mail-Attribut
es: El atributo para la dirección de correo electrónico del usuario.
fr: L'attribut pour l'adresse email de l'utilisateur
pt_pt: Atributo de e-mail de usuário

source: User pager attribute
de: Benutzer Pager-Attribut
es: El atributo para el bipper / número de móvil del usuario.
fr: L'attribut pour le numéro de bipper/mobile de l'utilisateur
pt_pt: Atributo de bip de usuário

source: Group filter
de: Gruppenfilter
es: El filtro de búsqueda para grupos.
fr: Le filtre de recherche pour les groupes
pt_pt: Filtro de grupo

source: Group attribute
de: Gruppenattribut
es: El atributo para el nombre del grupo
fr: L'attribut pour le nom du groupe
pt_pt: Atributo de grupo

source: Group member attribute
de: Gruppenmitgliedsattribut
es: La relación de los usuarios pertenecientes a un grupo.
fr: La relation des utilisateurs appartenant à un groupe
pt_pt: Atributo de membro de grupo

source: Compulsory field
de: Erforderliches Feld
es: campo obligatorio
fr: Champ obligatoire
pt_pt: Campo obrigatorio

source: Host address
de: Hostadresse
es: Direccion del servidor
fr: Adresse du serveur
pt_pt: Endereço do Host

source: Port
es: Puerto
pt_pt: Porta

source: Bad ldap filter: missing %s pattern. Check user or group filter
de: Ungültiger LDAP-Filter: Fehlendes %s Muster. Überprüfen Sie den Benutzer- oder Gruppenfilter
es: Filtro de ldap incorrecto: falta el patrón %s. Ver el filtro de usuario o grupo
fr: Mauvais filtre ldap : expression %s manquante. Vérifier le filtre de l'utilisateur ou du groupe
pt_pt: Filtro de LDAP ruim: faltando padrão %s. Verifique o filtro de usuário ou grupo

source: Invalid LDAP Host parameters
de: Ungültige LDAP-Hostparameter
es: Configuración de servidor LDAP no válida
fr: Paramètres du serveur LDAP invalides
pt_pt: Parametros de endereço do host do LDAP invalidos

source: LDAP Properties
de: LDAP-Eigenschaften
es: Propiedades LDAP
fr: Propriétés LDAP
pt_pt: Propriedades LDAP

source: LDAP servers
de: LDAP Server
es: Servidores LDAP
fr: Serveurs LDAP
pt_pt: Servidores LDAP

source: Import users manually
de: Benutzer manuell importieren
es: Importar usuarios manualmente
fr: Importer les utilisateurs manuellement
pt_pt: Importar utilizadores manualmente

source: Add a LDAP server
es: Añadir un servidor LDAP
fr: Ajouter un serveur LDAP
pt_pt: Adicionar servidor LDAP

source: Hostname
es: Nombre de host
fr: Nom d'hôte
pt_pt: Nome do Host

source: Do you really wish to remove this entry?
es: ¿Estás seguro de que quieres eliminar esta entrada?
fr: Voulez-vous réellement supprimer cette entrée ?
pt_pt: Você realmente quer remover esta entrada?

source: Engine Status
es: Estado del planificador
fr: Statut de l'ordonnanceur
pt_pt: Estado do Motor

source: Resources storage
de: Ressourcenspeicher
es: Almacenamiento de recursos
fr: Stockage des ressources
pt_pt: Armazenagem de recursos

source: Storage folders
de: Speicherordner
es: Archivos de copia de seguridad
fr: Dossiers de Sauvegarde
pt_pt: Fichas de Armazenagens

source: Retention durations
de: Aufbewahrungsdauern
es: Tiempos de retención
fr: Durées de rétention
pt_pt: Durações de Retenção

source: Partitioning retention options
de: Partitionierungsaufbewahrungsoptionen
pt_pt: Opções de retenção de particionamento

source: Input treatment options
de: Input-Behandlungsoptionen
es: Opciones de procesamiento de datos de rendimiento
fr: Options de traitement des données de performance
pt_pt: Opções de tratamento de entrada

source: Dashboard Integration Properties
de: Dashboard-Integrationseigenschaften
es: Propiedades de integración del panel de control
fr: Propriétés d'intégration du tableau de bord
pt_pt: Propriedades de integração do Painel de Controle

source: Audit log activation
de: Auditprotokollaktivierung
es: Activación de registros de auditoría.
fr: Activation des journaux d'audit
pt_pt: Ativação de registros de auditoria

source: Path to RRDTool Database For Metrics
de: Pfad zur RRDTool-Datenbank für Metriken
es: Ruta a los archivos de RRDTool para métricas
fr: Chemin d'accès vers les fichiers RRDTool pour les métriques
pt_pt: Caminho para o banco de dados do RRDTool para Metricas

source: Path to RRDTool Database For Status
de: Pfad zur RRDTool-Datenbank für historische Statuswerte
es: Ruta a los archivos de RRDTool para los estados
fr: Chemin d'accès vers les fichiers RRDTool pour les statuts
pt_pt: Caminho para o banco de dados do RRDTool para Estado

source: Path to RRDTool Database For Monitoring Engine Statistics
de: Pfad zur RRDTool-Datenbank für Monitoring Engine Statistiken
es: Ruta a la base de datos de RRDTool para las estadísticas del motor de supervisión
fr: Chemin vers la base de données RRDTool pour les statistiques du moteur de supervision
pt_pt: Caminho para o banco de dados do RRDTool para estatisticas do motor de monitoramento

source: Retention duration for performance data in RRDTool databases
de: Aufbewahrungsdauer für Performancedaten in den RRDTool-Datenbanken
pt_pt: Duração de retenção para dados de desempenho em bancos de dados do RRDTool

source: Retention duration for performance data in MySQL database
de: Aufbewahrungsdauer für Performancedaten in der MySQL-Datenbank
pt_pt: Duração de retenção para dados de desempenho no banco de dados MySQL

source: Retention duration for downtimes
de: Aufbewahrungsdauer für Ausfallszeiten
pt_pt: Duração de retenção para tempos de inatividade

source: Retention duration for comments
de: Aufbewahrungsdauer für Kommentare
pt_pt: Duração de retenção para comentários

source: Retention duration for logs
de: Aufbewahrungsdauer für Protokolle
pt_pt: Duração de retenção para logs

source: Retention duration for reporting data (Dashboard)
de: Aufbewahrungsdauer für Berichtsdaten (Dashboard)
pt_pt: Duração de retenção para dados de relatório (Dashboard)

source: Enable/Disable audit logs
de: Aktiviere bzw. Deaktiviere Auditprotokolle
es: Habilitar / deshabilitar registros de auditoría
fr: Activer/Désactiver les journaux d'audit
pt_pt: Ativa/Desativa registros de auditoria

source: Retention duration for partitioning
de: Aufbewahrungsdauer für die Partitionierung
pt_pt: Duração de retenção para particionamento

source: Forward provisioning
de: Dauer, für die vorgesorgt werden soll
pt_pt: Provisionamento direto

source: Backup directory for partitioning
de: Sicherungsverzeichnis für die Partitionierung
pt_pt: Diretório de backup para particionamento

source: Centreon information
de: Centreon Informationen
es: Información sobre Centreon
fr: Informations sur Centreon
pt_pt: IInformações Centreon

source: Centreon Web Directory
de: Centreon Web Verzeichnis
es: Directorio web de Centreon
fr: Répertoire Web de Centreon
pt_pt: Diretorio Centreon Web

source: Sessions Expiration Time
de: Session Ablaufzeit
es: Plazo de la sesión
fr: Durée d'expiration de la session
pt_pt: Duração do tempo de sessão

source: Limit per page for Monitoring
de: Limit pro Seite für das Monitoring
es: Límite por página para páginas de supervisión.
fr: Limite par page pour les pages de supervision
pt_pt: Limite por página para Monitoramento

source: Graph per page for Performances
de: Graphen pro Seite für die Performance
es: Tabla de rendimiento por página
fr: Graphique de performance par page
pt_pt: Gráfico de performance por página

source: Limit per page (default)
de: Limit pro Seite (Standardwert)
es: Límite por página (predeterminado)
fr: Limite par page (par défaut)
pt_pt: Limite por página (por padrão)

source: Refresh Interval for statistics
de: Aktualisierungsintervall für Statistiken
es: Actualizar intervalo para la página de estadísticas
fr: Intervalle de rafraîchissement pour la page des statistiques
pt_pt: Tempo de atualização para estatisticas

source: Refresh Interval for monitoring
de: Aktualisierungsintervall für das Monitoring
es: Intervalo de actualización para la página de supervisión.
fr: Intervalle de rafraîchissement pour la page de supervision
pt_pt: Tempo de atualização para monitoramento

source: Number of elements loaded in select
de: Anzahl der Elemente, die bei der Auswahl geladen werden
es: Número de elementos presentes
fr: Nombre d'éléments présent
pt_pt: Número de elementos carregados na seleção

source: Display Template
de: Anzeigentemplate
es: Usa la plantilla
fr: Utiliser le modèle
pt_pt: Mostrar Modelo

source: Last check
de: Letzte Überprüfung
es: Última comprobación
fr: Dernier contrôle
pt_pt: Última checagem

source: Criticality
de: Kritizität
es: criticidad
fr: Criticité
pt_pt: Criticidade

source: Attempt
de: Versuch
es: Tentativo
fr: Tentative
pt_pt: Tentativa

source: Sort by
de: Sortieren nach
es: ordenar por
fr: Trier par
pt_pt: Ordenar por

source: Ascending
de: Aufsteigend
es: creciente
fr: Croissant
pt_pt: Ascendente

source: Descending
de: Absteigend
es: descendente
fr: Décroissant
pt_pt: Descendente

source: Order sort
de: Sortierreihenfolge
es: Choix de tri
fr: Choix de tri
pt_pt: Ordenação

source: Sort problems by
de: Probleme sortieren nach
es: Ordenar problemas por
fr: Trier les problèmes par
pt_pt: Ordernar problemas por

source: Order sort problems
de: Sortierreihenfolge für Probleme
es: Orden de los problemas
fr: Ordre de tri des problèmes
pt_pt: Ordernar por problemas

source: Enable Autologin
de: Autologin aktivieren
es: Habilitar conexión automática
fr: Activer la connexion automatique
pt_pt: Ativar Auto-Login

source: Display Autologin shortcut
de: Autologin-Shortcut einblenden
es: Mostrar el atajo de conexión automática
fr: Afficher le raccourci de connexion automatique
pt_pt: Mostrar atalho para Auto-Login

source: Send anonymous statistics
de: Anonyme Statistiken senden
pt_pt: Enviar estatísticas anônimas

source: Proxy URL
es: URL du proxy web
fr: URL du proxy web
pt_pt: URL de Proxy

source: Test Internet Connection
de: Internetverbindung testen
es: Prueba de conexión a Internet
fr: Tester la connexion Internet
pt_pt: Teste a conexão com a Internet

source: Proxy port
es: Puerto de acceso al proxy de internet.
fr: Port d'accès au proxy internet
pt_pt: Porta do Proxy

source: Proxy user
de: Proxy-Benutzer
pt_pt: Usuário Proxy

source: Proxy password
de: Proxy-Passwort
pt_pt: Senha Proxy

source: Display downtime and acknowledgment on chart
de: Ausfallszeiten und Innkentnisnahmen auf dem Diagramm anzeigen
es: Mostrar tiempos de parada y reconocimientos en ghraphics
fr: Afficher les plages de maintenances et acquittements sur les ghraphiques
pt_pt: Mostrar manutenção e reconhecimento no gráfico

source: Display comment on chart
de: Kommentare auf dem Diagramm anzeigen
es: Mostrar comentario en gráfico
fr: Afficher les commentaires sur le graphique
pt_pt: Mostrar comentário no gráfico

source: Enable SSO authentication
de: SSO (Single Sign-on) Authentifizierung aktivieren
es: Habilitar autenticación SSO
fr: Activer l'authentification SSO
pt_pt: Ativa autenticação SSO

source: Are you sure you want to change this parameter? Please read the help before.
de: Sind Sie sich sicher, dass Sie diesen Parameter ändern möchten? Bitte lesen Sie vorher die Hilfe dazu.
es: ¿Seguro que quieres cambiar este parámetro? Por favor, lea la ayuda primero.
fr: Êtes-vous sûr de vouloir changer ce paramètre ? Veuillez lire l'aide avant.
pt_pt: Você tem certeza que quer alterar este parâmetro? Por favor, leia a ajuda antes.

source: Trusted client addresses
de: Vertrauenswürdige Client-Adressen
es: Direcciones de confianza
fr: Adresses des clients de confiance
pt_pt: Endereços de confiança

source: Blacklist client addresses
de: Nicht vertrauenswürdige Client-Adressen
es: Direcciones de clientes de cerraduras
fr: Adresses des clients bloqués
pt_pt: Endereços de clientes de bloqueios

source: Base Url
de: Basis-URL
es: URL base
fr: URL de base
pt_pt: Url base

source: Authorization Endpoint
de: Autorisierungsendpunkt
es: Punto final de autorización
fr: Point de terminaison d'autorisation
pt_pt: Endpoint de autorização

source: Token Endpoint
de: Token-Endpunkt
es: Punto final de token
fr: Point de terminaison de jeton
pt_pt: Endpoint de token

source: Introspection Token Endpoint
de: Introspection-Token-Endpunkt
es: Punto final de introspección de token
fr: Point de terminaison d'introspection du jeton
pt_pt: Endpoint de introspecção do token

source: User Information Endpoint
de: Benutzerinformationsendpunkt
es: Punto final de información del usuario
fr: Point de terminaison des informations utilisateur
pt_pt: Endpoint de informações do usuário

source: Scope
es: Alcance
fr: Portée
pt_pt: Escopo

source: Redirect Url
de: Weiterleitungs-URL
es: Redireccionar URL
fr: Adresse de redirection vers Centreon
pt_pt: URL de redirecionamento

source: Client ID
es: Identificación de cliente
fr: Identifiant client
pt_pt: Identificação de cliente

source: Client Secret
de: Client-Geheimnis
es: Secreto de cliente
fr: Secret client
pt_pt: Segredo de cliente

source: SSO only
de: Ausschließlich SSO (Single Sign-on)
es: Solo SSO
fr: Seulement SSO
pt_pt: Somente SSO

source: Mixed
de: Gemischt
es: mixto
fr: Mixte
pt_pt: Misto

source: SSO mode
de: SSO (Single Sign-on) Modus
es: Moda SSO
fr: Mode SSO
pt_pt: Modo SSO

source: SSO trusted client addresses
de: SSO (Single Sign-on) vertrauenswürdige Client-Adressen
es: Direcciones de clientes de confianza SSO
fr: Adresses des clients de confiance SSO
pt_pt: Endereços de clientes de confiança SSO

source: SSO blacklist client addresses
de: SSO (Single Sign-on) nicht vertrauenswürdige Client-Adressen
es: Direcciones de clientes bloqueados
fr: Adresses des clients de bloqués
pt_pt: Endereços de clientes bloqueados

source: SSO pattern matching login
de: SSO (Single Sign-on) Login-Abgleichsmuster
es: Patrón de búsqueda (patrón) para la autenticación (inicio de sesión)
fr: Chaine de recherche (pattern) pour l'authentification (login)
pt_pt: Padrão de pesquisa (pattern) para autenticação (SSO)

source: SSO pattern replace login
de: SSO (Single Sign-on) Login Muster zum Ersetzen
es: Cadena de reemplazo (patrón) para la autenticación (inicio de sesión)
fr: Chaine de remplacement (pattern) pour l'authentification (login)
pt_pt: Padrão de substituição para autenticação (SSO)

source: SSO login header
de: SSO (Single Sign-on) Login Header
es: Encabezado SSO HTTP
fr: Entête HTTP SSO
pt_pt: Cabeçalho de autenticação SSO

source: Enable Timezone management
de: Zeitzonenverwaltung aktivieren
es: Habilitar la gestión de compensación de tiempo
fr: Activer la gestion des décalages horaire
pt_pt: Ativa gerenciamento de Fuso Horário

source: Centreon Support Email
es: Servicio de soporte de correo
fr: Mail du service de support
pt_pt: E-mail de Suporte Centreon

source: Sorting
de: Sortierung
es: Tri
fr: Tri
pt_pt: Ordenando

source: Maximum page size
de: Maximale Seitengröße
es: Tamaño máximo de la página.
fr: Taille maximum de la page
pt_pt: Tamanho máximo da página

source: Sessions Properties
de: Sessioneigenschaften
es: Propiedades de sesión
fr: Propriétés des sessions
pt_pt: Propriedades de sessão

source: Refresh Properties
de: Aktualisierungseigenschaften
es: Actualizar propiedades
fr: Propriétés du rafraîchissement
pt_pt: Propriedades de atualização

source: Display properties
de: Anzeigeeigenschaften
es: Ajustes de pantalla
fr: Paramètres d'affichage
pt_pt: Propriedades de Exibição

source: Problem display properties
de: Problemanzeigeeigenschaften
es: Propiedades de los problemas de visualización
fr: Propriétés des problèmes d'affichage
pt_pt: Propriedades de exibição de problemas

source: Time Zone
de: Zeitzone
es: Huso horario
fr: Fuseau horaire
pt_pt: Fuso Horário

source: Authentication properties
de: Authentifizierungseigenschaften
es: Propiedades de autentificación
fr: Propriétés d'authentification
pt_pt: Propriedades de autenticação

source: Support Information
de: Supportinformationen
es: Centro de servicio
fr: Centre de services
pt_pt: Informação de Suporte

source: Backup enabled
de: Sicherung aktiviert
es: Habilitar copia de seguridad
fr: Activer la sauvegarde
pt_pt: Backup ativado

source: Backup directory
de: Sicherungsverzeichnis
es: Directorio de respaldo
fr: Répertoire des sauvegardes
pt_pt: Diretorio de Backup

source: Temporary directory
de: Temporäres Verzeichnis
es: Directorio temporal
fr: Répertoire temporaire
pt_pt: Diretorio temporario

source: Backup database centreon
de: Sicherung der centreon-Datenbank erstellen
es: Copia de seguridad de la base de datos de Centreon
fr: Sauvegarder la base de données Centreon
pt_pt: Backup do banco de dados Centreon

source: Backup database centreon_storage
de: Sicherung der centreon_storage-Datenbank erstellen
es: Copia de seguridad de la base de datos `centreon_storage`
fr: Sauvegarder la base de données 'centreon_storage'
pt_pt: Backup do banco de dados centreon_storage

source: Backup type
de: Sicherungstyp
es: Método de copia de seguridad
fr: Méthode de sauvegarde
pt_pt: Tipo de Backup

source: Full backup
de: Vollständige Sicherung
es: Copia de seguridad completa
fr: Sauvegarde complète
pt_pt: Backup completo

source: Partial backup
de: Teilsicherung
es: Copia de seguridad de tipo parcial
fr: Sauvegarde de type partielle
pt_pt: Backup parcial

source: Backup retention
de: Aufbewahrungsdauer der Sicherungen
es: Retención de la duración de las copias de seguridad.
fr: Durée de rétention des sauvegardes
pt_pt: Retenção de Backup

source: Backup configuration files
de: Sicherungskonfigurationsdateien
es: Copia de seguridad de los archivos de configuración
fr: Sauvegarder les fichiers de configuration
pt_pt: Backup dos ficheiros de configuração

source: MySQL configuration file path
de: Pfad zur MySQL-Konfigurationsdatei
es: Ruta al archivo de configuración de MySQL
fr: Chemin d'accès au fichier de configuration MySQL
pt_pt: Caminho do ficheiro de configuração do MySQL

source: SCP export enabled
de: SCP (secure copy) Export aktiviert
es: Habilitar la exportación SCP
fr: Activer l'export SCP
pt_pt: Ativa exportação SCP

source: Remote user
de: Remote-Benutzer
es: usuarios
fr: Utilisateurs
pt_pt: Usuário Remoto

source: Remote host
es: Host remoto
fr: Hôte distant
pt_pt: Host Remoto

source: Remote directory
de: Remote-Verzeichnis
es: Directorio remoto
fr: Répertoire distant
pt_pt: Diretorio remoto

source: Monitoring Engine information
de: Monitoring Engine Informationen
es: Información sobre el motor de supervisión.
fr: Informations sur le moteur de supervision
pt_pt: Informações do motor de monitoramento

source: Images Directory
de: Verzeichnis für Bilder
es: Directorio de imágenes
fr: Répertoire des images
pt_pt: Diretorio de Imagens

source: Plugins Directory
de: Verzeichnis für Plugins
es: Directorio de sondas
fr: Répertoire des sondes
pt_pt: Diretorio de Plugins

source: Interval Length
de: Intervalllänge
es: Unidad de tiempo de referencia
fr: Unité de temps de référence
pt_pt: Tamanho do Intervalo

source: Directory + Mailer Binary
de: Verzeichnis und Mailer-Ausführdatei
es: Ruta completa del ejecutable
fr: Chemin complet de l'exécutable
pt_pt: Diretorio + Binario do Mailer

source: Start script for broker daemon
es: Script de inicio de broker
fr: Script de démarrage du broker
pt_pt: Script de inicialização do daemon do Broker

source: Maximum number of hosts to show
de: Maximale Anzahl an Hosts die angezeigt werden
es: Número máximo de hosts para mostrar
fr: Nombre maximum d'hôtes à afficher
pt_pt: Número máximo de hosts para mostrar

source: Maximum number of services to show
de: Maximale Anzahl an Services die angezeigt werden
es: Número máximo de servicios para mostrar
fr: Nombre maximum de services à afficher
pt_pt: Número máximo de serviços para mostrar

source: Page refresh interval
de: Aktualisierungsintervall der Seite
es: Actualizar intervalo de la página
fr: Intervalle de rafraîchissement de la page
pt_pt: Intervalo de atualização de página

source: Force Active Checks
de: Aktive Überprüfungen erzwingen
es: Forzar controles activos
fr: Forcer les contrôles actifs
pt_pt: Forçar checagens Ativa

source: The directory isn't valid
de: Das Verzeichnis ist ungültig
es: El directorio no es valido
fr: Le répertoire n'est pas valide
pt_pt: O diretorio não é valido

source: Refresh interval must be numeric
de: Das Aktualisierungsintervall muss ein numerischer Wert sein
es: El intervalo de actualización debe ser un número.
fr: L'intervalle de rafraîchissement doit être un nombre
pt_pt: O intervalo de atualização deve ser numerico

source: This value must be a numerical value.
de: Dieser Wert muss ein numerischer Wert sein.
es: El valor debe ser numérico.
fr: La valeur doit être numérique.
pt_pt: O valor deve ser um número

source: Monitoring Engine
es: Motor de supervisión
fr: Moteur de supervision
pt_pt: Motor de Monitoramento

source: Monitoring database layer
de: Monitoring Datenbanklayer
es: Monitoreo de la capa de base de datos
fr: Surveillance de la couche base de données
pt_pt: Camada do banco de dados de Monitoramento

source: Engine Directories
de: Engine Verzeichnisse
es: Directorios del planificador
fr: Répertoires de l'ordonnanceur
pt_pt: Diretorios do Motor

source: Tactical Overview
de: Übersicht
es: Visión general
fr: Vue d'ensemble
pt_pt: Visão Geral Tática

source: Mailer path
de: Mailer-Pfad
es: Enviando emails
fr: Envoi d'emails
pt_pt: Caminho do Mailer

source: Default acknowledgement settings
de: Standardeinstellungen für die Inkenntnisnahme
es: Opciones de reconocimiento predeterminadas
fr: Options d'acquittement par défaut
pt_pt: Configurações padrão de Conhecimento

source: Default downtime settings
de: Standardeinstellungen für Ausfallszeiten
es: Opciones de tiempo de parada predeterminadas
fr: Options de la plage de maintenance par défaut
pt_pt: Opções padrão para manutenção

source: CSS File
de: CSS-Datei
es: Archivo CSS
fr: Fichier CSS
pt_pt: Ficheiro CSS

source: Added
de: Hinzugefügt
es: sumado
fr: Ajouté
pt_pt: Adicionado

source: Changed
de: Geändert
es: modificado
fr: Modifié
pt_pt: Alterado

source: Massive Change
de: Massenänderung
es: Cambio masivo
fr: Changement massif
pt_pt: Alteração em massa

source: Deleted
de: Gelöscht
es: suprimido
fr: Supprimé
pt_pt: Removido

source: Object ID
de: Objekt-ID
es: ID del objeto
fr: ID de l'objet
pt_pt: ID do Objeto

source: Contact Name
de: Kontaktname
es: Nombre del usuario
fr: Nom de l'utilisateur
pt_pt: Nome do Contacto

source: Field Name
de: Feldname
es: Nombre del campo
fr: Nom du champ
pt_pt: Nome do campo

source: Field Value
de: Feldwert
es: Valor de campo
fr: Valeur du champ
pt_pt: Valor do campo

source: Before
de: Vor
es: antes
fr: Avant
pt_pt: Antes

source: After
de: Nach
es: después
fr: Après
pt_pt: Depois

source: Logs for
de: Protokolle für
es: Registros para
fr: Logs pour
pt_pt: Registros para

source: Object type :
de: Objekttyp:
es: Tipo de objeto:
fr: Type d'objet :
pt_pt: Tipo de objeto :

source: Object name :
de: Objektname:
es: Nombre del objeto
fr: Nom de l'objet
pt_pt: Nome do objeto :
