Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: Default Settings
de: Standardeinstellungen
es: Ajustes predeterminados
fr: Paramètres par défaut
pt_pt: Configurações Padrão

source: Dependencies
de: Abhängigkeiten
es: dependencias
fr: Dépendances
pt_pt: Dependencias

source: Edit
de: Bearbeiten
es: editar
fr: Éditer
pt_pt: Editar

source: Engine configuration
de: Enginekonfiguration
es: Configuración del motor de recogida.
fr: Configuration du moteur de collecte
pt_pt: Configuração do Motor

source: Escalations
de: Eskalationen
es: Escaladas
fr: Escalades
pt_pt: Escalas

source: Event Logs
de: Eventprotokolle
es: Registros de eventos
fr: Journaux d'évènements
pt_pt: Registro de Eventos

source: Extensions
de: Erweiterungen
es: Extensiones
pt_pt: Extensões

source: General Access
de: Allgemeiner Zugriff
es: Gestión de acceso global
fr: Gestion des accès globaux
pt_pt: Acesso Geral

source: Geolocation
es: geolocalización
fr: Géolocalisation
pt_pt: Geolocalização

source: Group
de: Gruppe
es: grupo
fr: Groupe
pt_pt: Grupo

source: Home
de: Startseite
es: bienvenida
fr: Accueil
pt_pt: Inicio

source: Host Templates
es: Plantillas de host
fr: Modèles d'hôte
pt_pt: Modelos de Host

source: Hostgroups Summary
de: Hostgruppen Zusammenfassung
es: Resumen de estados por grupos de invitados
fr: Résumé des statuts par groupes d'hôtes
pt_pt: Resumo de Grupo de Hosts

source: Indicators
de: Indikatoren
es: Indicadores (KPIs)
fr: Indicateurs (KPI)
pt_pt: Indicadores (KPI)

source: Knowledge Base
es: Base de conocimientos
fr: Base de connaissance
pt_pt: Base de Conhecimento

source: Logs
de: Protokolle
es: Troncos
pt_pt: Registros

source: Management
de: Verwaltung
es: Administración
fr: Administration
pt_pt: Gerenciamento

source: Manufacturer
de: Hersteller
es: constructor
fr: Constructeur
pt_pt: Fabricante

source: Map
de: Karte
es: Mapa
pt_pt: Mapa

source: Menus Access
de: Menüzugriff
es: Gestión del acceso al menú.
fr: Gestion des accès aux menus
pt_pt: Acessos de Menu

source: Modules Options
de: Moduloptionen
es: Opción de módulo
fr: Option des modules
pt_pt: Opções de Modulos

source: Monitoring
es: Supervisión
fr: Supervision
pt_pt: Monitoramento

source: My Account
de: Mein Konto
es: Mi cuenta
fr: Mon compte
pt_pt: Minha Conta

source: Overview
de: Übersicht
es: Visión general
fr: Vue d'ensemble
pt_pt: Visão Geral

source: Parameters
de: Parameter
es: configuraciones
fr: Paramètres
pt_pt: Parametros

source: Performance Management
de: Leistungsverwaltung
es: Gestión de datos de rendimiento.
fr: Gestion des données de performance
pt_pt: Gerenciamento de Performance

source: Plugin packs
de: Plugin Pakete
es: Packs de sondes
fr: Packs de sondes
pt_pt: Pacotes de Plugin

source: Poller Statistics
de: Pollerstatistiken
es: Estadísticas de coleccionista
fr: Statistiques des collecteurs
pt_pt: Estatisticas de Coleta

source: Reporting
de: Berichtswesen
es: relaciones
fr: Rapports
pt_pt: Relatorios

source: Resources Access
de: Ressourcenzugriff
es: Gestión de acceso a recursos
fr: Gestion des accès aux ressources
pt_pt: Recursos de Acesso

source: Rules
de: Regeln
es: normas
fr: Règles
pt_pt: Regras

source: Scan
es: manual
fr: Manuelle
pt_pt: Manual

source: Server Status
es: Estado del servidor
fr: État du serveur
pt_pt: Estado do Servidor

source: Service Templates
es: Modelo de servicio
fr: Modèle de service
pt_pt: Modelos de Serviço

source: Services by host
de: Services nach Host
es: Servicios por host
fr: Services par hôte
pt_pt: Serviços por Host

source: Services by host group
de: Services nach Hostgruppen
es: Servicios por grupo de invitados
fr: Services par groupe d'hôtes
pt_pt: Serviços por Grupo de Host

source: Services by Hostgroup
de: Services nach Hostgruppen
es: Agrupación por grupos de invitados.
fr: Regroupement par groupes d'hôtes
pt_pt: Serviços por Grupo de Host

source: Services by Servicegroup
de: Services nach Servicegruppen
es: Agrupación por grupos de servicios
fr: Regroupement par groupes de services
pt_pt: Serviços por Grupo de Serviço

source: Services Grid
de: Servicegrid
es: Agrupación por host
fr: Regroupement par hôte
pt_pt: Grade de Serviços

source: Sessions
es: Sesiones
pt_pt: Sessões

source: Setup
es: Configuración
fr: Configuration
pt_pt: Configuração

source: System Logs
de: Systemprotokolle
es: Eventos relacionados con la recopilación de datos.
fr: Evenements liés à la collecte des données
pt_pt: Registros de Sistema

source: Time Periods
de: Zeiträume
es: Periodos de tiempo
fr: Périodes temporelles
pt_pt: Periodos de Tempo

source: Troubleshooter
es: ayudar
fr: Dépannage
pt_pt: Solucionador de Problemas

source: User Settings
de: Benutzereinstellungen
es: Configuraciones de usuario
fr: Paramètres utilisateurs
pt_pt: Configurações de Usuário

source: Users Access
de: Benutzerzugriff
es: Gestión de acceso de usuarios
fr: Gestion des accès utilisateurs
pt_pt: Acessos de Utilizadores

source: Views Restrictions
de: Ansichtenrestriktionen
es: Restricciones de acceso a las vistas.
fr: Restrictions d'accès aux vues
pt_pt: Restrições de Visões

source: Virtuals
de: Virtuelle
es: Métrica virtual
fr: Métriques virtuelles
pt_pt: Metricas Virtuais

source: Visualisation
de: Visualisierung
es: visualización
pt_pt: Visualização

source: Widgets
pt_pt: Ferramentas

source: Wizard
de: Assistent
es: Asistente de configuración
fr: Assistant de configuration
pt_pt: Assistente de Configuração

source: WizardAjax
es: Asistente de configuración
fr: Assistant de configuration
pt_pt: Assistente de Configuração

source: Correlation file
es: Archivo de correlación
fr: Fichier de corrélation
pt_pt: Ficheiro de correlação

source: Retention file
de: Aufbewahrungsdatei
es: Archivo de retención
fr: Fichier de rétention
pt_pt: Ficheiro de retenção

source: it's required
de: es ist erforderlich
es: necesario
fr: Requis
pt_pt: é requerido

source: Connection port
de: Verbindungsport
es: Puerto de conexion
fr: Port de connexion
pt_pt: Porta de conexão

source: Host to connect to
de: Host, mit dem sich verbunden werden soll
es: Host remoto
fr: Hôte distant
pt_pt: Host para conectar para

source: Failover name
es: Nombre del proceso de failover
fr: Nom du processus de bascule (failover)
pt_pt: Nome do Failover

source: Retry interval
de: Wiederholungsintervall
es: Intervalo entre 2 intentos.
fr: Intervalle entre 2 tentatives
pt_pt: Intervalo de tentativas

source: Buffering timeout
de: Puffertimeout
es: Tiempo antes de la activación del proceso de failover.
fr: Temps avant activation du processus de basculement (failover)
pt_pt: Tempo máximo para Buffer

source: Enable TLS encryption
de: TLS-Verschlüsselung aktivieren
es: Habilitar el cifrado TLS
fr: Activer le chiffrement TLS
pt_pt: Habilita encriptação TLS

source: Auto
de: Automatisch
es: automático
fr: Automatique
pt_pt: Automático

source: Private key file.
de: Private-Key Datei.
es: SSH clave privada.
fr: Clé privée SSH.
pt_pt: Ficheiro de chave privada (SSH)

source: Public certificate
de: Öffentliches Zertifikat
es: Certificado publico
fr: Certificat public
pt_pt: Certificado público

source: Trusted CA's certificate
de: Zertifikat einer vertrauenswürdigen CA
es: Certificado de CA de confianza
fr: Certificat CA de confiance
pt_pt: Certificado CA de confiança

source: Enable negotiation
de: Verhandlung aktvieren
es: Habilitar negociación de protocolo
fr: Activer la négociation du protocole
pt_pt: Habilita negociação

source: One peer retention
de: Ein Peer Aufbewahrung
es: Retención de datos para la conexión desde el Servidor Central.
fr: Rétention des données pour connexion depuis serveur Central
pt_pt: Um por retenção

source: Filter category
de: Filterkategorie
es: Filtros de categorías de transmisión
fr: Filtres par catégories de flux
pt_pt: Categoria de Filtro

source: Compression (zlib)
de: Kompression (zlib)
es: Compresión (zlib)
pt_pt: Compressão (zlib)

source: Compression level
de: Kompressionslevel
es: Nivel de compresion
fr: Niveau de compression
pt_pt: Nível de compressão

source: Compression buffer size
de: Kompressionspuffergröße
es: Tamaño de la memoria caché en la memoria utilizada para la compresión.
fr: Taille du cache en mémoire utilisé pour la compression
pt_pt: Tamanho do buffer de compressão

source: File path
de: Dateipfad
es: Localización de archivos
fr: Localisation du fichier
pt_pt: Localização do ficheiro

source: Maximum size of file
de: Maximale Dateigröße
es: Tamaño máximo de archivo
fr: Taille maximale du fichier
pt_pt: Tamanho máximo do ficheiro

source: Name of the logger
de: Name des Protokollierers
es: Nombre del registro de eventos
fr: Nom du journal d'évènements
pt_pt: Nome do registrador

source: Configuration messages
de: Konfigurationsnachrichten
es: Eventos de configuración
fr: Événements concernant la configuration
pt_pt: Configuração de mensagens

source: Debug messages
de: Debugnachrichten
es: Eventos de depuración
fr: Événements de débogage
pt_pt: Mensagens de Depuração

source: Error messages
de: Fehlernachrichten
es: Eventos de error
fr: Événements de type erreur
pt_pt: Mensagens de erro

source: Informational messages
de: Informationelle Nachrichten
es: Eventos informativos
fr: Événements de type information
pt_pt: Mensagens de informação

source: Logging level
de: Protokollierungslevel
es: Nivel de registro
fr: Niveau de journalisation
pt_pt: Nível de registro (Log)

source: Max file size in bytes
de: Maximale Dateigröße in Bytes
es: Tamaño máximo en bytes
fr: Taille maximale en octets (Bytes)
pt_pt: Tamanho máximo do ficheiro em bytes

source: RRD file directory for metrics
de: RRD-Dateiverzeichnis für Metriken
es: Directorio para almacenar archivos de rendimiento RRD
fr: Répertoire de stockage des fichiers RRD de performance
pt_pt: Diretorio de ficheiros RRD para metrica

source: RRD file directory for statuses
de: RRD-Dateiverzeichnis für Status
es: Directorio para almacenar archivos de estado RRD
fr: Répertoire de stockage des fichiers RRD de statuts
pt_pt: Diretorio de ficheiros RRD para status

source: TCP port
es: Puerto TCP
fr: Port TCP
pt_pt: Porta TCP

source: Unix socket
es: Socket Unix
fr: Socket Unix
pt_pt: Socket Unix

source: Write metrics
de: Metriken schreiben
es: Generar gráficas de rendimiento.
fr: Générer les graphiques de performance
pt_pt: Escrita de metricas

source: Write status
de: Status schreiben
es: Generar gráficas de estado.
fr: Générer les graphiques de statut
pt_pt: Escrita de status

source: Interval length
de: Intervalllänge
es: Unidad de tiempo de referencia (en segundos)
fr: Unité de temps de référence (en secondes)
pt_pt: Tamanho do intervalo (em segundos)

source: RRD length
de: RRD-Länge
es: Tiempo de retención de datos en bases de datos RRD (en segundos)
fr: Durée de rétention des données dans les bases RRD (en secondes)
pt_pt: Tamanho do RRD

source: DB type
de: DB Typ
es: Tipo de base de datos
fr: Type de base de données
pt_pt: Tipo do Banco de dados

source: DB host
es: Dirección de la base de datos
fr: Adresse de la base de données
pt_pt: Endereço Banco de dados

source: DB port
es: Puerto de conexión a la base de datos.
fr: Port de connexion à la base de données
pt_pt: Porta Banco de dados

source: DB user
de: DB Benutzer
es: Usuario para conectarse a la base de datos
fr: Utilisateur pour se connecter à la base de données
pt_pt: Usuário Banco de dados

source: DB password
de: DB Passwort
es: Contraseña del usuario
fr: Mot de passe de l'utilisateur
pt_pt: Senha Banco de dados

source: DB name
es: Nombre de la base de datos
fr: Nom de la base de données
pt_pt: Nome Banco de dados

source: Maximum queries per transaction
de: Maximale Anfragen pro Transaktion
es: Número máximo de solicitudes por transacción
fr: Nombre maximum de requêtes par transaction
pt_pt: Máximo de consultas por transação

source: Transaction commit timeout
de: Transaktionscommit Timeout
es: Tiempo máximo de ejecución del compromiso de transacción
fr: Temps d'exécution maximum des "commit" de transaction
pt_pt: Tempo máximo de execução de envio (commit)

source: Replication enabled
de: Replikation aktiviert
es: Habilitar replicación
fr: Activer la réplication
pt_pt: Republicação ativada

source: Rebuild check interval in seconds
de: Neuaufbau Überprüfungsintervall in Sekunden
es: Intervalo de verificación de solicitudes para reconstruir gráficos de rendimiento
fr: Intervalle de contrôle des demandes de reconstruction des graphiques de performance
pt_pt: Intervalo de checagem da reconstrução de gráficos de performance (em segundos)

source: Store performance data in data_bin
de: Leistungsdaten in data_bin speichern
es: Registro de datos de rendimiento en la tabla `data_bin`
fr: Enregistrement des données de performance dans la table 'data_bin'
pt_pt: Armazenamento de dados de performance em data_bin

source: Insert in index data
de: In index_data einfügen
es: Insertar en la tabla index_data
fr: Insertion dans la table index_data
pt_pt: Insere dados na tabela de indice

source: File for Centreon Broker statistics
de: Datei, in der Centreon-Broker-Statistiken gespeichert werden
es: Localización del archivo de estadísticas de Centreon Broker
fr: Localisation du fichier de statistiques de Centreon Broker
pt_pt: Localização do ficheiro de estatisticas do Centreon Broker

source: Store in performance data in data_bin
de: In Leistungsdaten in data_bin speichern
es: Registro de datos de rendimiento en la tabla `data_bin`
fr: Enregistrement des données de performance dans la table 'data_bin'
pt_pt: Armazena dados no banco de performance em data_bin

source: Add innodb_file_per_table=1 in my.cnf file under the [mysqld] section and restart MySQL Server.
de: Fügen Sie die Zeile innodb_file_per_table=1 in der my.cnf im Abschnitt [mysqld] ein und starten Sie den MySQL-Server neu.
es: Agregue innodb_file_per_table=1 en el archivo my.cnf en la sección [mysqld] y reinicie MySQL Server.
fr: Ajouter la propriété innodb_file_per_table=1 dans le fichier my.cnf dans l'encart [mysql] et redémarrez le serveur MySQL.
pt_pt: Adicione a propriedade innodb_file_per_table=1 no ficheiro my.cnf na seção [mysqld] e reinicie o servidor MySQL.veur MySQL.

source: Cannot get timezone information
de: Die Zeitzoneninformationen können nicht ermittelt werden
pt_pt: Não é possível obter informações sobre o fuso horário

source: Cannot get Centreon version
de: Die Centreon-Version kann nicht ermittelt werden
pt_pt: Não é possível obter a versão Centreon

source: File not found
de: Datei nicht gefunden
es: Archivo no encontrado
fr: Fichier non trouvé
pt_pt: Ficheiro não encontrado

source: All pollers
de: Alle Poller
fr: Tous les collecteurs
pt_pt: Todos os Coletores

source: Configure pollers
de: Poller konfigurieren
fr: Configurer les collecteurs
pt_pt: Configurar coletores

source: services
pt_pt: serviços

source: Edit profile
de: Profil bearbeiten
fr: Editer le profil
pt_pt: Editar perfil

source: Copy autologin link
de: Autologin Link kopieren
fr: Copier le lien de connexion automatique
pt_pt: Copia link de auto-autenticação

source: Server Configuration Wizard
de: Server Konfigurationsassistent
fr: Assistant de configuration du serveur
pt_pt: Assistente de Configuração de Servidor

source: Choose a server type
de: Wählen Sie einen Servertyp
fr: Choisissez un type de serveur
pt_pt: Escolha um tipo de servidor

source: Add a Centreon Remote Server
de: Centreon Remote Server hinzufügen
fr: Ajouter un serveur distant Centreon
pt_pt: Adiciona um Servidor Remoto do Centreon

source: Add a Centreon Poller
de: Centreon Poller hinzufügen
fr: Ajouter un collecteur Centreon
pt_pt: Adiciona um Coletor do Centreon

source: Remote Server Configuration
de: Remote-Server Konfiguration
fr: Configuration du serveur distant
pt_pt: Configuração do Servidor Remoto

source: Create new Remote Server
de: Neuen Remote-Server erstellen
fr: Créer un nouveau serveur distant
pt_pt: Cria um novo Servidor Remoto

source: Server Name
fr: Nom du serveur
pt_pt: Nome do Servidor

source: Server IP address
de: Server IP-Adresse
fr: Adresse IP du serveur
pt_pt: Endereço IP do Servidor

source: Database username
de: Datenbankbenutzername
fr: Nom de l'utilisateur ayant accès à la base de données
pt_pt: Nome de usuário do banco de dados

source: Database password
de: Datenbankpasswort
fr: Mot de passe de l'utilisateur ayant accès à la base de données
pt_pt: Senha do banco de dados

source: Centreon Central IP address, as seen by this server
de: IP des zentralen Centreon Servers, aus der Sicht dieses Servers
fr: Adresse IP du Central Centreon, telle que vue par ce serveur
pt_pt: Endereço IP do Centreon Central, como visto pelo o servidor

source: Centreon Web Folder on Remote
de: Centreon Web Ordner auf dem Remote-Server
fr: Dossier Centreon web sur le serveur distant
pt_pt: Pasta do Centreon Web remoto

source: Select a Remote Server
fr: Sélectionnez un serveur distant
pt_pt: Selecione um Servidor Remoto

source: Select Pending Remote Links
de: Wählen Sie ausstehende Remote-Verknüpfungen
fr: Sélectionner les liens distants en attente
pt_pt: Selecione associações pendentes remota

source: Select IP
de: IP wählen
fr: Sélectionnez une IP
pt_pt: Selecione IP

source: Select pollers to be attached to this new Remote Server
de: Wählen Sie Poller aus, die an den neuen Remote-Server angefügt werden
fr: Sélectionner les collecteurs à attacher à ce nouveau serveur distant
pt_pt: Selecione os coletores que devem ser anexados com o novo Servidor Remoto

source: Finalizing Setup
de: Setup wird abgeschlossen
fr: Finalisation de la configuration
pt_pt: Finalizando Configuração

source: Creating Export Task
de: Exportaufgabe wird erzeugt
fr: Création d'une tâche d'exportation
pt_pt: Criando Tarefa de Exportação

source: Generating Export Files
de: Exportdateien werden erzeugt
fr: Génération de fichiers d'exportation
pt_pt: Gerando Ficheiros para serem Exportados

source: The field is required
de: Dieses Feld ist erforderlich
fr: Ce champ est requis
pt_pt: Este campo é requerido

source: Not a valid IP address
de: Ungültige IP-Adresse
fr: Adresse IP non valide
pt_pt: Não é um endereço de IP válido

source: Add server with wizard
de: Server mithilfe des Assistenten hinzufügen
fr: Ajouter un serveur à l'aide de l'assistant
pt_pt: Adicionar servidor com assistente

source: Select linked Remote Server
de: Wählen Sie den verknüpften Remote-Server aus
fr: Selectionez le serveur distant lié
pt_pt: Selecione um Servidor Remoto associado

source: as
de: als
fr: en tant que
pt_pt: como

source: Server Configuration
de: Serverkonfiguration
fr: Configuration du Serveur
pt_pt: Configuração do Servidor

source: Attach poller to a master remote server
de: Poller dem Master Remote-Server anfügen
fr: Attacher un collecteur à un remote server
pt_pt: Anexar coletor a um servidor mestre remoto

source: Attach poller to additional remote servers
de: Poller weiteren Remote-Servern anfügen
fr: Attacher un collecteur à des remote servers additionels
pt_pt: Anexar coletor a servidores remotos adicionais

source: Advanced: reverse Centreon Broker communication flow
de: Fortgeschritten: Centreon Broker Kommunikationsablauf umdrehen
fr: Avancé: inversé le flux de communication du broker Centreon
pt_pt: Avançado: fluxo de comunicação reversa do Centreon Broker

source: %s is not valid.
de: %s ist ungültig.
fr: %s n'est pas valide.
pt_pt: %s não é valido.

source: You need to send '%s' in the request.
de: '%s' muss in der Anfrage gesendet werden.
fr: You devez envoyer le paramètre '%s' dans la requête.
pt_pt: Você precisa enviar '%s' na sua requisição.

source: Some database poller updates are not active; check your configuration
de: Einige Datenbankpollerupdates sind nicht aktiv; überprüfen Sie die Konfiguration
fr: Certains collecteurs ne sont pas à jour en base de données; vérifiez votre configuration
pt_pt: Algumas atualizações no banco de dados do coletor não estão ativas, verifique sua configuração.

source: Latency detected, check configuration for better optimization
de: Latenz erkannt, überprüfen Sie die Konfiguration für bessere Optimierung
fr: Latence détectée, vérifiez la configuration pour une meilleure optimisation
pt_pt: Latência detectada, verifique a configuração para uma melhor otimização

source: Monitoring engine information
de: Monitoring Engine Informationen
es: Información sobre el motor de supervisión.
fr: Information sur le moteur de supervision
pt_pt: Informção do motor de monitoramento

source: Broker module information
de: Brokermodulinformationen
es: Información de su agente broker
fr: Information du module broker
pt_pt: Informações do modulo Broker

source: Installation finished
de: Installation abgeschlossen
es: Instalación completada
fr: Installation terminée
pt_pt: Instalação finalizada

source: Database information
de: Datenbankinformationen
es: Información de la base de datos
fr: Information de la base de données
pt_pt: Informações do banco de dados

source: Modules installation
de: Modulinstallation
pt_pt: Instalação de módulos

source: Welcome to Centreon Setup
de: Willkommen beim Centreon-Setup
es: Bienvenido al proceso de instalación de Centreon
fr: Bienvenue dans le processus d'installation de Centreon
pt_pt: Bem vindo ao processo de configuração do Centreon

source: Cleanup check interval
es: Intervalo de control de purga
fr: Intervalle de contrôle de la purge
pt_pt: Intervalo da checagem de limpeza

source: Correlation passive
es: Correlación pasiva
pt_pt: Correlação passiva

source: Instance timeout
es: Tiempo máximo (timeout)
fr: Durée maximale (timeout)
pt_pt: Duração máxima (timeout)

source: Metric naming
es: Nombre de la métrica
fr: Nom de la métrique
pt_pt: Nome da metrica

source: Status naming
es: Nombre de estado
fr: Nom du statut
pt_pt: Nome do status

source: Storage DB host
es: Dirección de la base de datos
fr: Adresse de la base de données
pt_pt: Endereço do banco de dados de armazenagem

source: Storage DB name
es: Nombre de la base de datos
fr: Nom de la base de données
pt_pt: Nome do banco de dados de armazenagem

source: Storage DB password
es: Contraseña de cuenta
fr: Mot de passe du compte
pt_pt: Senha do banco de dados de armazenagem

source: Storage DB port
es: Puerto de acceso a la base de datos.
fr: Port d'accès à la base de données
pt_pt: Porta do banco de dados de armazenagem

source: Storage DB type
es: Tipo de base de datos
fr: Type de base de données
pt_pt: Tipo do banco de dados de armazenagem

source: Storage DB user
es: Usuario con acceso a la base de datos.
fr: Utilisateur ayant accès à la base de données
pt_pt: Usuário do banco de dados de armazenagem

source: graph on
de: Graph auf
es: gráfico del anfitrión
fr: graphique de l'hôte
pt_pt: gráfico em

source: Connection to Wiki database failed, please contact your administrator or read the Centreon online documentation to configure wiki access
es: Error al conectarse a la base de conocimientos, comuníquese con su administrador o consulte la documentación en línea de Centreon para configurar el acceso.
fr: Echec de connexion à la base de connaissance, veuillez contacter votre administrateur ou consulter la documentation en ligne Centreon pour configurer les accès.
pt_pt: Conexão com a base de dados da Wiki falhou, por favor entre em contacto com o seu administrador ou leia a documentação online do Centreon parar configurar o acesso ao Wiki.

source: File Path
de: Dateipfad
es: Localización de archivos
fr: Localisation du fichier
pt_pt: Caminho do Ficheiro

source: UI Notifications
de: UI-Benachrichtigungen
es: Notificaciones visibles en la interfaz.
fr: Notifications visible dans l'interface
pt_pt: Notificações de Interface

source: Password Management
de: Passwortverwaltung
es: Manejo de contraseñas
fr: Gestion du mot de passe
pt_pt: Gerenciamento de Senha

source: Preferences
de: Präferenzen
es: preferencias
fr: Préférences
pt_pt: Preferências
