Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: Enable/Disable Notifications services of a host
de: Benachrichtigungen für die Services eines Hosts (de)aktivieren
es: Habilitar / deshabilitar notificaciones de servicios de host
fr: Activer/Désactiver les notifications des services de l'hôte
pt_pt: Ativa/Desativa Notificações de serviços para um host

source: Enable/Disable Checks services of a host
de: Überprüfungen für die Services eines Hosts (de)aktivieren
es: Habilitar / deshabilitar cheques de servicios de host
fr: Activer/Désactiver les contrôles des services de l'hôte
pt_pt: Ativa/Desativa Checagem de Serviços para um host

source: Submit result for a host
de: Ergebnis für einen Host einreichen
es: Enviar el resultado para un host
fr: Soumettre le résultat pour un hôte
pt_pt: Envia resultado para um host

source: Shutdown Monitoring Engine
de: Monitoring Engine herunterfahren
es: Detener el programador
fr: Arrêter l'ordonnanceur
pt_pt: Desliga Motor de Monitoramento

source: Restart Monitoring Engine
de: Monitoring Engine neustarten
es: Reinicie el planificador
fr: Redémarrer l'ordonnanceur
pt_pt: Reinicia Motor de Monitoramento

source: Enable/Disable notifications
de: Benachrichtigungen (de)aktivieren
es: Habilitar / Deshabilitar notificaciones
fr: Activer/Désactiver les notifications
pt_pt: Ativa/Desativa notificações

source: Enable/Disable service checks
de: Serviceüberprüfungen (de)aktivieren
es: Habilitar / Deshabilitar cheques de servicios
fr: Activer/Désactiver les contrôles des services
pt_pt: Ativa/Desativa checagem de serviços

source: Enable/Disable passive service checks
de: Passive Serviceüberprüfungen (de)aktivieren
es: Habilitar / deshabilitar cheques de servicios pasivos
fr: Activer/Désactiver les contrôles passifs des services
pt_pt: Ativa/Desativa checagem de serviços passivos

source: Enable/Disable host checks
de: Hostüberprüfungen (de)aktivieren
es: Habilitar / deshabilitar controles de host
fr: Activer/Désactiver les contrôles des hôtes
pt_pt: Ativa/Desativa checagens do host

source: Enable/Disable passive host checks
de: Passive Hostüberprüfungen (de)aktivieren
es: Habilitar / deshabilitar cheques de invitado pasivos
fr: Activer/Désactiver les contrôles passifs d'hôtes
pt_pt: Ativa/Desativa checagens passiva do host

source: Enable/Disable Event Handlers
de: Event Handler (de)aktivieren
es: Activar / Desactivar el controlador de eventos
fr: Activer/Désactiver le gestionaire d'évènements
pt_pt: Ativa/Desativa Manipulação de Evento

source: Enable/Disable Flap Detection
de: Flackernerkennung (de)aktivieren
es: Activar / Desactivar detección de equipaje
fr: Activer/Désactiver la détection de bagotage
pt_pt: Ativa/Desativa Detecção de Variação

source: Enable/Disable Obsessive service checks
de: Überwachte Serviceüberprüfungen (de)aktivieren
es: Habilitar / deshabilitar el control de control posterior de los servicios
fr: Activer/Désactiver la commande post contrôle des services
pt_pt: Ativa/Desativa checagem de pós-comando do serviço

source: Enable/Disable Obsessive host checks
de: Überwachte Hostüberprüfungen (de)aktivieren
es: Habilitar / deshabilitar el control de control de host
fr: Activer/Désactiver la commande post contrôle des hôtes
pt_pt: Ativa/Desativa checagens de pós-comando do host

source: Enable/Disable Performance Data
de: Leistungsdaten (de)aktivieren
es: Activar / desactivar datos de rendimiento
fr: Activer/Désactiver les données de performance
pt_pt: Ativa/Desativa dados de performance

source: Display Top Counter
de: Counter in der oberen Menüleiste anzeigen
es: Ver estadísticas de host y servicio en el banner.
fr: Afficher les statistiques des hôtes et services dans le bandeau
pt_pt: Mostra Contadores de Topo

source: Display Top Counter pollers statistics
de: Pollerstatistikcounter in der oberen Menüleiste anzeigen
es: Ver estadísticas del colector en el banner.
fr: Afficher les statistiques des collecteurs dans le bandeau
pt_pt: Mostra Contadores de Topo para estatisticas do coletor

source: Display Poller Listing
de: Pollerauflistung anzeigen
es: Ver la lista de coleccionistas.
fr: Afficher la liste des collecteurs
pt_pt: Listagem de Exibição de Coletor

source: Generate Configuration Files
de: Konfigurationsdateien erzeugen
es: Generar archivos de configuración.
fr: Générer les fichiers de configuration
pt_pt: Geração de ficheiros de configuração

source: Generate SNMP Trap configuration
de: SNMP-Trap Konfiguration erzeugen
es: Generar configuración de captura SNMP
fr: Générer la configuration des traps SNMP
pt_pt: Geração de configuração de SNMP Trap

source: Services Actions Access
de: Zugriff auf Serviceaktionen
es: Acceso a acciones sobre servicios.
fr: Accès aux actions sur les services
pt_pt: Acesso a ações de serviços

source: Hosts Actions Access
de: Zugriff auf Hostaktionen
es: Acceso a acciones en hosts.
fr: Accès aux actions sur les hôtes
pt_pt: Acesso a ações de Hosts

source: Global Monitoring Engine Actions (External Process Commands)
de: Globale Aktionen für die Monitoring Engine (Externe Prozessbefehle)
es: Acciones globales del motor de supervisión (comandos externos).
fr: Actions globales du moteur de supervision (Commandes externes)
pt_pt: Acesso a ações globais do motor de monitoramento (Comandos Externos)

source: Global Functionalities Access
de: Zugriff auf globale Funktionalitäten
es: Acceso a funciones globales.
fr: Accès aux fonctionnalités globales
pt_pt: Acesso a funcionalidades globais

source: Compulsory Groups
de: Erforderliche Gruppen
es: Grupos obligatorios
fr: Groupes obligatoires
pt_pt: Grupos obrigatorios

source: ACL reloaded
de: Zugriffssteuerungsliste (ACL) neu geladen
es: ACL recargado
fr: ACL rechargées
pt_pt: Recarregar ACL

source: Reload ACL
de: Zugriffssteuerungsliste (ACL) neu laden
es: Recargar ACLs
fr: Recharger les ACL
pt_pt: Recarregar permissões (ACL)

source: Connected users
de: Verbundene Benutzer
es: Usuarios conectados
fr: Utilisateurs connectés
pt_pt: Utilizadores conectados

source: Position
es: Página
fr: Page
pt_pt: Posição

source: IP Address
de: IP-Adresse
es: Dirección IP
fr: Adresse IP
pt_pt: Endereço IP

source: Host Name
es: Nombre del anfitrión
fr: Nom de l'hôte
pt_pt: Nome do Host

source: Service Description
de: Servicebeschreibung
es: Descripción del servicio.
fr: Description du service
pt_pt: Descrição do serviço

source: Centreon Users
de: Centreon Benutzer
es: Usuarios de Centreon
fr: Utilisateurs Centreon
pt_pt: Utilizadores Centreon

source: The selected user didn't see any resources
de: Dem ausgewählten Benutzer wurden keine Ressourcen angezeigt
es: El usuario seleccionado no ve ningún recurso.
fr: L'utilisateur sélectionné ne voit aucune ressource
pt_pt: O usuário selecionado não pode ver qualquer recurso

source: Please select an user in order to display resources
de: Bitte wählen Sie einen Benutzer, um dessen Ressourcen einzusehen
es: Por favor, seleccione un usuario para ver los recursos
fr: Merci de sélectionner un utilisateur pour afficher les ressources
pt_pt: Por favor selecione o usuário na ordem para visualizar recursos

source: The selected user is not enable.
de: Der ausgewählte Benutzer ist nicht aktiviert.
es: El usuario seleccionado no está habilitado.
fr: L'utilisateur sélectionné n'est pas activé.
pt_pt: O usuário selecionado não esta ativo.

source: Hosts Groups Shared
de: Geteilte Hostgruppen
es: Grupos compartidos de hosts
fr: Groupes d'hôtes partagés
pt_pt: Grupos de Hosts compartilhados

source: Filters
de: Filter
es: filtros
fr: Filtres
pt_pt: Filtros

source: Access list name
de: Zugriffslistenname
es: Nombre de la lista de acceso
fr: Nom de la liste d'accès
pt_pt: Nome da lista de Acesso

source: Include all hosts
de: Alle Hosts inkludieren
es: Incluir todos los hosts
fr: Inclure tous les hôtes
pt_pt: Inclui todos os hosts

source: Include all hostgroups
de: Alle Hostgruppen inkludieren
es: Incluir todos los grupos de invitados
fr: Inclure tous les groupes d'hôtes
pt_pt: Inclui todos os grupos de host

source: Include all servicegroups
de: Alle Servicegruppen inkludieren
es: Incluir todos los grupos de servicio
fr: Inclure tous les groupes de services
pt_pt: Inclui todos os grupos de serviço

source: People linked to this Access list
de: Mit dieser Zugriffsliste verbundene Personen
es: Usuarios vinculados a esta lista de acceso
fr: Utilisateurs liés à cette liste d'accès
pt_pt: Utilizadores associados a lista de acesso

source: Shared Resources
de: Geteilte Ressourcen
es: Recursos compartidosb
fr: Ressources partagéesb
pt_pt: Recursos Compartilhados

source: Help
de: Hilfe
es: Ayuda
fr: Aide
pt_pt: Ajuda

source: <b><i>Help :</i></b> Select hosts and hostgroups that can be seen by associated users. You also have the possibility to exclude host(s) from selected hostgroup(s).
de: <b><i>Hilfe:</i></b> Wählen Sie Hosts und Hostgruppen, die von verknüpften Benutzern gesehen werden können. Es besteht ebenfalls die Möglichkeit, einzelne Hosts aus einer bzw. mehreren Hostgruppe(n) auszuschließen.
es: <b><i>Ayuda:</i></b> Selecciona hosts y grupos de hosts que pueden ser vistos por usuarios asociados. También puede excluir hosts de grupos de hosts seleccionados.
fr: <b><i>Aide :</i></b> Sélectionner les hôtes et les groupes d'hôtes qui peuvent être vus par les utilisateurs associés. Vous pouvez aussi exclure des hôtes des groupes d'hôtes sélectionnés.
pt_pt: <b><i>Ajuda :</i></b> Selecione hosts e grupo de hosts que podem ser vistos por utilizadores associados. Você também tem a possibilidade de excluir host(s) do grupo(s) de hosts selecionado.

source: <b><i>Help :</i></b> Select services that can be seen by associated users.
de: <b><i>Hilfe:</i></b> Wählen Sie Services, die von verknüpften Benutzern gesehen werden können.
es: <b><i> Ayuda: </i></b> Seleccione los servicios que pueden ver los usuarios asociados.
fr: <b><i>Aide :</i></b> Sélectionner les services qui peuvent être vus par les utilisateurs associés.
pt_pt: <b><i>Ajuda :</i></b> Selecione serviços que podem ser visto por utilizadores associados.

source: <b><i>Help :</i></b> Select meta services that can be seen by associated users.
de: <b><i>Hilfe:</i></b> Wählen Sie Meta-Services, die von verknüpften Benutzern gesehen werden können.
es: <b><i>Ayuda:</i></b> Seleccione los meta-servicios que pueden ver los usuarios asociados.
fr: <b><i>Aide :</i></b> Sélectionner les meta-services qui peuvent êtres vus par les utilisateurs associés.
pt_pt: <b><i>Ajuda:</i></b> Selecione meta-serviço para que utilizadores associados possam ver.

source: <b><i>Help :</i></b> Select the filter(s) you want to apply to the resource definition for a more restrictive view.
de: <b><i>Hilfe:</i></b> Wählen Sie einen bzw. mehrere Filter, der/die auf die Ressourcendefinition angewendet werden soll(en), um die Ansicht einzuschränken.
es: <b><i>Ayuda:</i></b> Seleccione los filtros que desea aplicar a la definición de recursos para una vista más estrecha.
fr: <b><i>Aide :</i></b> Sélectionner le(s) filtre(s) que vous voulez appliquer à la définition des ressources pour une vue plus restreinte.
pt_pt: <b><i>Ajuda :</i></b> Selecione os filtro(s) que você quer aplicar para a definição de recursos com uma visão mais restritiva.

source: Poller Filter
es: Filtrar por coleccionista
fr: Filtrer par collecteur
pt_pt: Filtro de Coleta

source: Host Groups
de: Hostgruppen
es: Grupos de anfitriones
fr: Groupes d'hôtes
pt_pt: Grupo de Hosts

source: Exclude hosts from selected host groups
de: Hosts aus den ausgewählten Hostgruppen ausschließen
es: Excluir hosts de grupos de hosts seleccionados
fr: Exclure les hôtes des groupes d'hôtes sélectionnés
pt_pt: Exclui hosts dos grupos de hosts selecionado

source: Service Category Filter
de: Servicekategoriefilter
es: Filtrar por categoría de servicio
fr: Filtrer par catégorie de service
pt_pt: Filtro de Categoria de Serviço

source: Host Category Filter
de: Hostkategoriefilter
es: Filtrar por categoría de host
fr: Filtrer par catégorie d'hôte
pt_pt: Filtro de Categoria de Host

source: Service Groups
de: Servicegruppen
es: Grupos de servicio
fr: Groupes de services
pt_pt: Grupos de Serviço

source: Meta Services
es: Servicios de metadatos
fr: Méta-Services
pt_pt: Meta Serviços

source: Hosts Resources
de: Hostressourcen
es: Gestión de host
fr: Gestion des hôtes
pt_pt: Recursos de Hosts

source: Services Resources
de: Serviceressourcen
es: Gestión de servicios
fr: Gestion des services
pt_pt: Recursos de Serviços

source: All Hosts
de: Alle Hosts
es: Todos los invitados
fr: Tous les hôtes
pt_pt: Todos os Hosts

source: All Hostgroups
de: Alle Hostgruppen
es: Todos los grupos de invitados.
fr: Tous les groupes d'hôtes
pt_pt: Todos os Grupos de Hosts

source: All Servicegroups
de: Alle Servicegruppen
es: Todos los grupos de servicios.
fr: Tous les groupes de services
pt_pt: Todos os Grupos de Serviço

source: Check User View
de: Benutzeransicht überprüfen
es: Comprueba la vista del usuario.
fr: Vérifier la vue de l'utilisateur
pt_pt: Verifica a visão do usuário

source: Version
es: Versión
pt_pt: Versão

source: Author
de: Autor
es: autor
fr: Auteur
pt_pt: Autor

source: Actions
de: Aktionen
es: Comportamiento
pt_pt: Ações

source: Would you like to install this widget?
es: ¿Te gustaría instalar este widget?
fr: Souhaitez-vous installer ce widget?
pt_pt: Você realmente quer instalar esta ferramenta ?

source: Would you like to install all widgets?
pt_pt: Gostaria de instalar todos os widgets?

source: Are you sure you want to uninstall this widget?
es: ¿Seguro que quieres desinstalar este widget?
fr: Êtes-vous sûr de vouloir désinstaller ce widget?
pt_pt: Você tem certeza que quer desinstalar esta ferramenta ?

source: Would you like to upgrade this widget?
es: ¿Te gustaría actualizar este widget?
fr: Souhaitez-vous monter en version ce widget?
pt_pt: Você realmente quer atualizar esta ferramenta ?

source: Would you like to upgrade all widgets?
pt_pt: Gostaria de atualizar todos os widgets?

source: Module Information
es: Información del módulo
fr: Information sur le module
pt_pt: Informação do Modulo

source: Upgrade Information
es: Información sobre el entorno.
fr: Information sur la mise à juour
pt_pt: Informação de Atualização

source: Real name
es: Nombre real
fr: Nom réel
pt_pt: Nome Real

source: Release
es: Versión
fr: Version
pt_pt: Versão

source: Base release
es: Version de base
fr: Version de base
pt_pt: Versão Base

source: Final release
es: Versión final
fr: Version finale
pt_pt: Versão

source: Installed
es: instalado
fr: Installé
pt_pt: Instalado

source: Back
de: Zurück
es: regreso
fr: Retour
pt_pt: Retornar

source: Upgrade
es: Actualización
fr: Mise à jour
pt_pt: Atualização

source: Install Module
es: Instalar el modulo
fr: Installer le module
pt_pt: Instalar Modulo

source: Module installed and registered
es: Módulo instalado y guardado.
fr: Module installé et enregistré
pt_pt: Modulo instalado e registrado

source: Unable to install module
es: No se pudo instalar el módulo
fr: Impossible d'installer le module
pt_pt: Impossivel instalar o modulo

source: Directory
de: Verzeichnis
es: repertorio
fr: Répertoire
pt_pt: Diretorio

source: Image
de: Bild
es: Imagen
pt_pt: imagem

source: Comment
de: Kommentar
es: comentario
fr: Commentaire
pt_pt: Comentário

source: Empty directory
de: Leeres Verzeichnis
es: Directorio vacío
fr: Répertoire vide
pt_pt: Diretorio vazio

source: More actions
de: Weitere Aktionen
es: Otras acciones
fr: Plus d'actions
pt_pt: Mais ações

source: Move images
de: Bilder verschieben
es: Mover imagenes
fr: Déplacer les images
pt_pt: Mover imagens

source: Synchronize Media Directory
de: Medienverzeichnis synchronisieren
es: Sincronizar el directorio de imágenes.
fr: Synchroniser le répertoire des images
pt_pt: Sincronizar Diretorio de Media

source: Modify directory
de: Verzeichnis bearbeiten
es: Editar directorio
fr: Modifier le répertoire
pt_pt: Modificar diretorio

source: Directory name
de: Verzeichnisname
es: Nombre de directorio
fr: Nom du répertoire
pt_pt: Nome do diretorio

source: Move files to directory
de: Dateien in Verzeichnis verschieben
es: Mueve los archivos al directorio
fr: Déplacer les fichier vers le répertoire
pt_pt: Mover ficheiros para o diretorio

source: Destination directory
de: Zielverzeichnis
es: Directorio de destino
fr: Répertoire de destination
pt_pt: Diretorio de destino

source: Images
de: Bilder
es: Imágenes
pt_pt: Imagens

source: Action
de: Aktion
es: Acción
pt_pt: Ação

source: Required Field
de: Benötigtes Feld
es: Campo obligatorio
fr: Champ requis
pt_pt: Campo Requerido

source: Apply
de: Übernehmen
es: aplicar
fr: Appliquer
pt_pt: Aplicar

source: Cancel
de: Abbrechen
es: anular
fr: Annuler
pt_pt: Cancelar

source: Add Image(s)
de: Bild(er) hinzufügen
es: Añadiendo imagen (es)
fr: Ajout d'image(s)
pt_pt: Adiciona imagem(s)

source: Existing or new directory
de: Existierendes oder neues Verzeichnis
es: Nueva carpeta o carpeta existente
fr: Nouveau dossier ou dossier existant
pt_pt: Existente ou novo diretorio

source: Image or archive
de: Bild oder Archiv
es: Imagen o archivo
fr: Image ou archive
pt_pt: Imagem ou ficheiro

source: Modify Image
de: Bild bearbeiten
es: Edita la imagen
fr: Modifier l'image
pt_pt: Modifica imagem

source: Image Name
de: Bildname
es: Nombre de la foto
fr: Nom de l'image
pt_pt: Nome da Imagem

source: Compulsory image name
de: Erforderlicher Bildname
es: Nombre de imagen obligatorio
fr: Nom de l'image obligatoire
pt_pt: Nome da imagem obrigatorio

source: View Image
de: Bild anzeigen
es: Ver la imagen
fr: Voir l'image
pt_pt: Ver imagem

source: Return to list
de: Zur Liste zurückkehren
es: Volver a la lista
fr: Retourner à la liste
pt_pt: Retorna para a lista

source: Review form after save
de: Formular nach dem Speichern überprüfen
es: Revise el formulario después de guardar
fr: Revoir le formulaire après la sauvegarde
pt_pt: Revisar formulário após salvar

source: Media Detection
de: Medienerkennung
es: Detección de imágenes
fr: Détection des images
pt_pt: Detecção de imagens

source: Bad picture alias detected :
de: Ungültiger Bildalias erkannt:
es: Se detectaron malos alias de imagen:
fr: Mauvais alias d'image détectés :
pt_pt: Atalho de imagem ruim detectado :

source: New directory added :
de: Neues Verzeichnis hinzugefügt:
es: Nuevos directorios añadidos:
fr: Nouveaux répertoires ajoutés :
pt_pt: Novo diretorio adicionado :

source: New images added :
de: Neue Bilder hinzugefügt:
es: Nuevas imágenes añadidas:
fr: Nouvelles images ajoutées :
pt_pt: Novas imagens adicionadas :

source: Convert gd2 -> png :
de: Gd2 -> png konvertieren:
es: Convertir gd2 -> png :
fr: Convertir gd2 -> png :
pt_pt: Converter gd2 -> png :

source: Close
de: Schließen
es: cerca
fr: Fermer
pt_pt: Fechar

source: User kicked
de: User rausgeworfen
es: Usuario desconectado
fr: Utilisateur déconnecté
pt_pt: Usuário desconectado

source: Kick User
de: User rauswerfen
es: Desconectar al usuario
fr: Déconnecter l'utilisateur
pt_pt: Desconectar usuário

source: Users
de: Benutzer
es: usuarios
fr: Utilisateurs
pt_pt: Utilizadores

source: Last request
de: Letzte Anfrage
es: Hora de la última solicitud
fr: Heure de la dernière requête
pt_pt: Última requisição

source: Acknowledge problems
de: Probleme zur Kenntnis nehmen
es: Reconoce el problema
fr: Acquitter le problème
pt_pt: Problemas Conhecidos

source: Acknowledged by %s
de: Zur Kenntnis genommen von %s
es: Reconocido por %s
fr: Acquitté par %s
pt_pt: Conhecimento por %s

source: Persistent
es: Reconocimiento persistente si el programador se reinicia.
fr: Persistant
pt_pt: Persistente

source: Acknowledge services attached to hosts
de: Mit diesem Host verknüpfte Services zur Kenntnis nehmen
es: Pagar por servicios de host
fr: Acquitter les services liés à l'hôte
pt_pt: Reconhecimento de serviços associados aos hosts

source: Sticky
de: Angeheftet
es: Reconocimiento persistente en caso de cambio de estado no correcto
fr: Persistant (non-OK)
pt_pt: Marcação

source: Force active checks
de: Aktive Überprüfungen erzwingen
es: Forzar controles activos
fr: Forcer les contrôles actifs
pt_pt: Forçar checagens ativas

source: Notify
de: Benachrichtigen
es: notificar
fr: Notifier
pt_pt: Notificar

source: Comment is required
de: Kommentar erforderlich
es: Un comentario es necesario
fr: Un commentaire est nécessaire
pt_pt: Comentário é requerido

source: Invalid information entered
de: Ungültige Informationen eingetragen
es: Información inválida ingresada
fr: Informations saisies invalides
pt_pt: Entrada de informações invalidas

source: Please correct these fields
de: Bitte korrigieren Sie diese Felder
es: Por favor, corrija estos campos
fr: Merci de corriger ces champs
pt_pt: Por favor, corrija estes campos

source: Acknowledge selected problems
de: Ausgewählte Probleme zur Kenntnis nehmen
es: Reconocer problemas seleccionados
fr: Acquitter les problèmes sélectionnés
pt_pt: Problemas Conhecidos selecionado

source: Set downtimes
de: Ausfallszeiten ansetzen
es: Establecer tiempos de parada
fr: Configurer des plages de maintenance
pt_pt: Configurar manutenções

source: Downtime set by %s
de: Ausfallszeit angesetzt von %s
es: Tiempo de inactividad establecido por %s
fr: Plage de maintenance fixée par %s
pt_pt: Manutenção configurada por %s

source: Start Time
de: Anfangszeit
es: Inicio
fr: Début
pt_pt: Inicio

source: End Time
de: Endzeit
es: Fin
fr: Fin
pt_pt: Fim

source: *The timezone used is configured on your user settings
de: *Die genutzte Zeitzone ist in Ihren Benutzereinstellungen festgelegt
es: * La zona horaria utilizada es la configurada en su configuración de usuario
fr: *Le fuseau horaire utilisé est celui configuré dans vos paramètres utilisateur
pt_pt: *O fuso horário utilizado é o que foi configurado no seu perfil de usuário

source: Duration
de: Dauer
es: duración
fr: Durée
pt_pt: Duração

source: Seconds
de: Sekunden
es: segundo
fr: Secondes
pt_pt: Segundos

source: Minutes
de: Minuten
es: Minutos
pt_pt: Minutos

source: Hours
de: Stunden
es: horas
fr: Heures
pt_pt: Horas

source: Days
de: Tage
es: días
fr: Jours
pt_pt: Dias

source: Scale of time
de: Zeitskala
es: Escala de tiempo
fr: Echelle de temps
pt_pt: Escala de tempo

source: Fixed
de: Fixiert
es: fijo
fr: Fixe
pt_pt: Fixado

source: Set downtimes on services attached to hosts
de: Ausfallszeiten für mit dem Host verknüpfte Services setzen
es: Establecer el tiempo de inactividad para los servicios conectados a los hosts
fr: Fixer des plages de maintenance aux services attachés aux hôtes
pt_pt: Configura manutenção aos serviços associados aos hosts

source: Set downtime
de: Ausfallszeit ansetzen
es: Establecer un tiempo de espera
fr: Planifier une maintenance
pt_pt: Configurar manutenção

source: Your command has been sent
de: Ihr Befehl wurde gesendet
es: Su pedido ha sido enviado.
fr: Votre commande a été envoyée
pt_pt: O seu comando foi enviado

source: Command execution problem
de: Problem bei der Befehlsausführung
es: Problema de ejecución del comando.
fr: Problème d'exécution de la commande
pt_pt: Problema de execução de comando

source: Add a comment for Service
de: Einen Kommentar zu diesem Service hinzufügen
es: Añadir un comentario al servicio.
fr: Ajouter un commentaire au service
pt_pt: Adicionar um comentário para o Serviço

source: Services
es: Servicios
pt_pt: Serviços

source: Comment type
de: Kommentartyp
es: Tipo de comentario
fr: Type de commantaire
pt_pt: Tipo de Comentário

source: Add a comment for Host
de: Einen Kommentar zu diesem Host hinzufügen
es: Añadir un comentario para un anfitrión
fr: Ajouter un commentaire pour un hôte
pt_pt: Adicionar um comentário para o Host

source: Add a comment
de: Einen Kommentar hinzufügen
es: Añadir un comentario
fr: Ajouter un commentaire
pt_pt: Adicionar comentário
