Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: [%s] The date "%s" was expected to be at most %s
de: [%s] Als Datum "%s" wurde maximal %s erwartet
fr: [%s] La date "%s" devait être au maximum au %s

source: Your autologin key must be different than your current password
de: Ihr Autologin-Schlüssel muss sich von Ihrem derzeitigen Passwort unterscheiden

source: Meta Service linked to service %d not found
de: Mit Service %d verknüpfter Meta-Service konnte nicht gefunden werden

source: Host meta for meta %d not found
de: Host-Meta für Meta %d konnte nicht gefunden werden

source: Incorrect resource type for downtime
de: Falscher Ressourcentyp für die Ausfallszeit

source: Meta service %d not found
de: Meta-Service %d konnte nicht gefunden werden

source: Host id %d not found
de: Host id %d konnte nicht gefunden werden

source: Host meta for meta service %d not found
de: Host-Meta für Meta-Service %d konnte nicht gefunden werden

source: The validator "%s" is not found
de: Der Validierer "%s" konnte nicht gefunden werden

source: Meta service not found
de: Meta-Service konnte nicht gefunden werden

source: No acknowledgement found for this meta service
de: Keine Inkenntnisnahme für diesen Meta-Service gefunden

source: Acknowledgement already cancelled for this meta service
de: Inkenntnisnahme für diesen Meta-Service wurde bereits zurückgezogen

source: Service %d (parent: %d) not found
de: Service %d (Übergeordnetes Objekt: %d) konnte nicht gefunden werden

source: Meta Service %d not found
de: Meta-Service %d konnte nicht gefunden werden

source: Type of action not recognized
de: Unbekannte Aktionsart

source: Invalid Credentials
de: Ungültige Anmeldeinformationen

source: User is not allowed to reach web application
de: Der Benutzer ist nicht berechtigt, auf die Web-Applikation zuzugreifen

source: User cannot be retrieved from the provider
de: Der Benutzer kann vom Bereitsteller nicht abgerufen werden

source: User not found and cannot be created
de: Benutzer konnte nicht gefunden und erstellt werden

source: User cannot be logout
de: Benutzer kann nicht abgemeldet werden

source: Error while refresh token
de: Fehler bei der Aktualisierung des Tokens

source: Your session has expired
de: Die Session ist nicht mehr gültig

source: Error while deleting expired token
de: Fehler beim Löschen eines abgelaufenen Tokens

source: Error while adding authentication token
de: Fehler beim Hinzufügen eines Authentifizierungstokens

source: Error while deleting session
de: Fehler beim Löschen der Session

source: Error while searching authentication tokens
de: Fehler bei der Suche von Authentifizierungstokens

source: Error while updating authentication tokens
de: Fehler bei der Aktualisierung der Authentifizierungstokens

source: Authentication token expired
de: Authentifizierungstoken abgelaufen

source: Authentication token not found
de: Authentifizierungstoken konnte nicht gefunden werden

source: [%s] Error when calculating string length of "%s" in %s
de: [%s] Fehler bei der Kalkulation der Zeichenkettenlänge von "%s" in %s

source: [%s] The value "%s" is too long, it should have no more than %d characters, but has %d characters
de: [%s] Der Wert "%s" ist zu lang. Er sollte maximal %d Zeichen haben, hat jedoch %d Zeichen

source: [%s] The value "%s" is too short, it should have at least %d characters, but only has %d characters
de: [%s] Der Wert "%s" ist zu kurz. Er sollte minimal %d Zeichen haben, hat jedoch nur %d Zeichen

source: [%s] The value "%d" was expected to be at least %d
de: [%s] Als Wert "%d" wurde mindestens %d erwartet

source: [%s] The value "%d" was expected to be at most %d
de: [%s] Als Wert "%d" wurde maximal %d erwartet

source: [%s] The value "%s" was expected to be a valid e-mail address
de: [%s] Als Wert "%s" wurde eine gültige E-Mail-Adresse erwartet

source: [%s] The value "%d" is not greater or equal than %d
de: [%s] Der Wert "%d" ist nicht größer bzw. gleich %d

source: [%s] The value is empty, but non empty value was expected
de: [%s] Der Wert ist leer, es wurde jedoch ein Wert erwartet

source: [%s] The value is null, but non null value was expected
de: [%s] Der Wert ist NULL, es wurde jedoch ein non-NULL Wert erwartet

source: [%s] The value provided (%s) was not expected. Possible values %s
de: [%s] Der angegebene Wert (%s) ist nicht bekannt. Mögliche Werte %s

source: [%s] The value (%s) doesn't match the regex '%s'
de: [%s] Der Wert (%s) entspricht nicht dem Regex-Ausdruck '%s'

source: Mandatory data to create the entity '%s' is missing
de: Notwendige Informationen zur Erstellung der Entität '%s' fehlen

source: Error while searching contact
de: Fehler bei der Suche des Kontakts

source: Host name can not be empty for host (id: %d)
de: Der Hostname des Hosts (id: %d) darf nicht leer sein

source: Error when searching for the engine configuration (%s)
de: Fehler bei der Suche nach der Engine-Konfiguration (%s)

source: The class %s does not exist
de: Die Klasse %s existiert nicht

source: The value cannot be null
de: Der Wert kann nicht NULL sein

source: Numeric value expected
de: Numerischer Wert erwartet

source: Filter name already used
de: Filtername bereits in Nutzung

source: Error when searching for host categories
de: Fehler bei der Suche von Hostkategorien

source: Error when searching for the host category (%s)
de: Fehler bei der Suche der Hostkategorie (%s)

source: Host category (%s) not found
de: Hostkategorie (%s) konnte nicht gefunden werden

source: Error on adding a host (Reason: %s)
de: Fehler beim Hinzufügen eines Hosts (Begründung: %s)

source: Error on updating a host (Reason: %s)
de: Fehler beim Aktualisieren eines Hosts (Begründung: %s)

source: Ip address cannot be empty
de: IP-Adresse darf nicht leer sein

source: Error when adding a host groups
de: Fehler beim Hinzufügen einer Hostgruppe

source: Error when searching for host groups
de: Fehler bei der Suche von Hostgruppen

source: Error when searching for the host group (%s)
de: Fehler bei der Suche der Hostgruppe (%s)

source: Host group (%s) not found
de: Hostgruppe (%s) konnte nicht gefunden werden

source: Error on reading host macros (Reason: %s)
de: Fehler beim Lesen der Hostmakros (Begründung: %s)

source: Error on updating a host macro (Reason: %s)
de: Fehler beim Aktualisieren eines Hostmakros (Begründung: %s)

source: Error when searching for host severities
de: Fehler bei der Suche von Hostschweregraden

source: Error when searching for the host severity (%s)
de: Fehler bei der Suche des Hostschweregrads (%s)

source: Host severity (%s) not found
de: Hostschweregrad (%s) konnte nicht gefunden werden

source: Invalid notification option (%d)
de: Ungültige Benachrichtigungsoption (%d)

source: Invalid stalking option (%d)
de: Ungültige Nachverfolgungsoption (%d)

source: This SNMP version (%s) is not allowed
de: Diese SNMP-Version (%s) ist nicht zulässig

source: This active checks status (%d) is not allowed
de: Der Status dieser aktiven Überprüfung (%d) ist nicht zulässig

source: This passive checks status (%d) is not allowed
de: Der Status dieser passiven Überprüfung (%d) ist nicht zulässig

source: This notifications status (%d) is not allowed
de: Dieser Benachrichtigungsstatus (%d) ist nicht zulässig

source: The notification interval must be greater than or equal to 0
de: Das Benachrichtigungsintervall muss größer bzw. gleich 0 sein

source: Notification options not allowed (%s)
de: Benachrichtigungsoptionen nicht zulässig (%s)

source: Stalking options not allowed (%s)
de: Nachverfolgungsoptionen nicht zulässig (%s)

source: Error when searching for the meta services configurations
de: Fehler bei der Suche nach Meta-Servicekonfigurationen

source: Error when searching for the meta service configuration (%s)
de: Fehler bei der Suche nach der Meta-Servicekonfiguration (%s)

source: Meta service configuration (%s) not found
de: Meta-Servicekonfiguration (%s) konnte nicht gefunden werden

source: Calculation method provided not supported (%s)
de: Die bereitgestellte Berechnungsmethode wird nicht unterstützt (%s)

source: Data source type provided not supported (%s)
de: Der bereitgestellte Datenquellentyp wird nicht unterstützt (%s)

source: Meta host %d not found
de: Meta-Host %d konnte nicht gefunden werden

source: Error when searching for hosts
de: Fehler bei der Suche von Hosts

source: Error when searching for services
de: Fehler bei der Suche von Services

source: Error when searching for meta services
de: Fehler bei der Suche von Meta-Services

source: Error when searching hostgroups
de: Fehler bei der Suche von Hostgruppen

source: Error when searching for the meta service (%d) metrics
de: Fehler bei der Suche der Meta-Service (%d) Metriken

source: Meta service with ID %d not found
de: Meta-Service mit ID %d konnte nicht gefunden werden

source: Unkown meta metrics selection mode provided for %d
de: Es wurde ein unbekannter Auswahlmodus für die Meta-Metriken für %d angegeben

source: One of the elements provided is not a ResourceGroup type
de: Eines der bereitgestellten Elemente ist kein Ressourcengruppen Typ

source: Error when searching servicegroups
de: Fehler bei der Suche von Servicegruppen

source: Status provided %d is invalid
de: Der angegebene Status %d ist ungültig

source: Meta Host %d not found
de: Meta-Host %d konnte nicht gefunden werden

source: Monitoring server not found (#%d)
de: Monitoring Server konnte nicht gefunden werden (#%d)

source: Generation error on monitoring server #%d: %s
de: Erzeugungsfehler auf dem Monitoring Server #%d: %s

source: Reloading error on monitoring server #%d: %s
de: Fehler beim erneuten Laden auf dem Monitoring Server #%d: %s

source: Error on retrieving monitoring servers
de: Fehler beim Ermitteln der Monitoring Server

source: Error on monitoring server #%d: %s
de: Fehler auf dem Monitoring Server #%d: %s

source: Error when searching for real time monitoring servers
de: Fehler bei der Suche nach Echtzeit Monitoring Servern

source: Error when searching for a monitoring server %s
de: Fehler bei der Suche des Monitoring Servers %s

source: Central platform's API data is not consistent. Please check the 'Remote Access' form.
de: Die API-Daten der zentralen Plattform sind nicht konsistent. Bitte überprüfen Sie das 'Fernzugriff'-Formular.

source: Platform name can't be empty
de: Plattformname darf nicht leer sein

source: Unable to find the encryption key.
de: Der Verschlüsselungsschlüssel konnte nicht gefunden werden.

source: Central's path is missing on: '%s'@'%s'. Please check the Remote Access form
de: Auf '%s'@'%s' fehlt der Pfad des zentralen Servers. Bitte überprüfen Sie das 'Fernzugriff'-Formular

source: Unable to link a 'remote': '%s'@'%s' to another remote platform
de: Eine 'remote'-Plattform: '%s'@'%s' kann nicht mit einer anderen 'remote'-Plattform verbunden werden

source: Cannot set parent id to a central server
de: Für einen zentralen Server kann keine übergeordnete ID angegeben werden

source: Error from Central's register API
de: Von der API des zentralen Servers zur Registrierung neuer Server wurde ein Fehler zurückgegeben

source: Platform not found
de: Plattform konnte nicht gefunden werden

source: An error occurred while searching any remote children
de: Fehler bei der Suche nach untergeordneten 'remote'-Plattformen

source: An error occurred while disabling the central menus
de: Fehler beim Deaktivieren der zentralen Menüs

source: An error occurred while enabling the central menus
de: Fehler beim Aktivieren der zentralen Menüs

source: An error occurred while updating the platform topology
de: Fehler beim Aktualisieren der Plattformtopologie

source: Central broker config id not found
de: Die ID der Konfiguration des zentralen Brokers konnte nicht gefunden werden

source: Poller broker config id not found
de: Die ID der Konfiguration des Poller Brokers konnte nicht gefunden werden

source: The parameter "%s" must be an integer
de: Der Parameter "%s" muss ein Integer sein

source: The JSON cannot be decoded
de: Das JSON konnte nicht decodiert werden

source: The definition model "%s" to validate the JSON does not exist or is empty
de: Das Definitionsmodell "%s" zur Validierung des JSON existiert nicht oder ist leer

source: Error on removing services from the host #%d
de: Fehler beim Entfernen von Services vom Host #%d

source: Error on removing services from the host #%d (Reason: %s)
de: Fehler beim Entfernen von Services vom Host #%d (Begründung: %s)

source: Action log id can not be null
de: Aktionsprotokoll-ID kann nicht NULL sein

source: The path does not exist
de: Der Pfad existiert nicht

source: Error while linking template (id: %d) to host (id: %d)
de: Fehler bei der Verknüpfung des Templates (id: %d) mit dem Host (id: %d)

source: Error while linking template %s to host (id: %d)
de: Fehler bei der Verknüpfung des Templates %s mit dem Host (id: %d)

source: You must at least add one resource provider
de: Sie müssen mindestens eine Ressourcenanbieter (resource provider) hinzufügen

source: Request failed (%d)
de: Anfrage fehlgeschlagen (%d)

source: Error when initializing the api uri
de: Fehler bei der Initialisierung der API URI

source: Response empty
de: Leere Antwort

source: Execution was too long and reached timeout
de: Die Ausführung hat zu viel Zeit in Anspruch genommen und ist in einen Timeout gelaufen

source: Failed to get the auth token from Central : '%s''
de: Fehler bei der Ermittlung des Authentifizierungstokens vom zentralen Server: '%s"

source: Central's response => Code :
de: Antwort des zentralen Servers => Code:

source: Please check the 'Centreon UI' form and your proxy configuration
de: Bitte überprüfen Sie die 'Centreon UI'- und die Proxy-Konfiguration

source: The property name of the normalizer cannot be empty.
de: Der Eigenschaftsname des Normalisierungsprogramms (normalizer) darf nicht leer sein.

source: There are not enough arguments to build the object %s
de: Es sind nicht genügend Argumente verfügbar, um das Objekt %s zu erstellen

source: Class %s not found
de: Die Klasse %s konnte nicht gefunden werden

source: Object %s must implement %s
de: Das Objekt %s muss %s implementieren

source: Max value of limit has to be %d instead %d
de: Maximaler Wert des Limits muss %d statt %d entsprechen

source: Minimum value of limit has to be 1 instead %d
de: Minimaler Wert des Limits muss 1 statt %d entsprechen

source: Minimum value of offset has to be 1 instead %d
de: Minimaler Wert des Offsets muss 1 statt %d entsprechen

source: Repository class %s has to implement %s
de: Bibliotheksklasse %s muss %s implementieren

source: Class %s has to implement %s to be DataRepresenter
de: Die Klasse %s muss %s implementieren, um DataRepresenter zu sein

source: Object %s must extend %s class or %s class
de: Das Objekt %s muss die Klasse %s oder %s erweitern

source: Not found exporter with name: %d
de: Exporter %d konnte nicht gefunden werden

source: not found
de: nicht gefunden

source: centreon is not properly installed
de: Centreon ist nicht korrekt installiert

source: Your password doesn't match the security policy
de: Ihr Passwort entspricht nicht den Sicherheitsvorgaben

source: No session token provided
de: Es wurde kein Sessiontoken bereitgestellt

source: Authentication failed
de: Authentifizierung fehlgeschlagen

source: User is blocked
de: Benutzer ist gesperrt

source: Password is expired
de: Passwort ist abgelaufen

source: Local provider configuration not found
de: Lokale Providerkonfiguration nicht gefunden

source: Old password usage is disable
de: Die Verwendung eines alten Passworts ist deaktiviert

source: Error while reading local provider configuration
de: Fehler beim Lesen der lokalen Providerkonfiguration

source: Provider configuration (%s) not found
de: Providerkonfiguration (%s) nicht gefunden

source: Provider not found
de: Provider nicht gefunden

source: Error while searching providers configurations
de: Fehler bei der Suche von Providerkonfigurationen

source: Error while searching provider configuration: '%s'
de: Fehler bei der Suche nach der Providerkonfiguration: '%s'

source: You must at least add one authentication provider
de: Sie müssen mindestens einen Authentifizierungsprovider hinzufügen

source: Missing mandatory parameter: '%s'
de: Fehlender erforderlicher Parameter: '%s'

source: Authentication Required
de: Authentifizierung erforderlich

source: Your password must be %d characters long
de: Ihr Kennwort muss %d Zeichen lang sein

source: uppercase characters
de: Großbuchstaben

source: lowercase characters
de: Kleinbuchstaben

source: numbers
de: Zahlen

source: special characters among '%s'
de: Sonderzeichen in '%s'

source: and must contain
de: und muss enthalten

source: You can't change your password because the delay before changing password is not over.
de: Sie können Ihr Passwort nicht ändern, da der Zeitraum zwischen Passwortänderungen noch nicht abgelaufen ist.

source: Your password has already been used. Please choose a different password from the previous three.
de: Ihr Passwort wurde bereits genutzt. Bitte wählen Sie ein anderes Passwort als die letzten drei.

source: Security Acknowledgement
de: Danksagung für Sicherheitsaspekte

source: unknown
de: unbekannt

source: Your new password and autologin key must be different
de: Ihr neues Passwort und Autologin-Schlüssel müssen sich unterscheiden

source: Your password has expired. Please change it.
de: Ihr Passwort ist abgelaufen. Bitte ändern Sie das Passwort.

source: Your password will expire in %s days.
de: Ihr Passwort läuft in %s Tagen ab.

source: Use deprecated pages
de: Veraltete Ansichtsseiten verwenden

source: Enable the one-click export button for poller configuration [BETA]
de: Aktiviere den "ein-Klick" Exportknopf für die Poller Konfiguration [BETA]

source: Enable Broker Statistics Collection
de: Brokerstatistiksammlung aktivieren

source: Menu
de: Menü
es: Menú

source: Vertical Inheritance Only
de: Ausschließlich vertikale Vererbung

source: Closest Value
de: Nächster Wert

source: Cumulative inheritance
de: Kumulative Vererbung

source: Contacts & Contact groups method calculation
de: Berechnungsmethode für Kontakte und Kontaktgruppen

source: Enable OpenId Connect authentication
de: OpenID Connect Authentifizierung aktivieren

source: OpenId Connect only
de: Ausschließlich OpenId Connect

source: Authentication mode
de: Authentifizierungsmodus

source: End Session Endpoint
de: Sessionendeendpunkt

source: Login claim value
de: Login Claim Wert

source: Use Basic Auth for Token Endpoint Authentication
de: Basic-Authentifizierung für Token-Endpunkt Authentifizierung verwenden

source: Disable SSL verify peer
de: SSL Peerverifizierung deaktivieren

source: Authentication by OpenId Connect
de: Authentifizierung durch OpenId Connect

source: Modify Gorgone options
de: Gorgone-Optionen bearbeiten

source: Invalid name or description
de: Ungültiger Name oder Beschreibung

source: Central's API URI
de: API-URI des zentralen Servers

source: apiPath
de: API-Pfad (z.B. /centreon)

source: Pool size
de: Poolgröße

source: Log directory
de: Protokollverzeichnis

source: Mandatory directory
de: Erforderliches Verzeichnis

source: Log filename
de: Name der Protokolldatei

source: Maximum files size (in bytes)
de: Maximale Dateiengröße (in Bytes)

source: Write timestamp (deprecated)
de: Zeitstempel schreiben (veraltet)

source: Write thread id (deprecated)
de: Thread-ID schreiben (veraltet)

source: Value must be a positive numeric
de: Der Wert muss ein positiver, numerischer Wert sein

source: Console
de: Konsole
es: Consola

source: Unable to load the Symfony container
de: Der Symfony-Container konnte nicht geladen werden

source: Enable macro filtering
de: Makrofilterung aktivieren

source: Macros whitelist
de: Makro Whitelist

source: Macros
de: Makros

source: A macro is malformated.
de: Ein Makro hat ein falsches Format.

source: Role Relations
de: Rollenbeziehungen

source: Linked to Roles
de: Mit Rollen verknüpft

source: geo coords are not valid
de: Geo-Koordinaten sind ungültig

source: Unauthorized value
de: Unautorisierter Wert

source: Select a template
de: Wählen Sie ein Template

source: Relation
de: Beziehung

source: Dependency name can't be empty
de: Abhängigkeitsname darf nicht leer sein

source: Dependency description can't be empty
de: Abhängigkeitsbeschreibung darf nicht leer sein

source: The selected template has the same time period as a template
de: Das ausgewählte Template umfasst den gleichen Zeitraum wie ein anderes Template

source: Unique
de: Einzigartig

source: Mode
de: Modus

source: HTTP Method
de: HTTP-Methode

source: Do not check SSL certificate validation
de: SSL-Zertifikatsvalidierung nicht überprüfen

source: Do not use proxy defined in global configuration
de: In der globalen Konfiguration festgelegte Proxy nicht verwenden

source: Gorgone connection port
de: Gorgone Verbindungsport

source: The IP address is incorrect
de: Die IP-Adresse ist falsch

source: Central
de: Zentraler Server

source: Add (advanced)
de: Hinzufügen (Fortgeschritten)

source: You are about to delete one or more pollers.\nThis action is IRREVERSIBLE.\nDo you confirm the deletion ?
de: Sie sind im Begriff einen oder mehrere Poller zu löschen.\nDiese Aktion ist UNUMKEHRBAR.\nBestätigen Sie die Löschung?

source: Y/m/d (H:i:s)
de: Y/m/d (h:min:s)

source: H:i:s
de: h:min:s

source: Bad Session ID
de: Ungültige Session-ID

source: Bad host ID
de: Ungültige Host-ID

source: You don't have access to this resource
de: Sie haben keinen Zugriff auf diese Ressource

source: Bad service ID
de: Ungültige Service-ID

source: d/m/Y H:i:s
de: d/m/Y h:min:s

source: Scheduled Downtimes
de: Angesetzte Ausfallszeiten

source: Total
de: Insgesamt

source: Base
de: Basis

source: Critical services
de: Kritische Services

source: Warning services
de: Warnung Services

source: Unknown services
de: Unbekannte Services

source: Pending services
de: Ausstehende Services

source: Do not use configured proxy to connect to this server
de: Konfigurierte Proxy für die Verbindung mit diesem Server nicht benutzen

source: Host Informations
de: Hostinformationen

source: Please update your PHP to 7.2 or upper.
de: Bitte aktualisieren Sie ihre PHP-Version auf 7.2 oder höher.

source: to
de: auf

source: Upgrade to this release requires Centreon >= 2.8.0-beta1.
de: Ein Upgrade auf diese Version erfordert eine Version >= 2.8.0-beta1.

source: Your current version is %s.
de: Ihre aktuelle Version ist %s.

source: Please upgrade to an intermediate release (ie. 2.8.x) first.
de: Bitte führen Sie zuerst ein Upgrade auf eine Zwischenversion (z.B. 2.8.x) durch.

source: <p>Currently upgrading... please do not interrupt this process.</p>
de: <p>Upgrade wird durchgeführt... bitte unterbrechen Sie diesen Prozess nicht.</p>

source: Please check the "upgrade.log" and the "sql-error.log" located in "%s" for more details
de: Bitte überprüfen Sie für weitere Details "upgrade.log" und "sql-error.log", die sich unter "%s" befinden

source: The SQL files are located in "%s"
de: Die SQL-Dateien befinden sich in "%s"

source: disabled
de: deaktiviert

source: Objects
de: Objekte

source: Features flipping
de: Banner aktivieren

source: Gorgone properties
de: Gorgone Optionen

source: Common Options
de: Allgemeine Optionen

source: API Options
de: API-Optionen

source: View wiki page
de: Wiki-Seite anzeigen

source: Edit wiki page
de: Wiki-Seite bearbeiten

source: View History
de: Historie anzeigen

source: Delete wiki page
de: Wiki-Seite löschen

source: View wiki page
de: Wiki-Seite anzeigen

source: View history
de: Historie anzeigen

source: Table is not partitioned
de: Die Tabelle ist nicht partitioniert

source: Centreon Databases Statistics
de: Centreon Datenbankstatistiken

source: Root user (default: root)
de: Root-Benutzer (Standardwert: root)
