Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: Monitoring Engine Information
de: Monitoring Engine Informationen
es: Información sobre el motor de supervisión.
fr: Information sur le moteur de supervision
pt_pt: Informação do Motor de Monitoramento

source: Centreon Trap Collector
de: Centreon Trap Sammler
es: Colector de trampas Centreon SNMP
fr: Colleteur de traps SNMP Centreon
pt_pt: Coletor Centreon Trap

source: Satellite configuration
de: Pollerkonfiguration
es: Configuración del colector
fr: Configuration du collecteur
pt_pt: Configuração do Coletor

source: Poller Name
es: Nombre del coleccionista
fr: Nom du collecteur
pt_pt: Nome do Coletor

source: Monitoring Engine Init Script
es: Guión de inicialización del motor de supervisión.
fr: Script d'initialisation du moteur de supervision
pt_pt: Script de inicialização do Motor de Monitoramento

source: Attach to Remote Server
pt_pt: Anexar ao servidor remoto

source: Monitoring Engine Binary
de: Monitoring Engine Ausführdatei
es: Binario del motor de supervisión.
fr: Binaire du moteur de supervision
pt_pt: Binario do Motor de Monitoramento

source: Monitoring Engine Statistics Binary
de: Monitoring Engine Statistikenausführungsdatei
es: Binario de estadísticas de supervisión del motor.
fr: Binaire de statistiques du moteur de supervision
pt_pt: Binario das estatisticas do Motor de Monitoramento

source: Perfdata file
de: Perfdata-Datei
es: Archivo de datos de rendimiento
fr: Fichier des données de performance
pt_pt: Ficheiro de Performance

source: SSH port
es: Puerto SSH
fr: Port SSH
pt_pt: Porta SSH

source: Is default poller ?
de: Ist Standardpoller?
es: Colector por defecto?
fr: Collecteur par défaut ?
pt_pt: Coletor por padrão ?

source: Centreon Broker configuration path
de: Centreon Broker Konfigurationspfad
es: Directorio de archivos de configuración de Centreon Broker
fr: Répertoire des fichiers de configuration de Centreon Broker
pt_pt: Caminho da configuração do Centreon Broker

source: Centreon Broker modules path
de: Centreon Broker Modulpfad
es: Ruta del módulo Centreon Broker
fr: Chemin des modules de Centreon Broker
pt_pt: Caminho dos modulos do Centreon Broker

source: Centreon Broker logs path
de: Centreon Broker Protokollpfad
es: Directorio de los registros de Centreon Broker
fr: Répertoire des logs de Centreon Broker
pt_pt: Caminho dos registros de Centreon Broker

source: Centreon Connector
es: Conector de centro
fr: Connecteur Centreon
pt_pt: Conector Centreon

source: Centreon Connector path
de: Centreon Connector Pfad
es: Ruta a los conectores.
fr: Chemin d'accès aux connecteurs
pt_pt: Caminho do Conector Centreon

source: Centreontrapd init script path
de: Centreontrapd Initialisierungsskriptpfad
es: Iniciar script para el proceso centerontrapd
fr: Script de démarrage du processus centreontrapd
pt_pt: Caminho do script de inicialização do Centreontrapd

source: Directory of light database for traps
de: Verzeichnis der SQLite-Datenbanken für Traps
es: Directorio de almacenamiento de base de datos SQLite que contiene la definición de captura SNMP
fr: Répertoire de stockage de la base SQLite contenant la définition des traps SNMP
pt_pt: Diretorio de banco de dados leve para traps SNMP

source: The name of the poller is mandatory
de: Der Name des Pollers ist erforderlich
es: Se requiere nombre del coleccionista
fr: Le nom du collecteur est obligatoire
pt_pt: O nome do coletor é obrigatorio

source: Server type
de: Servertyp
pt_pt: Tipo de servidor

source: Is running ?
de: In Betrieb?
es: En progreso?
fr: En cours d'exécution ?
pt_pt: esta em execução ?

source: Conf Changed
de: Konfiguration geändert
es: Cambio de configuración
fr: Changement de configuration
pt_pt: Configuração Alterada

source: Uptime
de: Betriebszeit
pt_pt: Tempo de atividade

source: Default
de: Standard
es: culpa
fr: Défaut
pt_pt: Padrão

source: Distant Poller
de: Entfernter Poller
pt_pt: Poste de amarração distante

source: Remote Server
pt_pt: Servidor remoto

source: Only services, servicegroups, hosts and hostgroups are taken in account in order to calculate this status. If you modify a template, it won't tell you the configuration had changed.
de: Nur Services, Servicegruppen, Hosts und Hostgruppen werden berücksichtigt, um diesen Status zu ermitteln. Wenn ein Template bearbeitet wird, wird Ihnen nicht mitgeteilt, dass sich die Konfiguration geändert hat.
pt_pt: Somente serviços, grupos de serviço, hosts e grupos de hosts são considerados para calcular esse status. Se você modificar um modelo, ele não lhe dirá que a configuração foi alterada.

source: Update informations
es: Actualizar informacion
fr: Mettre à jour les informations
pt_pt: Atualiza informações

source: Export configuration
de: Konfiguration exportieren
es: Configuración de exportación
fr: Exporter la configuration
pt_pt: Exporta configuração

source: You are not allowed to access this service group
de: Sie sind nicht dazu berechtigt, auf diese Servicegruppe zuzugreifen
es: No se le permite acceder a este grupo de servicios
fr: Vous n'êtes pas autorisé à accéder à ce groupe de services
pt_pt: Você não tem permissão para acessar este grupo de serviço

source: Add a Service Group
de: Servicegruppe hinzufügen
es: Agregar un grupo de servicio
fr: Ajouter un groupe de services
pt_pt: Adicionar Grupo de Serviço

source: Modify a Service Group
de: Servicegruppe bearbeiten
es: Editar un grupo de servicio
fr: Modifier un groupe de services
pt_pt: Modificar Grupo de Serviço

source: View a Service Group
de: Servicegruppe anzeigen
es: Ver un grupo de servicios.
fr: Visualiser un groupe de services
pt_pt: Visualizar Grupo de Serviço

source: Geo coordinates
de: Geo-Koordinaten
es: Coordenadas geograficas
fr: Coordonnées géographiques
pt_pt: Coordenadas Geograficas

source: Linked Host Group Services
de: Verknüpfte Hostgruppen Services
es: Servicios de grupo de acogida
fr: Services liés au groupe d'hôte
pt_pt: Grupos de Serviços associados a Host

source: Linked Service Templates
de: Verknüpfte Servicetemplates
es: Plantillas de servicio relacionadas
fr: Modèles de service liés
pt_pt: Modelos de Serviço Associado

source: Compulsory Description
de: Erforderliche Beschreibung
es: Descripción obligatoria
fr: Description obligatoire
pt_pt: Descrição obrigatoria

source: Command Line
de: Befehlszeile
es: Línea de comando
fr: Ligne de commande
pt_pt: Linha de Comando

source: Host Uses
de: Host nutzt
es: Anfitriones utilizados
fr: Hôtes utilisés
pt_pt: Hosts Utilizados

source: Services Uses
de: Services nutzen
es: Servicios utilizados
fr: Services utilisés
pt_pt: Serviços Utilizados

source: Check
de: Überprüfung
es: verificación
fr: Vérifier
pt_pt: Checagem

source: Miscellaneous
de: Sonstiges
es: Diverso
fr: Divers
pt_pt: Diversos

source: Discovery
es: descubrimiento
fr: Découverte
pt_pt: Descobrimento

source: Host links (host template links)
de: Hostverknüpfungen (Hosttemplate Verknüpfungen)
es: Vinculado a los modelos de hosts.
fr: Liés aux modèles d'hôtes
pt_pt: Atalhos de Hosts (atalhos de modelos de Host)

source: Service links (service template links)
de: Serviceverknüpfungen (Servicetemplate Verknüpfungen)
es: Plantillas de servicio relacionadas
fr: Modèles de services liés
pt_pt: Atalhos de Serviço (atalhos de modelos de serviço)

source: Could not find macro
es: No se puede encontrar la macro
fr: Ne peut pas trouver la macro
pt_pt: Não foi possivel encontrar a macro

source: ERROR
fr: ERREUR
pt_pt: ERRO

source: Directory traversal detected
es: Detección de cambio de directorio no autorizado
fr: Détection d'un changement de répertoire non autorisé
pt_pt: Diretorio transversal detectado

source: Plugin has to be in :
es: La sonda debe estar en:
fr: La sonde doit être dans :
pt_pt: O Plugin tem que estar em :

source: Plugin Test
es: Test de la sonde
fr: Test de la sonde
pt_pt: Teste do Plugin

source: Plugin test
es: Test de la sonde
fr: Test de la sonde
pt_pt: Teste do Plugin

source: Error: Cannot Execute this command due to a path security problem.
es: Error: no se puede ejecutar este comando debido a un problema de seguridad en la ruta.
fr: Erreur: Impossible d'exécuter cette commande en raison d'un problème de sécurité sur le chemin.
pt_pt: Erro: Não é possível executar este comando devido a um problema de segurança do caminho.

source: Plugin Help
de: Pluginhilfe
es: Ayuda de la sonda
fr: Aide de la sonde
pt_pt: Ajuda com Plugin

source: Argument Descriptions
de: Argumentbeschreibungen
es: Descripción de los argumentos
fr: Description des arguments
pt_pt: Descrição dos Argumentos

source: Arguments
de: Argumente
es: Argumentos
pt_pt: Argumentos

source: Sorry, your command line does not contain any $ARGn$ macro.
de: Ihre Befehlszeile enthält kein $ARGn$ Makro.
es: Lo sentimos, su línea de comando no contiene macros $ ARGn $.
fr: Désolé, votre ligne de commande ne contient pas de macro $ARGn$.
pt_pt: Desculpe, o seu comando não contém qualquer macro $ARGn$.

source: View command definition
es: Ver la definición del pedido.
fr: Voir la définition de la commande
pt_pt: Visualiza definição de Comando

source: Notification command
es: Comando de notificación
fr: Commande de notification
pt_pt: Comando de Notificação

source: Check command
es: Comando de control
fr: Commande de contrôle
pt_pt: Comando de Checagem

source: Information command
es: Información del pedido
fr: Information sur la commande
pt_pt: Informação de comando

source: No command selected
es: Sin orden seleccionado
fr: Aucune commande sélectionnée
pt_pt: Nenhum comando selecionado

source: Command Type
de: Befehlstyp
es: Tipo de orden
fr: Type de commande
pt_pt: Tipo de Comando

source: Command Name
de: Befehlsname
es: Nombre del pedido
fr: Nom de commande
pt_pt: Nome do Comando

source: Notif
es: Notificación
fr: Notification
pt_pt: Notificação

source: Misc
de: Sonstiges
es: Diverso
fr: Divers
pt_pt: Diversos

source: Macro Descriptions
de: Makrobeschreibungen
es: Descripción de macros
fr: Description des macros
pt_pt: Descrições da macro

source: Sorry, your command line does not contain any $_SERVICE$ macro or $_HOST$ macro.
de: Ihre Befehlszeile enthält kein $_SERVICE$- oder $_HOST$-Makro.
es: Lo sentimos, su línea de comando no contiene una macro $_SERVICE$ o $_HOST$.
fr: Désolé, votre ligne de commande ne contient pas de macro $_SERVICE$ ou $_HOST$.
pt_pt: Desculpe, o seu comando não contém qualquer macro $_SERVICE$ ou $_HOST$.

source: Add a Command
de: Befehl hinzufügen
es: Añadir una orden
fr: Ajouter une commande
pt_pt: Adicionar um comando

source: Modify a Command
de: Befehl bearbeiten
es: Modificar una orden
fr: Modifier une commande
pt_pt: Modificar um comando

source: View a Command
de: Befehl anzeigen
es: Ver una orden
fr: Visualiser une commande
pt_pt: Visualizar um comando

source: Argument Example
de: Argumentbeispiel
es: Ejemplo de argumentos
fr: Exemple d'arguments
pt_pt: Exemplo de Argumento

source: Enable shell
de: Shell aktivieren
es: Habilitar el shell
fr: Activer le shell
pt_pt: Ativar shell

source: Graph template
de: Graphentemplate
es: Plantilla de gráfico
fr: Modèle de graphique
pt_pt: Modelo de Gráfico

source: Describe arguments
de: Argumente beschreiben
es: Describe los argumentos
fr: Décrire les arguments
pt_pt: Descreva os argumentos

source: Clear arguments
de: Argumente zurücksetzen
es: Argumentos claros
fr: Effacer les arguments
pt_pt: Limpar os argumentos

source: Describe macros
de: Makros beschreiben
es: Describe los macros
fr: Décrire les macros
pt_pt: Descreva as macros

source: Macros Descriptions
de: Makrobeschreibungen
es: Descripción de macros
fr: Description des macros
pt_pt: Descrições das Macros

source: Select a connector...
de: Wählen Sie einen Konnektor...
es: Seleccione un conector ...
fr: Sélectionner un connecteur...
pt_pt: Selecione um conector...

source: Connectors
de: Konnektoren
es: Conectores
fr: Connecteurs
pt_pt: Conectores

source: Compulsory Command Line
de: Erforderliche Befehlszeile
es: Línea de comando requerida
fr: Ligne de commande obligatoire
pt_pt: Linha de comando obrigatoria

source: Commands definitions can contain Macros but they have to be valid.
de: Befehlsdefinitionen können Makros enthalten, diese müssen jedoch gültig sein.
es: Las definiciones de comandos pueden contener macros, pero estas deben ser válidas.
fr: Les définitions de commandes peuvent contenir des macros mais ces dernières doivent être valides.
pt_pt: As definições de comando devem conter Macros e devem ser válidas.

source: Test the plugin
es: Prueba la sonda
fr: Tester la sonde
pt_pt: Testar o Plugin

source: Escalations View
es: Visualisation diciembre escaladas
fr: Visualisation des escalades
pt_pt: Visualizar Escalas

source: Hostgroups Escalation
es: Grupos de escalada de invitados.
fr: Escalades des groupes d'hôtes
pt_pt: Escalas de Grupos de host

source: Hosts Escalation
es: Escaladas des Hôtes
fr: Escalades des hôtes
pt_pt: Escalas de Host

source: Services Escalation
es: Escaladas diciembre services
fr: Escalades des services
pt_pt: Escalas de Serviços

source: Add an Escalation
de: Eskalation hinzufügen
es: Añadir escalada
fr: Ajouter une escalade
pt_pt: Adicionar Escala

source: Modify an Escalation
de: Eskalation bearbeiten
es: Editar una escalada
fr: Modifier une escalade
pt_pt: Modificar Escala

source: View an Escalation
de: Eskalation anzeigen
es: Visualizar una escalada
fr: Visualiser une escalade
pt_pt: Visualizar Escala

source: Escalation Name
de: Eskalationsname
es: Nombre de escalada
fr: Nom d'escalade
pt_pt: Nome da Escala

source: First Notification
de: Erste Benachrichtigung
es: Primera notificación
fr: Première notification
pt_pt: Primeira Notificação

source: Notification Interval
de: Benachrichtigungsintervall
es: Intervalo de notificación
fr: Intervalle de notification
pt_pt: Intervalo de Notificação

source: Escalation Period
de: Eskalationszeitraum
es: Periodo de escalada
fr: Période d'escalade
pt_pt: Período de Escala

source: Recovery
de: Wieder verfügbar
es: recuperación
fr: Récupération
pt_pt: Recuperação

source: Hosts Escalation Options
de: Eskalationsoptionen für Hosts
es: Opciones de escalada de invitados
fr: Options d'escalade des hôtes
pt_pt: Opções de Escala de Hosts

source: Services Escalation Options
de: Eskalationsoptionen für Services
es: Opciones de servicio de escalada
fr: Options d'escalade des services
pt_pt: Opções de Escala de Serviços

source: Host inheritance to services
de: Hostvererbung an Services
es: Heredar las propiedades de los huéspedes por servicios
fr: Hériter des proriétés de l'hôte pour les services
pt_pt: Herança de hosts para serviços

source: Hostgroup inheritance to services
de: Hostgruppenvererbung an Services
es: Heredar las propiedades del grupo de hosts para servicios.
fr: Hériter les propriétés du groupe d'hôtes pour les services
pt_pt: Herança de Grupo de Host para serviços

source: Services by Host
de: Services nach Host
es: Servicios por anfitriones
fr: Services par hôtes
pt_pt: Serviços por Host

source: Service Group
de: Servicegruppe
es: Grupo de servicio
fr: Groupe de services
pt_pt: Grupo de Serviço

source: Add a Dependency
de: Abhängigkeit hinzufügen
es: Añadir una dependencia
fr: Ajouter une dépendance
pt_pt: Adicionar Dependencia

source: Modify a Dependency
de: Abhängigkeit bearbeiten
es: Modificar una adiccion
fr: Modifier une dépendance
pt_pt: Modificar Dependencia

source: View a Dependency
de: Abhängigkeit anzeigen
es: Visualizar una adiccion
fr: Visualiser une dépendance
pt_pt: Visualizar uma Dependência

source: Parent relationship
de: Übergeordnete Beziehung
es: Relación
fr: Relation de parenté
pt_pt: Relação de parentesco

source: Ok/Up
de: OK/verfügbar
es: Ok/Disponible
fr: Ok/Disponible
pt_pt: Ok/Disponível

source: Notification Failure Criteria
de: Kriterien für ein Benachrichtigungsversagen
es: Criterios para la falta de notificación
fr: Critères d'échec de notification
pt_pt: Criterio de Falha de Notificação

source: Execution Failure Criteria
de: Kriterien für ein Ausführungsversagen
es: Criterios de no ejecución.
fr: Critères d'échec d'exécution
pt_pt: Criterio de Falha de Execução

source: Host Groups Name
de: Hostgruppenname
es: Nombre del grupo anfitrión
fr: Nom du groupe d'hôte
pt_pt: Nome dos Grupos de Host

source: Dependent Host Groups Name
de: Name der abhängigen Hostgruppen
es: Nombre de los grupos de hosts relacionados.
fr: Nom des groupes d'hôtes liés
pt_pt: Nome dos Grupos de Host dependentes

source: Circular Definition
de: Zirkeldefinition
es: Definición circular
fr: Définition circulaire
pt_pt: Definição Circular

source: HostGroup
de: Hostgruppe
es: Grupo de invitados
fr: Groupe d'hôtes
pt_pt: Grupo de Hosts

source: Scheduling
de: Planung
es: planificación
fr: Planification
pt_pt: Agendamento

source: Are you sure you want to detach the service ?
de: Sie sie sich sicher, dass Sie die Verknüpfung aufheben wollen?
es: ¿Estás seguro de que quieres desconectar el servicio?
fr: Êtes-vous sûr de vouloir détacher le service ?
pt_pt: Você tem certeza que quer desassociar este serviço ?

source: Detach host group services
de: Verknüpfung der Hostgruppenservices aufheben
es: Desvincular los servicios del grupo de hosts.
fr: Détacher les services du groupe d'hôtes
pt_pt: Desassociar serviços de Grupo de Hosts

source: Move host group's services to hosts
de: Services der Hostgruppe auf die Hosts übertragen
es: Mover los servicios del grupo de hosts a los hosts.
fr: Déplacer les services du groupe d'hôtes vers les hôtes
pt_pt: Move os serviços do Grupo de Hosts para Hosts

source: HostGroups
de: Hostgruppen
es: Grupos de anfitriones
fr: Groupes d'hôtes
pt_pt: Grupos de Hosts

source: Templates
es: modelos
fr: Modèles
pt_pt: Modelos

source: Detach
de: Verknüpfung aufheben
es: despegar
fr: Détacher
pt_pt: Desassociar

source: Disabled hosts
de: Deaktivierte Hosts
es: Hosts desactivados
fr: Hôtes désactivés
pt_pt: Hosts desativados

source: Argument
es: Argumento
pt_pt: Argumento

source: Value
de: Wert
es: valor
fr: Valeur
pt_pt: Valor

source: Example
de: Beispiel
es: ejemplo
fr: Exemple
pt_pt: Exemplo

source: No argument found for this command
de: Für diesen Befehl wurde kein Argument gefunden
es: No se encontraron argumentos en este comando
fr: Aucun argument trouvé dans cette commande
pt_pt: Nenhum argumento foi encontrado para este comando

source: You are not allowed to access this service
de: Sie sind nicht dazu berechtigt, auf diesen Service zuzugreifen
es: No tienes permitido acceder a este servicio.
fr: Vous n'êtes pas autorisé à accéder à ce service
pt_pt: Você não tem permissão para acessar este serviço

source: Add a Service
de: Service hinzufügen
es: Añadir un servicio
fr: Ajouter un service
pt_pt: Adiciona um Serviço

source: Modify a Service
de: Service bearbeiten
es: Editar un servicio
fr: Modifier un service
pt_pt: Modifica um Serviço

source: View a Service
de: Service anzeigen
es: Ver un servicio
fr: Visualiser un service
pt_pt: Visualiza um Serviço

source: Using a Template exempts you to fill required fields
de: Die Verwendung eines Templates konsolidiert das Ausfüllen von erforderlichen Feldern
es: Usar una plantilla evita rellenar los campos requeridos
fr: Utiliser un modèle permet d'éviter de remplir les champs requis
pt_pt: Usando um Modelo, você não precisará preencher campos obrigatorios

source: Service State
de: Servicezustand
es: Estado del servicio
fr: Etat du service
pt_pt: Estado do Serviço

source: Is Volatile
de: Ist volatil
es: Es volátil
fr: Est volatile
pt_pt: É Volátil

source: Check Command
de: Überprüfungsbefehl
es: Comando de verificación
fr: Commande de vérification
pt_pt: Comando de Checagem

source: Args
de: Argumente
es: Argumentos
fr: Arguments
pt_pt: Argumentos

source: Max Check Attempts
de: Maximale Überprüfungsversuche
es: Número de controles antes de la validación de estado
fr: Nombre de contrôles avant validation de l'état
pt_pt: Tentativas máximas de Checagem

source: Normal Check Interval
de: Normaler Überprüfungsintervall
es: Intervalo normal de control
fr: Intervalle normal de contrôle
pt_pt: Intervalo normal de Checagem

source: Retry Check Interval
de: Überprüfungsintervall für wiederholte Überprüfungen
es: Intervalo no regular de control
fr: Intervalle non-régulier de contrôle
pt_pt: Intervalo de tentativa de Checagem

source: Event Handler Enabled
de: Event Handler aktiviert
es: Administrador de eventos habilitado
fr: Gestionnaire d'évènements activé
pt_pt: Manipulação de Eventos ativa

source: Active Checks Enabled
de: Aktive Überprüfungen aktiviert
es: Control activo habilitado
fr: Contrôle actif activé
pt_pt: Habilita Checagem Ativa

source: Passive Checks Enabled
de: Passive Überprüfungen aktiviert
es: Control pasivo habilitado
fr: Contrôle passif activé
pt_pt: Habilita Checagem Passiva

source: Check Period
de: Überprüfungszeitraum
es: Periodo de control
fr: Période de contrôle
pt_pt: Período de Checagem

source: Service Basic Information
de: Grundlegende Informationen zum Service
es: Información de servicio
fr: Informations sur le service
pt_pt: Informação Basica de Serviço

source: Acknowledgement timeout
de: Inkenntnisnahmentimeout
es: Duración máxima de una absolución
fr: Durée maximale d'un acquittement
pt_pt: Tempo limite do reconhecimento

source: Notification Enabled
de: Benachrichtigungen aktiviert
es: Notificación habilitada
fr: Notification activée
pt_pt: Notificação Ativa

source: Replacement
de: Austausch
es: reemplazo
fr: Remplacement
pt_pt: Substituição

source: Update mode
de: Aktualisierungsmodus
es: Modo de actualización
fr: Mode de mise à jour
pt_pt: Modo de atualização

source: Inherit only contacts/contacts group from host
de: Nur Kontakte/Kontakgruppen vom Host vererben
es: Heredar solo contactos / grupos de contactos de la definición de host
fr: Hériter seulement les contacts/groupes de contacts depuis la définition de l'hôte
pt_pt: Herda somente contactos e/ou grupos de contactos do Host

source: Contact additive inheritance
de: Additive Kontaktvererbung
es: Contactos de herencia adicionales
fr: Contacts hérités additionnels
pt_pt: Contacto com a herança aditiva

source: Contact group additive inheritance
de: Additive Kontaktgruppenvererbung
es: Grupos de contactos heredados adicionales
fr: Groupes de contacts hérités additionnels
pt_pt: Grupos de contacto com a herança aditiva

source: Implied Contacts
de: Implizierte Kontakte
es: Contactos vinculados
fr: Contacts liés
pt_pt: Contactos herdados

source: Implied Contact Groups
de: Implizierte Kontaktgruppen
es: Grupos vinculados de contactos
fr: Groupes de contacts liés
pt_pt: Grupos de Contacto implicitos

source: First notification delay
de: Verzögerung für die erste Benachrichtigung
es: Hora de la primera notificación
fr: Délai de première notification
pt_pt: Atraso da primeira notificação

source: Recovery notification delay
de: Verzögerung für die wieder verfügbar Benachrichtigung
es: Hora de la primera notificación de recuperación
fr: Délai de première notification de recouvrement
pt_pt: Atraso da notificação de recuperação

source: Notification Period
de: Benachrichtigungszeitraum
es: Periodo de notificación
fr: Période de notification
pt_pt: Período de Notificação

source: Flapping
de: Flackern
es: Bagotante
fr: Bagotant
pt_pt: Alternancia

source: Downtime Scheduled
de: Ausfallszeit angesetzt
es: Tiempos de parada programados
fr: Plages de maintenance programmées
pt_pt: Manutenção Agendada

source: Notification Type
de: Benachrichtigungstyp
es: Tipo de notificación
fr: Type de notification
pt_pt: Tipo de Notificação

source: Stalking Options
de: Nachverfolgungsoptionen
es: Opciones para guardar
fr: Options à enregistrer
pt_pt: Opções para Salvar

source: Add relations
de: Beziehungen hinzufügen
es: Añadir relaciones
fr: Ajouter des relations
pt_pt: Adicionar relações
