Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: No modification was made.
de: Es wurde keine Änderung vorgenommen.
es: No se han realizado cambios.
fr: Aucune modification effectuée.
pt_pt: Nenhuma modificação foi feita.

source: Object
de: Objekt
es: objeto
fr: Objet
pt_pt: Objeto

source: User
de: Benutzer
es: usuario
fr: Utilisateur
pt_pt: Usuário

source: Object Type
de: Objekttyp
es: Tipo de objeto
fr: Type d'objet
pt_pt: Tipo do Objeto

source: Event Type
de: Eventtyp
es: Tipo de evento
fr: Type d'évènement
pt_pt: Tipo de evento

source: Last 3 hours
de: Letzte 3 Stunden
es: Últimas 3 horas
fr: Les 3 dernières heures
pt_pt: Últimas 3 horas

source: Today
de: Heute
es: hoy
fr: Aujourd'hui
pt_pt: Hoje

source: Yesterday
de: Gestern
es: aquí
fr: Hier
pt_pt: Ontem

source: Last 4 days
de: Letzte 4 Tage
es: Últimos 4 días
fr: Les 4 derniers jours
pt_pt: Últimos 4 Dias

source: Last week
de: Letzte Woche
es: La última semana
fr: La dernière semaine
pt_pt: Última semana

source: Last month
de: Letzter Monat
es: El mes pasado
fr: Le dernier mois
pt_pt: Último mês

source: Last 6 months
de: Letzte 6 Monate
es: Los ultimos 6 meses
fr: Les 6 derniers mois
pt_pt: Últimos 6 Meses

source: Last year
de: Letztes Jahr
es: El año pasado
fr: La dernière année
pt_pt: Último Ano

source: State
de: Zustand
es: estatus
fr: État
pt_pt: Estado

source: Last event at
de: Letztes Event um
es: Último evento en
fr: Dernier évènement à
pt_pt: Último evento em

source: Last connection attempt
de: Letzter Verbindungsversuch
es: Ultima prueba de conexion
fr: Dernier essai de connxion
pt_pt: Última tentativa de conexão

source: Last connection success
de: Letzte erfolgreiche Verbindung
es: Última conexión hecha
fr: Dernière connexion réalisée
pt_pt: Última conexão realizada

source: One peer retention mode
de: Ein Peer Aufbewahrungsmodus
es: Retención de datos para la conexión desde el Servidor Central.
fr: Rétention des données pour connexion depuis serveur Central
pt_pt: Modo de retenção em um par

source: Event processing speed
de: Event Verarbeitungsgeschwindigkeit
es: Velocidad de procesamiento de eventos
fr: Vitesse de traitement des évènements
pt_pt: Velocidade de processamento de evento

source: Queue file
de: Warteschlangendatei
es: Cola de eventos
fr: File d'évènements
pt_pt: Fila de Ficheiros

source: Queued file enabled
de: Warteschlangendatei aktiviert
es: Cola de eventos habilitada
fr: File d'évènements activée
pt_pt: Fila de ficheiro ativada

source: Queued events
de: Events in der Warteschlange
es: Cola de eventos
fr: File d'évènements
pt_pt: Fila de Eventos

source: Memory file
de: Speicherdatei
es: Archivo de caché
fr: Fichier de cache
pt_pt: Ficheiro de Memória

source: Input accepted events type
de: Akzeptierte Eventtypen im Input
es: Tipos de eventos aceptados como entrada
fr: Types d'évènements acceptés en entrée
pt_pt: Tipos de eventos aceitaveis como entrada

source: Output accepted events type
de: Akzeptierte Eventtypen im Output
es: Tipos de eventos aceptados como salida
fr: Types d'évènements acceptés en sortie
pt_pt: Tipos de eventos aceitaveis como saída

source: Modules
de: Module
es: Módulos
pt_pt: Modulos

source: Last update
de: Letztes Update
es: última actualización
fr: Dernière mise à jour
pt_pt: Última atualização

source: Peers
es: Pares
fr: Pairs
pt_pt: Pares

source: Input
es: entrada
fr: Entrée
pt_pt: Entrada

source: No statistics file defined for this poller
de: Für diesen Poller wurde keine Statistikdatei angegeben
es: Ningún archivo de estadísticas definido para este colector
fr: Aucun fichier de statistiques défini pour ce collecteur
pt_pt: Sem ficheiro de estatisticas definido para este coletor

source: Cannot open statistics file
de: Die Statistikdatei konnte nicht geöffnet werden
es: No se puede abrir el archivo de estadísticas
fr: Impossible d'ouvrir le fichier des statistiques
pt_pt: Não foi possível abrir o ficheiro de estatísticas

source: Error in getting stats filename
de: Fehler beim Ermitteln des Namens der Statistikdatei
es: Error al recuperar el nombre del archivo de estadísticas
fr: Erreur dans la récupération du nom de fichier des stats
pt_pt: Erro ao recuperar status do nome de ficheiro

source: Change my settings
de: Meine Einstellungen anpassen
es: Cambiar mi configuración
fr: Changer mes réglages
pt_pt: Altera minhas configurações

source: Alias / Login
pt_pt: Apelido / Login

source: Pager
es: buscapersonas
fr: Bipeur
pt_pt: Bip

source: Confirm Password
de: Passwort bestätigen
es: Confirmación de contraseña
fr: Confirmation du mot de passe
pt_pt: Confirma Senha

source: Generate
de: Erzeugen
es: generar
fr: Générer
pt_pt: Gerado

source: Autologin Key
de: Autologin-Schlüssel
es: Llave de autoconexión
fr: Clé d'auto-connexion
pt_pt: Chave de Autologin

source: Language
de: Sprache
es: Lengua
fr: Langue
pt_pt: Linguagem

source: Animation effects
es: Efectos de animacion
fr: Effets d'animation
pt_pt: Efeitos de animação

source: Default page
de: Standardseite
es: Página predeterminada
fr: Page par défaut
pt_pt: Página Padrão

source: Show Up status
de: Verfügbar-Status anzeigen
es: Ver los estados Arriba
fr: Visualiser les statuts Up
pt_pt: Mostre status de Disponivel

source: Show Down status
de: Down-Status anzeigen
es: Ver los estados injoignales.
fr: Visualiser les statuts Injoignales
pt_pt: Mostre status de Baixa

source: Show Unreachable status
de: Nicht erreichbar-Status anzeigen
es: Ver los estados Desconocidos
fr: Visualiser les statuts Inconnus
pt_pt: Mostre status de Inalcançável

source: Show OK status
de: OK-Status anzeigen
es: Ver estados Ok
fr: Visualiser les statuts Ok
pt_pt: Moste status de OK

source: Show Warning status
de: Warnung-Status anzeigen
es: Visualizar estados de problemas
fr: Visualiser les statuts problèmatiques
pt_pt: Mostre status de Alerta

source: Show Critical status
de: Kritisch-Status anzeigen
es: Ver estados en alertas
fr: Visualiser les statuts en alertes
pt_pt: Mostre status de Criticos

source: Show Unknown status
de: Unbekannt-Status anzeigen
es: Visualizar los estatutos no determinados.
fr: Visualiser les statuts non déterminés
pt_pt: Mostre status de Indeterminado

source: New version
de: Neue Version
pt_pt: Nova versão

source: Legacy version
de: Alte Version
pt_pt: Versão legada

source: Sound for Up status
de: Ton für den Verfügbar-Status
es: Es por estado Arriba
fr: Son pour les statuts Up
pt_pt: Som para status de Disponivel

source: Sound for Down status
de: Ton für den Down-Status
es: Es por los estados injoignales.
fr: Son pour les statuts Injoignales
pt_pt: Som para status de Baixa

source: Sound for Unreachable status
de: Ton für den Nicht erreichbar-Status
es: Es para estados desconocidos.
fr: Son pour les statuts Inconnus
pt_pt: Som para status de Inalcançável

source: Sound for OK status
de: Ton für den OK-Status
es: Está para los estados Ok
fr: Son pour les statuts Ok
pt_pt: Som para status de OK

source: Sound for Warning status
de: Ton für den Warnung-Status
es: Es para estados problemáticos.
fr: Son pour les statuts problématiques
pt_pt: Som para status de Alerta

source: Sound for Critical status
de: Ton für den Kritisch-Status
es: Es para estados en alertas.
fr: Son pour les statuts en alertes
pt_pt: Som para status de Critico

source: Sound for Unknown status
de: Ton für den Unbekannt-Status
es: Su estado no especificado
fr: Son pour les statuts non déterminés
pt_pt: Som para status de indeterminado

source: Timezone / Location
de: Zeitzone / Standort
es: Zona horaria / ubicación
fr: Fuseau horaire / Localisation
pt_pt: Fuso horário / Localização

source: Compulsory name
de: Erforderlicher Name
es: Nombre obligatorio
fr: Nom obligatoire
pt_pt: Nome obrigatorio

source: Compulsory alias
de: Erforderlicher Alias
es: Alias ​​obligatorio
fr: Alias obligatoire
pt_pt: Apelido obrigatorio

source: Valid Email
de: Gültige Email
es: Email valido
fr: Email valide
pt_pt: E-mail válido

source: Passwords do not match
de: Die Passwörter stimmen nicht überein
es: Las contraseñas no coinciden
fr: Les mots de passe ne correspondent pas
pt_pt: As senhas não correspondem

source: Name already in use
de: Name wird bereits verwendet
es: Nombre ya usado
fr: Nom déjà utilisé
pt_pt: Nome já esta em uso

source: Rebuild RRD Database
de: RRD-Datenbank neu aufbauen
es: Regenerar las bases de datos RRD
fr: Regénérer les bases de données RRD
pt_pt: Reconstroi o banco de dados RRD

source: Stop rebuilding RRD Databases
de: Nauaufbau der RRD-Datenbanken abbrechen
es: Detener la regeneración de bases de datos RRD
fr: Arrêter la regénération des bases de données RRD
pt_pt: Para de reconstruir o banco de dados RRD

source: Delete graphs
de: Graphen löschen
es: Borrar gráficos
fr: Supprimer des graphiques
pt_pt: Remove gráficos

source: Hide graphs of selected Services
de: Graphen der ausgewählten Services verstecken
es: Ocultar gráficos de servicio seleccionados
fr: Cacher les graphiques des services sélectionnés
pt_pt: Oculta gráficos dos serviços selecionados

source: Stop hiding graphs of selected Services
de: Graphen der ausgewählten Services nicht mehr verstecken
es: No ocultar los gráficos de los servicios seleccionados.
fr: Ne plus cacher les graphiques des services sélectionnés
pt_pt: Para de ocultar gráficos dos serviços selecionados

source: Lock Services
de: Services sperren
es: Servicios de bloqueo
fr: Verrouiller les services
pt_pt: Bloqueia os Serviços

source: Unlock Services
de: Services entsperren
es: Desbloquear servicios
fr: Déverrouiller les services
pt_pt: Desbloqueia os Serviços

source: Metrics
de: Metriken
es: métrica
fr: Métriques
pt_pt: Metricas

source: Rebuild Waiting
de: Neuaufbau wartet
es: Esperando la reconstrucción
fr: En attente de reconstruction
pt_pt: Aguardando reconstrução

source: Locked
de: Gesperrt
es: bloqueado
fr: Verrouillé
pt_pt: Travado

source: Storage Type
de: Speichertyp
es: Tipo de copia de seguridad
fr: Type de sauvegarde
pt_pt: Tipo de Armazenagem

source: Do you confirm the change of the RRD data source type ? If yes, you must rebuild the RRD Database
de: Bestätigen Sie die Änderung des RRD-Datenquellentyps? Falls ja, muss die RRD-Datenbank neu aufgebaut werden
es: ¿Confirmar el cambio de tipo de fuente de datos? Si es así, es necesario reconstruir la base de datos RRD.
fr: Confirmer le changement de type de source de données ? Si oui, il est nécessaire de reconstruire la base de données RRD.
pt_pt: Você confirma a alteração do tipo de fonte de dados do RRD ? Se sim, você deve reconstruir o banco de dados do RRD

source: Set RRD Data Source Type to ABSOLUTE
de: RRD-Datenquellentyp auf absolut (ABSOLUTE) setzen
es: Establezca el tipo de fuente de datos RRD en ABSOLUTO
fr: Fixer le type de source de données RRD à ABSOLUTE
pt_pt: Configura o tipo da fonte de dados RRD para ABSOLUTE

source: Set RRD Data Source Type to COUNTER
de: RRD-Datenquellentyp auf Zähler (COUNTER) setzen
es: Establezca el tipo de fuente de datos RRD en CONTADOR
fr: Fixer le type de source de données RRD à COUNTER
pt_pt: Configura o tipo da fonte de dados RRD para COUNTER

source: Set RRD Data Source Type to DERIVE
de: RRD-Datenquellentyp auf ableiten (DERIVE) setzen
es: Establezca el tipo de fuente de datos RRD en DERIVE
fr: Fixer le type de source de données RRD à DERIVE
pt_pt: Configura o tipo da fonte de dados RRD para DERIVE

source: Set RRD Data Source Type to GAUGE
de: RRD-Datenquellentyp auf messen (GAUGE) setzen
es: Establezca el tipo de fuente de datos RRD en GAUGE
fr: Fixer le type de source de données RRD à GAUGE
pt_pt: Configura o tipo da fonte de dados RRD para GAUGE

source: Metric
de: Metrik
es: métrico
fr: Métrique
pt_pt: Metrica

source: Min
es: Mínimo
fr: Minimum
pt_pt: Mínimo

source: Max
es: Máximo
fr: Maximum
pt_pt: Máximo

source: Number of values
de: Anzahl an Werten
es: Numero de valores
fr: Nombre de valeurs
pt_pt: Número de valores

source: Data source type
de: Datenquellentyp
es: Tipo de fuente de datos
fr: Type de source de données
pt_pt: Tipo da fonte de dados

source: No wiki page defined
de: Keine Wiki-Seite festgelegt
es: No hay páginas definidas
fr: Aucune page définie
pt_pt: Nenhuma página wiki definida

source: Wiki page defined
de: Wiki-Seite festgelegt
es: Pagina definida
fr: Page définie
pt_pt: Página Wiki definida

source: Create wiki page
de: Wiki-Seite erstellen
es: Crear una página
fr: Créer une page
pt_pt: Cria página wiki

source: First page
de: Erste Seite
es: Primera página
fr: Première page
pt_pt: Primeira página

source: Previous page
de: Vorige Seite
es: Pagina anterior
fr: Page précédante
pt_pt: Página anterior

source: Next page
de: Nächste Seite
es: Siguiente pagina
fr: Page suivante
pt_pt: Próxima página

source: Last page
de: Letzte Seite
es: Ultima pagina
fr: Dernière page
pt_pt: Última página

source: Rows
de: Zeile
es: líneas
fr: Lignes
pt_pt: Linhas

source: Page
de: Seite
es: Página
pt_pt: Página

source: Host Template
es: Plantilla del anfitrión
fr: Modèle de l'hôte
pt_pt: Modelo de Host

source: Service Template
es: Modelo de servicio
fr: Modèle de service
pt_pt: Modelo de Serviço

source: Show wiki pageless only
de: Nur ohne Wiki-Seite anzeigen
es: Ver objetos sin base de conocimientos.
fr: Voir les objets sans base de connaissance
pt_pt: Mostra objetos não relacionados ao wiki

source: Show wiki pageless only - inherited templates included
de: Nur ohne Wiki-Seite anzeigen - inklusive vererbte Templates
es: Ver objetos sin una base de conocimiento incluyendo la herencia del modelo
fr: Voir les objets sans base de connaissance en incluant l'héritage des modèles
pt_pt: Mostra objetos não relacionados ao wiki - incluindo herança de modelos

source: Hosts Templates
de: Hosttemplates
es: Modelos de hosts
fr: Modèles d'hôtes
pt_pt: Modelos de Hosts

source: Services Templates
de: Servicetemplates
es: Modelos de servicio
fr: Modèles de services
pt_pt: Modelos de Serviços

source: All Pollers
de: Alle Poller
es: Todos los coleccionistas
fr: Tous les collecteurs
pt_pt: Todos os Coletores

source: SNMP Trap Generation
de: SNMP-Trap Erzeugung
es: Generando trampas SNMP
fr: Génération des traps SNMP
pt_pt: Geração de Trap SNMP

source: Export Options
de: Exportoptionen
es: Opciones de exportación
fr: Options d'export
pt_pt: Opções de Exportação

source: Implied Server
de: Implizierter Server
es: Servidor vinculado
fr: Serveur lié
pt_pt: Servidor Implicito

source: Generate trap database
de: Trap-Datenbank erzeugen
es: Generar base de definición de captura SNMP
fr: Générer la base de définition des traps SNMP
pt_pt: Gerar banco de dados de trap

source: Apply configurations
de: Konfigurationen übernehmen
es: Aplicar configuración
fr: Appliquer la configuration
pt_pt: Aplicar configurações

source: Reload
de: Neu laden
es: recargar
fr: Recharger
pt_pt: Recarregar

source: Restart
de: Neustart
es: reanudar
fr: Redémarrer
pt_pt: Reiniciar

source: Send signal
de: Zu sendendes Signal
es: Enviar la señal
fr: Envoyer le signal
pt_pt: Enviar sinal

source: Database generation
de: Datenbankerzeugung
es: Generando la base de datos
fr: Génération de la base de données
pt_pt: Geração de banco de dados

source: Centcore commands
de: Centcore Befehle
es: Órdenes de centcore
fr: Commandes centcore
pt_pt: Comandos do centcore

source: The config name already exists
es: El nombre utilizado ya existe.
fr: Le nom utilisé existe déjà
pt_pt: O nome da configuração já existe

source: Error while inserting central-module configuration
es: Error durante la inserción de las configuraciones del módulo central.
fr: Erreur durant l'insertion des configurations de central-module
pt_pt: Erro durante a inserção de configuração no modulo central (central-module)

source: Error while inserting central-broker configuration
es: Error al insertar la configuración del módulo Centreon Broker Master
fr: Erreur durant l'insertion de la configuration du module Centreon Broker Master
pt_pt: Erro durante a inserção de configuração no central-broker

source: Error while inserting central-rrd configuration
es: Error al insertar la configuración del módulo RRD de Centreon Broker
fr: Erreur durant l'insertion de la configuration du module Centreon Broker RRD
pt_pt: Erro durante a inserção de configuração no central-rrd

source: Error while inserting poller-module configuration
es: Error al insertar la configuración del módulo Centreon Broker del recopilador
fr: Erreur durant l'insertion de la configuration du module Centreon Broker du collecteur
pt_pt: Erro durante a inserção de configuração do modulo Broker do coletor.

source: Bad configuration type
es: Type incorrect de configuration
fr: Type incorrect de configuration
pt_pt: Tipo de configuração ruim

source: Central configuration
es: Configuración del servidor central
fr: Configuration du serveur central
pt_pt: Configuração Central

source: Requester
de: Anforderer
es: colector
fr: Collecteur
pt_pt: Requisitor

source: Information
es: información
fr: Informations
pt_pt: Informação

source: Additional daemon
es: Demonio adicional
fr: Démon supplémentaire
pt_pt: Daemon adicional

source: Serialization protocol
de: Serialisierungsprotokoll
es: Protocolo de serialización
fr: Protocole de sérialisation
pt_pt: Protocolo de serialização

source: None
de: Keine
es: no
fr: Aucune
pt_pt: Nenhum

source: Error while getting the local requester.
es: Error durante la recuperación del sondeador central
fr: Erreur durant la récupération du poller central
pt_pt: Erro ao obter o requisitor local.

source: No active poller is defined in Centreon.
es: No se han definido satélites activos en Centreon.
fr: Aucun satellite actif est défini dans Centreon.
pt_pt: Sem coletor definido no Centreon.

source: Central address
es: Dirígete a tu Central
fr: Adresse du Central
pt_pt: Endereço Central

source: Communication port
es: Puerto de comunicacion
fr: Port de communication
pt_pt: Porta de Comunicação

source: You are not allowed to access this object configuration
de: Sie sind nicht dazu berechtigt, auf diese Objektkonfiguration zuzugreifen
es: No está permitido acceder a la definición de objeto.
fr: Vous n'êtes pas autorisé à accéder à la définition de l'objet
pt_pt: Você não tem permissão para acessar esse objeto de configuração

source: Add a Centreon-Broker Configuration
de: Centreon-Broker Konfiguration hinzufügen
es: Agregar una configuración de Centreon-Broker
fr: Ajouter une configuration Centreon-Broker
pt_pt: Adicionar Configuração Centreon-Broker

source: Modify a Centreon-Broker Configuration
de: Centreon-Broker Konfiguration bearbeiten
es: Modificar una configuración de Centreon-Broker
fr: Modifier une configuration Centreon-Broker
pt_pt: Modificar Configuração Centreon-Broker

source: View a Centreon-Broker Configuration
de: Centreon-Broker Konfiguration anzeigen
es: Ver una configuración de Centreon-Broker
fr: Voir une configuration Centreon-Broker
pt_pt: Visualizar Configuração Centreon-Broker

source: Main options
de: Hauptoptionen
es: Opciones generales
fr: Options générales
pt_pt: Opções Principais

source: Log options
de: Protokolloptionen
es: Opciones de registro
fr: Options de journalisation
pt_pt: Opções de Registro

source: Advanced options
de: Erweiterte Optionen
es: Configuración avanzada
fr: Paramètres avancés
pt_pt: Opções Avançadas

source: Centreon Broker configuration
de: Centreon-Broker Konfiguration
es: Configuration de Centreon Broker
fr: Configuration de Centreon Broker
pt_pt: Configuração do Centreon Broker

source: Config file name
de: Name der Konfigurationsdatei
es: Nombre del archivo de configuración.
fr: Nom du fichier de configuration
pt_pt: Nome Ficheiro de Configuração

source: Cache directory
de: Cache-Verzeichnis
pt_pt: Diretório de cache

source: Event queue max size
de: Maximale Größe der Event-Warteschlange
es: Tamaño máximo de la cola de eventos.
fr: Taille maximale de la queue d'évènements
pt_pt: Tamanho máximo da fila de Eventos

source: Command file
de: Befehlsdatei
es: Ruta de socket Unix de Centreon Broker
fr: Chemin d'accès au socket Unix de Centreon Broker
pt_pt: Ficheiro de comando

source: Write timestamp
es: Escribe la marca de tiempo
fr: Ecrire l'horodatage (timestamp)
pt_pt: Salvar data/hora (timestamp)

source: Write thread id
es: Escriba el identificador de proceso
fr: Ecrite l'identifiant du processus
pt_pt: Escrever ID da thread de processo

source: Link to cbd service
de: Mit dem CBD-Dienst verknüpfen
pt_pt: Link para o serviço cbd

source: Statistics
de: Statistiken
es: Habilitar estadísticas
fr: Activer les statistiques
pt_pt: Estatísticas

source: Mandatory name
de: Erforderlicher Name
es: Nombre obligatorio
fr: Nom obligatoire
pt_pt: Nome Obrigatorio

source: Mandatory filename
de: Erforderlicher Dateiname
es: Nombre de archivo obligatorio
fr: Nom du fichier obligatoire
pt_pt: Ficheiro obrigatorio

source: Mandatory cache directory
de: Erforderliches Cache-Verzeichnis
pt_pt: Diretório de cache obrigatório

source: Value must be numeric
de: Der Wert muss numerisch sein
es: El valor debe ser numérico.
fr: La valeur doit être numérique
pt_pt: O Valor deve ser númerico

source: General
de: Allgemein
fr: Général
pt_pt: Geral

source: Bad arguments for wizard.
es: Malos argumentos para el asistente.
fr: Mauvais arguments pour l'assistant.
pt_pt: Argumentos ruins para o Assistente

source: The wizard is not correctly initialized.
es: El asistente no está inicializado correctamente.
fr: L'assistant n'est pas initialisé correctement.
pt_pt: O Assistente não foi inicializado corretamente.

source: The wizard is corrupted.
es: El asistente está dañado.
fr: L'assistant est endommagé.
pt_pt: O Assistente esta corrompido

source: Error while saving configuration.
es: Error al guardar la configuración.
fr: Erreur durant l'enregistrement de la configuration.
pt_pt: Erro enquanto salvava configuração.

source: Configuration saved.
es: Configuración guardada.
fr: Configuration sauvegardée.
pt_pt: Configuração salva.

source: Welcome to Centreon Broker configuration
es: Bienvenido a la configuración de Centreon Broker
fr: Bienvenu dans la configuration de Centreon Broker
pt_pt: Bem vindo a configuração do Centreon Broker

source: Choose a configuration template:
es: Elija la plantilla de configuración
fr: Choisissez le modèle de configuration
pt_pt: Escolha um modelo de configuração:

source: Simple poller
es: Solo coleccionista
fr: Collecteur uniquement
pt_pt: Coletor simples

source: Outputs
es: salidas
fr: Sorties
pt_pt: Saídas

source: Inputs
es: entradas
fr: Entrées
pt_pt: Entradas

source: Loggers
es: plotters
fr: Traceurs
pt_pt: Registradores

source: Add with wizard
de: Mit dem Assistenten hinzufügen
es: Añadir con Asistente
fr: Ajouter avec l'assistant
pt_pt: Adicionar com Assistente

source: You are not allowed to access this monitoring instance
de: Sie sind nicht dazu berechtigt, auf diese Monitoring-Instanz zuzugreifen
es: No estás autorizado para acceder a esta instancia de supervisión.
fr: Vous n'êtes pas autorisé à accéder à cette instance de supervision
pt_pt: Você não tem permissão para acessar essa instancia de monitoramento

source: Add a poller
de: Poller hinzufügen
es: Añadir un coleccionista
fr: Ajouter un collecteur
pt_pt: Adiciona Coletor

source: Modify a poller Configuration
de: Pollerkonfiguration bearbeiten
es: Cambiar la configuración de un colector.
fr: Modifier la configuration d'un collecteur
pt_pt: Modifica configuração do Coletor

source: View a poller Configuration
de: Pollerkonfiguration anzeigen
es: Ver la configuración de un colector.
fr: Afficher la configuration d'un collecteur
pt_pt: Visualiza configuração do Coletor

source: Server Information
de: Serverinformationen
es: Información del servidor
fr: Informations sur le serveur
pt_pt: Informações do servidor

source: Gorgone Information
de: Gorgone Informationen
es: Información Gorgone
fr: Informations Gorgone
pt_pt: Informações Gorgone
