Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: Last 24 Hours
de: Letzte 24 Stunden
es: Ultimas 24 horas
fr: Les 24 dernières heures
pt_pt: Últimas 24 Horas

source: Last 2 Days
de: Letzte 2 Tage
es: Los 2 dias anteriores
fr: Les 2 précédents jours
pt_pt: Últimos 2 Dias

source: Last 3 Days
de: Letzte 3 Tage
es: Últimos 3 días
fr: Les 3 derniers jours
pt_pt: Últimos 3 Dias

source: Last 4 Days
de: Letzte 4 Tage
es: 4 dias previos
fr: Les 4 précédents jours
pt_pt: Últimos 4 Dias

source: Last 5 Days
de: Letzte 5 Tage
es: Últimos 5 días
fr: Les 5 derniers jours
pt_pt: Últimos 5 Dias

source: Last 7 Days
de: Letzte 7 Tage
es: 7 dias previos
fr: Les 7 précédents jours
pt_pt: Últimos 7 Dias

source: Last 14 Days
de: Letzte 14 Tage
es: Los 14 dias anteriores
fr: Les 14 précédents jours
pt_pt: Últimos 14 Dias

source: Last 28 Days
de: Letzte 28 Tage
es: 28 dias previos
fr: Les 28 précédents jours
pt_pt: Últimos 28 Dias

source: Last 30 Days
de: Letzte 30 Tage
es: Los 30 dias anteriores
fr: Les 30 précédents jours
pt_pt: Últimos 30 Dias

source: Last 31 Days
de: Letzte 31 Tage
es: Los 31 dias anteriores
fr: Les 31 précédents jours
pt_pt: Últimos 31 Dias

source: Last 2 Months
de: Letzte 2 Monate
es: Los 2 meses anteriores
fr: Les 2 précédents mois
pt_pt: Últimos 2 Meses

source: Last 4 Months
de: Letzte 4 Monate
es: 4 meses anteriores
fr: Les 4 précédents mois
pt_pt: Últimos 4 Meses

source: Last 6 Months
de: Letzte 6 Monate
es: 6 meses anteriores
fr: Les 6 précédents mois
pt_pt: Últimos 6 Meses

source: Last Year
de: Letztes Jahr
es: El año pasado
fr: L'année précédente
pt_pt: Último Ano

source: Graph Period
de: Graphenzeitraum
es: Período de visualización
fr: Période de visualisation
pt_pt: Período do Gráfico

source: Choose the source to graph
de: Wählen Sie die Quelle für den Graph
es: Elegir fuente para grapher
fr: Choisissez la source à grapher
pt_pt: Escolha a fonte do gráfico

source: Apply Period
de: Zeitraum anwenden
es: Aplicar el periodo
fr: Appliquer la période
pt_pt: Aplicar Período

source: or
de: oder
es: o
fr: ou
pt_pt: ou

source: to
de: bis
es: la
fr: au
pt_pt: para

source: Display Status
de: Status anzeigen
es: Pantalla de estado
fr: Affichage de l'état
pt_pt: Exibir Estado

source: last day
de: Letzter Tag
pt_pt: último dia

source: last week
de: Letzte Woche
pt_pt: semana passada

source: last month
de: Letzter Monat
pt_pt: mês passado

source: last year
de: Letztes Jahr
pt_pt: ano passado

source: List of known metrics
de: Liste der bekannten Metriken
es: Lista de métricas conocidas
fr: Liste des métriques connues
pt_pt: Lista de metricas conhecidas

source: Service list
es: Lista de servicios
fr: Liste des services
pt_pt: Lista de serviço

source: Add a Data Source Template
de: Datenquellentemplate hinzufügen
es: Agregar una plantilla de fuente de datos
fr: Ajouter un modèle de source de données
pt_pt: Adicione uma fonte de dados para o Modelo

source: Modify a Data Source Template
de: Datenquellentemplate bearbeiten
es: Editar una plantilla de fuente de datos
fr: Modifier un modèle de source de données
pt_pt: Modifica uma fonte de dados para o Modelo

source: View a Data Source Template
de: Datenquellentemplate anzeigen
es: Ver una plantilla de fuente de datos
fr: Visualiser un modèle de source de données
pt_pt: Visualiza uma fonte de dados para o Modelo

source: Display Optional Modifier
de: Optionalen Modifikator anzeigen
es: Configuraciones de apariencia opcionales
fr: Paramètres d'apparence optionnels
pt_pt: Exibe Modificador Opcional

source: Colors
de: Farben
es: colores
fr: Couleurs
pt_pt: Cores

source: Legend
de: Legende
es: leyenda
fr: Légende
pt_pt: Legenda

source: Template Name
es: Nombre del modelo
fr: Nom du modèle
pt_pt: Nome do Modelo

source: Stack
de: Überlagerung
es: montón
fr: Empiler
pt_pt: Empilhar

source: Order
de: Reihenfolge
es: orden
fr: Ordre
pt_pt: Ordem

source: Choose a service if you want a specific curve for it.
de: Wählen Sie einen Service aus, wenn Sie eine spezifische Kurve für diesen möchten.
es: Seleccione un servicio para seleccionar una curva particular.
fr: Selectionner un service pour sélectionner une courbe particulière ce dernier.
pt_pt: Escolha um serviço se você quer uma curva especifica para isso.

source: Data Source Name
de: Datenquellenname
es: Nombre de la fuente de datos
fr: Nom de la source de données
pt_pt: Nome da fonte de dados

source: Line color
de: Linienfarbe
es: Color de la curva.
fr: Couleur de la courbe
pt_pt: Cor da Linha

source: Area color
de: Flächenfarbe
es: Color del litoral.
fr: Couleur de l'aire
pt_pt: Cor da Area

source: Warning Area color
de: Warnungsflächenfarbe
es: Color de superficie de advertencia
fr: Couleur de la surface Warning
pt_pt: Cor da Area para Alerta

source: Critical Area color
de: Flächenfarbe für Kritisch
es: Color de la superficie critica
fr: Couleur de la surface Critique
pt_pt: Cor da Area para Critico

source: Transparency
de: Transparenz
es: transparencia
fr: Transparence
pt_pt: Transparência

source: Filling
de: Füllung
es: relleno
fr: Remplissage
pt_pt: Preencher

source: Print Max value
de: Maximalen Wert ausgeben
es: Mostrar valor máximo
fr: Afficher la valeur maximale
pt_pt: Exibir Valor Máximo

source: Print Min value
de: Minimalen Wert ausgeben
es: Mostrar valor mínimo
fr: Afficher la valeur minimale
pt_pt: Exibir Valor Mínimo

source: Round the min and max
de: Minimalen und maximalen Wert runden
es: Redondea los valores mínimo y máximo.
fr: Arrondir les valeurs minimale et maximale
pt_pt: Arrendondar os valores máximo e mínimo

source: Print Average
de: Durchschnitt ausgeben
es: Mostrar promedio
fr: Afficher la moyenne
pt_pt: Exibir média

source: Print Last Value
de: Letzten Wert ausgeben
es: Mostrar el último valor
fr: Afficher la dernière valeur
pt_pt: Exibir o último valor

source: Print Total Value
de: Insgesamten Wert ausgeben
es: Mostrar valor total
fr: Afficher la valeur totale
pt_pt: Exibir o valor total

source: Invert
de: Invertieren
es: marcha atrás
fr: Inverser
pt_pt: Inverter

source: Default Centreon Graph Template
de: Standard Centreon Graphentemplate
es: ¿Modelo gráfico por defecto de Centreon?
fr: Modèle graphique par défaut de Centreon ?
pt_pt: Modelo Padrão de Gráfico do Centreon ?

source: Thickness
de: Dicke
es: espesor
fr: Epaisseur
pt_pt: Espessuras

source: Legend Name
de: Legendenname
es: leyenda
fr: Légende
pt_pt: Nome da Legenda

source: Display Only The Legend
de: Nur die Legende anzeigen
es: Mostrar solo la leyenda
fr: Afficher uniquement la légende
pt_pt: Exibir somente a Legenda

source: Empty Line After This Legend
de: Leere Zeile nach dieser Legende
es: Línea vacía después de esta leyenda
fr: Ligne vide après cette légende
pt_pt: Linha vazia após esta Legenda

source: Graph Choice
de: Graphenauswahl
es: Elección de la gráfica.
fr: Choix du graphique
pt_pt: Escolha o Gráfico

source: Data Source already in use for this Host/Service
de: Diese Datenquelle wird bereits bei diesem Host/Service verwendet
es: Fuente de datos ya utilizada para este Host / Servicio
fr: Source de données déjà utilisée pour cet Hôte/Service
pt_pt: Fonte de dados já esta em uso para este Host/Serviço

source: Random
de: Zufällig
es: aleatorio
fr: Aléatoire
pt_pt: Aleatorio

source: Color line mode
de: Farbenlinienmodus
es: Modo de color de la línea.
fr: Mode de couleur de la ligne
pt_pt: Modo da cor de linha

source: Bad Format: start color by #
de: Ungültiges Fomrat: Die Farbe muss mit # beginnen
es: Mal tamaño: el color debe comenzar con
fr: Mauvais format : la couleur doit commencer par #
pt_pt: Formato ruim: inicia cor por #

source: Stacked
de: Überlagert
es: apilada
fr: Empilée
pt_pt: Empilhado

source: Add a Graph Template
de: Graphentemplate hinzufügen
es: Añadir una plantilla de gráfico
fr: Ajouter un modèle de graphique
pt_pt: Adicionar um Modelo de Gráfico

source: Modify a Graph Template
de: Graphentemplate bearbeiten
es: Editar una plantilla de gráfico
fr: Modifier un modèle de graphique
pt_pt: Modificar um Modelo de Gráfico

source: View a Graph Template
de: Graphentemplate anzeigen
es: Ver una plantilla de gráfico
fr: Visualiser un modèle de graphique
pt_pt: Visualizar um Modelo de Gráfico

source: Image Type
de: Bildtyp
es: Tipo d`image
fr: Type d'image
pt_pt: Tipo de Imagem

source: Vertical Label
de: Vertikales Label
es: Etiqueta vertical
fr: Label vertical
pt_pt: Etiqueta Vertical

source: Width
de: Breite
es: ancho
fr: Largeur
pt_pt: Largura

source: Height
de: Höhe
es: altura
fr: Hauteur
pt_pt: Altura

source: Lower Limit
de: Untere Grenze
es: Límite inferior
fr: Limite inférieure
pt_pt: Limite minimo

source: Upper Limit
de: Obere Grenze
es: Límite superior
fr: Limite supérieure
pt_pt: Limite máximo

source: Size to max
de: Auf maximalen Wert skalieren
es: Talla maxima
fr: Taille max
pt_pt: Tamanho máximo

source: No Step
de: Kein Schritt
es: Sin escenario
fr: Sans étape
pt_pt: Sem Etapa

source: Recovery Step
de: Erholungsschritt
es: Paso de recuperacion
fr: Etape de récuperation
pt_pt: Etapa de Recuperação

source: Stacking
de: Überlagerung
es: montón
fr: Empiler
pt_pt: Empilhando

source: Scale Graph Values
de: Graphenwerte skalieren
es: Escalado
fr: Mise à l'échelle
pt_pt: Valores de escala do Gráfico

source: Data Sources
de: Datenquellen
es: Fuentes de datos
fr: Sources de données
pt_pt: Fontes de dados

source: Split Components
de: Komponenten aufteilen
es: Curvas separadas
fr: Séparer les courbes
pt_pt: Separar Componentes

source: Generated in
es: Generado en
fr: Généré en
pt_pt: Gerado em

source: Documentation
de: Dokumentation
es: Documentación
pt_pt: Documentação

source: Help Desk
es: Centro de servicio
fr: Centre des services
pt_pt: Assistencia

source: You are not allowed to reach this page
de: Sie sind nicht dazu berechtigt, auf diese Seite zuzugreifen
es: No estás autorizado para acceder a esta página.
fr: Vous n'êtes pas autorisé à accéder à cette page
pt_pt: Você não tem permissão para visualizar esta página

source: Password
de: Passwort
es: Contraseña
fr: Mot de passe
pt_pt: Senha

source: Username
de: Benutzername
es: Nombre de usuario
fr: Utilisateur
pt_pt: Nome do usuário

source: Connect
es: Conectarse
fr: Se connecter
pt_pt: Conectar

source: Your session is expired.
es: Tu sesión ha expirado
fr: Votre session a expirée
pt_pt: Sua sessão expirou.

source: You must specify a username
es: Debe especificar un nombre de usuario
fr: Vou devez spécifier un nom d'utilisateur
pt_pt: Você deve especificar um nome de usuário

source: You must specify a password
es: Debe especificar una contraseña
fr: Vou devez spécifier un mot de passe
pt_pt: Você deve especificar uma senha

source: Begin date
de: Anfangsdatum
es: Fecha de inicio
fr: Date de début
pt_pt: Data inicial

source: End date
de: Enddatum
es: Fecha final
fr: Date de fin
pt_pt: Data final

source: m/d/Y (H:i:s)
es: d/m/Y - H: i: s
fr: d/m/Y - H:i:s
pt_pt: d/m/Y - H:i:s

source: Type
de: Typ
es: Tipo
pt_pt: Tipo

source: Notification
de: Benachrichtigung
es: Notificación
pt_pt: Notificação

source: Alert
es: advertencia
fr: Alerte
pt_pt: Alerta

source: error
de: Fehler
fr: erreur
pt_pt: erro

source: Day
de: Tag
es: Día
fr: Jour
pt_pt: Dia

source: Time
de: Zeit
es: horas
fr: Heures
pt_pt: Tempo

source: Address
de: Adresse
es: dirección
fr: Adresse
pt_pt: Endereço

source: Retry
de: Wiederholen
es: reanimar
fr: Relancer
pt_pt: Tentar

source: Contact
de: Kontakt
es: Contacto
pt_pt: Contacto

source: Cmd
es: orden
fr: Commande
pt_pt: Comando

source: Choose the source
de: Quelle auswählen
es: Elige la fuente
fr: Choisir la source
pt_pt: Escolha a fonte

source: Message Type
de: Nachrichtentyp
es: Tipo de mensaje
fr: Type de message
pt_pt: Tipo de Mensagem

source: Alerts
es: Notificaciones
fr: Alertes
pt_pt: Alertas

source: Errors
de: Fehler
es: errores
fr: Erreurs
pt_pt: Erros

source: Hard Only
de: Nur HARD
es: Estado validado (duro) solamente
fr: Etat validés (Hard) seulement
pt_pt: Somente Estado Válido (Hard)

source: Log Period
de: Protokollzeitraum
es: Período de visualización
fr: Période de visualisation
pt_pt: Período de Registro

source: Apply period
de: Zeitraum anwenden
es: Aplicar el periodo
fr: Appliquer la période
pt_pt: Aplicar período

source: Services Groups
de: Servicegruppen
es: Grupos de servicio
fr: Groupes de services
pt_pt: Grupos de Serviços

source: Hosts Groups
de: Hostgruppen
es: Grupos de anfitriones
fr: Groupes d'hôtes
pt_pt: Grupos de Hosts

source: Object name
de: Objektname
es: Nombre del objeto:
fr: Nom de l'objet :
pt_pt: Nome do objeto :

source: Command
de: Befehl
es: orden
fr: Commande
pt_pt: Comando

source: Project Leaders
de: Projektleiter
es: Gestores de proyectos
fr: Chefs de projet
pt_pt: Lideres de Projeto

source: Developers
de: Entwickler
es: Desarrolladores
fr: Developpeurs
pt_pt: Desenvolvedores

source: Contributors
de: Mitwirkende
es: colaboradores
fr: Contributeurs
pt_pt: Colaboradores

source: And many others...
de: Und viele Andere...
es: Y muchos otros ...
fr: Et bien d'autres...
pt_pt: E muitos outros ...

source: You can see the full list by visiting the Centreon's Github
de: Die vollständige Liste kann auf Centreon's Github eingesehen werden
es: Puede ver la lista completa del proyecto Centeronsur Github
fr: Vous pouvez visualiser la liste complète à partir de du projet Centreonsur Github
pt_pt: Você pode ver a lista completa visitando o Github do Centreon

source: Modify General Options
de: Allgemeine Optionen bearbeiten
es: Editar opciones generales
fr: Modifier les options générales
pt_pt: Modifica opções gerais

source: Directory + RRDTOOL Binary
de: Verzeichnis und RRDTool-Ausführdatei
es: Ruta completa al ejecutable RRDTOOL
fr: Chemin complet de l'exécutable RRDTOOL
pt_pt: Diretorio + Binario RRDTOOL

source: RRDTool Version
es: Version de RRDTool
fr: Version de RRDTool
pt_pt: Versão do RRDTool

source: Unit Properties
es: Propiedades de la unidad.
fr: Propriétés de l'unité
pt_pt: Propriedades de Unidade

source: Font
es: Policía
fr: Police
pt_pt: Fonte

source: Font size
es: Tamaño de letra
fr: Taille de police
pt_pt: Tamanho da Fonte

source: Title Properties
es: Propiedades del título
fr: Propriétés du titre
pt_pt: Propriedades do Titulo

source: Axis Properties
es: Propiedades del eje
fr: Propriétés des axes
pt_pt: Propriedades do Axis

source: Legend Properties
es: Propiedades de leyenda
fr: Propriétés de la légende
pt_pt: Propriedades da Legenda

source: Watermark Properties
es: Propiedad de la marca de agua.
fr: Propriété du filigrane
pt_pt: Propriedades de Marca D'agua

source: Rrdcached configuration : work only with Centreon Broker
es: Configuración del módulo RRDCached: solo funciona con Centreon Broker
fr: Configuration du module RRDCached : fonctionne seulement avec Centreon Broker
pt_pt: Configuração do modulo RRDCached: Funciona somente com o Centreon Broker

source: Enable RRDCached
es: Habilitar RRDCached
fr: Activer RRDCached
pt_pt: Ativa RRDCached

source: TCP Port
es: Puerto TCP
fr: Port TCP
pt_pt: Porta TCP

source: UNIX Socket path
es: Ruta de acceso de socket Unix
fr: CHemin d'accès au socket Unix
pt_pt: Caminho do Socket UNIX

source: The rrdcached configuration must have a option.
es: La configuración del módulo RRDCached debe tener una opción.
fr: La configuration du module RRDCached doit avoir une option
pt_pt: A configuração do rrdcached deve ter uma opção.

source: Only one option must be set.
es: Solo se puede llenar una opción
fr: Une seule option peut être renseignée
pt_pt: Somente uma opção deve ser configurada

source: The port must be numeric
es: El puerto debe ser digital.
fr: La port doit être numérique
pt_pt: A porta deve ser numerica

source: Can't execute binary
de: Ausführdatei kann nicht ausgeführt werden
es: No se puede ejecutar el programa
fr: Impossible d'exécuter le programme
pt_pt: Não foi possivel executar o binario

source: Impossible to validate, one or more field is incorrect
de: Die Validierung konnte nicht durchgeführt werden. Ein oder mehrere Felder sind fehlerhaft
es: No se puede validar, uno o más campos son incorrectos
fr: Impossible de valider, un ou plusieurs champs sont incorrects
pt_pt: É impossivel validar, um ou mais campos estão incorretos

source: RRDTool Properties
de: RRDTool-Eigenschaften
fr: Propriétés de RRDTool
pt_pt: Propriedades do RRDTool

source: RRDTool Configuration
de: RRDTool-Konfiguration
es: Configuration de RRDTool
fr: Configuration de RRDTool
pt_pt: Configuração do RRDTool

source: Knowledge base url
es: URL para acceder a la base de conocimientos
fr: URL d'accès à la base de connaissance
pt_pt: URL base de Conhecimento

source: Mandatory field
de: Erforderliches Feld
es: campo obligatorio
fr: Champ obligatoire
pt_pt: Campo obrigatorio

source: Knowledge wiki account (with delete right)
de: Knowledge Wiki Benutzerkonto (mit Löschberechtigung)
es: Cuenta de administración de la base de conocimientos con derechos de supresión.
fr: Compte d'administration de la base de connaissance possédant les droits de suppression.
pt_pt: Conta da wiki da base de Conhecimento (com permissão de escrita)

source: Knowledge wiki account password
de: Knowledge Wiki Benutzerkonto Passwort
es: Contraseña de la cuenta de administración.
fr: Mot de passe du compte d'administration
pt_pt: Senha da conta wiki da Base de Conhecimento

source: Ignore ssl certificate
de: SSL-Zertifikat ignorieren
pt_pt: Ignore o certificado ssl

source: impossible to validate, one or more field is incorrect
de: Die Validierung konnte nicht durchgeführt werden. Ein oder mehrere Felder sind fehlerhaft
es: No se puede validar, uno o más campos son incorrectos.
fr: impossible de valider, un ou plusieurs champs sont incorrects
pt_pt: É impossivel validar, um ou mais campos estão incorretos

source: Debug
es: depuración
fr: Débogage
pt_pt: Depuragem

source: Logs Directory
de: Protokollverzeichnis
es: Directorio de registro de jounraux
fr: Répertoire d'enregistrement des jounraux
pt_pt: Diretorio de Registros

source: Authentication debug
de: Authentifizierungsdebugging
es: Registrar las autenticaciones.
fr: Enregistrer les authentifications
pt_pt: Depuração de Autenticação

source: SQL debug
de: SQL-Debugging
es: Guardar consultas SQL
fr: Enregistrer les requêtes SQL
pt_pt: Depuração SQL

source: Monitoring Engine Import debug
de: Monitoring Engine Import Debugging
es: Depuración del motor de supervisión.
fr: Débogage du moteur de supervision
pt_pt: Depuração de importação do motor de monitoramento

source: RRDTool debug
de: RRDTool-Debugging
es: RRDTool Debugging
fr: Débogage RRDTool
pt_pt: Depuração do RRDTool

source: LDAP User Import debug
de: LDAP-Benutzerimport-Debugging
es: Depuración de las importaciones de usuarios LDAP
fr: Débogage de l'import d'utilisateurs LDAP
pt_pt: Depuração de importação de utilizadores LDAP

source: Centreon Gorgone debug
de: Centreon Gorgone-Debugging
es: Depurando de Centreon Gorgone
fr: Débogage de Centreon Gorgone
pt_pt: Depuração do Centreon Gorgone

source: Centreontrapd debug
de: Centreontrapd-Debugging
es: Depuración del motor de procesamiento de capturas SNMP (centreontrapd)
fr: Débogage du moteur de traitement des traps SNMP (centreontrapd)
pt_pt: Depuração do Centreontrapd

source: Can't write in directory
de: In das Verzeichnis konnte nicht geschrieben werden
es: No se puede escribir en el directorio
fr: Impossible d'écrire dans le répertoire
pt_pt: Não é possivel escrever no diretorio

source: Debug Properties
de: Debuggingeigenschaften
es: Propiedades de depuración
fr: Propriétés du débogage
pt_pt: Propriedades de depuração

source: Modify Centcore options
de: Centcore-Optionen bearbeiten
es: Cambiar las opciones de Centcore
fr: Modifier les options de Centcore
pt_pt: Modificar opções do Centcore

source: Enable Broker statistics collection
de: Brokerstatistiksammlung aktivieren
es: Habilitar la recuperación de archivos de estadísticas de componentes de Centreon Broker
fr: Activer la récupération des fichiers de statistiques Broker
pt_pt: Ativa coleção de statisticas do Broker

source: Timeout value for Gorgone commands
de: Timeoutwert für Gorgone-Befehle
es: Tiempo máximo para ejecutar comandos Gorgone.
fr: Temps maximum d'exécution des commandes Gorgone
pt_pt: Tempo máximo para comandos do Gorgone

source: Must be a number
de: Muss eine Zahl sein
es: debe ser un número
fr: doit être un nombre
pt_pt: Deve ser um número

source: Centcore properties
de: Centcore-Eigenschaften
es: Propiedades Centcore
fr: Propriétés de Centcore
pt_pt: Propriedades do Centcore

source: Centcore Options
de: Centcore-Optionen
es: Opciones de proceso Centcore
fr: Options du processus Centcore
pt_pt: Opções do Centcore

source: General information
de: Allgemeine Informationen
es: Información general
fr: Informations générales
pt_pt: Informações Gerais

source: Configuration name
de: Konfigurationsname
es: Nombre de configuración
fr: Nom de la configuration
pt_pt: Nome da configuração

source: Enable LDAP authentication
de: LDAP-Authentifizierung aktivieren
es: Habilitar la autenticación LDAP
fr: Activer l'authentification LDAP
pt_pt: Ativa autenticação LDAP

source: Store LDAP password
de: LDAP-Passwort speichern
es: Copia de seguridad de la contraseña LDAP
fr: Sauvegarde du mot de passe LDAP
pt_pt: Armazena senha do LDAP

source: Auto import users
de: Benutzer automatisch importieren
es: Importación automática de usuarios.
fr: Import automatiques des utilisateurs
pt_pt: Auto importação de utilizadores

source: Use service DNS
de: DNS-Dienst verwenden
es: Usa el servicio DNS
fr: Utiliser le service DNS
pt_pt: Usa serviço de DNS

source: Use SSL connection
es: Usa una conexión SSL
fr: Utiliser une connexion SSL
pt_pt: Use conexão SSL

source: Use TLS connection
es: Utilice una conexión TLS
fr: Utiliser une connexion TLS
pt_pt: Use conexão TLS

source: Alternative domain for ldap
de: Alternative LDAP-Domain
es: Dominio alternativo para ldap
fr: Domaine alternatif pour ldap
pt_pt: Dominio alternativo para LDAP

source: LDAP search size limit
de: LDAP Suchgrößenlimit
es: Limitar el tamaño de la búsqueda LDAP
fr: Taille limite de la recherche LDAP
pt_pt: Tamanho limite para busca no LDAP

source: LDAP search timeout
de: LDAP Suchtimeout
es: Tiempo máximo para realizar la búsqueda LDAP
fr: Temps maximum d'exécution de la recherche LDAP
pt_pt: Tempo máximo para busca no LDAP

source: Contact template
de: Kontakt-Template
es: Modelo de contacto
fr: Modèle de contact
pt_pt: Modelo de Contacto

source: LDAP Information
es: Información LDAP
fr: Informations LDAP
pt_pt: Informações LDAP

source: LDAP Servers
de: LDAP Server
es: Servidores LDAP
fr: Serveurs LDAP
pt_pt: Servidores LDAP

source: Bind user
de: Benutzer für die Verbindung zu LDAP
es: Usuario de dominio
fr: Utilisateur du domaine
pt_pt: Usuário de Dominio

source: Bind password
de: Passwort für die Verbindung zu LDAP
es: Contraseña
fr: Mot de passe
pt_pt: Senha de Dominio

source: Protocol version
de: Protokollversion
es: Versión de protocolo
fr: Version du protocole
pt_pt: Versão do protocolo

source: Template
es: modelo
fr: Modèle
pt_pt: Modelo

source: Search user base DN
de: Basis-DN für die Benutzersuche
es: Base de búsqueda de usuarios DN
fr: Base de recherche d'utilisateur DN
pt_pt: URL de busca de usuário DN

source: Search group base DN
de: Basis-DN für die Gruppensuche
es: Base de búsqueda de grupo DN
fr: Base de recherche de groupe DN
pt_pt: URL de busca de grupo DN

source: User filter
de: Benutzerfilter
es: El filtro de búsqueda para usuarios.
fr: Le filtre de recherche pour les utilisateurs
pt_pt: Filtro de usuário

source: Login attribute
de: Login-Attribut
es: El atributo para el identificador del usuario.
fr: L'attribut pour l'identifiant de l'utilisateur
pt_pt: Atributo de Login
