Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: Authentication
de: Authentifizierung
es: autenticación
fr: Authentification
pt_pt: Autenticação

source: Popup notifications
de: Popup-Benachrichtigungen
es: Notificaciones visuales
fr: Notifications visuelles
pt_pt: Notificações em Janela

source: Sound notifications
de: Audio Benachrichtigungen
es: Notificaciones sonorres
fr: Notifications sonores
pt_pt: Som de notificações

source: API Access Configuration
de: API Zugriffskonfiguration
es: Configurando el acceso a la API
fr: Configuration d'accès à l'API
pt_pt: Configuração do acesso a API

source: Autorized contacts
de: Autorisierte Kontakte
es: Contactos autorizados
fr: Contacts autorisés
pt_pt: Contactos autorizados

source: Proxy options
de: Proxy Optionen
es: Configuraciones de proxy de Internet
fr: Paramètres du proxy internet
pt_pt: Opções de Proxy

source: Chart options
de: Diagrammoptionen
es: Configuracion de graficos
fr: Paramètres des graphiques
pt_pt: Opções de Gráfico

source: Modificaton type
de: Modifikationstyp
es: Tipo de modificación
fr: Type de modification
pt_pt: Tipo de modificação

source: Objets
es: objetos
pt_pt: Objetos

source: Object Name
de: Objektname
es: Nombre del objeto
fr: Nom de l'objet
pt_pt: Nome do Objeto

source: Dissociate this view ?
de: Ansicht dissoziieren?
es: ¿Eliminar la asociación de esta vista?
fr: Supprimer l'associatino de cette vue ?
pt_pt: Desassociar essa visualização ?

source: Dissociate
de: Dissoziieren
es: Eliminar la asociación
fr: Supprimer l'association
pt_pt: Desassociado

source: Partitioning Properties
de: Partitionierungsoptionen
es: Propiedades en particionamiento
fr: Propriétés sur le partitionnement
pt_pt: Propriedades de particionamento

source: Partition name
de: Partitionsname
es: Nombre de particion
fr: Nom de la partition
pt_pt: Nome da Partição

source: Creation time
de: Erstellungszeitpunkt
es: Fecha de creación
fr: Date de création
pt_pt: Data de criação

source: Number of entries
de: Anzahl an Einträgen
es: Número de entradas
fr: Nombre d'entrées
pt_pt: Número de entradas

source: Data size
de: Datengröße
es: Tamaño de los datos
fr: Taille des données
pt_pt: Tamanho dos dados

source: Index size
de: Indexgröße
es: Tamaño del índice
fr: Taille de index
pt_pt: Tamanho do indice

source: Total size
de: Insgesamte Größe
es: Tamaño total
fr: Taille totale
pt_pt: Tamanho total

source: Database Informations
es: Información de la base de datos
fr: Informations de la base de données
pt_pt: Informações do Banco de dados

source: Database Engine
de: Datenbankengine
es: Motor de base de datos
fr: Moteur de la base de données
pt_pt: Motor de Banco de dados

source: Engine Name
es: Nombre del motor de supervisión.
fr: Nom du moteur de supervision
pt_pt: Nome do motor

source: Centreon DataBase Statistics
es: Base de Datos Centreon Estadísticas
fr: Statistiques sur les bases de données de Centreon
pt_pt: Banco de dados de statisticas do Centreon

source: Data free
de: Freier Speicherplatz
es: Espacio libre
fr: Espace libre
pt_pt: Espaço livre

source: Configuration Actions
de: Konfigurationsaktionen
es: Configuración de la acción
fr: Configuration des actions
pt_pt: Configuração de ações

source: Real Name
es: Nombre real
fr: Nom réel
pt_pt: Nome real

source: Expiration date
es: Fin de la fecha de la licencia
fr: Date de fin de licence
pt_pt: Data de expiração

source: Do you confirm the deletion?
es: ¿Confirma usted la eliminación?
fr: Confirmez-vous la suppression ?
pt_pt: Você confirma a remoção?

source: Uninstall Module
es: Desinstalar el módulo
fr: Désinstaller le module
pt_pt: Desinstalar modulo

source: Time Range Exceptions
de: Zeitspannenausnahmen
es: Período de excepción
fr: Période d'exception
pt_pt: Periodo de tempo de exceções

source: Timeperiods
de: Zeiträume
es: Periodos de tiempo
fr: Périodes de temps
pt_pt: Períodos de tempo

source: Advanced settings
de: Fortgeschrittene Einstellungen
es: Configuración avanzada
fr: Paramètres avancés
pt_pt: Configurações avançadas

source: Add new entry
de: Neuen Eintrag hinzufügen
es: Añadir nueva entrada
fr: Ajouter une nouvelle entrée
pt_pt: Adicionar nova entrada

source: Notification options
de: Benachrichtigungsoptionen
es: Opciones de notificación
fr: Options de notification
pt_pt: Opções de notificação

source: Extended Info
de: Erweiterte Informationen
es: Informaciones complementarias
fr: Informations complémentaires
pt_pt: Informações extras

source: Notification status
de: Benachrichtigungsstatus
es: Estado de notificación
fr: Etat de la notification
pt_pt: Estado da Notificação

source: Configuration Files Export
de: Konfigurationsdateienexport
es: Exportar los archivos de configuración del motor de configuración.
fr: Export des fichiers de configuration du moteur de supervision
pt_pt: Exportação de ficheiros de configuração

source: Polling instances
de: Polling-Instanzen
es: Autoridades de cobro
fr: Instances de collecte
pt_pt: Instancias de Coletagem

source: Poller States
es: Estado de coleccionistas
fr: État des collecteurs
pt_pt: Estado dos Coletores

source: Welcome
es: Bienvenida
fr: Bienvenue
pt_pt: Bem vindo

source: Logout
es: Salir
fr: Déconnexion
pt_pt: Desconectar

source: In Downtime
de: In Ausfallszeit
es: El tiempo de parada comenzó
fr: Plage de maintenance démarrée
pt_pt: Em Manutenção

source: Display Chart
de: Diagramm anzeigen
es: Ver gráfico
fr: Afficher le graphique
pt_pt: Mostrar Gráficos

source: Recurrent downtimes
es: Tiempos de parada recurrentes
fr: Plages de maintenance récurrentes
pt_pt: Manutenções recorrentes

source: Plugin Packs
es: Packs de plugins
fr: Packs de plugins
pt_pt: Pacote de Plugins

source: Manager
es: administrador
fr: Gestionnaire
pt_pt: Gerencia

source: Subscription
es: suscripción
fr: Abonnement
pt_pt: Subscrição

source: Platform Status
es: Estado de la plataforma
fr: Statut de la plateforme
pt_pt: Estado da Plataforma

source: Engine Statistics
es: Estadísticas del motor
fr: Statistiques du moteur
pt_pt: Estatísticas do Motor

source: No downtime scheduled
de: Keine Ausfallszeit angesetzt
es: No hay tiempo de inactividad programado
fr: Pas de plage de maintenance programmée
pt_pt: Sem manutenção agendada

source: Add downtime
de: Ausfallszeit hinzufügen
es: Añadir un tiempo de inactividad
fr: Ajouter une plage de maintenance
pt_pt: Adicionar manutenção

source: General informations
de: Allgemeine Informationen
es: Información general
fr: Informations générales
pt_pt: Informações Gerais

source: Could not find storage database. Session probably expired.
es: Base de datos de almacenamiento no encontrada. La sesión probablemente ha expirado.
fr: Base de données de stockage non trouvée. La session a probablement expirée.
pt_pt: Não foi possivel encontrar o banco de dados. A sessão provavelmente expirou.

source: Could not find configuration database. Session probably expired.
es: No se pudo encontrar la base de datos de configuración. La sesión probablemente ha expirado
fr: Impossible de trouver la base de données de configuration. La session a probablement expirée
pt_pt: Não foi possivel encontrar a configurações do banco de dados. A sessão provavelmente expirou.

source: Add open_files_limit=32000 in my.cnf file under the [mysqld] section and restart MySQL Server.
es: Agregue open_files_limit=32000 en el archivo my.cnf en la sección [mysqld] y reinicie el servidor MySQL.
fr: Ajouter la propriété open_files_limit=32000 dans le fichier my.cnf dans l'encart [mysql] et redémarrez le serveur MySQL.
pt_pt: Adicione a propriedade open_files_limit=32000 no ficheiro my.cnf na seção [mysqld] e reinicie o servidor MySQL.

source: Could not find database user. Session probably expired.
es: No se puede encontrar al usuario con acceso a las bases de datos. La sesión probablemente ha expirado
fr: Impossible de trouver l'utilisateur ayant accès aux bases de données. La session a probablement expirée
pt_pt: Não foi possivel encontrar o usuário do banco de dados. A sessão provavelmente expirou.

source: Could not find CENTREON_ETC. Session probably expired.
es: No se encontró la variable CENTREON_ETC. La sesión probablemente ha expirado.
fr: Variable CENTREON_ETC non trouvée. La session a probablement expirée.
pt_pt: Não foi possivel encontrar a variavel CENTREON_ETC . A sessão provavelmente expirou.

source: Database Host Address (default: localhost)
de: Datenbank Hostadresse (Standardwert: localhost)
es: Dirección del host de la base de datos (por defecto: localhost)
fr: Adresse de l'hôte de la base de données (par défaut : localhost)
pt_pt: Endereço do banco de dados (padrão: localhost)

source: Database Port (default: 3306)
de: Datenbankport (Standardwert: 3306)
es: Puerto de acceso a la base de datos (por defecto: 3306)
fr: Port d'accès à la base de données (par défaut : 3306)
pt_pt: Porta do banco de dados (padrão: 3306)

source: Root password
de: Root-Passwort
es: Contraseña de root
fr: Mot de passe root
pt_pt: Senha de root

source: Configuration database name
de: Konfigurationsdatenbankname
es: Nombre de la base de datos de configuración.
fr: Nom de la base de données de configuration
pt_pt: Nome do banco de dados de configuração

source: Storage database name
de: Speicherdatenbankname
es: Nombre de la base de datos de almacenamiento
fr: Nom de la base de données de stockage
pt_pt: Nome do banco de dados de armazenagem

source: Database user name
de: Datenbankbenutzername
es: Nombre del usuario con acceso a la base de datos.
fr: Nom de l'utilisateur ayant accès à la base de données
pt_pt: Nome de usuário do banco de dados

source: Database user password
de: Passwort des Datenbankbenutzers
es: Contraseña del usuario de la base de datos.
fr: Mot de passe de l'utilisateur de la base de données
pt_pt: Senha do usuário de banco de dados

source: Confirm user password
de: Benutzerpasswort bestätigen
es: Confirmar la contraseña del usuario.
fr: Confirmer le mot de passe de l'utilisateur
pt_pt: Confirmar a senha de usuário

source: Broker Module information
es: Información de su agente broker
fr: Information du module broker
pt_pt: Informações do modulo Broker

source: This installer will help you setup your database and your monitoring configuration.
de: Dieser Installationsassistent unterstützt Sie dabei die Datenbank sowie die Überwachungskonfiguration einzurichten.
es: Este instalador le ayudará a configurar su base de datos y la configuración de su supervisión.
fr: Cet installeur vous aidera à paramétrer votre base de données et la configuration de votre supervision.
pt_pt: Este instalador irá lhe ajudar a configurar seu banco de dados e seu ambiente de monitoramento.

source: Confirm password
de: Passwort bestätigen
es: confirmar la contraseña
fr: Confirmer le mot de passe
pt_pt: Confirme a senha

source: First name
de: Vorname
es: primer nombre
fr: Prénom
pt_pt: Primeiro nome

source: Last name
de: Nachname
es: Nombre usual
fr: Nom usuel
pt_pt: Apelido

source: Congratulations, you have successfully installed Centreon!
es: Enhorabuena, ha instalado con éxito Centreon!
fr: Félicitations, vous avez installé avec succès Centreon en version <b>%s</b>.
pt_pt: Parabéns, o Centreon foi instalado com sucesso!

source: Currently installing database and generating cache... please do not interrupt this process.<br/><br/>
es: Instalando las bases de datos y generando el caché... no interrumpa el proceso. <br/> <br/>
pt_pt: Efetuando a instalação do banco de dados e gerando o cache ... por favor não interrompa este processo.<br/><br/>

source: Configuration database
de: Konfigurationsdatenbank
es: Base de datos de configuración
fr: Base de données de configuration
pt_pt: Configuração do banco de dados

source: Storage database
de: Speicherdatenbank
es: Base de datos de almacenamiento
fr: Base de données de stockage
pt_pt: Banco de dados de armazenagem

source: Utils database
es: Base de datos del corredor
fr: Base de données du broker
pt_pt: Utilitários de banco de dados

source: Creating database user
de: Datenbankbenutzer wird angelegt
es: Creación del usuario accediendo a las bases de datos.
fr: Création de l'utilisation accédant aux bases de données
pt_pt: Criando usuário do banco de dados

source: Setting up basic configuration
de: Basiskonfiguration wird erstellt
es: Instalación de la configuración básica.
fr: Installation de la configuration basique
pt_pt: Instalação da configuração básica

source: Setting up configuration file
de: Konfigurationsdatei wird erstellt
es: Instalación de archivos de configuración
fr: Installation des fichiers de configurations
pt_pt: instalação dos ficheiros de configuração

source: Partitioning database tables
de: Datenbanktabellen werden partitioniert
es: Tablas particionadas
fr: Tables partitionnées
pt_pt: Tabelas de partição

source: You are not in an access group
es: No estás en un grupo de acceso
fr: Vous n'êtes pas dans un groupe d'accès
pt_pt: Você não esta no grupo de acesso

source: Knowledge base database name
es: Nombre de la base de datos de conocimiento
fr: Nom de la base de données de connaissance
pt_pt: Nome do banco de dados de Conhecimento

source: Knowledge base database user
es: Cuenta de acceso a la base de datos
fr: Compte d'accès à la base de données
pt_pt: Usuário do banco de dados de Conhecimento

source: Knowledge base Database password
es: Contraseña del usuario que tiene acceso a la base de datos.
fr: Mot de passe de l'utilisateur ayant accès à la base de données
pt_pt: Senha do banco de dados de Conhecimento

source: Knowledge base Database host
es: Dirección de la base de datos
fr: Adresse de la base de données
pt_pt: Endereço do banco de dados de Conhecimento

source: Test DB connection
es: Probar la conexión a la base de datos
fr: Tester la connexion à la base de données
pt_pt: Teste a conexão com o banco de dados

source: Knowledge base Database prefix
es: Prefijo de las tablas de la base de datos
fr: Préfix des tables de la base de données
pt_pt: Prefixo da base do banco de dados de Conhecimento

source: RRDTool database size
es: Duración de la retención de datos en bases de datos RRD
fr: Durée de rétention des données dans les bases RRD
pt_pt: Tamanho do banco de dados do RRDTool

source: Retention Duration for Data in MySQL
es: Duración de la retención de datos en MySQL
fr: Durée de rétention des données dans MySQL
pt_pt: Duração da retenção de dados para o MySQL

source: Retention Duration for Downtimes
es: Periodo de retención tiempo de retención
fr: Durée de rétention des plages de maintenance
pt_pt: Duração da retenção para Manutenções

source: Retention Duration for Comments
es: Periodos de retención de comentarios.
fr: Durées de rétention des commentaires
pt_pt: Duração de Retenção para Comentários

source: Logs retention duration
es: Tiempo de retención de registro
fr: Durée de rétention des journaux
pt_pt: Duração de retenção para registros

source: Reporting retention duration (dashboard)
es: Duración de retención de la información de informes (Panel de control)
fr: Durée de rétention des information de génération de rapports (Tableau de bord)
pt_pt: Duração de rentenção para relatorio (Painel de Controle)

source: Proxy protocol
es: Protocolo proxy de internet
fr: Protocole du proxy Internet
pt_pt: Protocolo Proxy

source: No view available. To create a new view, please click "Add view" button.
de: Keine Ansicht verfügbar. Um eine neue Ansicht hinzuzufügen, klick Sie auf den "Ansicht hinzufügen" Button.
es: No hay vistas disponibles. Para agregar una vista, use el botón "Agregar una vista".
fr: Aucune vue disponible. Pour ajouter une vue, utiliser le bouton "Ajouter une vue".
pt_pt: Nenhuma visão disponível. Para criar uma nova visão, clique no botão "Adicionar visão".

source: Create a view
de: Ansicht erstellen
es: Crear una vista
fr: Créer une vue
pt_pt: Criar uma visão

source: Shared views list
es: Lista de vistas compartidas
fr: Liste des vues partagées
pt_pt: Lista de visões compartilhadas

source: Edit a view
de: Ansicht bearbeiten
es: editar
fr: Éditer
pt_pt: Editar uma visão

source: Locked?
es: Bloqueado?
fr: Verrouillée?
pt_pt: Bloqueado?

source: User List
es: Lista de usuarios
fr: Liste des utilisateurs
pt_pt: Lista de utilizadores

source: User Group List
es: Lista de grupos de usuarios
fr: Liste des groupes utilisateurs
pt_pt: Lista de Grupo de Utilizadores

source: Add a widget
de: Widget hinzufügen
es: Añadir widget
fr: Ajouter widget
pt_pt: Adicionar uma ferramenta

source: Widget Information
es: Información del Widget
fr: Informations sur le Widget
pt_pt: Informação da Ferramenta

source: Service Description Search Key
es: Ingrese el nombre de un servicio
fr: Entrez le nom d'un service
pt_pt: Chave de busca para descrição de Serviço

source: Quick Search
es: Busqueda rapida
fr: Recherche Rapide
pt_pt: Busca Rápida

source: Go
es: Ir
pt_pt: Ir

source: service
es: Servicio
pt_pt: serviço

source: Reset filters
es: Restablecer filtros
fr: Remise à zéro des filtres
pt_pt: Limpa filtros

source: Do you confirm the duplication ?
es: ¿Confirma usted la duplicación?
fr: Confirmez-vous la duplication ?
pt_pt: Confirma a duplicação ?

source: Implied Resources
es: Recursos involucrados
fr: Ressources impliquées
pt_pt: Recursos impliicitos

source: Include Host Groups -> Hosts
es: Incluye grupos de invitados -> anfitriones
fr: Inclus groupes d'hôtes -> hôtes
pt_pt: Inclui Grupos de Host -> Hosts

source: Implied page
es: Páginas involucradas
fr: Pages Impliquées
pt_pt: Página implicita

source: topology_name
es: Nombre de la topología.
fr: Nom de la topologie
pt_pt: Nome da Topologia

source: More Actions
es: Otras acciones
fr: Plus d'actions
pt_pt: Mais ações

source: Valid for an upgrade
es: Válido para una actualización.
fr: Valide pour une mise à jour
pt_pt: Valido para atualização

source: SQL file included
es: Archivo SQL incluido
fr: Fichier SQL inclus
pt_pt: Ficheiro SQL incluido

source: PHP file included
es: Archivo PHP incluido
fr: Fichier PHP inclus
pt_pt: Ficheiro PHP incluido

source: Impossible
es: Imposible
pt_pt: Impossivel

source: Pick a color
es: Elige un color
fr: Choisissez une couleur
pt_pt: Pegar uma cor

source: Initial State Logging Option
es: Registro de estados iniciales.
fr: Journalisation des états initaux
pt_pt: Opção de registro de Estado Inicial

source: VRML Image
es: Imagen VRML
fr: Image VRML
pt_pt: Imagem VRML

source: View a Meta Service indicator
es: Ver un indicador de meta-servicio
fr: Visualiser un indicateur de Méta-Service
pt_pt: Visualizar indicador de Meta-Serviço

source: Enabled HostGroups
es: Habilitar grupo de invitados
fr: Activer le groupe d'hôtes
pt_pt: Ativar Grupos de Host

source: Disabled HostGroups
es: Desactivar el grupo de hosts.
fr: Désactiver le groupe d'hôtes
pt_pt: Desativar Grupos de Hosts

source: Reach API
es: Acceso a la API
fr: Accès à l'API
pt_pt: Alcaçar a API

source: ALL
es: todos
fr: Tous
pt_pt: TODOS

source: Retention path
es: Ruta de los archivos de retención.
fr: Chemin des fichiers de rétention
pt_pt: Caminho de Retenção

source: Mandatory retention path
es: Ruta del archivo de retención requerido
fr: Chemin d'accès du fichier de rétention obligatoire
pt_pt: Caminho de retenção Mandatorio

source: Init System
es: Sistema de inicializacion
fr: Système d'initialisation
pt_pt: Sistema de Inicialização

source: Start time
es: Hora de inicio del programa.
fr: Heure de début
pt_pt: Hora de Inicio

source: Only services and hosts are taken in account in order to calculate this status. If you modify a template, it won't tell you the configuration had changed.
es: Solo se tienen en cuenta los cambios de configuración del host y del servicio para calcular este estado. Si modifica una plantilla, no aparecerá ningún indicador de cambio de configuración.
fr: Seuls les modifications de configuration des hôtes et services sont prisent en compte pour calculer cet état. Si vous modifiez un modèle, aucun indicateur de modification de configuration n’apparaitra.
pt_pt: Apenas serviços e hosts são considerados para calcular esse status. Se você modificar um modelo, ele não informará que a configuração foi alterada.

source: Y/m/d
es: d/m/Y
fr: d/m/Y
pt_pt: d/m/Y

source: Y/m/d G:i
es: d/m/Y G: i
fr: d/m/Y G:i
pt_pt: d/m/Y G:i

source: Right Click here to add an autologin link directly to your bookmarks
es: Haga clic derecho aquí para agregar un enlace de inicio de sesión automático directamente en sus marcadores
fr: Clic droit ici afin d'ajouter un lien de connexion automatique directement dans vos marques-pages
pt_pt: Clique com o botão direito do mouse para adicionar o link de autenticação automatica diretamente no seu bookmarks

source: Please define autologin authentication key in your profile.
es: Por favor, establezca una clave de autorización de inicio de sesión automático en su perfil.
fr: Merci de définir une clé d’autorisation de connexion automatique dans votre profil.
pt_pt: Por favor, defina uma chave de autenticação automatica no seu perfil.

source: Connected Users
es: Usuarios conectados
fr: Utilisateurs connectés
pt_pt: Utilizadores Conectados

source: Y/m/d H:i
es: d/m/Y H: i
fr: d/m/Y H:i
pt_pt: d/m/Y H:i

source: General options
es: Ajustes globales
fr: Paramètres globaux
pt_pt: Opções Globais

source: Job groups
es: Grupos de tareas
fr: Groupes de tâches
pt_pt: Grupos de Tarefa

source: Jobs
es: tareas
fr: Tâches
pt_pt: Tarefas

source: Logos
es: Logotipos
pt_pt: Logotipos

source: Publication rules
es: Reglas de publicación
fr: Règles de publication
pt_pt: Regras de Publicação

source: Report design groups
es: Grupos de plantillas de informes
fr: Groupes de modèles de rapport
pt_pt: Grupos de modelos de relatorio

source: Report designs
es: Plantillas de informes
fr: Modèles de rapport
pt_pt: Modelos de Relatorio

source: Report view
es: Informes de visualización
fr: Visualisation des rapports
pt_pt: Visualização de Relatorio

source: Trash
es: cubo de basura
fr: Poubelle
pt_pt: Lixeira

source: element(s) found
pt_pt: item (s) encontrado (s)

source: Select all
pt_pt: Selecionar tudo

source: Add
pt_pt: Adicionar

source: elements to selection ?
pt_pt: elementos para selecionar?

source: Could not find utils database. Session probably expired.
pt_pt: Não é possível encontrar o banco de dados do Broker. A sessão provavelmente expirou.

source: The installation is now finished. To get further information regarding Centreon please visit the following links
pt_pt: A instalação está completa agora. Para mais informações sobre o Centreon, use os seguintes links

source: Official website
pt_pt: Site oficial

source: Forum
pt_pt: Fórum

source: Bug Tracker
pt_pt: Reportar um erro

source: For professional support subscription please contact the <a href="http://support.centreon.com">Centreon Support Center</a>.
pt_pt: Pour la souscription à un support professionnel, contacter le <a href="http://support.centreon.com">Centre de Support Centreon</a>.

source: Utils database name
pt_pt: Nome do banco de dados em tempo real

source: File read path
pt_pt: Caminho do ficheiro sendo reproduzido

source: File read offset
pt_pt: Índice de leitura de ficheiro

source: File write path
pt_pt: Caminho do ficheiro sendo escrito

source: File write offset
pt_pt: Índice de Gravação de Ficheiro

source: File max size
pt_pt: Tamanho máximo do ficheiro

source: Temporary recovery mode
pt_pt: Ativação do ficheiro temporário

source: Performance broker page work only with Centreon Broker.
pt_pt: A página de desempenho só funciona com o Centreon Broker.

source: Widget Title
pt_pt: Título do Widget

source: Tree Focus
pt_pt: Concentre-se na árvore

source: Metaservices
pt_pt: Meta-Service

source: Split
pt_pt: Separado

source: Length
pt_pt: Size

source: SNMP information
pt_pt: Informação SNMP

source: Global Community
pt_pt: Comunidade global

source: Directory of traps configuration files
pt_pt: Diretório de ficheiros de configuração de trap
