Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: Meta service
es: Servicio meta
fr: Méta-Service
pt_pt: Meta-Serviço

source: Extended Status Information
de: Erweiterte Statusinformationen
es: Información de estado extendida
fr: Informations étendues de statut
pt_pt: Informações Extendidas de Estado

source: Performance Data
de: Leistungsdaten
es: Datos de rendimiento
fr: Données de performance
pt_pt: Dados de Performance

source: Next Check
de: Nächste Überprüfung
es: Siguiente cheque
fr: Prochain contrôle
pt_pt: Próxima Checagem

source: Latency
de: Latenz
es: estado latente
fr: Latence
pt_pt: Latencia

source: Execution Time
de: Ausführungszeit
es: Tiempo de ejecución
fr: Temps d'exécution
pt_pt: Tempo de Execução

source: CRITICAL
de: KRITISCH
es: CRÍTICA
fr: CRITIQUE
pt_pt: CRITICO

source: WARNING
de: WARNUNG
es: ADVERTENCIA
fr: ALERTE
pt_pt: AVISO

source: UNKNOWN
de: UNBEKANNT
es: DESCONOCIDO
fr: INCONNU
pt_pt: DESCONHECIDO

source: Notification Information
de: Benachrichtigungsinformationen
es: Informacion de notificacion
fr: Informations sur la notification
pt_pt: Informação de Notificação

source: Command Options
de: Befehlsoptionen
es: Opciones de orden
fr: Options de la commande
pt_pt: Opções de Comando

source: Check result
de: Überprüfungsergebnis
es: Resultado de control
fr: Résultat du contrôle
pt_pt: Resultado da Checagem

source: Check output
de: Überprüfungsoutput
es: Checkout
fr: Sortie du contrôle
pt_pt: Saída da Checagem

source: Performance data
de: Leistungsdaten
es: Datos de rendimiento
fr: Données de performance
pt_pt: Dados de Performance

source: Delete Problem Acknowledgement
de: Inkenntnisnahme des Problems löschen
es: Elimina el problema
fr: Supprimer l'acquittement du problème
pt_pt: Remove Conhecimento de Problema

source: Acknowledge Host Problem
de: Hostproblem zur Kenntnis nehmen
es: Reconocer los problemas del huésped.
fr: Acquitter les problèmes de l'hôte
pt_pt: Conhecimento de Problemas do Host

source: Y/m/d - H:i:s
de: Y/m/d - h:min:s
es: d/m/Y - H: i: s
fr: d/m/Y - H:i:s
pt_pt: d/m/Y - H:i:s

source: ACKNOWLEDGED
de: ZUR KENNTNIS GENOMMEN
es: ABSUELTO
fr: ACQUITTÉ
pt_pt: CONHECIMENTO

source: Status Details
es: Detalles de estado
fr: Détails des statuts
pt_pt: Detalhes de Estado

source: Ouput
de: Output
es: Estado detallado
fr: Statut détaillé
pt_pt: Saída

source: Next Notification
de: Nächste Benachrichtigung
es: Siguiente notificación
fr: Prochaine notification
pt_pt: Próxima Notificação

source: Is This Host Flapping?
de: Flackern dieser Host?
es: ¿Estado del host bagote?
fr: Est-ce que le statut de hôte bagote ?
pt_pt: O host esta em variação ?

source: Percent State Change
de: Prozentuale Zustandsänderung
es: Porcentaje de cambio de estado
fr: Pourcentage de changement d'état
pt_pt: Porcetagem de Alteração de Estado

source: Host Commands
de: Hostbefehle
es: Ordenes disponibles
fr: Commandes disponibles
pt_pt: Comandos de Host

source: Schedule downtime for this host
de: Ausfallszeit für diesen Host ansetzen
es: Programar una hora de apagado para este host
fr: Planifier une plage de maintenance pour cet hôte
pt_pt: Agendar manutenção para este host

source: Add Comment for this host
de: Kommentar zu diesem Host hinzufügen
es: Agrega un comentario para este anfitrión
fr: Ajouter un commentaire pour cet hôte
pt_pt: Adicionar Comentário para este host

source: Disable all service notifications on this host
de: Alle Servicebenachrichtigungen für diesen Host deaktvieren
es: Deshabilitar todas las notificaciones de servicio para este host
fr: Désactiver toutes les notifications de service pour cet hôte
pt_pt: Desativar todas as notificações de serviço para este host

source: Enable all service notifications on this host
de: Alle Servicebenachrichtigungen für diesen Host aktivieren
es: Habilitar todas las notificaciones de servicio para este host
fr: Activer toutes les notifications de service pour cet hôte
pt_pt: Ativar todas as notificações de serviço para este host

source: Schedule an immediate check of all services on this host
de: Sofortige Überprüfung für alle Services diesen Hosts ansetzen
es: Programe el control inmediato de todos los servicios en este host
fr: Planifier un contrôle immédiat de tous les services sur cet hôte
pt_pt: Agendar checagem imediata para todos os serviços deste host

source: Schedule an immediate check of all services on this host (forced)
de: Sofortige Überprüfung für alle Services diesen Hosts ansetzen (erzwungen)
es: Programar el control inmediato de todos los servicios en este host (Forzado)
fr: Planifier un contrôle immédiat de tous les services sur cet hôte (Forcé)
pt_pt: Agendar checagem imediata de todos os serviços deste host (forçada)

source: Disable all service checks on this host
de: Alle Serviceüberprüfungen für diesen Host deaktivieren
es: Deshabilitar todas las comprobaciones de servicio en este host
fr: Désactiver tous les contrôles de service sur cet hôte
pt_pt: Desativar todas as checagens de serviço deste host

source: Enable all service checks on this host
de: Alle Serviceüberprüfungen für diesen Host aktivieren
es: Habilitar todo el control de servicio en este host
fr: Activer tous les contrôle de services sur cet hôte
pt_pt: Ativar todas as checagens de serviço deste host

source: Acknowledge problem
de: Problem zur Kenntnis nehmen
es: Reconoce el problema
fr: Acquitter le problème
pt_pt: Conhecimento de problema

source: Links
de: Verknüpfungen
es: Vínculos
fr: Liens
pt_pt: Associações

source: Notifications
de: Benachrichtigungen
es: Notificaciones
pt_pt: Notificações

source: Notified
de: Benachrichtigt
es: notificado
fr: Notifié
pt_pt: Notificado

source: Obsess Over Host
de: Host überwachen
es: Verificación de verificación del host
fr: Contrôle de vérification de l'hôte
pt_pt: Controle de Verificação de Host

source: Active Checks
de: Aktive Überprüfungen
es: Controles activos
fr: Contrôles actifs
pt_pt: Checagens Ativas

source: Passive Checks
de: Passive Überprüfungen
es: Controles pasivos
fr: Contrôles passifs
pt_pt: Checagens Passivas

source: Event Handler
es: Gerente de eventos
fr: Gestionnaire d'évènements
pt_pt: Manipulação de Eventos

source: Flap Detection
de: Flackererkennung
es: Detección de estatutos en bagotage.
fr: Détection de bagotage des statuts
pt_pt: Detecção de Variação

source: Acknowledged
de: Zur Kenntnis genommen
es: absueltos
fr: Acquittés
pt_pt: Conhecimento

source: Submit result for this host
de: Ergebnis für diesen Host einreichen
es: Enviar un resultado para este anfitrión
fr: Soumettre un résultat pour cet hôte
pt_pt: Enviar resultado para este host

source: Enable Active Checks
de: Aktive Überprüfungen aktivieren
es: Habilitar controles activos
fr: Activer les contrôles actifs
pt_pt: Ativar Checagens Ativa

source: Disable Active Checks
de: Aktive Überprüfungen deaktivieren
es: Desactivar controles activos
fr: Désactiver les contrôles actifs
pt_pt: Desabilitar Checagens Ativa

source: Enable Passive Checks
de: Passive Überprüfungen aktivieren
es: Habilitar cheques pasivos
fr: Activer les contrôles passifs
pt_pt: Ativar Checagens Passiva

source: Disable Passive Checks
de: Passive Überprüfungen deaktivieren
es: Desactivar las verificaciones pasivas.
fr: Désactiver les contrôles passifs
pt_pt: Desativar Checagens Passiva

source: Enable Host Notifications
de: Hostbenachrichtigungen aktivieren
es: Habilitar notificaciones para el host
fr: Activer les notifications pour l'hôte
pt_pt: Ativar Notificações de Host

source: Disable Host Notifications
de: Hostbenachrichtigungen deaktivieren
es: Deshabilitar notificaciones para el host
fr: Désactiver les notifications pour l'hôte
pt_pt: Desativar Notificações de Host

source: Enable Event Handler
de: Event Handler aktivieren
es: Habilitar administrador de eventos
fr: Activer le gestionnaire d'évènements
pt_pt: Ativar Manipulação de Evento

source: Disable Event Handler
de: Event Handler deaktivieren
es: Deshabilitar administrador de eventos
fr: Désactiver le gestionnaire d'évènements
pt_pt: Desativar Manipulação de Evento

source: Enable Flap Detection
de: Flackererkennung aktivieren
es: Habilitar la detección de estados de bagotage.
fr: Activer la détection de bagotage des statuts
pt_pt: Ativar Detecção de Variação

source: Disable Flap Detection
de: Flackererkennung deaktivieren
es: Desactivar la detección de estados de bagotage.
fr: Désactiver la détection de bagotage des statuts
pt_pt: Desativar Detecção de Variação

source: Enable Obsess Over Host
de: Host überwachen aktivieren
es: Habilitar el seguimiento preciso del host
fr: Activer le suivi précis de l'hôte
pt_pt: Ativar Checagem Pós-Comando do Host

source: Disable Obsess Over Host
de: Host überwachen deaktivieren
es: Deshabilitar el seguimiento preciso del host
fr: Désactiver le suivi précis de l'hôte
pt_pt: Desativar Checagem Pós-Comando do Host

source: View status of all services on host %s
de: Status für alle Services des Hosts %s anzeigen
es: Ver el estado de todos los servicios en el host %s
fr: Voir le statut de tous les services de cet hôte %s
pt_pt: Visualizar estado de todos os serviços do host %s

source: View graphs for host %s
de: Graphen für Host %s anzeigen
es: Ver gráficos para el host %s
fr: Visualiser les graphiques de l'hôte %s
pt_pt: Visualizar gráficos para o host %s

source: Configure host %s
de: Host %s konfigurieren
es: Configurar host %s
fr: Configurer l'hôte %s
pt_pt: Configurar host %s

source: View report for host %s
de: Berichtsdaten für Host %s anzeigen
es: Ver informe para host %s
fr: Visualiser les rapports de l'hôte %s
pt_pt: Visualizar relátorio para o host %s

source: View logs for host %s
de: Protokolle für Host %s anzeigen
es: Ver registros para el host %s
fr: Visualiser les évènements de l'hôte %s
pt_pt: Visualizar registros para o host %s

source: Member of Host Groups
de: Mitglied von Hostgruppen
es: Miembro del grupo de anfitriones.
fr: Membre du groupe d'hôtes
pt_pt: Membro do Grupo de Host

source: Host Categories
de: Hostkategorien
es: Categorias de host
fr: Catégories d'hôte
pt_pt: Categorias do Host

source: Contact groups notified for this host
de: Kontaktgruppen, die für diesen Host benachrichtigt werden
es: Grupos de contacto notificados para este anfitrión
fr: Groupes de contacts notifiés pour cet hôte
pt_pt: Grupos de Contacto notificados por este host

source: Contacts notified for this host
de: Kontakte, die für diesen Host benachrichtigt werden
es: Contactos notificados para este host
fr: Contacts notifiés pour cet hôte
pt_pt: Contactos notificados por este host

source: URL Notes
de: URL Notizen
es: Enlace de información
fr: Lien d'information
pt_pt: URL de Notas

source: Action URL
de: Aktions-URL
es: URL d`action
fr: URL d'action
pt_pt: URL de Ação

source: This host no longer exists in Centreon configuration. Please reload the configuration.
de: Dieser Host existiert nicht mehr in der Centreon Konfiguration. Bitte Laden Sie die Konfiguration neu.
es: Este host no existe en la configuración de Centreon. Por favor, vuelva a cargar la configuración.
fr: Cet hôte n'existe pas dans la configuration Centreon. s'il vous plaît recharger la configuration.
pt_pt: Este host não existe mais na configuração Centreon. Por favor, recarregue a configuração.

source: Submit command?
de: Befehl einreichen?
es: Enviar este pedido?
fr: Soumettre cette commande ?
pt_pt: Enviar comando?

source: Command sent
de: Befehl gesendet
es: Orden enviada
fr: Commande envoyée
pt_pt: Comando enviado

source: Failed to execute command
de: Befehlsausführung fehlgeschlagen
es: No se puede ejecutar el comando
fr: Impossible d'exécuter la commande
pt_pt: Falha ao executar o comando

source: Acknowledge Service Problem
de: Serviceproblem zur Kenntnis nehmen
es: Reconocer el problema del servicio.
fr: Acquitter le problème du service
pt_pt: Conhecimento de Serviços com Problema

source: Meta Service
es: -Servicio meta
fr: Méta-Service
pt_pt: Meta-Serviço

source: on host
de: auf Host
es: en el host
fr: sur l'hôte
pt_pt: no host

source: Extended status information
de: Erweiterte Statusinformationen
es: Información de estado extendida
fr: Informations d'état étendues
pt_pt: Informação Extendida de Estado

source: Last Check Type
de: Letzter Überprüfungstyp
es: Último tipo de verificación
fr: Dernier contrôle de type
pt_pt: Último Tipo de Checagem

source: Next Scheduled Active Check
de: Nächste angesetzte aktive Überprüfung
es: Siguiente control activo planificado
fr: Prochain contrôle actif planifié
pt_pt: Próximo Agendamento de Checagem Ativa

source: Check Duration
de: Überprüfungsdauer
es: Tiempo de ejecución
fr: Temps d'exécution
pt_pt: Duração da Checagem

source: Last Service Notification
de: Letzte Servicebenachrichtigung
es: Última notificación del servicio.
fr: Dernière notification du service
pt_pt: Última Notificação de Serviço

source: Is This Service Flapping?
de: Flackert dieser Service?
es: ¿El estado de la bolsa de servicio?
fr: Est-ce que l'état du service bagote ?
pt_pt: Este Serviço esta Variável ?

source: Tools
de: Werkzeuge
es: instrumentos
fr: Outils
pt_pt: Utilitarios

source: Service Commands
de: Servicebefehle
es: Órdenes de Servicio
fr: Commandes du service
pt_pt: Comandos de Serviço

source: Checks for this service
de: Überprüfungen für diesen Service
es: Controles por este servicio.
fr: Vérifications pour ce service
pt_pt: Checagens para este serviço

source: Re-schedule the next check for this service
de: Nächste Überprüfung für diesen Service neu ansetzen
es: Reprogramar el siguiente cheque para este servicio
fr: Re-planifier le prochain contrôle pour ce service
pt_pt: Reagendar a próxima checagem para este serviço

source: Re-schedule the next check for this service (forced)
de: Nächste Überprüfung für diesen Service neu ansetzen (erzwungen)
es: Reprogramar la próxima verificación para este servicio (Forzado)
fr: Re-planifier le prochain contrôle pour ce service (Forcé)
pt_pt: Reagendar a próxima checagem para este serviço (forçada)

source: Submit result for this service
de: Ergebnis für diesen Service einreichen
es: Enviar un resultado para este servicio
fr: Soumettre un résultat pour ce service
pt_pt: Enviar resultado para este serviço

source: Schedule downtime for this service
de: Ausfallszeit für diesen Service ansetzen
es: Programar una parada para este servicio.
fr: Planifier une plage de maintenance pour ce service
pt_pt: Agendar manutenção para este serviço

source: Add a comment for this service
de: Einen Kommentar zu diesem Service hinzufügen
es: Añadir un comentario para este servicio.
fr: Ajouter un commentaire pour ce service
pt_pt: Adicionar comentário para este serviço

source: Obsess Over Service
de: Service überwachen
es: Ejecutar un comando de control posterior
fr: Exécuter une commande post contrôle
pt_pt: Executar comando após checagem de Serviço

source: All Comments for this service
de: Alle Kommentare zu diesem Service
es: Todos los comentarios de este servicio.
fr: Tous les commentaires de ce service
pt_pt: Todos os comentários deste serviço

source: Executed Check Command Line
de: Ausgeführter Überprüfungskommandozeilenbefehl
es: Comando ejecutado por el motor.
fr: Commande exécutée par le moteur
pt_pt: Linha de Comando executada pela Checagem

source: Service Notifications
de: Servicebenachrichtigungen
es: Notificaciones de servicio
fr: Notifications du service
pt_pt: Notificações de Serviço

source: Enable Service Notifications
de: Servicebenachrichtigungen aktivieren
es: Habilitar notificaciones de servicio
fr: Activer les notifications du service
pt_pt: Ativar Notificações de Serviço

source: Disable Service Notifications
de: Servicebenachrichtigungen deaktivieren
es: Deshabilitar notificaciones de servicio
fr: Désactiver les notifications du service
pt_pt: Desativar Notificações de Serviço

source: Enable Obsess Over Service
de: Service überwachen aktivieren
es: Habilitar el comando post control
fr: Activer la commande post contrôle
pt_pt: Ativar Checagem Pós-comando

source: Disable Obsess Over Service
de: Service überwachen deaktivieren
es: Deshabilita el comando de control posterior
fr: Désactiver la commande post contrôle
pt_pt: Desativar Checagem Pós-comando

source: Active
de: Aktiv
es: bienes
fr: Actif
pt_pt: Ativo

source: Passive
de: Passiv
es: pasivo
fr: Passif
pt_pt: Passivo

source: Status Graph
es: Tabla de estado
fr: Graphique des statuts
pt_pt: Gráfico de Estado

source: Detailed Graph
de: Detaillierter Graph
es: Tabla detallada
fr: Graphique détaillé
pt_pt: Gráfico Detalhado

source: Contact groups notified for this service
de: Kontaktgruppen, die für diesen Service benachrichtigt werden
es: Grupos de contacto notificados para este servicio.
fr: Groupes de contacts notifiés pour ce service
pt_pt: Grupos de Contacto notificados por este serviço

source: Contacts notified for this service
de: Kontakte, die für diesen Service benachrichtigt werden
es: Contactos notificados para este servicio.
fr: Contacts notifiés pour ce service
pt_pt: Contactos notificados por este serviço

source: Service groups
de: Servicegruppen
es: Grupos de servicio
fr: Groupes de services
pt_pt: Grupos de Serviço

source: Service Categories
de: Servicekategorien
es: Categorias de servicio
fr: Catégories de service
pt_pt: Categorias de Serviço

source: Host Shortcuts
de: Hostabkürzungen
es: Atajo de host
fr: Racourcis d'hôte
pt_pt: Atalhos de Host

source: Service Shortcuts
de: Serviceabkürzungen
es: Atajos de servicio
fr: Raccourcis de service
pt_pt: Atalhos de Serviço

source: All Services
de: Alle Services
es: Todos los servicios
fr: Tous les services
pt_pt: Todos os Serviços

source: Configure host
de: Host konfigurieren
es: Configurar el host
fr: Configurer l'hôte
pt_pt: Configura Host

source: Configure service
de: Service konfigurieren
es: Configurar el servicio
fr: Configurer le service
pt_pt: Configura Serviço

source: View report for service %s
de: Berichtsdaten für Service %s anzeigen
es: Ver informe para servicio %s
fr: Visualiser le rapport pour le service %s
pt_pt: Visualizar relatorio para serviço %s

source: View host status page
de: Host Statusseite anzeigen
es: Ver la página de detalles del anfitrión.
fr: Visualiser la page de détails de l'hôte
pt_pt: Visualizar página de estado do host

source: View logs for service %s
de: Protokolle für Service %s anzeigen
es: Ver registros para el servicio%s
fr: Visualiser les journaux pour le service %s
pt_pt: Visualizar registros para o serviço %s

source: The related host no longer exists in Centreon configuration. Please reload the configuration.
de: Der Host, zu dem eine Beziehung besteht, existiert nicht mehr in der Centreon Konfiguration. Bitte Laden Sie die Konfiguration neu.
es: El host no existe en la configuración de Centreon. Por favor, vuelva a cargar la configuración.
fr: L'hôte n'existe pas dans la configuration Centreon. s'il vous plaît recharger la configuration.
pt_pt: O host relacionado não existe mais na configuração do Centreon. Por favor, recarregue a configuração.

source: Host list
de: Hostliste
es: anfitriones
fr: Hôtes
pt_pt: Lista de Host

source: Add a Virtual Metric
de: Virtuelle Metrik hinzufügen
es: Añadir una métrica virtual
fr: Ajouter une métrique virtuelle
pt_pt: Adcionar uma métrica Virtual

source: Modify a Virtual Metric
de: Virtuelle Metrik bearbeiten
es: Modificar una métrica virtual
fr: Modifier une Métrique Virtuelle
pt_pt: Modificar uma métrica Virtual

source: View a Virtual Metric
de: Virtuelle Metrik anzeigen
es: Ver una métrica virtual
fr: Voir une Métrique Virtuelle
pt_pt: Visualizar uma métrica Virtual

source: RPN Function
de: RPN-Funktion
es: Función RPN
fr: Fonction RPN
pt_pt: Função RPN

source: Metric Name
de: Metrikname
es: Nombre de la métrica
fr: Nom de la métrique
pt_pt: Nome da metrica

source: Choose a service if you want a specific virtual metric for it.
de: Wählen Sie einen Service aus, wenn Sie eine spezifische virtuelle Metrik für diesen möchten.
es: Seleccione un servicio para definir una métrica virtual para este último.
fr: Selectionner un service pour définir une métrique virtuelle pour ce dernier.
pt_pt: Escolha um serviço se você quiser uma métrica virtual específica para ele.

source: Linked Host Services
de: Verknüpfte Host Services
es: Servicios alojados
fr: Services d'hôte liés
pt_pt: Serviços de Host associados

source: DEF Type
de: DEF Typ
es: Tipo DEF
fr: Type DEF
pt_pt: Tipo de DEF

source: RPN (Reverse Polish Notation) Function
de: RPN (Reverse Polish Notation) Funktion
es: Función RPN (Notación Polaca Inversa)
fr: Fonction RPN (Notation Polonaise Inversée)
pt_pt: Função RPN (Notação Reversa Polonesa)

source: <br><i><b><font color="#B22222">Notes </font>:</b></i><br>&nbsp;&nbsp;&nbsp;- Do not mix metrics of different sources.<br>&nbsp;&nbsp;&nbsp;- Only aggregation functions work in VDEF rpn expressions.
de: <br><i><b><font color="#B22222">Notizen </font>:</b></i><br>&nbsp;&nbsp;&nbsp;- Vermischen Sie keine Metriken aus verschiedenen Quellen.<br>&nbsp;&nbsp;&nbsp;- In VDEF RPN Ausdrücken funktionieren ausschließlich Aggregationsfunktionen.
es: <br><i><b><font color="#B22222"> Notas </font>:</b></i><br>&nbsp;&nbsp;&nbsp; - No mezcle métricas de diferentes fuentes. <br> &nbsp;&nbsp;&nbsp; - Solo las funciones de agregación funcionan en expresiones rpn VDEF.
fr: <br><i><b><font color="#B22222">Notes </font>:</b></i><br>&nbsp;&nbsp;&nbsp;- Ne pas mélanger les métriques de différentes sources.<br>&nbsp;&nbsp;&nbsp;- Seules les fonctions d'agrégation fonctionnent avec les expressions VDEF.
pt_pt: <br><i><b><font color="#B22222">Notas </font>:</b></i><br>&nbsp;&nbsp;&nbsp;- Não misture métricas de diferentes fontes.<br>&nbsp;&nbsp;&nbsp;- Somente funções de agregação funcionam em expressões rnp em VDEF.

source: Metric Unit
de: Metrikeinheit
es: Unidad de la métrica / curva
fr: Unité de la métrique / courbe
pt_pt: Unídade de Métrica

source: Warning Threshold
de: Grenzwert für Warnung
es: Nivel de alerta
fr: Niveau d'alerte
pt_pt: Nível de Alerta

source: Critical Threshold
de: Grenzwert für Kritisch
es: Nivel critico
fr: Niveau critique
pt_pt: Nível de Criticidade

source: Hidden Graph And Legend
de: Ausgeblendeter Graph und Legende
es: Oculta el gráfico y la leyenda.
fr: Masquer le graphique et la légende
pt_pt: Ocultar Gráfico e Legenda

source: Required service
de: Erforderlicher Service
es: Servicio requerido
fr: Service requis
pt_pt: Serviço Requerido

source: Name already in use for this Host/Service
de: Dieser Name wird bereits bei diesem Host/Service verwendet
es: Nombre ya utilizado para este host / servicio
fr: Nom déjà utilisé pour cet hôte/service
pt_pt: Nome já esta em uso para este Host/Serviço

source: Can't Use This Virtual Metric '
de: Diese virtuelle Metrik kann nicht verwendet werden '
es: No se puede utilizar esta métrica virtual `
fr: Impossible d'utiliser cette métrique virtuelle '
pt_pt: Não foi possível usar esta Métrica Virtual '

source: Required fields
de: Benötigte Felder
es: Campos obligatorios
fr: Champs requis
pt_pt: Campos requeridos

source: Properties
de: Eigenschaften
es: propiedades
fr: Propriétés
pt_pt: Propriedades

source: Graphs
de: Graphen
es: gráficos
fr: Graphiques
pt_pt: Gráficos

source: Unit
de: Einheit
es: unidad
fr: Unité
pt_pt: Unidade

source: Function
de: Funktion
es: función
fr: Fonction
pt_pt: Função

source: Data Count
de: Datenanzahl
es: Numero de datos
fr: Nombre de données
pt_pt: Contadores de Dados

source: Hidden
de: Versteckt
es: Caché
fr: Caché
pt_pt: Oculto

source: Last 3 Hours
de: Letzte 3 Stunden
es: Últimas 3 horas
fr: Les 3 dernières heures
pt_pt: Últimas 3 Horas

source: Last 6 Hours
de: Letzte 6 Stunden
es: Últimas 6 horas
fr: Les 6 dernières heures
pt_pt: Últimas 6 Horas

source: Last 12 Hours
de: Letzte 12 Stunden
es: Últimas 12 horas
fr: Les 12 dernières heures
pt_pt: Últimas 12 Horas
