Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: ServiceGroup
de: Servicegruppe
es: Grupo de servicio
fr: Groupe de services
pt_pt: Grupo de Serviços

source: OK Time
es: Tiempo de estado ok
fr: Temps état OK
pt_pt: Tempo em OK

source: OK Mean Time
es: OK (hora conocida)
fr: OK (Temps connu)
pt_pt: OK (Tempo médio)

source: OK Alerts
es: Alertas OK
fr: Alertes OK
pt_pt: Alertas OK

source: WARNING Time
es: Estado tiempo ADVERTENCIA
fr: Temps état WARNING
pt_pt: Tempo em AVISO

source: WARNING Mean Time
es: ADVERTENCIA
fr: WARNING (Temps connu)
pt_pt: AVISO (Tempo Médio)

source: WARNING Alerts
es: Alertes ADVERTENCIA
fr: Alertes WARNING
pt_pt: Alertas de AVISO

source: CRITICAL Time
es: Estado del tiempo CRÍTICO
fr: Temps état CRITICAL
pt_pt: Tempo em CRITICO

source: CRITICAL Mean Time
es: CRÍTICO (tiempos conocidos)
fr: CRITICAL (Temps connu)
pt_pt: CRITICO (Tempo Médio)

source: CRITICAL Alerts
es: Alertas criticas
fr: Alertes CRITICAL
pt_pt: Alertas de CRITICO

source: UNKNOWN Time
es: Estado de tiempo DESCONOCIDO
fr: Temps état UNKNOWN
pt_pt: Tempo em DESCONHECIDO

source: UNKNOWN Mean Time
es: DESCONOCIDO (tiempo conocido)
fr: UNKNOWN (Temps connu)
pt_pt: DESCONHECIDO (Tempo Médio)

source: UNKNOWN Alerts
es: Alertas UNKNOWN
fr: Alertes UNKNOWN
pt_pt: Alertas de DESCONHECIDO

source: UNDETERMINED Time
es: INDETERMINADO estado tiempo
fr: Temps état INDÉTERMINÉ
pt_pt: Tempo em INDETERMINADO

source: UNDETERMINED Mean Time
es: INDETERMINADO (tiempo conocido)
fr: INDÉTERMINÉ (Temps connu)
pt_pt: INDETERMINADO (Tempo Médio)

source: UNDETERMINED Alerts
es: Alertas no definidas
fr: Alertes UNDETERMINED
pt_pt: Alertas de INDERTEMINADO

source: OK Alert
es: Alerta ok
fr: Alerte OK
pt_pt: Alertas em OK

source: Warning Mean Time
es: ADVERTENCIA
fr: WARNING (Temps connu)
pt_pt: AVISO (Tempo Médio)

source: Warning Alert
es: Advertencia Alerte
fr: Alerte Warning
pt_pt: Alertas de AVISO

source: Unknown Mean Time
es: DESCONOCIDO (tiempo conocido)
fr: INCONNU (Temps connu)
pt_pt: DESCONHECIDO (Tempo Médio)

source: Unknown Alert
es: Alerta desconocida
fr: Alerte Inconnu
pt_pt: Alertas de DESCONHECIDO

source: Critical Mean Time
es: Crítico (tiempo conocido)
fr: Critique (Temps connu)
pt_pt: Critico (Tempo Médio)

source: Critical Alert
es: Alerta crítica
fr: Alerte Critique
pt_pt: Alertas de Critico

source: Hosts Group
es: Grupo de invitados
fr: Groupe d'hôtes
pt_pt: Grupo de Hosts

source: Up Time
es: Tiempo del estado disponible
fr: Temps état disponible
pt_pt: Tempo Disponivel

source: Up Mean Time
de: Durchschnittliche verfügbar-Zeit
es: Disponible (tiempo conocido)
fr: Disponible (Temps connu)
pt_pt: Disponivel (Tempo Médio)

source: Up Alerts
es: Alertes Disponible
fr: Alertes Disponible
pt_pt: Alertas de Disponível

source: Down Time
es: Estado de tiempo no disponible
fr: Temps état indisponible
pt_pt: Tempo em Indisponível

source: Down Mean Time
de: Durchschnittliche Down-Zeit
es: No disponible (hora conocida)
fr: Indisponible (Temps connu)
pt_pt: Indisponível (Tempo Médio)

source: Down Alerts
es: Alertas no disponibles
fr: Alertes Indisponible
pt_pt: Alertas de Indisponível

source: Unreachable Time
es: Estado de tiempo inalcanzable
fr: Temps état Injoignable
pt_pt: Tempo em Inalcançável

source: Unreachable Mean Time
de: Durchschnittliche nicht erreichbar-Zeit
es: Inalcanzable (tiempo conocido)
fr: Injoignable (Temps connu)
pt_pt: Inalcançável (Tempo Médio)

source: Unreachable Alerts
es: Alertas no deseadas
fr: Alertes Injoignable
pt_pt: Alertas de Inalcançável

source: Undetermined Time
es: Tiempo de estado indeterminado
fr: Temps état Indterminé
pt_pt: Tempo em Indeterminável

source: Up Alert
de: Verfügbar Alert
es: Alerte Disponible
fr: Alerte Disponible
pt_pt: Alerta de Disponível

source: Down Alert
es: Alerta no disponible
fr: Alerte Indisponible
pt_pt: Alerta de Indisponível

source: Unreachable Alert
de: Nicht erreichbar Alert
es: Alerta inseparable
fr: Alerte Injoignable
pt_pt: Alerta de Inalcançável

source: Service group state
de: Servicegruppenzustand
es: Estado del grupo de servicio
fr: Etat du groupe de services
pt_pt: Estado do Grupo de Serviço

source: Detection by browser
de: Erkennung durch den Browser
es: Detección del navegador
fr: Détection via le navigateur
pt_pt: Detecção pelo o navegador

source: Active Color
de: Aktive Farbe
es: Color activo
fr: Couleur active
pt_pt: Cor Ativa

source: New Color
de: Neue Farbe
es: Nuevo color
fr: Nouvelle couleur
pt_pt: Nova Cor

source: Session is expired
de: Session ist abgelaufen
pt_pt: Sessão expirada

source: Connection Successful
de: Verbindung erfolgreich
pt_pt: Conexão bem sucedida

source: Widget Preferences for %s
de: Widget Präferenzen für %s
es: Preferencias de widgets para %s
fr: Préférences du Widget pour %s
pt_pt: Preferencias de ferramenta para %s

source: Widget Preferences
de: Widget Präferenzen
es: Preferencias de widgets
fr: Préférences du widget
pt_pt: Preferencias de ferramenta

source: Could not establish connection to Centreon IMP servers (
de: Es konnte keine Verbindung zu den Centreon IMP Servern hergestellt werden (
pt_pt: Não foi possível estabelecer conexão com os servidores IMP Centreon (

source: You're not authorized to access poller data
de: Sie haben keine Berechtigungen für den Zugriff auf Pollerdaten
pt_pt: Você não está autorizado a acessar os dados do poller

source: Add view
de: Ansicht hinzufügen
es: Añadir una vista
fr: Ajouter une vue
pt_pt: Adicionar visão

source: This view name is required
de: Dieser Ansichtsname wird benötigt
es: El nombre de la vista es obligatorio.
fr: Le nom de la vue est obligatoire
pt_pt: O nome da visão é requerido

source: Edit view
de: Ansicht bearbeiten
es: editar
fr: Éditer
pt_pt: Editar visão

source: Delete view
de: Ansicht löschen
es: eliminar
fr: Supprimer
pt_pt: Remover visão

source: Set default
de: Standard festlegen
es: Establecer como predeterminado
fr: Configurer par défaut
pt_pt: Configurar por padrão

source: Share view
de: Ansicht teilen
es: Comparte la vista
fr: Partager la vue
pt_pt: Compartilhar visão

source: Viewers
de: Anseher
es: Personas con acceso visual.
fr: Personnes ayant accès en visualisation
pt_pt: Visualizadores

source: Viewers group
de: Ansehergruppe
es: Grupos con acceso visual.
fr: Groupes ayant accès en visualisation
pt_pt: Grupo de visualizadores

source: Add viewer / viewer group
de: Anseher(gruppe) hinzufügen
es: Añadir usuarios / grupos de usuarios
fr: Ajouter utilisateurs / groupes d'utilisateurs
pt_pt: Adicionar visualizador / grupo de visualizadores

source: Add widget
de: Widget hinzufügen
es: Añadir widget
fr: Ajouter widget
pt_pt: Adicionar ferramenta

source: Rotation
es: Rotación
pt_pt: Rotação

source: Set this view as your default view
de: Diese Ansicht als Standardansicht festlegen
es: ¿Configurar esta vista como la predeterminada?
fr: Configurer cette vue comme celle par défaut ?
pt_pt: Configurar essa visão como sua visão padrão ?

source: Export CSV
de: CSV exportieren
es: Exportadores en formato CSV
fr: Exporter au format CSV
pt_pt: Exportar formato CSV

source: Export XML
de: XML exportieren
pt_pt: Exporter au format XML

source: Virtual metrics
de: Virtuelle Metriken
es: Métricas / curvas virtuales
fr: Métriques/courbes virtuelles
pt_pt: Metricas virtuais

source: Curve
de: Kurve
es: curvas
fr: Courbes
pt_pt: Curva

source: UI notifications
de: UI-Benachrichtigungen
pt_pt: Notificações Interface

source: Performance Data Management
de: Leistungsdatenverwaltung
es: Gestión de datos de rendimiento.
fr: Gestion des données de performance
pt_pt: Gerenciamento de dados de performance

source: LDAP Server
es: Servidor LDAP
fr: Serveur LDAP
pt_pt: Servidor LDAP

source: Skin Menu Selection
de: Skin-Menü Auswahl
es: Seleccionando la apariencia de los menús.
fr: Sélection de l'apparence des menus
pt_pt: Seleção de aparencia dos menus

source: CSS configuration
de: CSS Konfiguration
es: CSS de configuración
fr: Configuration CSS
pt_pt: Configuração CSS

source: ACL Menu
de: Zugriffssteuerungslistenmenü (ACL Menü)
es: Grupo de acceso al menú
fr: Groupe d'accès aux menus
pt_pt: Menu de permissionamento (ACL)

source: ACL Resource
de: Zugriffssteuerungslistenressource (ACL Ressource)
es: Grupo de acceso a recursos
fr: Groupe d'accès aux ressources
pt_pt: Recursos de permissionamento (ACL)

source: ACL Actions
de: Zugriffssteuerungslistenaktionen (ACL Aktionen)
es: Grupo de acceso a la equidad
fr: Groupe d'accès aux actions
pt_pt: Ações de permissionamento (ACL)

source: ACL Group
de: Zugriffssteuerungslistengruppe (ACL Gruppe)
es: Grupo de control de acceso
fr: Groupe de contrôle d'accès
pt_pt: Grupo de permissionamento (ACL)

source: Media
de: Medien
es: medios de comunicación
fr: Médias
pt_pt: Média

source: Service Statuses
de: Servicestatus
pt_pt: Statuts de services

source: Performances
de: Leistungsübersicht
es: Información de rendimiento
fr: Informations de performance
pt_pt: Informações de Performance

source: Host Information
de: Host Informationen
es: Información sobre el anfitrión
fr: Informations sur l'hôte
pt_pt: Informações de Host

source: Host commands and shortcuts
de: Hostbefehle und -abkürzungen
es: Comandos y atajos
fr: Commandes et racourcis d'hôte
pt_pt: Comandos e atalhos de Host

source: Entry time
de: Eintragszeit
es: Fecha de generacion
fr: Date de génération
pt_pt: Data de criação

source: Authors
de: Autoren
es: autores
fr: Auteurs
pt_pt: Autores

source: Started
de: Gestartet
es: comenzado
fr: Démarré
pt_pt: Iniciado

source: Cancelled
de: Abgebrochen
es: cancelado
fr: Annulé
pt_pt: Cancelado

source: Actual End
de: Tatsächliches Ende
es: Fin actual
fr: Fin Actuelle
pt_pt: Fim atual

source: No downtime scheduled for services
de: Für Services sind keine Ausfallszeiten angesetzt
pt_pt: Sem manutenções agendadas para os serviços

source: Snmp Traps
es: Trampas SNMP
fr: Traps SNMP
pt_pt: Traps SNMP

source: Contact group
de: Kontaktgruppe
es: Grupo de contactos
fr: Groupe de contacts
pt_pt: Grupo de contactos

source: Snmp trap Groups
de: SNMP-Trapgruppen
es: Grupo de trampas SNMP
fr: Groupe de traps SNMP
pt_pt: Grupo de traps SNMP

source: Host category
de: Hostkategorie
pt_pt: Categoria do Host

source: Informations
de: Informationen
es: información
pt_pt: Informações

source: Impacted Resources
de: Betroffene Ressourcen
es: Recursos impactados
fr: Ressources impactées
pt_pt: Recursos impactados

source: Escalation
de: Eskalation
es: Escalada de la notificación
fr: Escalade de notification
pt_pt: Escala

source: Service category
de: Servicekategorie
pt_pt: Categoria do Serviço

source: Service Scheduling Options
de: Serviceplanungsoptionen
es: Opciones de orden de servicio
fr: Options d'ordonnancement des services
pt_pt: Opções de agendamento de Serviço

source: Service template
es: Modelo de servicio
fr: Modèle de service
pt_pt: Modelo de serviço

source: Service dependency
de: Serviceabhängigkeit
es: Dependencia del servicio
fr: Dépendance de service
pt_pt: Dependencia de Serviço

source: Snmp trap manufacturer
de: SNMP-Trap Hersteller
es: Generador de trampas SNMP
fr: Constructeur de traps SNMP
pt_pt: Construtores de trap de SNMP

source: Host template
es: Plantilla de host
fr: Modèle d'hôte
pt_pt: Modelo de Host

source: Hostgroup dependency
de: Hostgruppenabhängigkeit
es: Dependencia del grupo de anfitriones.
fr: Dépendance de groupe d'hôtes
pt_pt: Dependencia de grupo de Hosts

source: Meta-service dependency
de: Meta-Serviceabhängigkeit
es: Dependencia de los meta-servicios.
fr: Dépendance de méta-services
pt_pt: Dependencia de Meta-Serviço

source: Host basic information
de: Grundlegende Informationen zum Host
es: Información básica sobre el host.
fr: Information de base sur l'hôte
pt_pt: Informações básicas do Host

source: Host check options
de: Host-Überprüfungsoptionen
es: Opciones de control de host
fr: Options de contrôle de l'hôte
pt_pt: Opções de checagem do Host

source: Scheduling options
de: Planungsoptionen
es: Opciones de programación
fr: Options d'ordonnancement
pt_pt: Opções de agendamento

source: Notification receivers
de: Empfänger von Benachrichtigungen
es: Personas que reciben notificaciones.
fr: Personnes recevant les notifications
pt_pt: Notificações de receptores

source: Host dependency
de: Hostabhängigkeit
es: Dependencia del anfitrión
fr: Dépendance d'hôte
pt_pt: Dependencia do Host

source: Servicegroup dependency
de: Servicegruppenabhängigkeit
es: Dependencia del grupo de servicio
fr: Dépendance de groupe de services
pt_pt: Dependencia de Grupo de Serviços

source: Timeperiod
de: Zeitraum
es: Periodo de tiempo
fr: Période de temps
pt_pt: Período de tempo

source: Basic Settings
de: Grundlegende Einstellungen
es: Opciones basicas
fr: Options basiques
pt_pt: Configurações Básicas

source: Inclusion
de: Inklusion
pt_pt: Inclusão

source: Time Range exceptions
de: Zeitspannenausnahmen
es: Período de excepción
fr: Période d'exception
pt_pt: Exceções de Período de tempo

source: You must set a poller for generate configuration.
de: Sie müssen einen Poller festlegen, damit die Konfiguration erstellt werden kann.
pt_pt: Você deve configurar um coletor para gerar configuração.

source: Back to Centreon Broker configuration menu
de: Zurück zum Centreon Broker Konfigurationsmenü
es: Regresar al menú de Centreon Broker
fr: Revenir au menu de Centreon Broker
pt_pt: Retorna ao menu de configuração do Centreon Broker

source: Previous
de: Zurück
es: anterior
fr: Précédant
pt_pt: Anterior

source: Next
de: Weiter
es: Próximo
fr: Suivant
pt_pt: Próximo

source: Finish
de: Abschließen
es: acabado
fr: Terminer
pt_pt: Terminado

source: Downtime
de: Ausfallszeit
fr: Plage de maintenance
pt_pt: Manutenção

source: Post-Restart command
de: Post-Neustart Befehl
es: Comando ejecutado post-generación.
fr: Commande exécutée post-génération
pt_pt: Comando de pós-reinicio

source: Monitoring engine config
de: Monitoring Engine Konfiguration
es: Configuración del motor de supervisión.
fr: Configuration du moteur de supervision
pt_pt: Configuração do motor de monitoramento

source: Resource
de: Ressource
es: recurso
fr: Ressource
pt_pt: Recurso

source: + Add a new entry
de: + Neuen Eintrag hinzufügen
es: + Añadir nueva entrada
fr: + Ajouter une nouvelle entrée
pt_pt: + Adicionar uma nova entrada

source: Nothing here, use the "Add" button
de: Nichts gefunden, verwenden Sie den "Hinzufügen" Button
es: Nada que mostrar, use el botón "Agregar"
fr: Rien à afficher, utiliser le bouton "Add"
pt_pt: Nenhum conteúdo, use o botão "Adicionar"

source: Dependency check up
de: Abhängigkeitsprüfung
es: Verificación de dependencias
fr: Vérification des dépendances
pt_pt: Checagem de dependencias

source: Module name
de: Modulname
es: Nombre del modulo
fr: Nom du module
pt_pt: Nome do modulo

source: File
de: Datei
es: expediente
fr: Fichier
pt_pt: Ficheiro

source: Loaded
de: Geladen
es: cargado
fr: Chargé
pt_pt: Carregado

source: Not loaded
de: Nicht geladen
es: No cargado
fr: Non chargé
pt_pt: Não carregado

source: Set the default timezone in php.ini file
de: Legen Sie die Standardzeitzone in der php.ini Datei fest
es: Establecer la zona horaria predeterminada en el archivo php.ini
fr: Définir le fuseau horaire par défaut dans le fichier php.ini
pt_pt: Configure o fuso horário padrão no ficheiro php.ini

source: Not initialized
de: Nicht initialisiert
es: No inicializado
fr: Non initialisé
pt_pt: Não inicializado

source: Centreon Upgrade
es: Actualizar Centreon
fr: Mise à jour de Centreon
pt_pt: Atualização do Centreon

source: You are about to upgrade Centreon.
de: Sie sind im Begriff ein Upgrade von Centreon durchzuführen.
es: Estás a punto de actualizar Centreon.
fr: Vous êtes sur le point de mettre à jour Centreon.
pt_pt: Você esta prestes a atualizar o Centreon.

source: The entire process should take around ten minutes.
de: Der vollständige Prozess nimmt ca. zehn Minuten in Anspruch.
es: Todo el proceso debe tomar unos diez minutos.
fr: Le processus complet devrait prendre environ dix minutes.
pt_pt: O processo completo deve levar em torno de 10 minutos.

source: It is strongly recommended to make a backup of your databases before going any further.
de: Es wird dringend empfohlen, eine Sicherung der Datenbank zu erstellen, bevor der Prozess fortgesetzt wird.
es: Se recomienda encarecidamente realizar una copia de seguridad de sus bases de datos antes de continuar.
fr: Il est fortement recommandé de faire une sauvegarde de vos bases de données avant d'aller plus loin.
pt_pt: É extremamente recomendável que você faça uma cópia de segurança dos seus bancos de dados antes de fazer qualquer coisa.

source: Configuration file not found.
de: Konfigurationsdatei nicht gefunden.
es: Archivo de configuración no encontrado.
fr: Fichier de configuration non trouvé.
pt_pt: Ficheiro de configuração não encontrado.

source: Release notes
de: Veröffentlichungsnotizen
es: Notas de lanzamiento
fr: Notes de version
pt_pt: Notas de lançamento

source: Everything is ready !
de: Alle Vorbereitungen wurden abgeschlossen!
es: Todo está listo !
fr: Tout est prêt !
pt_pt: Está tudo pronto !

source: Your Centreon Platform is about to be upgraded from version
de: Ihre Centreon-Plattform wird nun upgegraded von der Version
es: Su plataforma Centreon está a punto de ser actualizada de la versión
fr: Votre plateforme Centreon va être mise à jour de la version
pt_pt: A sua plataforma Centreon está prestes a ser atualizada a partir da versão

source: For further details on changes, please find the complete changelog on
de: Für weitere Informationen hinsichtlich Änderungen in dieser Version, schauen Sie im Änderungsprotokoll nach
es: Para más detalles sobre los cambios, por favor encuentre el registro completo de cambios en
fr: Pour plus d'informations, consultez les notes de version sur
pt_pt: Para mais informações sobre as alterações, consulte o changelog completo sobre

source: Installation
es: Instalación
pt_pt: Instalação

source: <p>Currently upgrading database... please do not interrupt this process.</p>
es: <p> En el proceso de actualizar la base de datos ... No interrumpa este proceso. </ p>
fr: <p>En cours de mise à jour de la base de données... Merci de ne pas interrompre ce processus.</p>
pt_pt: <p>Efetuando atualização de banco de dados ... por favor não interrompa este processo.</p>

source: Step
de: Schritt
es: paso
fr: Étape
pt_pt: Etapa

source: You seem to be having trouble with your upgrade.
de: Es scheint, als gäbe es ein Problem bei Ihrem Update.
es: Parece que hay un problema con tu actualización.
fr: Il semble qu'il y ait un problème avec votre mise à jour.
pt_pt: Parece que você esta tendo problemas com sua atualização.

source: You may refer to the line in the specified file in order to correct the issue.
de: Bitte überprüfen Sie die Zeile in der angegebenen Datei um das Problem zu beheben.
es: Puede consultar la línea que es problemática para obtener más información sobre el incidente.
pt_pt: Você deve verificar a linha que esta causando o problema para poder-mos encontrar uma resolução para este caso.

source: The SQL files are located in %s
es: Los archivos SQL se encuentran en %s
fr: Les fichiers SQL sont situés dans %s
pt_pt: Os ficheiros SQL estão localizados em %s

source: But do not edit the SQL files unless you know what you are doing.Refresh this page when the problem is fixed.
de: Die SQL-Dateien sollten Sie jedoch nur bearbeiten, wenn Sie sich im Klaren darüber sind, was Sie anpassen. Aktualisieren Sie die Seite wenn das Problem behoben wurde.
es: No edite archivos SQL a menos que sepa lo que está haciendo. Actualice esta página una vez que se resuelva el problema.
fr: N'éditez pas les fichiers SQL à moins que vous sachiez ce que vous faites. Rafraichissez cette page une fois le problème résolu.
pt_pt: Mas não edite os ficheiros SQL se você não souber o que esta fazendo. Atualize esta página para verificar se o problema foi resolvido.

source: Centreon Installation
es: Installation de Centreon
fr: Installation de Centreon
pt_pt: Instalação do Centreon

source: Upgrade finished
de: Upgrade abgeschlossen
es: Actualización completada
fr: Mise à jour terminée
pt_pt: Atualização finalizada

source: Congratulations, you have successfully upgraded to Centreon version <b>%s</b>.
de: Herzlichen Glückwunsch! Das Update auf Centreon-Version <b>%s</b> wurde erfoglreich durchgeführt.
es: Enhorabuena, ha actualizado correctamente a la versión de Centreon <b>%s </b>.
fr: Félicitations, vous avez mis à jour avec succès Centreon en version <b>%s</b>.
pt_pt: Parabéns, você efetuou com sucesso a atualização do Centreon para versão <b>%s</b>.

source: About
de: Über
es: A proposito
fr: À propos
pt_pt: Sobre

source: Access Groups
de: Zugriffsgruppe
es: Gestión de grupos de acceso.
fr: Gestion des groupes d'accès
pt_pt: Grupos de Acesso

source: Access List
de: Zugriffsliste
es: Lista de acceso
fr: Liste d'accès
pt_pt: Lista de Acesso

source: ACL
de: Zugriffskontrollliste (ACL)
pt_pt: Permissionamento (ACL)

source: Actions Access
de: Aktionenzugriff
es: Gestión de accesos sobre acciones.
fr: Gestion des accès sur les actions
pt_pt: Ações de Acesso

source: Add Widget
de: Widget hinzufügen
es: Añadir widget
fr: Ajouter widget
pt_pt: Adicionar Ferramenta

source: Administration
es: Administración
pt_pt: Administração

source: Advanced Logs
de: Fortgeschrittene Protokolle
es: Troncos
fr: Logs
pt_pt: Registros Avançados

source: Auto Discovery
es: Descubrimiento automatizado
fr: Découverte automatisée
pt_pt: Auto descobrimento

source: Boolean Rules
de: Boolean Regeln
es: Reglas booleanas
fr: Règles booléennes
pt_pt: Regras Boleanas

source: Broker configuration
de: Brokerkonfiguration
es: Configuration de Centreon Broker
fr: Configuration de Centreon Broker
pt_pt: Configuração do Centreon Broker

source: Broker Statistics
de: Brokerstatistiken
es: Estadísticas de corredores
fr: Statistiques du broker
pt_pt: Estatisticas do Broker

source: Business Activity
de: Geschäftsaktivität
es: Actividades de negocios
fr: Activités métiers
pt_pt: Atividades de Negócio

source: Business Views
de: Geschäftsansichten
es: Vistas de negocios
fr: Vues métiers
pt_pt: Visões de Negócio

source: By Host
de: Nach Host
es: Por host
fr: Par hôte
pt_pt: Por Host

source: By Host Group
de: Nach Hostgruppe
es: Por grupo de anfitriones
fr: Par groupe d'hôtes
pt_pt: Por Grupo de Hosts

source: By Service Group
de: Nach Servicegruppe
es: Por grupo de servicio
fr: Par groupe de services
pt_pt: Por Grupo de Serviços

source: By Status
de: Nach Status
es: Por estado
fr: Par statut
pt_pt: Por Estado

source: Centreon Map Client (admin)
de: Centreon Map Client (Administrator)
es: Mapa de Centreon del cliente (admin)
fr: Client Centreon Map (admin)
pt_pt: Cliente Centreon Map (admin)

source: Centreon Map Client (user)
de: Centreon Map Client (Benutzer)
es: Centreon Map Client (Usuario)
fr: Client Centreon Map (utilisateur)
pt_pt: Client Centreon Map (usuário)

source: Centreon UI
es: Centreon web
fr: Centreon web
pt_pt: Centreon web

source: Checks
de: Überprüfungen
es: controles
fr: Contrôles
pt_pt: Checagens

source: Configuration
de: Konfiguration
es: Configuración
pt_pt: Configuração

source: Contact Templates
de: Kontakttemplates
es: Plantillas de contacto
fr: Modèles de contact
pt_pt: Modelos de Contacto

source: Contacts / Users
de: Kontakte / Benutzer
es: Contactos / Usuarios
fr: Contacts / Utilisateurs
pt_pt: Contactos / Utilizadores

source: Curves
de: Kurven
es: curvas
fr: Courbes
pt_pt: Curvas

source: Custom Views
de: Benutzerdefinierte Ansichten
es: Vistas personalizadas
fr: Vues personnalisées
pt_pt: Visões Personalizadas

source: Dashboard
es: Salpicadero
fr: Tableau de bord
pt_pt: Painel de Controle

source: Databases
de: Datenbanken
es: Bases de datos
fr: Bases de données
pt_pt: Banco de Dados
