Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: Service not found
de: Service konnte nicht gefunden werden
fr: Service non trouvé
pt_pt: Serviço não encontrado

source: No acknowledgement found for this host
de: Keine Inkenntnisnahme für diesen Host gefunden
fr: Aucun acquittement trouvé pour cet hôte
pt_pt: Nenhum reconhecimento encontrado para este host

source: Acknowledgement already cancelled for this host
de: Inkenntnisnahme für diesen Host wurde bereits zurückgezogen
fr: Acquittement déjà annulé pour cet hôte
pt_pt: Reconhecimento já foi cancelado para este host

source: No acknowledgement found for this service
de: Keine Inkenntnisnahme für diesen Service gefunden
fr: Aucun acquittement trouvé pour ce service
pt_pt: Nenhum reconhecimento encontrado para este serviço

source: Acknowledgement already cancelled for this service
de: Inkenntnisnahme für diesen Service wurde bereits zurückgezogen
fr: Acquittement déjà annulé pour ce service
pt_pt: Reconhecimento já foi cancelado para este serviço

source: Incorrect Resource type: %s
de: Falscher Ressourcentyp: %s
fr: Type de ressource incorrect: %s
pt_pt: Tipo de Recurso incorreto: %s

source: Loop detected in file %s
fr: Boucle détectée dans le fichier %s
pt_pt: Loop detectado no arquivo %s

source: The configuration file %s does not exists
fr: Le fichier de configuration %s n'existe pas
pt_pt: O arquivo de configuração %s não existe

source: Downtime not found
de: Ausfallszeit konnte nicht gefunden werden
fr: Plage de maintenance non trouvée
pt_pt: Manutenção não encontada

source: Downtime already cancelled for this %s
de: Ausfallszeit für diesen %s wurde bereits abgebrochen
fr: Plage de maintenance déjà annulée pour %s
pt_pt: Manutenção já foi cancelada para %s

source: Incorrect Resource Type
de: Falscher Ressourcentyp
fr: Type de ressource incorrect
pt_pt: Tipo de Recurso incorreto

source: The contact alias is empty
de: Der Kontakt-Alias ist leer
fr: L'alias du contact est vide
pt_pt: O apelido de contato esta vazio

source: Host name can not be empty
de: Der Hostname darf nicht leer sein
fr: Le nom d'hôte ne peut être vide
pt_pt: O nome do Host não pode estar em branco

source: The host of service is not defined
fr: L'hôte du service n'est pas défini
pt_pt: O host do serviço não esta definido

source: Host of downtime not found
fr: L'hôte associé à la plage de maintenance n'a pas été trouvé
pt_pt: O host do serviço não esta definido

source: The host of service (id: %d) is not defined
de: Der Host des Services (id: %d) ist nicht definiert
fr: L'hôte du service (id: %d) n'est pas défini
pt_pt: O host do serviço (id: %d) não esta definido

source: Host name of service (id: %d) can not be empty
de: Der Hostname des Services (id: %d) darf nicht leer sein
fr: Le nom d'hôte du service (id: %d) ne peut pas être vide
pt_pt: O nome do Host do serviço (id: %d) não pode estar em branco

source: The description of service (id: %d) can not be empty
de: Die Beschreibung des Services (id: %d) darf nicht leer sein
fr: La description du service (id: %d) ne peut pas être vide
pt_pt: A descrição do serviço (id: %d) não pode estar em branco

source: Host name cannot be empty
de: Der Hostname darf nicht leer sein
fr: Le nom d'hôte ne peut pas être vide
pt_pt: Nome do host não pode estar em branco

source: Service description cannot be empty
de: Die Beschreibung des Services darf nicht leer sein
fr: La description du service ne peut pas être vide
pt_pt: Descrição do serviço não pode estar em branco

source: Token expired.
fr: Token expiré.
pt_pt: Token expirado.

source: Contact disabled.
fr: Contact désactivé.
pt_pt: Contato desabilitado.

source: Token can not empty, null or not defined
fr: Le token ne peut être ni null, ni vide ou non défini
pt_pt: Token não pode estar em branco, vazio ou não definido

source: Error when connecting to the Gorgone server
de: Fehler beim Verbindungsaufbau mit dem Gorgone-Server
fr: Erreur de connexion avec le serveur Gorgone
pt_pt: Erro ao conectar no servidor Gorgone

source: Host name already exists
de: Hostname bereits in Nutzung
fr: Le nom d'hôte existe déjà
pt_pt: Nome de host já existe

source: Error while creation of host
fr: Erreur lors de la creation de l'hôte
pt_pt: Erro na criação do host

source: Error while searching for the host
de: Fehler bei der Suche des Hosts
fr: Erreur lors de la recherche de l'hôte
pt_pt: Erro enquanto buscava pelo o host

source: Error while searching for the number of host
de: Fehler bei der Suche der Anzahl an Hosts
fr: Erreur lors de la recherche du nombre d'hôte
pt_pt: Erro enquanto buscava pelo o número do host

source: Error while searching for resources
fr: Erreur lors de la recherche de ressources
pt_pt: Erro enquanto buscava por recursos

source: Error when searching for monitoring servers
fr: Erreur lors de la recherche de serveurs de supervision
pt_pt: Erro enquanto buscava por servidores de monitoramento

source: Error when searching for a resource of monitoring server
fr: Erreur lors de la recherche de la ressource attachée au serveur de supervision
pt_pt: Erro enquanto buscava por servidores de monitoramento

source: Error when searching for the local monitoring servers
fr: Erreur lors de la recherche du serveur de supervision local
pt_pt: Erro ao buscar pelo o servidor de monitoramento local

source: Error while searching for the web version of the Centreon platform
fr: Erreur lors de la récupération de la version de la plate-forme Centreon
pt_pt: Erro enquanto buscava pela a versão web da plataforma Centreon

source: Error while searching for the modules version of the Centreon platform
fr: Erreur lors de la recherche de la version des extensions
pt_pt: Erro enquanto buscava por versões de modulos da plataforma Centreon

source: Error while searching for the widgets version of the Centreon platform
fr: Erreur lors de la recherche de la version des widgets
pt_pt: Erro enquanto buscava por versões de widgets da plataforma Centreon

source: Bad format for the sort request parameter
fr: Mauvais format pour la requête de tri
pt_pt: Formato incorreto para a classificação de requisição de parametro

source: Contact not found
fr: Contact non trouvé
pt_pt: Contato não encontrado

source: Token not found
fr: Token non trouvé
pt_pt: Token não encontrado

source: Centcore directory %s does not exist
de: Centcore-Verzeichnis %s existiert nicht
fr: Le répertoire Centcore %s n'existe pas
pt_pt: Diretorio %s do Centcore não existe

source: Error during creation of the CentCore command file (%s)
de: Fehler bei der Erstellung der CentCore Befehlsdatei (%s)
fr: Erreur lors de la création du fichier de commande Centcore (%s)
pt_pt: Erro durante a criação do arquivo de comando do CentCore (%s)

source: Bad request
fr: Mauvaise requête
pt_pt: Requisição incorreta

source: Request error
fr: Erreur de requête
pt_pt: Erro de Requisição

source: Monitoring server %1 not found
fr: Serveur de supervision %1 non trouvé
pt_pt: Servidor de Monitoramento %1 não encontrado

source: Template with id %1 not found
fr: Le modèle possédant l'id %1 n'a pas été trouvé
pt_pt: Modelo com id %1 não encontrado

source: Template %1 not found
fr: Le modèle %1 n'a pas été trouvé
pt_pt: Modelo com id %1 não encontrado

source: Bad SQL request
de: Ungültige SQL-Anfrage
fr: Mauvaise requête SQL
pt_pt: Requisição de SQL incorreta

source: Incorrect Event Type
fr: Mauvais type d'évènement
pt_pt: Tipo de Evento incorreto

source: Provider %1 is loaded
fr: Le fournisseur %1 est chargé
pt_pt: Provedor %1 foi carregado

source: The parameter %s is not allowed
de: Der Parameter %s ist nicht zulässig
fr: Le paramètre %s n'est pas autorisé
pt_pt: O parametro %s não é aceito

source: The value %1 is only supported by the operators %2 and %3
fr: La valeur %1 est uniquement supportée par les opéreateurs %2 et %3
pt_pt: O valor %1 é somente suportado pelo os operadores %2 e %3

source: Bad regex format
fr: Mauvaise expression régulière (RegExp)
pt_pt: Formato regex incorreto

source: Bad search operator
de: Ungültiger Suchoperator
fr: Mauvais opérateur de recherche
pt_pt: Operador de pesquisa incorreto

source: Error during token creation
fr: Erreur lors de la création du token
pt_pt: Erro durante a criação do token

source: Error during deleting expired session
fr: Erreur lors de l'expiration de la session
pt_pt: Erro durante a remoção de sessão expirada

source: Error when recovering the number of tokens
fr: Erreur lors de la récupération du nombre de token
pt_pt: Erro ao recuperar o número de tokens

source: Error when deleting tokens for one contact
fr: Erreur lors de la suppression des tokens pour un contact
pt_pt: Erro ao remover tokens de um contato

source: Retention duration for audit logs
de: Aufbewahrungsdauer für Auditprotokolle
fr: Durée de rétention pour les logs d'actions

source: looks like a CLAPI action
fr: Probablement une action réalisée par CLAPI

source: Default contact group
de: Standardkontaktgruppe
fr: Groupe de contacts par défaut

source: Hosts
es: anfitriones
fr: Hôtes

source: Host
es: anfitrión
fr: Hôte

source: Gorgone connection protocol
de: Gorgone Verbindungsprotokoll
fr: Protocole de connexion utilisé par Gorgone

source: Use the Remote Server as a proxy
de: Remote-Server als Proxy verwenden
fr: Utiliser le Remote Server comme proxy

source: This IP Address already exist
de: Diese IP-Adresse existiert bereits
fr: Cette adresse IP existe déjà

source: This server is already registered
de: Dieser Server ist bereits registriert
fr: Ce serveur est déjà enregistré

source: No Central in topology,please edit it from Configuration > Pollers menu
de: Kein zentraler Server in der Topologie vorhanden, bitte passen Sie die Einstellungen unter Konfiguration > Poller an
fr: Pas de Central dans la topologie,Editez le depuis le menu Configurations > Collecteurs

source: Email
es: Correo
fr: Mail

source: Currently installing database and generating cache... please do not interrupt this process.
de: Derzeit werden die Datenbank installiert und der Cache erzeugt... bitte unterbrechen Sie diesen Prozess nicht.
fr: Installation en cours de la base de données et génération du cache... ne pas interrompre le processus.<br/><br/>

source: You may refer to the line that causes problem in order to find out more about the issue.
fr: Vous pouvez vous référer à la ligne qui pose problème pour en savoir plus sur l'incident.

source: [Page deprecated] Please use the new page:
de: [Seite veraltet] Bitte nutzen Sie die neue Seite:
fr: [Page dépréciée] Utilisez la nouvelle page:

source: Illegal characters for Gorgone commands
de: Unzulässige Zeichen innerhalb des Gorgonebefehls
fr: Caractères illégaux pour les commandes Gorgone

source: Use SSL/TLS
de: SSL/TLS verwenden
fr: Utiliser SSL/TLS

source: Synchronization Options
de: Synchronisierungsoptionen
fr: Options de Synchronisation

source: An integer with a minimum value of 1 is required
de: Ein Integer mit einem minimalen Wert von 1 ist erforderlich
fr: Un entier supérieur à 1 est requis

source: Default contactgroup
de: Standard Kontaktgruppe
fr: Groupe de contacts par défaut

source: LDAP synchronization interval (in hours)
de: LDAP Synchronisierungsintervall (in Stunden)
fr: Intervalle (en heures), entre les synchronisations LDAP

source: Enable LDAP synchronization on login
de: LDAP-Synchronisierung bei Login aktivieren
fr: Synchronisation LDAP lors du login

source: Contacts with the 'Reach Centreon Front-end' option enabled
de: Kontakte mit der 'Zugriff auf das Centreon Front-end'-Option aktiviert
fr: Contacts autorisés à se connecter à l'interface web

source: Refresh
de: Aktualisieren
fr: Actualiser

source: To manually request a LDAP synchronization of a contact
de: Um manuell eine LDAP-Synchronisierung beim nächsten Login durchzuführen
fr: Demande de synchronisation LDAP du contact

source: This user isn't linked to a LDAP
de: Dieser Benutzer ist mit keinem LDAP verknüpft
fr: Ce contact n'est lié à aucun LDAP

source: Manually request to synchronize this contact with his LDAP
de: Manuelle Anforderung zur Synchronisierung dieses Kontakts mit seinem LDAP
fr: Demande de synchronisation LDAP du contact

source: Already requested, please wait the CRON execution or for the user to login
de: Bereits angefordert, bitte warten Sie auf die CRON-Ausführung oder bis sich der Benutzer anmeldet
fr: Demande enregistrée, merci d'attendre la prochaine exécution du CRON ou connexion du contact

source: The chosen contact(s) will be disconnected. Do you confirm the LDAP synchronization request ?
de: Die Verbindung des/der ausgewählten Kontakts/Kontakte wird beendet. Bestätigen Sie die LDAP-Synchronisierungsanfrage?
fr: Les contacts sélectionnés vont être déconnectés. Confirmez-vous la demande de synchronisation LDAP ?

source: If the contact is connected, all his instances will be closed. Are you sure you want to request a data synchronization at the next login of this Contact ?
de: Wenn der Kontakt verbunden ist, werden alle seine Verbindungsinstanzen geschlossen. Sind Sie sich sicher, dass Sie beim nächsten Login des Kontakts eine Datensynchronisation anfordern möchten?
fr: Si ce contact est connecté, toutes ses instances seront supprimées. Êtes-vous sûr de vouloir que ce contact synchronise ses données LDAP lors de sa prochaine connexion ?

source: All this contact sessions will be closed. Are you sure you want to request a synchronization at the next login of this Contact ?
de: Alle Sessions dieses Kontakts werden geschlossen. Sind Sie sich sicher, dass Sie eine Synchronisation bei der nächsten Anmeldung des Kontakts anfordern möchten?
fr: Toutes les sessions de ce contact seront supprimées. Êtes-vous sûr de vouloir que ce contact exécute unesynchronisation lors de sa prochaine connexion ?

source: Synchronize LDAP
de: LDAP synchronisieren
fr: Synchroniser avec le LDAP

source: No LDAP configuration enabled !
fr: Aucune configuration LDAP active !

source: Resync data requested.
fr: Mise à jour des données demandée.

source: Error : unable to read or update the contact data in the DB
fr: Erreur : impossible de lire ou de mettre à jour les données en DB

source: Last LDAP sync
de: Letzte LDAP-Synchronisation
fr: Dernière synchro LDAP

source: Refresh LDAP
de: LDAP aktualisieren
fr: Actualiser LDAP

source: Logout user
de: Benutzer abmelden
fr: Déconnecter le contact

source: Layout
es: Disposición
fr: Mise en page

source: host
es: anfitrión
fr: hôte

source: Invalid Image Format.
de: Ungültiges Bildformat.
fr: Format d'image invalide.

source: Images already uploaded.
fr: Images déjà uploadés.

source: Manual
de: Manuell
es: definido
fr: Définie

source: Heartbeat Interval
de: Herzschlagintervall
fr: Intervalle du Heartbeat

source: Number between 5 and 600
de: Zahl zwischen 5 und 600
fr: Nombre entre 5 et 600

source: Use setpgid
de: Setpgid verwenden
es: Usar setpgid
fr: Utiliser setpgid

source: bytes
fr: octets

source: Bad OID Format
de: Ungültiges OID-Format
fr: Mauvais Format d'OID

source: String
de: Zeichenfolge
es: cadena
fr: Chaine

source: By OID, Host and Service
de: Nach OID, Host und Service
fr: Par OID, hôte et service

source: Resolve
de: Auflösen
es: resolver
fr: Résoudre

source: Incremental
de: Inkrementell
es: incrementales
fr: Incrémentale

source: Monitoring Engine start command
de: Monitoring Engine Startbefehl
fr: Commande de démarrage du moteur de supervision

source: Monitoring Engine stop command
de: Monitoring Engine Stopbefehl
fr: Commande d'arrêt du moteur de supervision

source: Monitoring Engine restart command
de: Monitoring Engine Neustartbefehl
fr: Commande de redémarrage du moteur de supervision

source: Monitoring Engine reload command
de: Monitoring Engine neu Laden Befehl
fr: Commande de rechargement du moteur de supervision

source: Localhost ?
es: Anfitrión local?
fr: Hôte local ?

source: Centreon Broker reload command
de: Centreon Broker neu Laden Befehl
fr: Commande de rechargement de Centreon Broker

source: The IP address is already registered on another poller
de: Die IP-Adresse ist bereits auf einem anderen Poller registriert
fr: L'adresse IP est déjà enregistrée sur un autre collecteur

source: The IP address is already registered
de: Die IP-Adresse ist bereits registriert
fr: L'adresse IP est déjà enregistrée

source: Localhost
es: Host local
fr: Hôte local

source: Login:
fr: Pseudo:

source: Acknowlegment
fr: Acquittement

source: ACL Resource name can't be empty
de: Zugriffssteuerungsliste (ACL) Ressourcenname darf nicht leer sein
fr: Le nom de la Resource ACL ne peut pas être vide

source: You can't edit this downtime because you don't have access to all of its resources
fr: Vous ne pouvez pas éditer cette plage de maintenance car vous n'êtes pas autorisé à accéder à toutes les ressources liées

source: You can't edit this hostgroup because you don't have access to all its resources
de: Sie können diese Hostgruppe nicht bearbeiten, da Sie nicht auf alle derer Ressourcen Zugriff haben
fr: Vous ne pouvez pas éditer groupe d'hote car vous n'êtes pas autorisé à accéder à toutes les ressources liées

source: Filter by Host
fr: Filtrer par hôtes

source: Filter by Hostgroup
fr: Filtrer par groupe d'hôtes

source: Filter by Servicegroup
fr: Filtrer par groupe de services

source: Chart
fr: Graphiques

source: Attach to Master Remote Server
de: Dem Master Remote-Server anfügen
fr: Lier à un Remote Server principal

source: Locked elements
de: Gesperrte Elemente
fr: Eléments verrouillés

source: This value needs to be an integer lesser than
de: Dieser Wert muss ein Integer unter dem folgenden Wert sein
fr: Cette valeur doit être un entier inférieur à

source: Host and service id can not be null at the same time
de: Die Host- und Service-ID können nicht beide NULL betragen
fr: L'ID de l'hôte et du service ne peuvent pas être null en même temps

source: Downtime internal id can not be null
de: Interne ID der Ausfallszeit kann nicht NULL sein
fr: L'ID interne de la plage de maintenance ne peut pas être null

source: Error while searching for the host macros
de: Fehler bei der Suche der Hostmakros
fr: Erreur lors de la recherche des macros de l'hôte

source: Monitoring server with id %d not found
de: Monitoring Server mit ID %d konnte nicht gefunden werden
fr: Le serveur de supervision avec l'id %d n'a pas été trouvé

source: Monitoring server %s not found
de: Monitoring Server %s konnte nicht gefunden werden
fr: Le serveur de supervision %s n'a pas été trouvé

source: Template with id %d not found
fr: Le modèle avec l'id %d n'a pas été trouvé

source: Template %s not found
fr: Le modèle %s n'a pas été trouvé

source: Error while searching for the service macros
de: Fehler bei der Suche der Makros des Services
fr: Erreur lors de la recherche des macros du service

source: Error while searching for the service
de: Fehler bei der Suche des Services
fr: Erreur lors de la recherche du service

source: Error while searching for the command of service
de: Fehler bei der Suche des Befehls des Services
fr: Erreur lors de la recherche de la commande du service

source: The service id can not be null
fr: L'id du service ne peut pas être null

source: Host or id can not be null
fr: L'hôte ou l'id de l'hôte ne peuvent pas être null

source: The command line in the configuration is empty while in the monitoring it is not
fr: La ligne de commande dans la configuration est vide alors que celle de la supervision ne l'est pas.

source: Different number of tokens between configuration and monitoring command line
fr: Nombre différent de jetons entre la ligne de commande de configuration et de supervision

source: Error when deleting a monitoring server
fr: Erreur lors de la supression d'un serveur de supervision

source: Acknowledged by
fr: Acquitté par

source: Acknowledgement
fr: Acquittement

source: Acknowledge services attached to host
fr: Acquitter les services attachés à l'hôte

source: at
fr: à

source: Clear all
fr: Effacer tout

source: Criterias
fr: Critères

source: Copy
fr: Copier

source: Command copied to clipboard
fr: Commande copiée dans le presse-papier

source: Current notification number
fr: Numéro de notification actuel

source: Current state duration
fr: Durée de l'état actuel

source: Downtime duration
fr: Durée de la plage de maintenance

source: End date must be greater than start date
fr: La date de fin doit être supérieure à la date de début

source: End time
fr: Heure de fin

source: Is this resource flapping?
fr: Cette ressource est-elle bagottante?

source: Show criterias filters
fr: Montrer les critères de filtre

source: Start date
fr: Date de début

source: Change start date
fr: Changer la date de début

source: Change start time
fr: Changer l'heure de début

source: Host group
fr: Groupe d'hôtes

source: In downtime
fr: En plage de maintenance

source: Last 24 hours
fr: 24 dernières heures

source: Last 7 days
fr: 7 derniers jours

source: Last 31 days
fr: 31 derniers jours

source: Set downtime on
fr: Programmer une plage de maintenance sur

source: Downtime set by
fr: Plage de maintenance programmée par

source: Set downtime on services attached to host
fr: Programmer une plage de maintenance sur les services attachés à l'hôte

source: Last notification
fr: Dernière notification

source: Last state change
fr: Dernier changement d'état

source: Next check
fr: Prochain contrôle

source: If checked, a notification is sent to the contacts linked to the object to warn that the incident on the resource has been acknowledged
fr: Si cette option est cochée, une notification sera envoyée aux contacts liés à l'objet afin d'avertir que l'incident de la ressource a été acquitté

source: Open
fr: Ouvrir

source: Percent state change
fr: Pourcentage de changement d'état

source: Resource name
fr: Nom de la ressource

source: Resource problems
fr: Problèmes de ressources

source: Rows per page
fr: Lignes par page

source: of
fr: de

source: More
fr: Étendre

source: Disable autorefresh
fr: Désactiver l'actualisation automatique

source: Enable autorefresh
fr: Activer l'actualisation automatique

source: Search help
fr: Aide pour la recherche

source: This search bar will search matching occurences you type, contained in: host name or alias or address or service description
fr: Cette barre de recherche va rechercher les ressources correspondantes aux occurences que vous tapez, contenues dans: le nom de l'hôte, l'alias, l'adresse, ou bien la description du service

source: You can use regular expression syntax to retrieve more relevant results
fr: Vous pouvez utiliser des expressions régulières afin d'afficher des résultats plus pertinents à la recherche

source: It's possible to specify the criteria you precisely want to search, by using the following syntax:
fr: Il est possible de spécifier les critères que vous voulez rechercher de manière précise, en utilisant la syntaxe suivante:

source: Some examples:
fr: Quelques exemples:

source: will display resources with host name starting by'
fr: affichera les ressources avec un nom d'hôte commençant par

source: will display resources with service description finishing by
fr: affichera les ressources avec une description de service finissant par

source: will display all resources with host having alias containing
fr: affichera les ressources avec un alias d'hôte contenant

source: will display resources having FQDN that doesn't contain
fr: affichera les ressources avec un FQDN ne contenant pas

source: and host alias containing
fr: et un alias d'hôte contenant

source: Tips
fr: Conseils

source: get some help while creating your regular expression query at
fr: obtenez de l'aide lors de la création de votre expression régulière sur

source: Service group
fr: Groupe de services

source: State filter
fr: Filtre de statut

source: Acknowledge command sent
fr: Commande d'acquittement envoyée
