Repository: centreon/centreon-archived
Catalog: lang/*.UTF-8/LC_MESSAGES/messages.po
Languages: de, es, fr, pt_pt

source: No Comment for services.
de: Keine Kommentare für Services.
es: No hay comentarios para los servicios.
fr: Pas de commentaires pour les services.
pt_pt: Sem comentários para serviços.

source: Services Comments
de: Servicekommentare
es: Comentarios sobre servicios
fr: Commentaires sur les services
pt_pt: Comentários de Serviços

source: View comments of hosts
de: Kommentare zu den Host anzeigen
es: Ver comentarios de invitados
fr: Visualiser les commentaires des hôtes
pt_pt: Visualizar comentários de hosts

source: Service
es: Servicio
pt_pt: Serviço

source: Output
es: Estado detallado
fr: Statut détaillé
pt_pt: Estado detalhado

source: Hostgroup
de: Hostgruppe
es: Grupo de invitados
fr: Groupe d'hôtes
pt_pt: Grupo de Host

source: Search
de: Suche
es: Buscar
fr: Rechercher
pt_pt: Busca

source: Add a downtime
de: Ausfallszeit hinzufügen
es: Añadir un tiempo de inactividad
fr: Ajouter une plage de maintenance
pt_pt: Adiciona manutenção

source: Modify a downtime
de: Ausfallszeit bearbeiten
es: Cambiar un tiempo de parada
fr: Modifier une plage de maintenance
pt_pt: Modifica manutenção

source: View a downtime
de: Ausfallszeit anzeigen
es: Visualizar un tiempo de inactividad
fr: Visualiser une plage de maintenance
pt_pt: Visualiza manutenção

source: Periods
de: Zeiträume
es: períodos
fr: Périodes
pt_pt: Períodos

source: Links Management
de: Verknüpfungsverwaltung
es: Gestión de enlaces
fr: Gestion des liaisons
pt_pt: Gestão de Associações

source: Linked with Hosts
de: Verknüpft mit Host(s)
es: Vinculado a invitados
fr: Lié aux hôtes
pt_pt: Associado com Hosts

source: Linked with Host Groups
de: Verknüpft mit Hostgruppe(n)
es: Vinculado con grupos de hosts.
fr: Lié avec des groupes d'hôtes
pt_pt: Associado com Grupo de Hosts

source: Linked with Services
de: Mit Services verbunden
es: Vinculado con servicios
fr: Lié avec les services
pt_pt: Associado com Serviços

source: Linked with Service Groups
de: Mit Servicegruppen verbunden
es: Vinculado con el grupo de servicios.
fr: Lié avec le groupe de services
pt_pt: Associado com Grupos de Serviço

source: Downtime Configuration
de: Ausfallszeitkonfiguration
es: Configuración de tiempos de parada.
fr: Configuration des plages de maintenance
pt_pt: Configuração de Manutenção

source: Period
de: Zeitraum
es: período
fr: Période
pt_pt: Período

source: Add new period
de: Neuen Zeitraum hinzufügen
es: Añadir un nuevo periodo
fr: Ajouter une nouvelle période
pt_pt: Adiciona novo período

source: The end time must be greater than the start time.
de: Die Endzeit muss weiter in der Zukunft liegen als die Startzeit.
es: La fecha de finalización debe ser mayor que la fecha de inicio.
fr: La date de fin doit être plus grande que la date de début.
pt_pt: O tempo final deve ser maior que o tempo inicial.

source: No relation set for this downtime
de: Keine Beziehung für diese Ausfallszeit festgelegt
es: No se hace relación con este tiempo de parada.
fr: Aucune relation faite avec cette plage de maintenance
pt_pt: Nenhuma relação configurada para esta manutenção

source: Time period
de: Zeitraum
es: Periodo de tiempo
fr: Période de temps
pt_pt: Período de Tempo

source: Downtime type
de: Ausfallszeittyp
es: Tipo de tiempo de parada
fr: Type de plage de maintenance
pt_pt: Tipo de Manutenção

source: Flexible
de: Flexibel
pt_pt: Flexivel

source: Weekly basis
de: Wöchentliche Basis
es: semanal
fr: Hebdomadaire
pt_pt: Semanalmente

source: Monthly basis
de: Monatliche Basis
es: mensual
fr: Mensuel
pt_pt: Mensalmente

source: Specific date
de: Konkretes Datum
es: Fecha especifica
fr: Date spécifique
pt_pt: Data especifica

source: Monday
de: Montag
es: lunes
fr: Lundi
pt_pt: Segunda

source: Tuesday
de: Dienstag
es: martes
fr: Mardi
pt_pt: Terça

source: Wednesday
de: Mittwoch
es: miércoles
fr: Mercredi
pt_pt: Quarta

source: Thursday
de: Donnerstag
es: jueves
fr: Jeudi
pt_pt: Quinta

source: Friday
de: Freitag
es: viernes
fr: Vendredi
pt_pt: Sexta

source: Saturday
de: Samstag
es: sábado
fr: Samedi
pt_pt: Sábado

source: Sunday
de: Sonntag
es: domingo
fr: Dimanche
pt_pt: Domingo

source: First of month
de: Erster des Monats
es: Primero del mes
fr: Premier du mois
pt_pt: Primeiro do mês

source: Second of month
de: Zweiter des Monats
pt_pt: Segundo do mês

source: Third of month
de: Dritter des Monats
pt_pt: Terceiro do mês

source: Fourth of month
de: Vierter des Monats
pt_pt: Quarto do mês

source: Last of month
de: Letzter des Monats
es: Ultimo del mes
fr: Dernier du mois
pt_pt: Último do mês

source: Please select one or more items
de: Bitte wählen Sie ein oder mehrere Elemente aus
es: Por favor seleccione uno o más objetos
fr: Merci de sélectionner un ou plusieurs objets
pt_pt: Por favor, selecione um ou mais itens

source: Servicegroup
de: Servicegruppe
es: Grupos de servicio
fr: Groupes de services
pt_pt: Grupo de Serviço

source: Poller
es: colector
fr: Collecteur
pt_pt: Coletor

source: Hostgroups
de: Hostgruppen
es: Grupo de invitados
fr: Groupe d'hôtes
pt_pt: Grupos de Host

source: Servicegroups
de: Servicegruppen
es: Grupos de servicio
fr: Groupes de services
pt_pt: Grupos de Serviço

source: Pollers
de: Poller
es: colectores
fr: Collecteurs
pt_pt: Coletores

source: The timezone used is configured on your user settings
de: Die genutzte Zeitzone ist in Ihren Benutzereinstellungen festgelegt
es: La zona horaria utilizada es la configurada en la configuración de usuario.
fr: Le fuseau horaire utilisé est celui configuré dans vos paramètres utilisateur
pt_pt: O fuso horário utilizado é o mesmo que foi configurado no seu perfil de usuário

source: minutes
de: Minuten
es: minutos
pt_pt: minutos

source: hours
de: Stunden
es: horas
fr: heures
pt_pt: horas

source: days
de: Tage
es: días
fr: jours
pt_pt: dias

source: Set downtime for hosts services
de: Ausfallszeit für die Services der Hosts eintragen
es: Establecer un tiempo de espera para los servicios de host
fr: Configurer une plage de maintenance pour les services des hôtes
pt_pt: Configura manutenção para os serviços de hosts

source: N/A
pt_pt: N/D

source: Never Started
de: Nie gestartet
es: Nunca comencé
fr: Jamais démarré
pt_pt: Nunca iniciado

source: Do you confirm the cancellation ?
de: Bestätigen Sie den Abbruch?
es: ¿Confirma usted la cancelación?
fr: Confirmez-vous l'annulation ?
pt_pt: Você confirma este cancelamento ?

source: Services Downtimes
de: Serviceausfallszeiten
es: Tiempo de parada de los servicios.
fr: Plages de maintenance des services
pt_pt: Manutenções de Serviços

source: View downtimes of hosts
de: Ausfallszeiten der Hosts anzeigen
es: Visualiza los tiempos de parada de los hosts.
fr: Visualiser les plages de maintenance des hôtes
pt_pt: Visualizar manutenções de hosts

source: Display Finished Downtimes
de: Abgeschlossene Ausfallszeiten anzeigen
es: Mostrar los tiempos de apagado finalizados
fr: Afficher les plages de maintenance terminés
pt_pt: Exibir Manutenção Finalizada

source: Display Recurring Downtimes
de: Wiederholt auftretende Ausfallszeiten anzeigen
es: Mostrar tiempos de parada cíclicos
fr: Afficher les plages de maintenance cycliques
pt_pt: Exibir Ciclo de Manutenções

source: Entry Time
de: Eintragszeit
es: Fecha de la incautación
fr: Date de saisie
pt_pt: Data Inicial

source: Acknowledge a Service
de: Service zur Kenntnis nehmen
es: Pagar un servicio
fr: Acquitter un service
pt_pt: Conhecimento de Serviço

source: notify
de: benachrichtigen
es: notificar
fr: Notifier
pt_pt: notificar

source: sticky
de: angeheftet
es: Reconocimiento persistente en caso de cambio de estado no correcto
fr: Acquittement persistant en cas de changement de statut non-OK
pt_pt: Confirmação persistente em caso de mudança de estado não OK

source: persistent
es: Reinsertar al reiniciar el motor de supervisión.
fr: Ré-insérer lors d'un redémarrage du moteur de supervision
pt_pt: Reinsira ao reiniciar o motor de monitoramento

source: Force active check
de: Aktive Überprüfung erzwingen
es: Forzar el control activo
fr: Forcer le contrôle actif
pt_pt: Forçar checagem ativa

source: comment
de: Kommentar
es: comentario
fr: Commentaire
pt_pt: comentário

source: Servicegroups / Hosts
de: Servicegruppen / Hosts
es: Grupos de servicio / anfitriones
fr: Groupes de services / Hôtes
pt_pt: Grupos de Serviço / Hosts

source: Services informations
de: Serviceinformationen
es: Información sobre servicios
fr: Informations sur les services
pt_pt: Informações de Serviços

source: Details
es: detalles
fr: Détails
pt_pt: Detalhes

source: Summary
de: Zusammenfassung
es: resumen
fr: Résumé
pt_pt: Resumo

source: Problems
de: Probleme
es: dificultades
fr: Problèmes
pt_pt: Problemas

source: Acknowledge
de: Zur Kenntnis genommen
es: absolución
fr: Acquitter
pt_pt: Conhecimento

source: Not Acknowledged
de: Nicht zur Kenntnis genommen
es: No pagado
fr: Non acquittés
pt_pt: Sem Conhecimento

source: Display
de: Anzeige
es: visualización
fr: Afficher
pt_pt: Exibir

source: Display details
de: Details anzeigen
es: Mostrar detalles
fr: Afficher les détails
pt_pt: Exibir detalhes

source: Last Check
de: Letzte Überprüfung
es: Última comprobación
fr: Dernier contrôle
pt_pt: Última Checagem

source: Status information
es: Estado detallado
fr: Statut détaillé
pt_pt: Informação de Estado

source: Display
de: Anzeige
es: visualización
fr: Afficher
pt_pt: Exibir

source: Verification Check
de: Verifizierungsüberprüfung
es: Verificación de control
fr: Vérification du contrôle
pt_pt: Verificação de Checagem

source: Verification Check (Forced)
de: Verifizierungsüberprüfung (erzwungen)
es: Control de cheques (forzado)
fr: Vérification du contrôle (Forcé)
pt_pt: Verificação de Checagem (Forçado)

source: Services : Acknowledge
de: Services: Zur Kenntnis nehmen
es: Servicios: Acquitter
fr: Services : Acquitter
pt_pt: Serviços : Conhecimento

source: Services : Disacknowledge
de: Services: Inkenntnisnahme entfernen
es: Servicios: Dé-acquitter
fr: Services : Dés-acquitter
pt_pt: Serviços : Sem Conhecimento

source: Services : Enable Notification
de: Services: Benachrichtigungen aktivieren
es: Servicios: Habilitar notificación
fr: Services : Activer la notification
pt_pt: Serviços : Ativar Notificação

source: Services : Disable Notification
de: Services: Benachrichtigungen deaktivieren
es: Servicios: Deshabilitar notificación
fr: Services : Désactiver la notification
pt_pt: Serviços : Desabilitar Notificação

source: Services : Enable Check
de: Services: Überprüfung aktivieren
es: Servicios: Habilitar verificación
fr: Services : Activer la vérification
pt_pt: Serviços : Ativar Checagem

source: Services : Disable Check
de: Services: Überprüfung deaktivieren
es: Servicios: Deshabilitar la verificación
fr: Services : Désactiver la vérification
pt_pt: Serviços : Desativar Checagem

source: Hosts : Acknowledge
de: Hosts: Zur Kenntnis nehmen
es: Anfitriones: Adquisidor
fr: Hôtes : Acquitter
pt_pt: Hosts : Conhecimento

source: Hosts : Disacknowledge
de: Hosts: Inkenntnisnahme entfernen
es: Anfitriones: Dés-acquitter
fr: Hôtes : Dés-acquitter
pt_pt: Hosts : Sem Conhecimento

source: Hosts : Enable Notification
de: Hosts: Benachrichtigungen aktivieren
es: Hosts: Habilitar notificación
fr: Hôtes : Activer la notification
pt_pt: Hosts : Ativar Notificação

source: Hosts : Disable Notification
de: Hosts: Benachrichtigungen deaktivieren
es: Anfitriones: Deshabilitar notificación
fr: Hôtes : Désactiver la notification
pt_pt: Hosts : Desativar Notificação

source: Hosts : Enable Check
de: Hosts: Überprüfung aktivieren
es: Hosts: Habilitar verificación
fr: Hôtes : Activer la vérification
pt_pt: Hosts : Ativar Checagem

source: Hosts : Disable Check
de: Hosts: Überprüfung deaktivieren
es: Anfitriones: Deshabilitar la verificación
fr: Hôtes : Désactiver la vérification
pt_pt: Hosts : Desativar Checagem

source: Sort by Status
de: Nach Status sortieren
es: Ordenar por estado
fr: Trier par statut
pt_pt: Ordenar por estado

source: Hostgroups / Hosts
de: Hostgruppen / Hosts
es: Grupos de anfitriones
fr: Groupes d'hôtes / Hôtes
pt_pt: Grupos de Hosts / Hosts

source: Services information
de: Serviceinformationen
es: Información sobre servicios
fr: Informations sur les services
pt_pt: Informações de Serviços

source: Unhandled Problems
de: Nicht behandelte Probleme
es: Problemas no pagados
fr: Problèmes non acquittés
pt_pt: Problemas sem Tratamento

source: Host Problems
de: Hostprobleme
es: Problemas en progreso
fr: Problèmes en cours
pt_pt: Hosts com Problemas

source: Host Status
es: Estado del anfitrión
fr: Statut de l'hôte
pt_pt: Estado de Host

source: Tries
de: Versuche
es: intentos
fr: Tentatives
pt_pt: Tentativas

source: Hosts : Schedule immediate check
de: Hosts: Sofortige Überprüfung ansetzen
es: Anfitriones: Planifique un chequeo inmediato
fr: Hôtes : Planifier un contrôle immédiat
pt_pt: Hosts: Agendar checagem imediata

source: Hosts : Schedule immediate check (Forced)
de: Hosts: Sofortige Überprüfung ansetzen (erzwungen)
es: Anfitriones: Programe un chequeo inmediato (Forzado)
fr: Hôtes : Planifier un contrôle immédiat (Forcé)
pt_pt: Hosts: Agendar checagem imediata (Forçado)

source: Hosts : Set Downtime
de: Hosts: Ausfallszeit ansetzen
es: Anfitriones: Añadir un tiempo de parada
fr: Hôtes : Ajouter une plage de maintenance
pt_pt: Hosts : Configurar Manutenção

source: Up
de: Verfügbar
es: Disponible
fr: Disponible
pt_pt: Disponível

source: Down
es: indisponible
fr: Indisponible
pt_pt: Indisponível

source: Unreachable
de: Nicht erreichbar
es: inalcanzable
fr: Injoignable
pt_pt: Inalcançável

source: Pending
de: Ausstehend
es: A la espera
fr: En attente
pt_pt: Pendente

source: Severity
de: Schweregrad
es: criticidad
fr: Criticité
pt_pt: Severidade

source: Hard State Duration
de: Zeit im HARD-Zustand
es: Validado desde
fr: Validé depuis
pt_pt: Duração do Estado Válido

source: Sort by severity
de: Nach Schweregrad sortieren
es: Ordenar por criticidad
fr: Trier par criticité
pt_pt: Ordenar por severidade

source: Top Priority Hosts
de: Hosts mit der höchsten Priorität
es: Anfitriones prioritarios
fr: Hôtes prioritaires
pt_pt: Hosts Prioritarios em Topo

source: Secondary Priority Hosts
de: Hosts mit der zweithöchsten Priorität
es: Invitados secundarios
fr: Hôtes secondaires
pt_pt: Hosts prioritarios secundarios

source: HTTP Action Link
de: HTTP-Aktionslink
es: Enlace HTTP externo
fr: Lien HTTP externe
pt_pt: Link de ação HTTP

source: Notification is disabled
de: Benachrichtigung ist deaktiviert
es: Notificaciones deshabilitadas
fr: Notifications désactivées
pt_pt: As Notificaçãos estão desativadas

source: Y/m/d H:i:s
de: a/m/d h:min:s
es: d/m/Y - H: i: s
fr: d/m/Y - H:i:s
pt_pt: d/m/Y - H:i:s

source: Please enter a comment
de: Bitte geben Sie einen Kommentar ein
es: Gracias por ingresar un comentario
fr: Merci d'entrer un commentaire
pt_pt: Por favor, adicione um comentário

source: Host Group
de: Hostgruppe
es: Grupo de invitados
fr: Groupe d'hôtes
pt_pt: Grupo de Host

source: Hosts Status
es: Estado de acogida
fr: État des hôtes
pt_pt: Estado de Hosts

source: Services Status
es: Estado de servicios
fr: État des services
pt_pt: Estado de Serviços

source: OK: all pollers are running
es: OK: todos los coleccionistas se están ejecutando
fr: OK: tous les collecteurs sont en cours d'exécution
pt_pt: OK: todos os coletores estão em execução

source: Latency detected on %s; check configuration for better optimisation
es: Latencia detectada en %s; Compruebe la configuración para una mejor optimización
fr: Latence détecté pour %s, contrôler la configuration pour améliorer les performances
pt_pt: Latência detectada em %s, verifique a configuração para uma melhor otimização

source: OK: no latency detected on your platform
es: OK: no se detecta latencia en tu plataforma
fr: OK: aucune latence détectée sur votre plateforme
pt_pt: OK: nenhuma latência detectada na sua plataforma

source: Some database poller updates are not active; check your Monitoring platform
es: Algunos coleccionistas no actualizan la base de datos; controla tu plataforma de supervisión
fr: Certains collecteurs ne mettent pas à jour la base de données; contrôler votre plate-forme de supervision
pt_pt: Alguns coletores não atualizaram o banco de dados; Verifique sua plataforma de Monitoramento

source: OK: all database poller updates are active
es: OK: todas las actualizaciones de la base de datos para tus coleccionistas están activas
fr: OK: toutes les mises à jour des bases de données de vos collecteurs sont actives
pt_pt: OK: todos os bancos de dados de coletores estão atualizados.

source: Sort results (ascendant)
de: Ergebnisse sortieren (aufsteigend)
es: Ordenar resultados (ascendente)
fr: Trier les résultats (ascendant)
pt_pt: Ordenar resultados (ascendente)

source: Sort results (descendant)
de: Ergebnisse sortieren (absteigend)
es: Ordenar resultados (descendiendo)
fr: Trier les résultats (descendant)
pt_pt: Ordenar resultados (descendente)

source: Sort by Host Name
de: Nach Hostname sortieren
es: Ordenar por nombre de host
fr: Trier par nom d'hôte
pt_pt: Ordenar por nome de host

source: Sort by host name
de: Nach Hostname sortieren
es: Ordenar por nombre de host
fr: Trier par nom d\'hôte
pt_pt: Ordenar por nome de host

source: Sort by service description
de: Nach Servicebeschreibung sortieren
es: Ordenar por nombre de servicio
fr: Trier par nom de service
pt_pt: Ordenar por descrição de serviço

source: Sort by status
de: Nach Status sortieren
es: Ordenar por estado
fr: Trier par statut
pt_pt: Ordenar por estado

source: Sort by last change date
de: Nach letztem Änderungsdatum sortieren
es: Ordenar por tiempo pasado en el estado actual
fr: Trier selon la durée passée dans l'état courant
pt_pt: Ordenar por data de última alteração

source: Sort by last hard state change date
de: Nach letztem HARD-Zustandsänderungsdatum sortieren
es: Ordenar por último cambio en estado difícil hasta la fecha
fr: Trier selon le dernier changement d'état hard en date
pt_pt: Ordenar por data de alteração de estado válida

source: Sort by last check
de: Nach letzter Überprüfung sortieren
es: Ordenar por fecha del último cheque
fr: Trier selon la date de dernière vérification
pt_pt: Ordenar por última checagem

source: Sort by retries number
de: Nach der Anzahl der Wiederholungsversuche sortieren
es: Ordenar por número de intentos
fr: Trier par nombre d'essais
pt_pt: Ordenar por número de tentativas

source: Sort by plugin output
de: Nach Pluginoutput sortieren
es: Ordenar de acuerdo con el mensaje de salida de las sondas
fr: Trier selon le message de sortie des sondes
pt_pt: Ordenar pela a saída do plugin

source: Services : Schedule immediate check
de: Services: Sofortige Überprüfung ansetzen
es: Servicios: Planifica un cheque inmediato.
fr: Services : Planifier un contrôle immédiat
pt_pt: Serviços : Agendar checagem imediata

source: Services : Schedule immediate check (Forced)
de: Services: Sofortige Überprüfung ansetzen (erzwungen)
es: Servicios: Planificar un cheque inmediato (Forzado)
fr: Services : Planifier un contrôle immédiat (Forcé)
pt_pt: Serviços : Agendar checagem imediata (Forçada)

source: Services : Set Downtime
de: Services: Ausfallszeit ansetzen
es: Servicios: Añadir un tiempo de inactividad
fr: Services : Ajouter une plage de maintenance
pt_pt: Serviços : Configurar Manutenção

source: Warning
de: Warnung
es: advertencia
fr: Alerte
pt_pt: Alerta

source: Critical
de: Kritisch
es: crítico
fr: Critique
pt_pt: Critico

source: Unknown
de: Unbekannt
es: desconocido
fr: Inconnu
pt_pt: Desconhecido

source: Service Problems
de: Serviceprobleme
es: Problemas en progreso
fr: Problèmes en cours
pt_pt: Serviço com Problemas

source: Service Status
es: Estado del servicio
fr: Statut du service
pt_pt: Estado do Serviço

source: HTTP Link
es: Link HTTP
fr: Lien HTTP
pt_pt: Link HTTP

source: Host is currently on downtime
de: Host befindet sich momentan in einer Ausfallszeit
es: El anfitrión está actualmente en un punto muerto
fr: L'hôte est actuellement en période d'arrêt
pt_pt: O Host esta atualmente em manutenção

source: Problem has been acknowledged
de: Problem wurde zur Kenntnis genommen
es: El problema ha sido reconocido.
fr: Le problème a été acquitté
pt_pt: O Problema foi colocado em conhecimento

source: This host is only checked in passive mode
de: Dieser Host wird nur im passiven Modus überprüft
es: El host se controla solo en modo pasivo
fr: L'hôte est contrôlé uniquement en mode passif
pt_pt: O Host é somente checado em modo passivo

source: This host is never checked
de: Dieser Host wird nie überprüft
es: Este host nunca se comprueba
fr: Cet hôte n'est jamais vérifié
pt_pt: O host nunca foi checado

source: Service is currently on Downtime
de: Service befindet sich momentan in einer Ausfallszeit
es: El servicio está actualmente en paro.
fr: Le service est actuellement en période d'arrêt
pt_pt: O Serviço esta atualmente em manutenção

source: This service is only checked in passive mode
de: Dieser Service wird nur im passiven Modus überprüft
es: El servicio se controla solo en modo pasivo.
fr: Le service est contrôlé uniquement en mode passif
pt_pt: O Serviço é somente checado em modo passivo

source: This service is neither active nor passive
de: Dieser Service ist weder aktiv noch passiv
es: Este servicio no es activo ni pasivo.
fr: Ce service n'est ni actif ni passif
pt_pt: Este serviço não é ativo e nem passivo

source: This Service is flapping
de: Dieser Service flackert
es: Le statut du service bagote
fr: Le statut du service bagote
pt_pt: O serviço esta variavel

source: Polling instance
de: Polling-Instanz
es: Cuerpo de colección
fr: Instance de collecte
pt_pt: Instancia de Coletor

source: Status Information
es: Estado detallado
fr: Statut détaillé
pt_pt: Informações de Estado

source: Current Attempt
de: Derzeitiger Versuch
es: Tentativo
fr: Tentative
pt_pt: Tentativa Atual

source: State Type
de: Zustandstyp
es: Tipo de estado
fr: Type d'état
pt_pt: Tipo de Estado

source: Last State Change
de: Letzte Zustandsänderung
es: Cambio de ultimo estado
fr: Changement du dernier état
pt_pt: Última Alteração de Estado

source: Current State Duration
de: Zeit im derzeitigen Zustand
es: Duración del estado actual.
fr: Durée de l'état actuel
pt_pt: Duração Atual do Estado

source: Last Notification
de: Letzte Benachrichtigung
es: Última notificación
fr: Dernière notification
pt_pt: Última Notificação

source: Current Notification Number
de: Derzeitge Benachrichtigungsnummer
es: Número de notificación actual
fr: Numéro de notification actuel
pt_pt: Número Atual de Notificações

source: In Scheduled Downtime?
de: In einer angesetzten Ausfallszeit?
es: ¿Dejar de planificar en progreso?
fr: Planification d'arrêt en cours?
pt_pt: Em Agendamento de Manutenção ?

source: Last Update
de: Letztes Update
es: última actualización
fr: Dernière mise à jour
pt_pt: Última Atualização

source: Timezone
de: Zeitzone
es: Huso horario
fr: Fuseau horaire
pt_pt: Fuso horário

source: DOWN
es: NO DISPONIBLE
fr: INDISPONIBLE
pt_pt: INDISPONÍVEL

source: UNREACHABLE
de: NICHT ERREICHBAR
es: inalcanzable
fr: INJOIGNABLE
pt_pt: INALCANÇÁVEL

source: Last time in
de: Letzte Zeit in
es: Última vez
fr: Dernière fois
pt_pt: Última vez em

source: Notes
de: Notizen
es: Notas
pt_pt: Notas

source: Check information
de: Überprüfungsinformation
es: Información de control
fr: Informations sur le contrôle
pt_pt: Informações de Checagem

source: Notification information
de: Benachrichtigungsinformationen
es: Informacion de notificacion
fr: Informations sur la notification
pt_pt: Informação de Notificação

source: Last Status Change
de: Letzte Statusänderung
es: Último cambio de estado
fr: Dernier changement de statut
pt_pt: Última Alteração de Estado

source: Extended information
de: Erweiterte Informationen
es: informaciones suplementarias
fr: Informations supplémentaires
pt_pt: Informação Extendida
