
<HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//FR">

<html>
<head>
<title>A Propos de Nagios</title>

<STYLE type="text/css">
<!--
        .Trademark { font-size: x-small; }

        .Disclaimer { text-align: center; font-size: xx-small; font-style: italic; }

        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
  <h2 class="PageTitle">A Propos de Nagios<sup class="Trademark">TM</sup></h2>

</div>
<p></p>
<hr>

<p>
<a name="whatis"></a>
<strong><u>Qu'est-ce que Nagios?</u></strong>
</p>
<p> Nagios<sup class="Trademark">TM</sup> est une application permettant la surveillance 
  syst&egrave;me et r&eacute;seau. Elle surveille les h&ocirc;tes et services que vous sp&eacute;cifiez, 
  vous alertant lorsque les syst&egrave;mes vont mal et quand ils vont mieux.</p>

<p> Nagios<sup class="Trademark">TM</sup> a &eacute;t&eacute; pr&eacute;vu &agrave; l'origine pour fonctionner 
  sous <a href="http://www.linux.org">Linux [Anglais]</a>, toutefois il devrait 
  fonctionner &eacute;galement sous les autres syst&egrave;mes Unix. </p>
<p> Quelques-unes des fonctionnalit&eacute;s incluses dans Nagios <sup class="Trademark">TM</sup> 
  : </p>

<p>
<ul>
  <li>Surveillance des services r&eacute;seaux (SMTP, POP3, HTTP, NNTP, PING, etc.) 
  <li>Surveillance des ressources des h&ocirc;tes (charge processeur, utilisation des 
    disques, etc.) 
  <li>Syst&egrave;me simple de plugins permettant aux utilisateurs de d&eacute;velopper facilement 
    leurs propres v&eacute;rifications de services. 
  <li>Parall&eacute;lisation de la v&eacute;rifications des services. 
  <li>Possibilit&eacute; de d&eacute;finir la hi&eacute;rarchie du r&eacute;seau en utilisant des h&ocirc;tes "parents", 
    ce qui permet la d&eacute;tection et la distinction entre les h&ocirc;tes qui sont &agrave; l'arr&ecirc;t 
    et ceux qui sont injoignables. 
  <li>Notifications des contacts quand un h&ocirc;te ou un service a un probl&egrave;me et quand celui-ci est r&eacute;solu 
    (via email, pager, sms, ou par tout autre m&eacute;thode d&eacute;finie par l'utilisateur) 
  <li>Possibilit&eacute; de d&eacute;finir des gestionnaires d'&eacute;v&egrave;nements qui s'ex&eacute;cutent pour 
    des &eacute;v&egrave;nements sur des h&ocirc;tes ou des services, pour une r&eacute;solution pro-active 
    des probl&egrave;mes 
  <li>Rotation automatique des fichiers log 
  <li>Support pour l'impl&eacute;mentation de la surveillance redondante des h&ocirc;tes
  <li>Interface web optionnelle, pour voir l'&eacute;tat actuel du r&eacute;seau, notification 
    et historique des probl&egrave;mes, fichiers log, etc. 

</ul>
<p></p>


<p>
<a name="requirements"></a>
<strong><u>Pr&eacute;-requis au niveau du Syst&egrave;me</u></strong>
</p>
<p>
<i>Le seul pr&eacute;-requis pour le fonctionnement de Nagios est une machine fonctionnant sous Linux (ou une variante Unix) et un compilateur C - si vous d&eacute;sirez le compiler vous-m&ecirc;me -.</i>  Il faudra &eacute;galement que TCP/IP soit configur&eacute;, car la plupart des v&eacute;rifications de services seront faites par le r&eacute;seau.

</p>
<p>
Vous <i>n'</i>&ecirc;tes <i>pas oblig&eacute;</i> d'utiliser les CGIs inclus dans Nagios.  Toutefois, si vous d&eacute;cidez de les utiliser, vous devrez avoir les composants logiciels suivants install&eacute;s...
</p>

<p>
<ol>
<li>Un serveur Web (de pr&eacute;f&eacute;rence <a href="http://www.apache.org" target="_top">Apache [Anglais]</a>)

<li>La <a href="http://www.boutell.com/gd">librairie gd [Anglais]</a> de Thomas Boutell's, version 1.6.3 or sup&eacute;rieure (requise par les CGIs <a href="cgis.html#statusmap_cgi">statusmap</a> et <a href="cgis.html#trends_cgi">trends</a>)
</ol>
<p></p>

<p>
<a name="licensing"></a>
<strong><u>Licence</u></strong>

</p>
<p class="SectionBody"> Nagios<sup class="Trademark">TM</sup> est distribu&eacute; 
  sous les termes de la <a href="http://www.gnu.org/copyleft/gpl.html">GNU General 
  Public License [Anglais]</a> Version 2 comme publi&eacute;e par la <a href="http://www.fsf.org">Free 
  Software Foundation [Anglais]</a>. Cette licence vous donne la permission l&eacute;gale 
  de copier, distribuer et/ou modifier Nagios sous certaines conditions. R&eacute;f&eacute;rez-vous 
  au fichier 'LICENSE' inclus dans la distribution Nagios ou lisez la <a href="http://www.gnu.org/copyleft/gpl.html">version 
  en-ligne de la licence [Anglais]</a> pour plus de d&eacute;tails. </p>

<p class="SectionBody"><b>[NdT] </b>: Une traduction fran&ccedil;aise de la GPL 
  version 2 est disponible sur le <a href="http://fsffrance.org/gpl/gpl-fr.fr.html">site 
  fran&ccedil;ais de la Free Software Foundation.</a> </p>
<p class="SectionBody"><b>[NdT] </b>: Cette traduction est &eacute;galement distribu&eacute;e 
  sous les termes de la <a href="http://www.gnu.org/copyleft/fdl.html">GNU Free 
  Documentation License [Anglais]</a></p>
<p><br />
  <b>Pour Nagios : </b><br />

  Ce programme est un logiciel libre ; vous pouvez le redistribuer et/ou le modifier 
  au titre des clauses de la Licence Publique G&eacute;n&eacute;rale GNU, telle 
  que publi&eacute;e par la Free Software Foundation ; soit la version 2 de la 
  Licence, ou (&agrave; votre discr&eacute;tion) une version ult&eacute;rieure 
  quelconque. Ce programme est distribu&eacute; dans l'espoir qu'il sera utile, 
  mais SANS AUCUNE GARANTIE ; sans m&ecirc;me une garantie implicite de COMMERCIABILITE 
  ou DE CONFORMITE A UNE UTILISATION PARTICULIERE. Voir la Licence Publique G&eacute;n&eacute;rale 
  GNU pour plus de d&eacute;tails. Vous devriez avoir re&ccedil;u un exemplaire 
  de la Licence Publique G&eacute;n&eacute;rale GNU avec ce programme ; si ce 
  n'est pas le cas, &eacute;crivez &agrave; la Free Software Foundation Inc., 
  51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.</p>

<p><b>Pour la traduction : <br />
  </b>Copyright (c) 2006-2007 pour <a href="#traducteurs">l'&eacute;quipe de traduction</a> 
  .<br />
  Cette documentation est une documentation libre; vous pouvez la redistribuer 
  et/ou la modifier au titre des clauses de la <a href="http://www.gnu.org/copyleft/fdl.html">GNU 
  Free Documentation License[Anglais]</a>, Version 1.2, ou (&agrave; votre discr&eacute;tion) 
  une version ult&eacute;rieure quelconque. Une copie de cette licence est incluse 
  dans cette documention <a href="fdl.txt">ici [Anglais].</a><br />

</p>
<p></p>
<p>
<a name="acknowledgements"></a>
<strong><u>Remerciements</u></strong>
</p>
<p>
Beaucoup de monde a contribu&eacute; &agrave; Nagios, en signalant des bugs, en sugg&eacute;rant des am&eacute;liorations, en &eacute;crivant des plugins, etc.  Une liste de quelques-uns des nombreux contributeurs au d&eacute;veloppement de Nagios se trouvent sur <a href="http://www.nagios.org/">http://www.nagios.org [Anglais]</a>.

</p>

<p>
<a name="downloading"></a>
<strong><u>T&eacute;l&eacute;charger la derni&egrave;re version</u></strong>
</p>
<p> Vous pouvez trouver les nouvelles versions de Nagios sur <a href="http://www.nagios.org" target="_top">http://www.nagios.org 
  [Anglais]</a>. </p>

<p> <b><u>Traduction:</u></b></p>

<p>Notes de traduction : <br />
</p>
<ul>
  <li>Pour certains termes traduits, la version originale anglaise est sp&eacute;cifi&eacute;e 
  entre crochet : <i>m&eacute;thode de d&eacute;lai inter-contr&ocirc;les de service</i> 
  [service_inter_check_delay_method]<br />
  Ceci est utilis&eacute; lorsque les termes anglais sont des variables de configurations, 
  des &eacute;l&eacute;ments dans l'interface Nagios, ou des anglicismes fr&eacute;quements 
  utilis&eacute;s.
  </li>

<li>Le &quot;je&quot; a &eacute;t&eacute; conserv&eacute; de la documentation 
  originale et fait bien entendu r&eacute;f&eacute;rence &agrave; Ethan Galstad.
</li>
</ul>
<p>&nbsp;</p>
<p>La traduction de ce manuel est une mise &agrave; jour effectu&eacute;e &agrave; 
  partir de celle de Nagios version 1 cr&eacute;e par Pierre-Antoine Angelini, 
  Johan MOREAU et Christian Vanguers, elle m&ecirc;me tir&eacute;e de la documentation 
  fran&ccedil;aise de NetSaint r&eacute;alis&eacute;e par Xavier Dusart.<br />

</p>
<p><a name="traducteurs"></a>Elle est issue d'un effort collectif des personnes 
  suivantes : </p>
<p><b><u>Equipe de traduction : </u></b></p>
<p>Erwan Ben Souiden<br />
Xavier Dusart<br />
Herv&eacute; Nicol<br />
Patrick Proy<br />
</p>
<p><b><u>Equipe de relecture : </u></b></p>
<p>Herv&eacute; Bouchind'homme<br />
Ren&eacute; Coulet <br />
Philippe Delsol <br />
Johan Moreau<br />
</p>

<hr>

<br clear="all">
<div class="Disclaimer">
Nagios et le logo Nagios sont des marques d&eacute;pos&eacute;es de Ethan Galstad.  Toute autre marque d&eacute;pos&eacute;e, marques, marques enregistr&eacute;es, et marques d&eacute;pos&eacute;es enregistr&eacute;es peuvent &ecirc;tre  la propri&eacute;t&eacute; de leur(s) propri&eacute;taire(s) respectifs.

</div>

</body>
</html>
