
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//FR">

<html>
<head>
<title>Informations aux d&eacute;butants</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Informations aux d&eacute;butants</h2>

</div>
<p></p>
<hr>
<p> F&eacute;licitation pour avoir choisi d'essayer Nagios! Nagios est vraiment puissant et flexible, mais n'est malheureusement pas tr&egrave;s facile pour les d&eacute;butants. Pourquoi? Parce que l'installer et le configurer correctement demande beaucoup de travail. Ceci dit, si vous vous y collez et que vous arrivez &agrave; le faire fonctionner, vous ne voudrez plus vous en passer. :-) Voici quelques &eacute;l&eacute;ments importants &agrave; garder en m&eacute;moire pour ceux qui, parmi vous, &ecirc;tes des utilisateurs de Nagios de la premi&egrave;re heure: </p>

<p>
<ol>
  <li><strong>Relax - Cela va prendre du temps.</strong> N'esp&eacute;rez pas pouvoir 
    compiler Nagios et le d&eacute;marrer sans rien faire. Ce n'est pas si facile. C'est 
    d'ailleurs assez difficile. Si vous ne voulez pas passer du temps &agrave; apprendre 
    comment &ccedil;a fonctionne et pensez voir les choses tourner facilement, ne prenez pas 
    la peine d'utiliser ce logiciel. Au lieu de cela, payez quelqu'un pour surveiller 
    votre r&eacute;seau pour vous ou embauchez quelqu'un pour installer Nagios &agrave; votre 
    place : -)<br />
    <br />

  <li><strong>Lire la documentation.</strong> Nagios est suffisament difficile &agrave; configurer lorsque vous avez une bonne connaissance de son fonctionnement, c'est donc quasiment impossible si vous ne poss&eacute;dez pas ces connaissances .
    Rendez vous service et lisez avant d'essayer d'installer et faire tourner Nagios &agrave; l'aveuglette.
    Si vous &ecirc;tes du genre &agrave; ne pas prendre le temps de lire la documentation, vous vous renderez probablement compte que les autres aussi
    ne trouveront pas de temps pour vous aider quand vous aurez des probl&egrave;mes. RTFM. [<b>NdT </b>: <b>R</b>ead <b>T</b>he <b>F</b>ucking 
    <b>M</b>anual (lisez ce foutu manuel) ]<br /> 
    <br />

 
  <li><strong>Utiliser les fichiers d'exemples de configurations.</strong> 
    Des fichiers d'exemple de configurations sont fournit avec Nagios.
    Regardez les, modifiez les en fonction de vos besoins et testez les !
    Les fichiers d'exemple ne sont que cela - des exemples.
    Il y a de tr&egrave;s fortes chances qu'ils ne fonctionnent pas pour vous sans modifications.
    Les fichiers d'exemple de configurations peuvent &ecirc;tre trouv&eacute;s dans le sous-r&eacute;pertoire <i>sample-config/</i> de la distribution Nagios.<br />

    <br />
  <li><strong>Demandez de l'aide aux autres.</strong> Si vous avez lu la documentation, 
    pass&eacute; en revu les fichiers d'exemple de configurations,
    et avez toujours des probl&egrave;mes, essayez d'envoyer un mail d&eacute;crivant vos probl&egrave;mes &agrave; la liste de diffusion 
    <i>nagios-users</i>. Avec tout le travail que j'ai [NdT:Ethan Galstad] &agrave; faire pour ce projet,
    je suis dans l'incapacit&eacute; de r&eacute;pondre &agrave; la plus part des questions qui me sont envoy&eacute;es directement,
    alors votre meilleure source d'aide sera la liste de diffusion.
    Si vous avez bien lu auparavant et que vous fournissez une bonne description de votre probl&egrave;me,
    il y a de fortes chances que quelqu'un vous donne des pistes pour faire fonctionner les choses proprement.
    <br />

    <b>[NdT</b> : Un forum francophone existe &agrave; l'adresse suivante : <a href="http://forums.opsyx.com/">http://forums.opsyx.com/</a>]. 
    <br />
</ol>
<hr>

</body>
</html>

