


<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<HEAD><TITLE>Permissions du fichier de commandes externe</TITLE>
<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->
</STYLE>

<BODY bgColor=#ffffff text=black class="Default">
<P>
  <div align=center> 
    <h2 class="PageTitle">Permissions du fichier de commandes externe</h2>
  </div>
<p></P>
<HR>

<P> <STRONG><U>Notes</U></STRONG></P>
<P>Toutes les manipulations d&eacute;crites ici peuvent &ecirc;tre effectu&eacute;es 
  automatiquement lors de l'installation : <a href="#notes">regardez ici</a>.</P>
<P>Ces instructions supposent que vous avez install&eacute; Nagios sur une machine 
  d&eacute;di&eacute;e qui n'a aucun compte d'utilisateurs standards ( c.a.d qui 
  n'est pas une machine accessible au public). Si Nagios est install&eacute; sur 
  une machine publique/multi-utilisateurs, je vous sugg&egrave;re de mettre en 
  place des permissions d'acc&egrave;s plus restrictives sur le fichier de commandes 
  externes et d'utiliser, par exemple, <a href="http://cgiwrap.unixtools.org/">CGIWrap</a> 
  pour ex&eacute;cuter les CGIs sous un utilisateur sp&eacute;cifique. Si vous 
  ne le faites pas, vous pourriez ainsi permettre &agrave; des utilisateurs lambda 
  de contr&ocirc;ler Nagios gr&acirc;ce aux commandes externes ! Je suppose que 
  vous ne le voulez pas. Vous trouverez plus d'informations sur la s&eacute;curisation 
  de Nagios <a href="security.html">ici</a></P>

<P><STRONG><U>Introduction</U></STRONG> </P>

<P>Un des probl&egrave;mes les plus communs que les utilisateurs rencontrent semble &ecirc;tre 
  la configuration correcte des permissions pour le fichier de commande externe. 
  Vous devez param&eacute;trer correctement les permissions dans le <b>r&eacute;pertoire</b> 
  <i>/usr/local/nagios/var/rw</i> (ou tout autre chemin d&eacute;fini par la 
  directive <a href="configmain.html#command_file">fichier de commande</a> dans 
  votre <a href="configmain.html">fichier de configuration principal</a>). Je 
  vais vous montrer comment le faire. Note : Vous devez &ecirc;tre <i>root</i> pour 
  pouvoir ex&eacute;cuter certaines &eacute;tapes...</P>

<P><b><u>Utilisateurs et Groupes</u></b> </P>

<P>Tout d'abord, trouvez l'utilisateur sous lequel le serveur web fonctionne. 
  Sur de nombreux syst&egrave;mes, c'est l'utilisateur <i>nobody ou apache </i>bien que 
  cela d&eacute;pende de l'OS ou de la distribution que vous utilisez. Vous aurez aussi 
  besoin de savoir sous quel utilisateur tourne Nagios - cela est d&eacute;fini 
  par la variable <a href="configmain.html#netsaint_user">nagios_user</a> du fichier 
  de configuration principal.</P>
<P>Puis, cr&eacute;ez un nouveau groupe qui va inclure l'utilisateur qui fait 
  tounrer le serveur web, ainsi que l'utilisateur qui fait tourner Nagios. Appelons 
  ce groupe '<b>nagiocmd</b>' (appelez le autrement si vous le souhaitez). Sur 
  la RedHat, vous pouvez utiliser la commande suivante pour ajouter un nouveau 
  groupe (elle peut &ecirc;tre diff&eacute;rente sur d'autres syst&egrave;mes) 
  : </P>

<P><FONT color=red>/usr/sbin/groupadd nagiocmd</FONT> </P>
<P>Ensuite, ajoutez au nouveau groupe l'utilisateur du serveur web (<i>nobody 
  ou apache, etc ..</i>) et l'utilisateur de Nagios (<i>nagios</i>) &agrave; l'aide de 
  la commande suivante :</P>
<P> <FONT color=red>/usr/sbin/usermod -G nagiocmd nagios</FONT> <br />
  <FONT color=red>/usr/sbin/usermod -G nagiocmd nobody</FONT> </P>

<P>
<b><u>Cr&eacute;ation du r&eacute;pertoire</u></b>
</P>
<P>Ensuite, cr&eacute;ez le r&eacute;pertoire dans lequel le fichier de commande 
  devra &ecirc;tre stock&eacute;. Par d&eacute;faut, c'est <i>/usr/local/nagios/var/rw</i>, 
  bien qu'il puisse &ecirc;tre chang&eacute; en modifiant le chemin sp&eacute;cifi&eacute; 
  dans le r&eacute;pertoire <a href="configmain.html#command_file">command_file</a>. 

</P>
<P>
<FONT color=red>mkdir /usr/local/nagios/var/rw</FONT>
</P>

<P>
<b><u>Configuration des permissions du r&eacute;pertoire</u></b>
</P>
<P>Ensuite, changez le propri&eacute;taire du r&eacute;pertoire qui va &ecirc;tre utilis&eacute; pour garder le fichier de commande...

</P>
<P><FONT color=red>chown nagios:nagiocmd /usr/local/nagios/var/rw</FONT> </P>
<P>Assurez-vous que l'utilisateur Nagios dispose de toutes les permissions sur 
  ce r&eacute;pertoire... </P>
<P><FONT color=red>chmod u+rwx /usr/local/nagios/var/rw</FONT>
</P>

<P>Assurez-vous que le groupe que vous avez cr&eacute;&eacute; a les permissions 
  de lecture et d'&eacute;criture sur le r&eacute;pertoire. </P>

<p> <font color="red">chmod g+rw /usr/local/nagios/var/rw</font> </p>
<p> Pour forcer les fichiers nouvellement cr&eacute;&eacute;s dans le r&eacute;pertoire 
  &agrave; h&eacute;riter des permissions de groupe du r&eacute;pertoire, il nous 
  faut activer le bit de rappel [<i>sticky bit</i>] du groupe sur le r&eacute;pertoire...</p>
<p> <font color="red">chmod g+s /usr/local/nagios/var/rw</font> </p> 



<P>
<b><u>V&eacute;rification des permissions</u></b>
</P>

<P>V&eacute;rifiez les permissions sur le sous-r&eacute;pertoire rw/ en tapant '<b>ls -al /usr/local/nagios/var</b>'. Vous devriez voir quelque chose ressemblant &agrave; :</P>
<P><FONT color=red>
<PRE>drwxrws---   2 nagios nagiocmd     1024 Aug 11 16:30 rw</PRE>

</FONT>
<p></P>

<P>Notez que l'utilisateur <i>nagios</i> est le propri&eacute;taire du r&eacute;pertoire et 
  que le groupe <i>nagiocmd</i> est le groupe propri&eacute;taire du r&eacute;pertoire. L'utilisateur 
  <i>nagios</i> a les permissions <b>rwx</b> et le groupe <i>nagiocmd</i> a les 
  permissions <b>rw</b> sur le r&eacute;pertoire. Notez &eacute;galement que le bit de 
  rappel du groupe est activ&eacute;. C'est ce que nous voulons... </P>

<P><STRONG><U>Red&eacute;marrez votre serveur Http</U></STRONG></P>
<P>Une fois que vous avez mis des permissions correctes sur le r&eacute;pertoire 
  contenant les fichiers de commande externe, assurez vous que vous avez red&eacute;marr&eacute; 
  votre serveur http. Si vous ne le faites pas, apache ne sera pas autoris&eacute; 
  &agrave; &eacute;crire dans le fichier de commandes externes, m&ecirc;me si 
  l'utilisateur qui fait tourner celui-ci est membre du groupe nagiocmd.</P>
<P><STRONG><U><a name="notes"></a>Notes...</U></STRONG> </P>
<P>Si vous avez pr&eacute;cis&eacute; l'option <b>--with-command-grp=<i>somegroup</i></b> lors du lancement du script de configuration, vous pouvez cr&eacute;er le r&eacute;pertoire qui gardera automatiquement le fichier de commande et configurera les permissions correctes en tapant '<b>make install-commandmode</b>'.

</P>
<HR>

</BODY>
</html>
