
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">



<html>

<head>

<title>Utilisation de l'interpr&eacute;teur Perl int&eacute;gr&eacute;</title>

<STYLE type="text/css">

<!--

        .Default { font-family: verdana,arial,serif; font-size: 8pt; }

        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }

-->

</STYLE>

</head>



<body bgcolor="#FFFFFF" text="black" class="Default">



<p>

<div align="center">

  <h2 class="PageTitle">Utilisation de l'interpr&eacute;teur Perl int&eacute;gr&eacute;</h2>

</div>

<p></p>



<hr>



<p>

<strong><u>Introduction</u></strong>

</p>



<p> Stephen Davies a cr&eacute;&eacute; du code permettant de compiler Nagios 

  avec un interpr&eacute;teur Perl int&eacute;gr&eacute;. Ceci peut &ecirc;tre 

  int&eacute;ressant si vous utilisez massivement des plugins &eacute;crits en 

  Perl. </p>

<p> Stanley Hopcroft a beaucoup travaill&eacute; sur l'interpr&eacute;teur Perl 

  int&eacute;gr&eacute; et a comment&eacute; les avantages et d&eacute;savantages 

  de son utilisation. Il a &eacute;galement donn&eacute; plusieurs indices utiles 

  pour &eacute;crire des plugins Perl qui fonctionnent correctement avec l'interpr&eacute;teur 

  int&eacute;gr&eacute;. La majeure partie de cette documentation provient de 

  ses commentaires. </p>

<p> Notez que "ePN", tel qu'il est utilis&eacute; dans cette documentation, fait 

  r&eacute;f&eacute;rence &agrave; Perl int&eacute;gr&eacute; &agrave; Nagios 

  [embedded Perl Nagios], ou si vous pr&eacute;f&eacute;rez, Nagios compil&eacute; 

  avec un interpr&eacute;teur Perl int&eacute;gr&eacute;.</p>



<p> <strong><u>Avantages</u></strong> </p>



<p> Parmi les avantages de ePN [embedded Perl Nagios] on compte : </p>



<p>

<ul>

  <li>Nagios passera beaucoup moins de temps &agrave; ex&eacute;cuter vos plugins 

    Perl car il n'a plus besoin de cr&eacute;er un sous-processus [fork] pour 

    lancer le plugin (en chargeant &agrave; chaque fois l'interpr&eacute;teur 

    Perl). Il ex&eacute;cute maintenant votre plugin gr&acirc;ce &agrave; un appel 

    de biblioth&egrave;que.<br />

    <br />

  <li>Il r&eacute;duit grandement l'impact sur le syst&egrave;me des plugins Perl 

    et/ou vous permet de lancer plus de contr&ocirc;les en plugin Perl que ce 

    dont vous seriez capables autrement. En d'autres termes, vous &ecirc;tes moins 

    tent&eacute; d'&eacute;crire vos plugins en d'autres langages comme C/C++, 

    ou Expect/TCL, qui sont g&eacute;n&eacute;ralement consid&eacute;r&eacute;s 

    comme ayant un cycle de d&eacute;veloppement plus long que Perl (m&ecirc;me 

    s'ils tournent a peu pr&egrave;s dix fois plus vite &#151; TCL &eacute;tant 

    une exception).<br />

    <br />

  <li>Si vous n'&ecirc;tes pas un d&eacute;veloppeur C, vous pouvez quand m&ecirc;me 

    faire beaucoup de choses avec Nagios en laissant Perl faire le gros du travail, 

    sans que Nagios ne soit trop ralenti. Ceci dit, notez que ePN n'acc&eacute;l&egrave;rera 

    pas votre plugin (une fois &ocirc;t&eacute; le temps de chargement de l'interpr&eacute;teur). 

    Si vous voulez des plugins plus rapides, alors tournez-vous vers les XSUB 

    Perl (XS), ou C <i>apr&egrave;s</i> vous &ecirc;tre assur&eacute; que votre 

    Perl est propre et que votre algorithme est correct (l'apport de Benchmark.pm 

    <i>n'a pas de prix</i> pour comparer les performances des &eacute;l&eacute;ments 

    de langage Perl).<br />

    <br />

  <li>L'utilisation de ePN est un excellent moyen d'en apprendre plus sur Perl.<br />

</ul>

<p> <strong><u>D&eacute;savantages</u></strong> </p>



<p> Les d&eacute;savantages de ePN [embedded Perl Nagios] ressemblent beaucoup 

  &agrave; ceux du mod_perl d'Apache (i.e. Apache avec un interpr&eacute;teur 

  Perl int&eacute;gr&eacute;) par rapport &agrave; l'Apache standard : </p>



<p>

<ul>

  <li>Un programme Perl qui fonctionne <i>parfaitement</i> avec Nagios standard 

    peut <i>ne pas</i> fonctionner avec ePN. Il vous faudra peut-&ecirc;tre modifier 

    vos plugins pour qu'ils tournent.<br />

    <br />

  <li>Les plugins Perl sont plus difficiles &agrave; d&eacute;boguer sous ePN 

    qu'avec un Nagios standard.<br />

    <br />

  <li>Votre ePN aura une plus grande taille (encombrement en m&eacute;moire) qu'un 

    Nagios standard.<br />

    <br />

  <li>Certaines constructions [constructs] Perl ne peuvent pas &ecirc;tre utilis&eacute;es, 

    ou peuvent se comporter diff&eacute;remment de ce &agrave; quoi vous vous 

    attendiez.<br />

    <br />

  <li>Il vous faudra conna&icirc;tre &quot;plus d'une fa&ccedil;on de le faire&quot;, 

    et peut-&ecirc;tre choisir celle qui semble la moins attirante ou &eacute;vidente.<br />

    <br />

  <li>Il vous faudra une meilleure connaissance de Perl (mais rien de bien &eacute;sot&eacute;rique 

    ou concernant la structure interne de Perl &#151; sauf si vous utilisez les 

    XSUBS).<br />

</ul>

<p> <strong><u>Public</u></strong><u><strong> vis&eacute;</strong></u></p>



<p>

<ul>

  <li>Les d&eacute;veloppeurs Perl moyens ; ceux qui connaissent la puissance 

    des fonctionnalit&eacute;s du langage sans en conna&icirc;tre les rouages 

    internes.<br />

    <br />

  <li>Ceux qui ont un point de vue utilitaire plut&ocirc;t qu'une profonde compr&eacute;hension 

    [sic].<br />

    <br />

  <li>Si vous aimez les objets Perl, la gestion de noms, les structures de donn&eacute;es, 

    et le d&eacute;bogueur, cela suffit sans doute.<br />

    <br />

</ul>

<p> <strong><u>Ce que vous devez faire quand vous &eacute;crivez un plugin Perl 

  (ePN ou pas)</u></strong> </p>



<p>

<ul>

  <li>G&eacute;n&eacute;rez <b>toujours</b> un affichage<br />

    <br />

  <li>Utilisez &quot;use utils&quot; et importez ce qui en est export&eacute; 

    ($TIMEOUT %ERRORS &amp;print_revision &amp;support)<br />

    <br />

  <li>Jetez un &#156;il sur la fa&ccedil;on dont sont &eacute;crits les plugins 

    Perl standard, comme par exemple :<br />

    <br />

    <ul>

      <li>Quittez toujours avec une valeur $ERRORS{CRITICAL}, $ERRORS{OK}, etc. 

      <li>Utilisez getopt pour lire les param&egrave;tres de la ligne de commande 

      <li>G&eacute;rez les d&eacute;passements de d&eacute;lai

      <li>Appelez print_usage (que vous fournissez) quand il n'y a pas de param&egrave;tres 

        &agrave; la commande 

      <li>Utilisez des noms de param&egrave;tres standard (par exemple H 'host', 

        V 'version') 

    </ul>

</ul>

<p></p>





<p> <strong><u>Ce que vous devez faire quand vous &eacute;crivez un plugin Perl 

  pour ePN</u></strong> </p>



<p>

<ol>

  <li>&lt;DATA&gt; ne peut pas &ecirc;tre utilis&eacute; ; utilisez ici des documents 

    &agrave; la place, par exemple :<br />

    <br />

    <dir> 

      <pre>

my $data = &lt;&lt;DATA;

portmapper 100000

portmap 100000

sunrpc 100000

rpcbind 100000

rstatd 100001

rstat 100001

rup 100001

..

DATA



%prognum = map { my($a, $b) = split; ($a, $b) } split(/\n/, $data) ;

</pre>

    </dir>

  <li>Les blocks BEGIN ne fonctionneront pas comme vous l'attendez. Il vaut mieux 

    les &eacute;viter.<br />

    <br />

  <li>Assurez-vous de la parfaite propret&eacute; du code &agrave; la compilation, 

    i.e.<br />

    <br />

    <ul>

      <li>utilisez use strict 

      <li>utilisez perl -w (les autres param&egrave;tres (notamment T) ne sont 

        d'aucune aide) 

      <li>utilisez perl -c 

    </ul>

    <br />

    <br />

  <li>Evitez les variables de port&eacute;e lexicale (my) d&eacute;clar&eacute;es 

    globalement comme moyen de passer des <u>variables</u> aux fonctions. En fait 

    ceci est <u>fatal</u> si la fonction est appel&eacute;e par le plugin plus 

    d'une fois lorsque le contr&ocirc;le est ex&eacute;cut&eacute;. Ces fonctions 

    se comportent comme des encapsulations [closures] qui verrouillent les variables 

    lexicales globales sur leur premi&egrave;re valeur lors des appels suivants 

    &agrave; la fonction. Si toutefois votre variable globale est en lecture seule 

    (une structure de donn&eacute;es complexe par exemple), ce n'est pas un probl&egrave;me. 

    Ce que Bekman <a href="http://perl.apache.org/guide/">recommande en remplacement</a> 

    est une des solutions suivantes :<br />

    <br />

    <ul>

      <li>faites une fonction anonyme et appelez-la &agrave; travers une r&eacute;f&eacute;rence 

        au code, par exemple :<br />

        <br />

        <dir> 

          <pre>

remplacez ceci                par  



my $x = 1 ;                   my $x = 1 ;

sub a { .. Process $x ... }   $a_cr = sub { ... Process $x ... } ;

.                             .

.                             .

a ;                           &amp;$a_cr ;

$x = 2                        $x = 2 ;

a ;                           &amp;$a_cr ;



# les encapsulations anonymes reprennent __toujours__ la valeur lexicale courante</pre>

        </dir>

      <li>mettez la variable globale et la fonction qui l'utilise dans leur propre 

        paquetage [package] (comme objet ou module) 

      <li>passez les variables aux fonctions comme r&eacute;f&eacute;rences ou 

        alias (\$lex_var ou $_[n]) 

      <li>remplacez les variables lexicales par des variables globales au paquetage 

        et excluez les des objections faites par &quot;use strict&quot; en d&eacute;clarant 

        &quot;use vars qw(global1 global2 ..)&quot; 

    </ul>

    <br />

  <li>Sachez o&ugrave; trouvez plus d'informations.<br />

    <br />

    <dir> 

      <p> Vous pouvez obtenir des informations utiles des indices habituels (les 

        livres O'Reilly, plus &quot;Object Oriented Perl" de Damien Conways) mais 

        pour les bonnes r&eacute;ponses dans ce contexte commencez par le guide 

        du mod_perl de Stas Bekman sur <a href="http://perl.apache.org/guide/">http://perl.apache.org/guide/</a>.</p>

      <p> Ce document merveilleux au format livre n'a strictement rien &agrave; 

        voir avec Nagios, mais tout &agrave; voir avec l'&eacute;criture de programmes 

        pour l'interpr&eacute;teur Perl int&eacute;gr&eacute; &agrave; Apache 

        (i.e. le mod_perl de Doug MacEachern). </p>

      <p> La page &quot;man&quot; perlembed est essentielle pour le contexte et 

        les encouragements.</p>

      <p> Si l'on consid&egrave;re que Lincoln Stein et Doug MacEachern savent 

        deux-trois choses sur Perl et l'int&eacute;gration de Perl, leur livre 

        &quot;Writing Apache Modules with Perl and C&quot; vaut certainement d'&ecirc;tre 

        lu. </p>

    </dir>

  <li>Sachez que votre plugin peut retourner d'&eacute;tranges valeurs avec ePN, 

    et que cela est probablement d&ucirc; au point 4 ci-dessus.<br />

    <br />

  <li>Soyez pr&ecirc;t &agrave; d&eacute;boguer en :<br />

    <br />

    <ul>

      <li>ayant un ePN de test 

      <li>ajoutant des instructions print &agrave; votre plugin pour afficher 

        la valeur des variables sur STDERR (STDOUT ne peut pas &ecirc;tre utilis&eacute;) 

      <li>ajoutant des instructions print &agrave; p1.pl pour afficher ce qu'ePN 

        pense qu'est votre plugin avant d'essayer de le lancer (vi) 

      <li>lan&ccedil;ant l'ePN en avant-plan (probablement en conjonction avec 

        les recommandations pr&eacute;c&eacute;dentes) 

      <li>utilisant le module &quot;Deparse&quot; sur votre plugin pour voir comment 

        l'analyseur syntaxique l'a optimis&eacute;, et ce que l'interpr&eacute;teur 

        re&ccedil;oit r&eacute;ellement (voir &quot;Constants in Perl&quot; de 

        Sean M. Burke, The Perl Journal, automne 2001) 

    </ul>

    <br />

    <dir> perl -MO::Deparse &lt;votre_programme&gt; </dir>

    <br />

  <li>Sachez qu'ePN transforme votre plugin lui aussi, et si tout le reste a &eacute;chou&eacute; 

    essayez de d&eacute;boguer la version transform&eacute;e.<br />

    <br />

    <dir> 

      <p> Comme vous pouvez le constater ci-dessous p1.pl r&eacute;&eacute;crit 

        votre plugin comme une fonction appel&eacute; 'hndlr' dans le paquetage 

        nomm&eacute; &quot;Embed::&lt;quelque-chose-ayant-rapport-avec-le-nom-de-fichier-de-votre-plugin&gt;&quot;.</p>

      <p> Votre plugin attend peut-&ecirc;tre des param&egrave;tres de la ligne 

        de commande dans @ARGV, donc pl.pl assigne &eacute;galement @_ &agrave; 

        @ARGV. </p>

      <p> Ceci &agrave; son tour est &eacute;valu&eacute; et si &quot;eval&quot; 

        remonte une erreur (qu'elle soit syntaxique ou d'ex&eacute;cution), le 

        plugin est jet&eacute; dehors. </p>

      <p> La copie d'&eacute;cran suivante montre comment un ePN de test a transform&eacute; 

        le plugin <i>check_rpc</i> avant d'essayer de l'ex&eacute;cuter. Seule 

        une petite partie du code du plugin est montr&eacute;e ici, car nous ne 

        nous int&eacute;ressons qu'aux transformations que l'ePN lui fait subir). 

        Les transformations sont affich&eacute;es en rouge : </p>

      <dir> 

        <p> 

        <pre>

<font color="red">

                package main;

                use subs 'CORE::GLOBAL::exit';

                sub CORE::GLOBAL::exit { die "ExitTrap: $_[0] (Embed::check_5frpc)"; }

                package Embed::check_5frpc; sub hndlr { shift(@_);

                @ARGV=@_;</font>

#! /usr/bin/perl -w

#

# check_rpc plugin for nagios

#

# usage:

#    check_rpc host service

#

# Check if an rpc serice is registered and running

# using rpcinfo - $proto $host $prognum 2>&1 |";

#

# Use these hosts.cfg entries as examples

#

# command[check_nfs]=/some/path/libexec/check_rpc $HOSTADDRESS$ nfs

# service[check_nfs]=NFS;24x7;3;5;5;unix-admin;60;24x7;1;1;1;;check_rpc

#

# initial version: 3 May 2000 by Truongchinh Nguyen and Karl DeBisschop

# current status: $Revision: 1.8.2.4

#

# Copyright Notice: GPL

#

<i>... le reste du plugin ci-dessous ...</i>

<font color="red">}</font>

</pre>

        <p></p>

      </dir>

    </dir>

    <br />

  <li>Ne pas utiliser &quot;use diagnostics&quot; dans un plugin lanc&eacute; 

    par votre ePN de production. Je pense qu'il force la valeur de retour &agrave; 

    CRITICAL dans <u>tous</u> les plugins Perl.<br />

    <br />

  <li>Envisagez l'utilisation d'un mini Perl int&eacute;gr&eacute; pour v&eacute;rifier 

    votre plugin. Cela ne suffit pas &agrave; valider votre plugin avec l'ePN, 

    mais si le plugin &eacute;choue &agrave; ce test il &eacute;chouera &eacute;galement 

    avec l'ePN. <font color="red">Un exemple de mini ePN est inclus dans le r&eacute;pertoire 

    <i>contrib/</i> de la distribution de Nagios &agrave; cette fin. Placez-vous 

    dans le r&eacute;pertoire contrib/ et tapez &quot;make mini_epn&quot; pour 

    le compiler. Il doit &ecirc;tre ex&eacute;cut&eacute; depuis le r&eacute;pertoire 

    o&ugrave; se trouve p1.pl (ce fichier est distribu&eacute; avec Nagios).</font> 

    <br />

    <br />

</ol>

<p></p>





<p> <strong><u>Compilation de Nagios avec l'interpr&eacute;teur Perl int&eacute;gr&eacute;</u></strong></p>



<p> Bien, vous pouvez respirer maintenant. Alors, vous voulez <i>toujours</i> 

  compiler Nagios avec l'interpr&eacute;teur Perl int&eacute;gr&eacute; ? ;-) 

</p>



<p> Si vous voulez compiler Nagios avec l'interpr&eacute;teur Perl int&eacute;gr&eacute; 

  il vous faut relancer le script de configuration (configure) avec le param&egrave;tre 

  <font color="red"><i>--enable-embedded-perl</i></font>. Si vous voulez que l'interpr&eacute;teur 

  Perl int&eacute;gr&eacute; utilise un cache interne pour les scripts compil&eacute;s, 

  ajoutez &eacute;galement le param&egrave;tre <font color="red"><i>--with-perlcache</i></font>. 

  Par exemple : </p>



<p>

<font color="red">

<strong>

<pre>

	./configure --enable-embedded-perl --with-perlcache <i>...autres param&egrave;tres...</i>

</pre>

</strong>

</font>

<p></p>

<p></p>





<hr>

</body>

</html>

