
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Contr&ocirc;les Indirects des H&ocirc;tes et des Services</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Contr&ocirc;les Indirects des H&ocirc;tes et des Services</h2>
</div>
</p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Par chance, la plupart des services que vous allez superviser sur votre r&eacute;seau peuvent &ecirc;tre contr&ocirc;l&eacute;s en utilisant directement par un plugin depuis la machine Nagios. 
Les services qui peuvent &ecirc;tre directement contr&ocirc;l&eacute;s sont par exemple la disponibilit&eacute; des serveurs web, email et FTP.
Ces services peuvent &ecirc;tre contr&ocirc;l&eacute;s par un plugin depuis l'h&ocirc;te Nagios parce que ce sont des ressources accessibles directement.
Cependant, il y a un certain nombre de choses dont vous aimeriez superviser mais qui ne sont pas publiquement accessibles comme les autres services.
Ces services/ressources "priv&eacute;s" inclus le taux d'utilisation d'un disque, la charge d'un processeur,etc... d'une machine distante.
Ce type de ressources ne peuvent pas &ecirc;tre contr&ocirc;l&eacute;es sans utiliser un agent interm&eacute;diaire. 
Les contr&ocirc;les de service qui n&eacute;cessitent un agent interm&eacute;diaire (pour r&eacute;aliser le contr&ocirc;le) sont appel&eacute;s contr&ocirc;les <i>indirects</i>.
</p>

<p>
Les contr&ocirc;les indirects sont utiles pour : 
</p>
<p>
<ul>
<li>Superviser les ressources "locales" (telles que le taux d'utilisation d'un disque, la charge d'un processeur, etc.) sur des machines distantes
<li>Superviser des services et des h&ocirc;tes derri&egrave;re un pare-feu
<li>Obtenir des r&eacute;sultats plus r&eacute;alistes des contr&ocirc;les de services sensibles aux d&eacute;lais entre des machines distantes (par exemple le temps de r&eacute;ponse d'un ping entre deux h&ocirc;tes distants)
</p>

<p>
Il existe plusieurs m&eacute;thodes pour r&eacute;aliser des contr&ocirc;les actifs indirects (on ne discutera pas des <a href="passivechecks.html">contr&ocirc;les passifs</a>), mais j'expliquerai uniquement comment ils peuvent &ecirc;tre effectu&eacute;s en utilisant l'addon <a href="addons.html#nrpe">nrpe</a>.
</p>


<p>
<strong><u>Contr&ocirc;les Indirects des Services</u></strong>
</p>

<p>
Le diagramme ci-dessous montre comment les contr&ocirc;les indirects des services fonctionnent. Cliquez sur l'image pour l'agrandir...
</p>


<p>
<a href="images/indirectsvccheck.png"><img src="images/indirectsvccheck.png" border=1 width=200 height=275 alt="Contr&ocirc;les Indirects des Services"></a>
</p>

<p>
<strong><u>Contr&ocirc;les Multiples et Indirects des Services</u></strong>
</p>

<p>
Si vous supervisez des serveurs se trouvant derri&egrave;re un pare-feu (et que la machine sur laquelle Nagios est install&eacute;e se trouve en dehors du pare-feu) le contr&ocirc;le des services sur ces machines peut s'av&eacute;rer un compliqu&eacute;.
Il y a des chances pour que vous bloquiez la plupart du trafic entrant qui serait normalement requis pour la supervision.
Une solution pour r&eacute;aliser les contr&ocirc;les actifs (ceci est aussi valable pour les <a href="passivechecks.html">contr&ocirc;les passifs</a>) sur les machines derri&egrave;re le pare-feu serait d'enfoncer un petit trou dans les filtres du pare-feu pour autoriser l'h&ocirc;te Nagios &agrave; appeler le d&eacute;mon <i>nrpe</i> d'un h&ocirc;te prot&eacute;g&eacute; par le pare-feu.
La machine prot&eacute;g&eacute;e par le pare-feu pourrait aussi &ecirc;tre utilis&eacute;e comme interm&eacute;diaire dans la r&eacute;alisation de contr&ocirc;les sur d'autres serveurs prot&eacute;g&eacute;s par le pare-feu.
</p>

<p>
Le diagramme ci-dessous montre comment les contr&ocirc;les de services multiples et indirects fonctionnent.
Remarquez que le d&eacute;mon <i>nrpe</i> tourne sur les machines #1 et #2.
La copie fonctionnant sur la machine #2 est utilis&eacute;e pour permettre &agrave; l'agent <i>nrpe</i> sur l'h&ocirc;te #1 de contr&ocirc;ler un service "priv&eacute;" sur la machine #2.
Les services "priv&eacute;s" sont des services tel que la charge CPU, l'utilisation de l'espace disque, etc. qui ne sont pas directement expos&eacute;s comme SMTP, FTP, et les services web.
Cliquez sur l'image pour l'agrandir...
</p>

<p>
<a href="images/indirectsvccheck2.png"><img src="images/indirectsvccheck2.png" border=1 width=200 height=275 alt="Multiple Indirected Service Checks"></a>
</p>

<p>
<strong><u>Controles Indirects d'Hotes</u></strong>
</p>

<p>
Les contr&ocirc;les indirects d'h&ocirc;tes fonctionnent de la m&ecirc;me fa&ccedil;on que les contr&ocirc;les indirects services.
Typiquement, le plugin utilis&eacute; dans la commande de contr&ocirc;le d'h&ocirc;te demande &agrave; un agent interm&eacute;diaire (c.a.d. un d&eacute;mon fonctionnant sur une machine distante) de r&eacute;aliser le contr&ocirc;le d'h&ocirc;te pour lui.
Les contr&ocirc;les indirects d'h&ocirc;te sont utiles lorsque l'h&ocirc;te distant &agrave; superviser se trouvent derri&egrave;re un pare-feu et que vous souhaitez restreindre le trafic de supervision &agrave; une machine donn&eacute;e.
Cette machine (l'h&ocirc;te #1 sur le diagramme ci-dessous) r&eacute;alisera les contr&ocirc;les d'h&ocirc;tes et retournera les r&eacute;sultats au plugin <i>check_nrpe</i> de plus haut niveau (sur le serveur central).
Notez qu'avec cette configuration des probl&egrave;mes peuvent survenir.
Si l'h&ocirc;te distant #1 s'effondre, le plugin <i>check_nrpe</i> ne sera pas capable de contacter le d&eacute;mon <i>nrpe</i> et Nagios croira que les h&ocirc;tes distants #2, #3, et #4 sont "down", m&ecirc;me si ce n'est pas le cas.
Si l'h&ocirc;te #1 est votre firewall, alors le probl&egrave;me n'en sera pas vraiment un parce que Nagios le d&eacute;tectera "down" et consid&eacute;ra les h&ocirc;tes #2, #3 et #4 comme inaccessibles.
</p>

<p>
Le diagramme ci-dessous montre comment un contr&ocirc;le indirect d'h&ocirc;te peut &ecirc;tre effectu&eacute; en utilisant le d&eacute;mon <a href="addons.html#nrpe"><i>nrpe</i></a> et le plugin <i>check_nrpe</i>. Cliquez sur l'image pour l'agrandir.
</p>

<p>
<a href="images/indirecthostcheck.png"><img src="images/indirecthostcheck.png" border=1 width=200 height=275 alt="Indirect Host Checks"></a>
</p>

<hr>

</body>
</html>
