

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<HEAD>
<TITLE>D&eacute;termination de l'&eacute;tat et de l'accessibilit&eacute; des h&ocirc;tes du r&eacute;seau</TITLE>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</HEAD>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">D&eacute;termination de l'&eacute;tat et de l'accessibilit&eacute; des h&ocirc;tes du r&eacute;seau</h2>

</div>
</p>
<hr>

<p>
<strong><u>Supervision des services sur des h&ocirc;tes hors fonction ou inaccessibles</u></strong>
</p>
<p>
Le but principal de Nagios est de superviser des services qui tournent sur ou sont propos&eacute;s par des h&ocirc;tes physiques ou des &eacute;quipements de votre r&eacute;seau. Il est &eacute;vident que si un h&ocirc;te ou un &eacute;quipement du r&eacute;seau s'arr&ecirc;te, tous les services qu'il offre s'arr&ecirc;tent avec lui. De la m&ecirc;me mani&egrave;re, si un h&ocirc;te devient inaccessible, Nagios ne pourra pas superviser les services associ&eacute;s &agrave; cet h&ocirc;te.
</p>
<p>
Nagios reconna&icirc;t cette situation et tente de v&eacute;rifier ce genre de sc&eacute;nario quand un probl&egrave;me survient sur un service. Chaque fois qu'un contr&ocirc;le de service retourne un niveau d'&eacute;tat non-OK, Nagios essaiera de contr&ocirc;ler si l'h&ocirc;te supportant ce service est "vivant". Pratiquement, ceci consiste &agrave; envoyer un ping &agrave; l'h&ocirc;te et &agrave; v&eacute;rifier si une r&eacute;ponse est retourn&eacute;e. Si la commande de contr&ocirc;le de l'h&ocirc;te retourne un &eacute;tat non-OK, Nagios suppose qu'il y a un probl&egrave;me li&eacute; &agrave; l'h&ocirc;te. Dans ce cas, Nagios "taira" toutes les alarmes potentielles pour les services qui tournent sur cet h&ocirc;te et se contentera de notifier les contacts appropri&eacute;s que l'h&ocirc;te est hors fonction ou inaccessible. Si la commande de contr&ocirc;le de l'h&ocirc;te retourne l'&eacute;tat OK, Nagios verra que l'h&ocirc;te est en fonction et enverra une alerte pour le service qui pr&eacute;sente un probl&egrave;me.
</p>

<p>
<strong><u>H&ocirc;tes locaux</u></strong>

</p>
<p>
Les h&ocirc;tes "locaux" sont ceux qui se trouvent sur le m&ecirc;me segment de r&eacute;seau que l'h&ocirc;te qui h&eacute;berge Nagios - aucun routeur ou firewall ne se trouve entre eux. La <a href="#figure1">figure 1</a> repr&eacute;sente un exemple de topologie de r&eacute;seau. L'h&ocirc;te A fait tourner Nagios et supervise tous les autres h&ocirc;tes ou routeurs repr&eacute;sent&eacute;s sur le sch&eacute;ma. Les h&ocirc;tes B, C, D, E et F sont tous consid&eacute;r&eacute;s comme "locaux" par rapport &agrave; l'h&ocirc;te A.
</p>
<p>
L'option &lt;<i>parents</i>&gt; de la d&eacute;finition d'h&ocirc;te pour un h&ocirc;te "local" doit &ecirc;tre laiss&eacute;e vide, car les h&ocirc;tes locaux n'ont pas de d&eacute;pendances ou de "parents" - c'est ce qui les rend locaux.
</p>

<p>
<strong><u>Supervision d'h&ocirc;tes locaux</u></strong>

</p>
<p>
Contr&ocirc;ler des h&ocirc;tes qui sont sur votre r&eacute;seau local est assez simple. Sorti de quelqu'un qui d&eacute;branche accidentellement (ou intentionnellement) le c&acirc;ble r&eacute;seau d'un de vos h&ocirc;tes, peu de choses peuvent causer un probl&egrave;me lors du contr&ocirc;le de la connexion au r&eacute;seau. Il n'y a pas de routeurs ou de r&eacute;seaux externes entre l'h&ocirc;te charg&eacute; de la supervision et les autres h&ocirc;tes du r&eacute;seau local.
</p>
<p>
Si Nagios a besoin de contr&ocirc;ler qu'un h&ocirc;te est "vivant", il lancera simplement la commande de contr&ocirc;le de cet h&ocirc;te. Si la commande retourne un &eacute;tat OK, Nagios suppose que l'h&ocirc;te est en fonction. Si la commande retourne n'importe quel autre &eacute;tat, Nagios suppose que l'h&ocirc;te est hors fonction.
</p>

<p>
<a name="figure1"></a>
<strong>Figure 1.</strong><br />
<img src="images/physical-network.png" border=1><br clear="all">
</p>

<p>
<strong><u>H&ocirc;tes distants</u></strong>

</p>
<p>
Les h&ocirc;tes "distants" sont ceux qui se trouvent sur un segment de r&eacute;seau diff&eacute;rent de celui de l'h&ocirc;te qui h&eacute;berge Nagios. Dans le sch&eacute;ma ci-dessus, les h&ocirc;tes G, H, I, J, K, L et M sont tous consid&eacute;r&eacute;s comme "distants" par rapport &agrave; l'h&ocirc;te A.
</p>
<p>
Notez que certains h&ocirc;tes sont "plus loin" que d'autres. Les h&ocirc;tes H, I et J se trouvent un saut [NdT : hop] plus loin de l'h&ocirc;te A que l'h&ocirc;te G (le routeur). De cette constatation, nous pouvons d&eacute;duire un arbre de d&eacute;pendance des h&ocirc;tes comme indiqu&eacute; <a href="#figure2">figure 2</a>. Cette arbre va nous aider &agrave; configurer chaque h&ocirc;te dans Nagios.
</p>
<p>
L'option <b>&lt;parents&gt;</b> de la d&eacute;finition d'h&ocirc;te d'un h&ocirc;te "distant" doit &ecirc;tre le nom court de l'h&ocirc;te directement au-dessus dans l'arbre de d&eacute;pendance (comme indiqu&eacute; ci-dessous). Par exemple, l'h&ocirc;te parent de l'h&ocirc;te H est l'h&ocirc;te G. Celui de l'h&ocirc;te G est F. F n'a pas d'h&ocirc;te parent, car il est sur le m&ecirc;me segment de r&eacute;seau que l'h&ocirc;te A - c'est un h&ocirc;te "local".
</p>

<p>

<a name="figure2"></a>
<strong>Figure 2.</strong><br />
<img src="images/network-heirarchy.png" border=1><br clear="all">
</p>

<p>
<strong><u>Supervision d'h&ocirc;tes distants</u></strong>
</p>
<p>
Contr&ocirc;ler l'&eacute;tat d'h&ocirc;tes distants est l&eacute;g&egrave;rement plus complexe que pour des h&ocirc;tes locaux. Si Nagios ne peut pas superviser des services distants, il doit d&eacute;terminer si l'h&ocirc;te distant est hors fonction ou s'il est inaccessible. Heureusement, l'option <b>&lt;parents&gt;</b> permet &agrave; Nagios de le faire.
</p>
<p>

Si la commande de contr&ocirc;le d'un h&ocirc;te distant retourne un &eacute;tat non-OK, Nagios va parcourir l'arbre de d&eacute;pendance (comme indiqu&eacute; dans le sch&eacute;ma ci-dessus) jusqu'au sommet (ou jusqu'&agrave; ce que le contr&ocirc;le d'un h&ocirc;te parent retourne l'&eacute;tat OK). Ce faisant, Nagios peut d&eacute;terminer si un probl&egrave;me sur un service r&eacute;sulte de l'arr&ecirc;t d'un h&ocirc;te, de la rupture d'un lien r&eacute;seau, ou est simplement une erreur du service.
</p>

<p>
<strong><u>Type de notification DOWN oppos&eacute; &agrave; UNREACHABLE</u></strong>
</p>

<p>
Je re&ccedil;ois de nombreux courriels de personnes demandant pourquoi Nagios envoie des notifications au sujet d'h&ocirc;tes inaccessibles. La r&eacute;ponse est que vous l'avez configur&eacute; pour qu'il le fasse. Si vous voulez d&eacute;sactiver les notifications UNREACHABLE pour les h&ocirc;tes, modifiez le param&eacute;tre <i>notify_options</i> de chaque d&eacute;finition d'h&ocirc;te en supprimant le param&egrave;tre <i>u</i> ("unreachable"). Vous trouverez plus d'information dans cette FAQ [NdT : la FAQ n'existe plus dans cette version de la documentation].
</p>

<hr>

</body>
</html>
