
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Notifications</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Notifications</h2>

</div>
</p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
J'ai re&ccedil;u de nombreuses questions sur le fonctionnement des notifications. Ce document essaiera d'expliquer exactement quand et comment les notifications pour les h&ocirc;tes et les services sont &eacute;mises, et qui les re&ccedil;oit.
</p>


<p>
<strong><u>Quand y a-t'il notification ?</u></strong>

</p>

<p>
La d&eacute;cision d'&eacute;mettre des notifications est prise dans le cadre du contr&ocirc;le de service et du contr&ocirc;le d'h&ocirc;te. Les notifications d'h&ocirc;te et de service ont lieu dans les cas suivants ...
</p>

<p>
<ul><li>Lors d'un changement d'&eacute;tat HARD. Pour plus d'informations sur les &eacute;tats et les changement d'&eacute;tat HARD, lisez <a href="statetypes.html">ceci</a>.
<li>Lorsqu'un h&ocirc;te ou un service demeure dans un &eacute;tat hard et non-OK, et que le d&eacute;lai d&eacute;fini dans le param&eacute;tre &lt;<i>notification_interval</i>&gt; de la d&eacute;finition de l'h&ocirc;te ou du service est &eacute;coul&eacute; depuis que la derni&egrave;re notification a &eacute;t&eacute; &eacute;mise (pour ce m&ecirc;me h&ocirc;te ou service). Si vous ne voulez pas de notifications r&eacute;it&eacute;r&eacute;es, mettez &agrave; 0 le param&eacute;tre &lt;<i>notification_interval</i>&gt; - ceci emp&ecirc;che les notifications d'&ecirc;tre envoy&eacute;es plus d'une fois pour un probl&egrave;me donn&eacute;.
</ul>
</p>


<p>
<strong><u>Qui est notifi&eacute; ?</u></strong>
</p>

<p>
Chaque d&eacute;finition de service comprend un param&eacute;tre &lt;<i>contact_groups</i>&gt; qui d&eacute;finit quels groupes de contacts recevront les notifications de ce service. Chaque groupe de contacts peut contenir un ou plusieurs contacts individuels. Quand Nagios &eacute;met une notification de service, il notifie chaque contact membre d'un des groupes de contacts sp&eacute;cifi&eacute;s dans le param&eacute;tre &lt;<i>contactgroups</i>&gt; de la d&eacute;finition du service. Nagios est conscient qu'un contact peut &ecirc;tre membre de plus d'un groupe, donc il commence par supprimer les doublons.
</p>

<p>
Chaque d&eacute;finition d'h&ocirc;te comprend un param&eacute;tre &lt;<i>contact_groups</i>&gt; qui d&eacute;finit quels groupes de contacts recevront les notifications de cet h&ocirc;te. Quand Nagios &eacute;met une notification d'h&ocirc;te, il notifie chaque contact membre d'un des groupes de contacts &agrave; notifier pour cet h&ocirc;te. Nagios supprime les doublons de la liste des contacts avant toute chose.
</p>


<p>
<strong><u>Quels sont les filtres &agrave; traverser avant qu'une notifications ne soit &eacute;mise ?</u></strong>
</p>

<p>
Le simple fait qu'une notification d'h&ocirc;te ou de service doive &ecirc;tre &eacute;mise ne signifie pas que des contacts vont la recevoir. Il y a plusieurs filtres qu'une notification doit traverser avant d'&ecirc;tre jug&eacute;e valable pour l'&eacute;mission. M&ecirc;me alors, des contacts peuvent ne pas la recevoir si leurs filtres de notification ne le permettent pas. Voyons en d&eacute;tail les filtres &agrave; traverser...
</p>


<p>
<strong><u>Filtre global au programme :</u></strong>
</p>
<p>
Le premier filtre que les notifications doivent traverser est un test pour savoir si les notifications sont activ&eacute;es au niveau global du programme ou non. Ceci est sp&eacute;cifi&eacute; par le param&eacute;tre <a href="configmain.html#enable_notifications">enable_notifications</a> du fichier de configuration principal, mais peut &ecirc;tre modifi&eacute; en cours d'ex&eacute;cution via l'interface web. Si les notifications sont d&eacute;sactiv&eacute;es de mani&egrave;re globale, aucune notification ne sera envoy&eacute;e - point final. Si elles sont activ&eacute;es, il y a encore d'autres tests &agrave; r&eacute;ussir...
</p>

<p>
<strong><u>Filtres d'h&ocirc;te et de service :</u></strong>

</p>

<p>
Le premier filtre des notifications d'h&ocirc;te et de service consiste &agrave; v&eacute;rifier que l'h&ocirc;te ou le service n'est pas dans une <a href="downtime.html">p&eacute;riode d'arr&ecirc;t planifi&eacute;</a>. Si c'est le cas, <b>personne n'est notifi&eacute;</b>. S'il n'est pas dans une p&eacute;riode d'arr&ecirc;t planifi&eacute;, la notification est pass&eacute;e au filtre suivant. Notez &eacute;galement que les notifications de services sont supprim&eacute;es si l'h&ocirc;te auquel est associ&eacute; le service est dans une p&eacute;riode d'arr&ecirc;t planifi&eacute;.
</p>

<p>
Le deuxi&egrave;me filtre des notifications d'h&ocirc;te et de service consiste &agrave; v&eacute;rifier si l'h&ocirc;te ou le service <a href="flapping.html">oscille</a> (&agrave; condition que vous ayez activ&eacute; la d&eacute;tection d'oscillation). Si le service ou l'h&ocirc;te oscille, <b>personne n'est notifi&eacute;</b>. Sinon, la notification est pass&eacute;e au filtre suivant.
</p>

<p>
Le troisi&egrave;me filtre &agrave; traverser pour les notifications d'h&ocirc;te et de service est form&eacute; par les param&eacute;tres de notification. Chaque d&eacute;finition de service contient des param&eacute;tres qui d&eacute;terminent si les notifications doivent &ecirc;tre envoy&eacute;es pour les &eacute;tats WARNING, CRITICAL, et RECOVERY. De la m&ecirc;me mani&egrave;re, chaque d&eacute;finition d'h&ocirc;te contient des param&eacute;tres qui d&eacute;terminent si les notifications doivent &ecirc;tre envoy&eacute;es quand l'h&ocirc;te s'arr&ecirc;te [NdT: &eacute;tat DOWN], devient inaccessible [UNREACHABLE], ou se r&eacute;tablit [RECOVERY]. Si la notification d'h&ocirc;te ou de service est bloqu&eacute;e par ces param&eacute;tres, <b>personne n'est notifi&eacute;</b>. Dans le cas contraire, la notification est pass&eacute;e au filtre suivant... Note : les notifications concernant les r&eacute;tablissement d'h&ocirc;tes et de services ne sont &eacute;mises que si une notification a &eacute;t&eacute; envoy&eacute;e &agrave; l'apparition du probl&egrave;me. Cela n'a pas de sens de recevoir une notification de r&eacute;tablissement pour un probl&egrave;me dont vous n'aviez pas connaissance...
</p>

<p>
Le quatri&egrave;me filtre des notifications d'h&ocirc;te et de service &agrave; traverser concerne la p&eacute;riode. Chaque d&eacute;finition d'h&ocirc;te et de service comporte un param&eacute;tre &lt;<i>notification_period</i>&gt; qui sp&eacute;cifie quelle p&eacute;riode contient les heures de notification valides pour cet h&ocirc;te ou service. Si le moment o&ugrave; la notification appara&icirc;t n'est pas dans une plage valide de la p&eacute;riode sp&eacute;cifi&eacute;e, <b>personne n'est contact&eacute;</b>. Dans le cas contraire, la notification est pass&eacute;e au filtre suivant... Note : si le filtre de p&eacute;riode n'est pas travers&eacute;, Nagios r&eacute;ordonnancera la prochaine notification pour l'h&ocirc;te ou le service (s'il est dans un &eacute;tat non-OK) dans la prochaine plage de temps valide pour la p&eacute;riode. Cela permet de s'assurer que les contacts sont notifi&eacute;s des probl&egrave;mes d&egrave;s que possible quand arrive le prochain moment valide de la p&eacute;riode.
</p>

<p>
Le dernier jeu de filtres d'h&ocirc;te et de service est conditionn&eacute;e par deux &eacute;l&eacute;ments : (1) une notification a d&eacute;j&agrave; &eacute;t&eacute; &eacute;mise par le pass&eacute; concernant un probl&egrave;me avec l'h&ocirc;te ou le service, et (2) l'h&ocirc;te ou le service est rest&eacute; dans le m&ecirc;me &eacute;tat non-OK depuis la derni&egrave;re notification. Si ces deux conditions sont r&eacute;unies, Nagios v&eacute;rifie que le temps &eacute;coul&eacute; depuis l'&eacute;mission de la derni&egrave;re notification est sup&eacute;rieur ou &eacute;gal &agrave; la valeur sp&eacute;cifi&eacute;e par le param&eacute;tre  &lt;<i>notification_interval</i>&gt; de la d&eacute;finition de l'h&ocirc;te ou du service. Si le temps &eacute;coul&eacute; depuis la derni&egrave;re notification est insuffisant, <b>personne n'est contact&eacute;</b>. Si un temps suffisant s'est &eacute;coul&eacute;, ou si les deux conditions de ce filtre n'ont pas &eacute;t&eacute; r&eacute;unies, la notification sera &eacute;mise ! Le fait qu'elle parvienne ou non aux contacts individuels rel&egrave;ve d'un autre jeu de filtres...
</p>

<p>
<strong><u>Filtres de contact :</u></strong>
</p>
<p>
A ce point la notification a travers&eacute; le filtre du mode de programme et tous les filtres d'h&ocirc;te et de service, et Nagios commence &agrave; envoyer des notifications &agrave; <a href="xodtemplate.html#contact">tous ceux qui doivent en recevoir</a>. Cela signifie-t-il que tous les contacts vont recevoir la notification ? Non ! Chaque contact poss&egrave;de son propre jeu de filtres que la notification doit traverser avant qu'ils ne la re&ccedil;oivent. Note : les filtres de contact sont propres &agrave; chaque contact et n'affectent pas la fa&ccedil;on dont les autres contacts re&ccedil;oivent les notifications.
</p>

<p>
Le premier filtre &agrave; passer pour chaque contact concerne les param&eacute;tres de notification. Chaque d&eacute;finition de contact comprend des param&eacute;tres qui d&eacute;terminent si les notifications de service peuvent &ecirc;tre &eacute;mises pour les &eacute;tats WARNING, CRITICAL, et RECOVERY. Chaque d&eacute;finition de contact contient &eacute;galement des options qui d&eacute;terminent si les notifications d'h&ocirc;te peuvent &ecirc;tre &eacute;mises lorsqu'un h&ocirc;te passe dans les &eacute;tats DOWN, UNREACHABLE, ou RECOVERY. Si la notification d'h&ocirc;te ou de service ne remplit pas ces conditions, <b>les contacts ne recevront pas de notification</b>. Dans le cas contraire, la notification est pass&eacute;e au prochain filtre... Note : les notifications concernant les r&eacute;tablissement d'h&ocirc;tes et de services ne sont &eacute;mises que si une notification a &eacute;t&eacute; envoy&eacute;e &agrave; l'apparition du probl&egrave;me. Cela n'a pas de sens de recevoir une notification de r&eacute;tablissement pour un probl&egrave;me dont vous n'aviez pas connaissance...
</p>


<p>
Le dernier filtre &agrave; passer pour chaque contact concerne la p&eacute;riode. Chaque d&eacute;finition de contact comprend un param&eacute;tre &lt;<i>notification_period</i>&gt; qui sp&eacute;cifie la p&eacute;riode durant laquelle on peut envoyer des notification &agrave; ce contact. Si l'heure &agrave; laquelle la notification est faite n'est pas comprise dans la plage de temps de la p&eacute;riode sp&eacute;cifi&eacute;e, <b>le contact ne recevra pas la notification</b>. Dans le cas contraire, le contact la re&ccedil;oit !
</p>

</dir>

<p>
<strong><u>Pourquoi aucune m&eacute;thode de notification n'est-elle int&eacute;gr&eacute;e directement &agrave; Nagios ?</u></strong>
</p>

<p>
On m'a plusieurs fois demand&eacute; pourquoi les m&eacute;thodes de notification (pager, etc.) ne sont pas directement int&eacute;gr&eacute;es au code de Nagios. La r&eacute;ponse est simple - cela n'aurait pas beaucoup de sens. Nagios n'est pas pr&eacute;vu pour &ecirc;tre une application "tout-en-un". Si les contr&ocirc;les de service &eacute;taient int&eacute;gr&eacute;s dans le cœur de Nagios, il serait tr&egrave;s difficile pour les utilisateurs d'ajouter de nouvelles m&eacute;thodes de contr&ocirc;le, de modifier celles qui existent, etc. Les notifications fonctionnent de la m&ecirc;me mani&egrave;re. Il y a mille et une fa&ccedil;ons d'envoyer des notifications et de nombreux modules ont d&eacute;j&agrave; &eacute;t&eacute; d&eacute;velopp&eacute;s pour faire le sale boulot, alors pourquoi r&eacute;inventer la roue, et vous contenter d'un pneu de v&eacute;lo ? Il est bien plus facile de d&eacute;l&eacute;guer &agrave; une application externe (c.-&agrave;-d. un simple script ou un syst&egrave;me de messagerie complet) ce travail complexe. Des modules de messagerie qui peuvent traiter les notifications pour les pagers ou les t&eacute;l&eacute;phones portables sont list&eacute;s ci-dessous, dans la section des ressources.
</p>

<p>
<strong><u>Macro de type de notification</u></strong>
</p>

<p>
Lorsque vous bricolez vos commandes de notification, vous devez prendre en compte le type de notification qui se pr&eacute;sente. La macro <a href="macros.html#notificationtype">$NOTIFICATIONTYPE$</a> contient une cha&icirc;ne de caract&eacute;res qui identifie pr&eacute;cis&eacute;ment cela. Le tableau ci-dessous liste les valeurs possibles de cette macro et leur description  :
</p>

<table class="Default" border="1">
<tr><th>Valeur</th><th>Description</th></tr>
<tr><td>PROBLEM</td><td>Un service ou un h&ocirc;te vient de passer (ou est encore) dans un &eacute;tat d&eacute;notant un probl&egrave;me. S'il s'agit d'une notification de service, cela signifie que le service est dans un &eacute;tat WARNING, UNKNOWN ou CRITICAL. Si c'est une notification d'h&ocirc;te, cela signifie que l'h&ocirc;te est dans l'&eacute;tat DOWN ou UNREACHABLE.</td></tr>
<tr><td>RECOVERY</td><td>Un service ou un h&ocirc;te s'est r&eacute;tabli. S'il s'agit d'une notification de service, cela signifie que le service vient de retourner dans l'&eacute;tat OK. Si c'est une notification d'h&ocirc;te, cela signifie que l'h&ocirc;te vient de reprendre l'&eacute;tat UP.</td></tr>

<tr><td>ACKNOWLEDGEMENT</td><td>Cette notification est li&eacute;e &agrave; l'acquittement d'un probl&egrave;me d'h&ocirc;te ou de service. Les notifications d'acquittement sont g&eacute;n&eacute;r&eacute;es via l'interface web par les contacts de l'h&ocirc;te ou du service  concern&eacute;.</td></tr>
<tr><td>FLAPPINGSTART</td><td>L'h&ocirc;te ou le service vient de commencer &agrave; <a href="flapping.html">osciller</a>.</td></tr>
<tr><td>FLAPPINGSTOP</td><td>L'h&ocirc;te ou le service vient de s'arr&ecirc;ter d'<a href="flapping.html">osciller</a>.</td></tr>
</table>

<p>
<strong><u>Ressources utiles</u></strong>

</p>

<p>
Il y a bien des moyens de configurer Nagios pour envoyer des notifications. C'et &agrave; vous de d&eacute;cider de la (des) m&eacute;thode(s) que vous voulez utiliser. Une fois ce choix fait, vous devrez installer les logiciels n&eacute;cessaires, et d&eacute;finir les commandes de notification dans vos fichiers de configuration avant de pouvoir les utiliser. Voici quelques m&eacute;thodes de notification possibles :
</p>

<p>
<ul>
<li>Email
<li>Pager
<li>T&eacute;l&eacute;phone (SMS)
<li>Message WinPopup
<li>Messageries instantan&eacute;es Yahoo, ICQ, ou MSN
<li>Alertes sonores
<li>etc...
</ul>
</p>

<p>
En gros, tout ce que vous pouvez faire en ligne de commande peut &ecirc;tre adapt&eacute; sous forme de commande de notification.
</p>

<p>
Si vous voulez envoyer une notification alphanum&eacute;rique &agrave; votre pager ou &agrave; votre t&eacute;l&eacute;phone portable via email, vous trouverez peut-&ecirc;tre les informations suivantes utiles [NdT : et si vous &ecirc;tes aux USA]. Voici quelques hyperliens vers divers fournisseurs de service de messagerie, qui expliquent comment envoyer des messages alphanum&eacute;riques aux pagers et aux t&eacute;l&eacute;phones portables...
</p>

<p>
<ul>
<li><a href="http://www.cingular.com/media/text_messaging">Cigular</a><br />
<li><a href="http://www.pagenet.com/sendamessage/emailpage.asp">PageNet</a><br />
<li><a href="http://www.messaging.sprintpcs.com/sms_help/send_email.html">SprintPCS</a> (t&eacute;l&eacute;phones SMS)<br />

</ul>
</p>

<p>
Si vous cherchez &agrave; envoyer des messages &agrave; votre pager ou &agrave; votre t&eacute;l&eacute;phone portable sans email, jetez un coup d'œil aux applications suivantes. Elles peuvent &ecirc;tre utilis&eacute;es en conjonction avec Nagios pour envoyer une notification via un modem quand un probl&egrave;me arrive. De cette fa&ccedil;on, vous n'&ecirc;tes pas d&eacute;pendant de l'email pour &eacute;mettre des notifications (gardez &agrave; l'esprit que l'email peut *ne pas* fonctionner s'il y a des probl&egrave;mes r&eacute;seau). Je n'ai pas personnellement essay&eacute; ces applications, mais certains m'ont dit l'avoir fait avec succ&egrave;s...
</p>
<p>
<ul>
<li><a href="http://www.gnokii.org/">Gnokii [Anglais]</a> (logiciel SMS pour contacter des t&eacute;l&eacute;phones Nokia via le r&eacute;seau GSM)
<li><a href="http://www.qpage.org/" target="_top">QuickPage [Anglais]</a> (logiciel de pager alphanum&eacute;rique)
<li><a href="http://www.sendpage.org/" target="_top">Sendpage [Anglais]</a> (logiciel de pager)

<li><a href="http://www.smsclient.org/" target="_top">SMS Client [Anglais]</a> (outil en ligne de commande pour envoyer des messages aux pagers et aux t&eacute;l&eacute;phones portables)
</ul>
</p>

<p>
Si vous d&eacute;sirez une m&eacute;thode atypique, vous pouvez essayer de vous amuser avec les alertes sonores. Si vous voulez des alertes sonores sur le serveur de supervision (avec voix synth&eacute;thique), essayez <a href="http://www.cstr.ed.ac.uk/projects/festival/">Festival [Anglais]</a>. Si vous voulez les recevoir sur une autre machine, testez le <a href="http://radscan.com/nas.html">Network Audio system (NAS) [Anglais]</a> et <a href="http://rplay.doit.org/">rplay [Anglais]</a>.
</p>

<p>
Enfin, il y a un espace dans la section des contributions de la <a href="http://www.nagios.org">page d'accueil de Nagios [Anglais]</a> pour les scripts de notification r&eacute;alis&eacute;s par des utilisateurs. Vous pouvez y trouver votre bonheur, dans la mesure o&ugrave; ils g&egrave;rent le sale boulot n&eacute;cessaire &agrave; l'&eacute;mission de notifications alphanum&eacute;riques...
</p>

<p>
</p>

<hr>

</body>
</html>