
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Types d'&eacute;tats</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Types d'&eacute;tats</h2>
</div>
</p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>
<p>
L'&eacute;tat courant des services et des h&ocirc;tes est d&eacute;termin&eacute; par deux composants : l'&eacute;tat du service ou de l'h&ocirc;te (c.a.d OK, WARNING, UP, DOWN, etc) et le type d'&eacute;tat dans lequel il se trouve.
Il y a deux types d'&eacute;tat dans Nagios - les &eacute;tats "soft" et les &eacute;tats "hard".
Les types d'&eacute;tat sont une partie cruciale de la logique de supervision de Nagios. Ils sont utilis&eacute;s pour d&eacute;terminer quand les gestionnaires d'&eacute;v&eacute;nement sont ex&eacute;cut&eacute;s et quand les notifications sont envoy&eacute;es.
</p>

<p>
<strong><u>R&eacute;essais de Contr&ocirc;le de Service et d'H&ocirc;te</u></strong>
</p>
<p>
Pour &eacute;viter les alarmes ind&eacute;sirables, Nagios vous permet de d&eacute;finir combien de fois un contr&ocirc;le de service ou d'h&ocirc;te sera retent&eacute; avant que le service ou l'h&ocirc;te soit consid&eacute;r&eacute; comme ayant r&eacute;ellement un probl&egrave;me.
Le nombre maximum de tentatives avant qu'un service ou un h&ocirc;te  soit consid&eacute;r&eacute; comme ayant un r&eacute;el probl&egrave;me est configur&eacute; par l'option &lt;<i>max_check)attempts</i>&gt; dans les d&eacute;finitions de service et d'h&ocirc;te.
Le num&eacute;ro de la tentative de contr&ocirc;le de service ou d'h&ocirc;te en cours d&eacute;termine le type d'&eacute;tat dans lequel ce dernier se trouve.
Il y a quelques exceptions &agrave; cela dans la logique de supervision, mais nous les ignorerons pour l'instant. Jetons un coup d'oeil aux diff&eacute;rents types d'&eacute;tat...
</p>

<p>
<strong><u>Etat Soft</u></strong>
</p>
<p>
Un service ou un h&ocirc;te est dans un &eacute;tat soft dans les situations suivantes...
</p>
<p>
<ul>
<li>Quand un contr&ocirc;le de service ou d'h&ocirc;te retourne un &eacute;tat non-OK et qu'il n'a pas encore &eacute;t&eacute; (re)contr&ocirc;l&eacute; autant de fois que le sp&eacute;cifie l'option  &lt;<i>max_check_attempts</i>&gt; de la d&eacute;finition du service ou de l'h&ocirc;te. Appelons &ccedil;a un &eacute;tat d'erreur soft...
<li>Quand un service ou un h&ocirc;te se r&eacute;tablit suite &agrave; un &eacute;tat d'erreur soft. Ceci est consid&eacute;r&eacute; comme un r&eacute;tablissement soft.
</ul>
</p>

<p>
<strong><u>Ev&egrave;nements d'Etat Soft</u></strong>
</p>
<p>
Que se passe-t'il lorsqu'un service ou un h&ocirc;te est dans un &eacute;tat d'erreur soft ou en r&eacute;tablissement soft ?
</p>
<p>
<ul>
<li>L'erreur ou le r&eacute;tablissement soft est enregistr&eacute; dans un log si vous avez activ&eacute; les options <a href="configmain.html#log_service_retries">log_service_retries</a> ou <a href="configmain.html#log_host_retries">log_host_retries</a> dans le fichier de configuration principal.
<li>Les <a href="eventhandlers.html">gestionnaires d'&eacute;v&eacute;nement</a> sont ex&eacute;cut&eacute;s (si vous en avez d&eacute;fini) pour traiter l'erreur ou le r&eacute;tablissement soft du service ou de l'h&ocirc;te. (Avant toute ex&eacute;cution de gestionnaire d'&eacute;v&egrave;nement, les <a href="macros.html">macros</a> <b>$HOSTSTATETYPE$</b> ou <b>$SERVICESTATETYPE$</b> sont mises "<b>SOFT</b>").
<li>Nagios <i>n'envoie pas</i>  de notifications aux contacts, car il n'y a pas (ou il n'y a pas eu) de "r&eacute;el" probl&egrave;me avec le service ou l'h&ocirc;te. 
</ul>
</p>
<p>
Comme vous pouvez le voir, la seule chose importante qui se passe lors d'un &eacute;tat soft est l'ex&eacute;cution des gestionnaires d'&eacute;v&eacute;nement. 
L'utilisation des gestionnaires d'&eacute;v&eacute;nement peut se r&eacute;v&eacute;ler particuli&egrave;rement pratique si vous voulez r&eacute;parer pr&eacute;ventivement un probl&egrave;me avant qu'il ne passe en &eacute;tat hard.
Vous trouverez plus d'informations sur les gestionnaires d'&eacute;v&egrave;nement <a href="eventhandlers.html">ici</a>.
</p>



<p>
<strong><u>Etat Hard</u></strong>
</p>
<p>
Les &eacute;tats hards surviennent pour les services dans les situations suivantes (les &eacute;tats hard des h&ocirc;tes sont d&eacute;crits plus loin)...
</p>
<p>
<ul>
<li>Quand un contr&ocirc;le de service retourne un &eacute;tat non-OK et qu'il a &eacute;t&eacute; (re)contr&ocirc;l&eacute; autant de fois que sp&eacute;cifi&eacute; par l'option &lt;<i>max_check_attempts</i>&gt; de la d&eacute;finition du service. C'est un &eacute;tat d'erreur hard.
<li>Quand un service se r&eacute;tablit d'un &eacute;tat d'erreur hard. Ceci est consid&eacute;r&eacute; comme un r&eacute;tablissement hard.
<li>Quand un contr&ocirc;le de service retourne un &eacute;tat non-OK et que l'h&ocirc;te correspondant est soit DOWN soit UNREACHABLE. 
C'est une exception &agrave; la logique g&eacute;n&eacute;rale de la supervision, mais c'est tout &agrave; fait coh&eacute;rent.
Si l'h&ocirc;te n'est pas UP, pourquoi essayer de recontr&ocirc;ler le service?
</ul>
</p>

<p>
Les &eacute;tats hard surviennent pour les <i>h&ocirc;tes</i> dans les situations suivantes...
</p>
<p>
<ul>
<li>Quand un contr&ocirc;le d'h&ocirc;te retourne un &eacute;tat non-OK et qu'il a &eacute;t&eacute; (re)contr&ocirc;l&eacute; autant de fois que sp&eacute;cifi&eacute; par l'option &lt;<i>max_check_attempts</i>&gt de la d&eacute;finition de l'h&ocirc;te. C'est un &eacute;tat d'erreur hard.
<li>Quand un h&ocirc;te se r&eacute;tablit suite &agrave; un &eacute;tat d'erreur hard. Ceci est consid&eacute;r&eacute; comme un r&eacute;tablissement hard.
</ul>
</p>

<p>
<strong><u>Changements d'Etat Hard</u></strong>
</p>
<p>
Avant d'expliquer ce qui se passe quand un h&ocirc;te ou un service est en &eacute;tat hard, vous devez conna&icirc;tre les changements d'&eacute;tat hard. Les changements d'&eacute;tat hard surviennent quand un service ou un h&ocirc;te...
</p>
<p>
<ul>
<li>passe de l'&eacute;tat hard OK &agrave; l'&eacute;tat hard non-OK
<li>passe de l'&eacute;tat hard non-OK &agrave; l'&eacute;tat hard OK
<li>passe d'un &eacute;tat hard non-OK quelconque &agrave; un &eacute;tat hard non-OK d'un autre type (i.e. d'un &eacute;tat hard WARNING &agrave; un &eacute;tat hard UNKNOWN)
</ul>
</p>

<p>
<strong><u>Ev&egrave;nements d'Etat Hard</u></strong>
</p>
<p>
Que se passe-t'il lorsqu'un service ou un h&ocirc;te est dans un &eacute;tat d'erreur hard ou en r&eacute;tablissement hard ? Eh bien, &ccedil;a d&eacute;pend s'il y a eu ou non un changement d'&eacute;tat hard (tel que d&eacute;crit ci-dessus).
</p>

<p>
Si un changement d'&eacute;tat hard s'est produit <i>et</i> que le service ou l'h&ocirc;te est dans un &eacute;tat non-OK, les actions suivantes sont enclench&eacute;es...
</p>
<p>
<ul>
<li>Le probl&egrave;me hard du service ou de l'h&ocirc;te est enregistr&eacute; dans le log.
<li>Les <a href="eventhandlers.html">gestionnaires d'&eacute;v&egrave;nement</a> sont ex&eacute;cut&eacute;s (si vous en avez d&eacute;fini) pour traiter le probl&egrave;me hard du service ou de l'h&ocirc;te. (Avant toute ex&eacute;cution de gestionnaire d'&eacute;v&egrave;nement, les <a href="macros.html">macros</a> <b>$HOSTSTATETYPE$</b> ou <b>$SERVICESTATETYPE$</b> sont mises "<b>HARD</b>"). 
<li>Les contacts seront notifi&eacute;s du probl&egrave;me du service ou de l'h&ocirc;te (si <a href="notifications.html">la politique de notification</a> le permet).
</ul>
</p>

<p>Si un changement d'&eacute;tat hard s'est produit <i>et</i> que le service ou l'h&ocirc;te est dans un &eacute;tat OK, les actions suivantes sont enclench&eacute;es....
</p>
<p>
<ul>
<li>Le r&eacute;tablissement hard du service ou de l'h&ocirc;te est enregistr&eacute; dans le log.
<li>>Les <a href="eventhandlers.html">gestionnaires d'&eacute;v&egrave;nement</a> sont ex&eacute;cut&eacute;s (si vous en avez d&eacute;fini) pour traiter le r&eacute;tablissement hard du service ou de l'h&ocirc;te. (Avant toute ex&eacute;cution de gestionnaire d'&eacute;v&egrave;nement, les <a href="macros.html">macros</a> <b>$HOSTSTATETYPE$</b> ou <b>$SERVICESTATETYPE$</b> sont mises "<b>HARD</b>").
<li>Les contacts seront notifi&eacute;s du r&eacute;tablissement du service ou de l'h&ocirc;te (si <a href="notifications.html">la politique de notification</a> le permet).
</ul>
</p>

<p>
Si un changement d'&eacute;tat hard NE S'EST PAS produit et que le service ou l'h&ocirc;te est dans un &eacute;tat non-OK, les actions suivantes sont enclench&eacute;es...
</p>
<p>
<ul>
<li>Les contacts seront re-notifi&eacute;s du probl&egrave;me du service ou de l'h&ocirc;te (si <a href="notifications.html">la politique de notification</a> le permet).
</ul>
</p>

<p>Si un changement d'&eacute;tat hard NE S'EST PAS produit <i>et</i> que le service ou l'h&ocirc;te est dans un &eacute;tat OK, il ne se passe rien. En effet, le service ou l'h&ocirc;te est dans un &eacute;tat OK et l'&eacute;tait aussi lors du dernier contr&ocirc;le.
</p>

<hr>

</body>
</html>
