
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Quoi de neuf ?</title>

<STYLE type="text/css">
<!--
        .PageTitle { font-family: verdana,arial,serif; font-size: 10pt; font-weight: bold; }
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Quoi de neuf dans la version 2.0 ?</h2>

</div>
</p>

<hr>

<p>
<font color='red'><strong>Important :</strong></font> assurez-vous d'avoir lu toute la documentation (et plus particuli&egrave;rement <a href="http://www.nagios.org/faqs/">les F.A.Q.</a>) avant d'envoyer votre question aux listes de diffusion.
</p>


<a name="changelog"></a>
<p>
<strong><u>Journal des &eacute;volutions</u></strong>

</p>

<p>
Le journal des &eacute;volutions de Nagios est consultable en ligne sur <a href="http://www.nagios.org/changelog.php">http://www.nagios.org/changelog.php [Anglais]</a> ou dans le fichier <b>Changelog</b> &agrave; la racine de la distribution du code source.
</p>

<p>
<strong><u>Probl&egrave;mes connus</u></strong>
</p>

<p>
Il y a un probl&egrave;me connu qui affecte Nagios 2.0 sur les syst&egrave;mes FreeBSD. Ce probl&egrave;me sera r&eacute;solu, esp&eacute;rons-le, dans une version 2.x...
</p>

<p>
<ol>
<li><b>FreeBSD et les threads [NdT : fils d'ex&eacute;cution]</b>. FreeBSD propose une impl&eacute;mentation native au niveau utilisateur des threads appel&eacute;e 'pthread', et en option un portage 'linuxthreads' qui utilise les accroches du noyau [NdT : kernel hooks].  Des gars de Yahoo! ont signal&eacute; que l'utilisation de la biblioth&egrave;que pthread provoque l'arr&ecirc;t de Nagios lorsque la demande d'entr&eacute;es-sorties est importante, ce qui cause la perte de certains r&eacute;sultats de contr&ocirc;les de services. Passer &agrave; la biblioth&egrave;que linuxthreads semble am&eacute;liorer les choses, mais ne r&eacute;soud pas le probl&egrave;me. Le blocage se produit dans la fonction __pthread_acquire() de liblthread - le verrou ne peut jamais &ecirc;tre acquis. Cela se produit quand le thread principal est embranch&eacute; [NdT : fork] pour ex&eacute;cuter un contr&ocirc;le actif. Au second embranchement pour cr&eacute;er le processus petit-fils, le petit-fils est cr&eacute;&eacute; par fork, mais ne retourne jamais &agrave; l'adaptateur [NdT : wrapper] de fork dans liblthread, parce qu'il est coinc&eacute; dans __pthread_acquire(). Peut-&ecirc;tre des utilisateurs de FreeBSD peuvent-ils contribuer &agrave; la r&eacute;solution de ce probl&egrave;me.</li>

</ol>
</p>

<p>
<strong><u>Changements et nouveaut&eacute;s</u></strong>
</p>

<p>
<ol>

<li><b>Changements dans les macros</b> - Les <a href="macros.html">macros</a> ont subi une refonte majeure. Vous devrez mettre &agrave; jour la plupart de vos d&eacute;finitions de commandes pour vous adapter aux nouvelles macros. La plupart des macros sont maintenant disponibles en tant que variables d'environnement. De plus, des macros d'h&ocirc;te et de service "&agrave; la demande" ont &eacute;t&eacute; ajout&eacute;es. Lisez la <a href="macros.html">documentation sur les macros</a> pour de plus amples informations.<br />
<br />
<li><b>Changements dans les groupes d'h&ocirc;tes</b>

	<ul>
	<li><b>Suppression des escalades de groupes d'h&ocirc;tes</b> - Cette fonction peut &ecirc;tre remplac&eacute;e par le param&eacute;tre <i>hostgroup_name</i> de la <a href="xodtemplate.html#hostgroup">d&eacute;finition du groupe d'h&ocirc;tes</a>.
	<li><b>Changement du param&eacute;tre "members"</b> - La <a href="xodtemplate.html#hostgroup">d&eacute;finition</a> d'un groupe d'h&ocirc;tes peut maintenant contenir plusieurs param&eacute;tres <i>members</i>, ce qui devrait rendre plus facile la saisie des fichiers de configuration lorsque vous avez un grand nombre d'h&ocirc;tes membres.  Vous pouvez aussi utiliser le param&eacute;tre <i>hostgroups</i> de la <a href="xodtemplate.html#host">d&eacute;finition d'h&ocirc;te</a> pour d&eacute;finir &agrave; quel(s) groupe(s) d'h&ocirc;tes appartient un h&ocirc;te en particulier.
	<li><b>Changement dans les groupes de contacts</b> - Le param&eacute;tre <i>contact_groups</i> a &eacute;t&eacute; d&eacute;plac&eacute; de la d&eacute;finition des groupes d'h&ocirc;tes &agrave; <a href="xodtemplate.html#host">celle des h&ocirc;tes</a>.  Ceci afin d'&ecirc;tre coh&eacute;rent avec la d&eacute;finition des contacts de services. Mettez &agrave; jour vos fichiers de configuration !
	<li><b>Changement dans les permissions</b> - Les permissions d'acc&egrave;s aux groupes d'h&ocirc;tes dans les CGI ont &eacute;t&eacute; chang&eacute;es. Vous devez maintenant avoir acc&egrave;s &agrave; tous les h&ocirc;tes membres du groupe d'h&ocirc;tes pour avoir acc&egrave;s au groupe d'h&ocirc;tes.
	</ul>

<br />
<li><b>Changements dans les h&ocirc;tes</b>
	<ul>
	<li><b>Contr&ocirc;le de fra&icirc;cheur de l'h&ocirc;te</b> - le contr&ocirc;le de fra&icirc;cheur a &eacute;t&eacute; ajout&eacute; aux contr&ocirc;les d'h&ocirc;tes. C'est le param&eacute;tre <a href="configmain.html#check_host_freshness">check_host_freshness</a> qui d&eacute;finit ce comportement, associ&eacute; au param&eacute;tre <i>check_freshness</i> de la <a href="xodtemplate.html#host">d&eacute;fintion d'h&ocirc;te</a>.
	<li><b>Commande OCHP</b> - Les contr&ocirc;les d'h&ocirc;tes peuvent maintenant &ecirc;tre remont&eacute;s, comme l'&eacute;taient les contr&ocirc;les de services. La <a href="configmain.html#ochp_command">commande OCHP</a> est lanc&eacute;e pour tous les h&ocirc;tes dont le param&eacute;tre <i>obsess_over_host</i> est activ&eacute; dans la <a href="xodtemplate.html#host">d&eacute;finition d'h&ocirc;te</a>.
	</ul>

<br />
<li><b>Changements dans le contr&ocirc;le des h&ocirc;tes</b>
	<ul>
	<li><b>Contr&ocirc;les ordonnanc&eacute;s r&eacute;guli&egrave;rement</b> - Vous pouvez maintenant ordonnancer le contr&ocirc;le r&eacute;gulier d'h&ocirc;tes en utilisant le param&eacute;tre <i>check_interval</i> de la <a href="xodtemplate.html#host">d&eacute;finition d'h&ocirc;te</a>. <strong>NOTE :</strong>  Attention ! Vous devez utiliser parcimonieusement les contr&ocirc;les r&eacute;guliers d'h&ocirc;tes. Ils ne sont pas n&eacute;cessaires au fonctionnement normal (les contr&ocirc;les &agrave; la demande sont d&eacute;j&agrave; r&eacute;alis&eacute;s quand c'est n&eacute;cessaire) et peuvent <a href="tuning.html">d&eacute;grader les performances</a> s'ils sont utilis&eacute;s de mani&egrave;re inappropri&eacute;e. Vous &ecirc;tes pr&eacute;venus.
	<li><b>Contr&ocirc;les d'h&ocirc;tes passifs</b> - Les contr&ocirc;les d'h&ocirc;tes passifs sont maintenant possibles s'ils sont activ&eacute;s par le param&eacute;tre <a href="configmain.html#accept_passive_host_checks">accept_passive_host_checks</a> du fichier de configuration principal et le param&eacute;tre <i>accept_passive_host_checks</i> de la <a href="xodtemplate.html#host">d&eacute;finition d'h&ocirc;te</a>. Les <a href="passivechecks.html">contr&ocirc;les passifs d'h&ocirc;tes</a> peuvent simplifier la mise en oeuvre d'une supervision <a href="redundancy.html">redondante</a> ou <a href="distributed.html">r&eacute;partie</a>. <strong>NOTE :</strong> Certains probl&egrave;mes sont li&eacute;s aux contr&ocirc;les d'h&ocirc;tes passifs - pour en savoir plus lisez <a href="passivechecks.html">ceci</a>.
	</ul>

<br />
<li><b>Changements dans la m&eacute;morisation</b>
	<ul>
	<li><b>M&eacute;morisation des informations d'ordonnancement</b> - Les information d'ordonnancement des contr&ocirc;les d'h&ocirc;tes et de services (prochains moments de contr&ocirc;le) peuvent maintenant &ecirc;tre m&eacute;moris&eacute;es entre les red&eacute;marrages du programme gr&acirc;ce au param&eacute;tre <a href="configmain.html#use_retained_scheduling_info">use_retained_scheduling_info</a>.
	<li><b>M&eacute;morisation plus subtile</b> - Les valeurs de divers param&eacute;tres d'h&ocirc;tes et de services qui peuvent &ecirc;tre m&eacute;moris&eacute;es entre les red&eacute;marrages du programme ne le sont d&eacute;sormais que si elles ont &eacute;t&eacute; chang&eacute;es en cours d'ex&eacute;cution par une <a href="extcommands.html">commande externe</a>. Cela rendra les choses plus claires pour ceux qui tentent de modifier les valeurs de param&eacute;tres d'h&ocirc;tes et de services puis red&eacute;marrent Nagios, s'attendant &agrave; constater des changements.
	<li><b>Plus de choses m&eacute;moris&eacute;es</b> - Il y a plus d'informations m&eacute;moris&eacute;es entre les red&eacute;marrages du programme, y compris l'historique de la <a href="flapping.html">d&eacute;tection d'oscillation</a>. Youpi !
	</ul>

<br />
<li><b>Changements dans les informations &eacute;tendues</b>
	<ul>
	<li><b>Nouvel emplacement</b> - Les d&eacute;finitions d'informations &eacute;tendues <a href="xodtemplate.html#hostextinfo">d'h&ocirc;tes</a> et <a href="xodtemplate.html#serviceextinfo">de services</a> sont maintenant stock&eacute;es dans les fichiers de configuration des objets, avec les d&eacute;finitions d'h&ocirc;tes, etc. Il en r&eacute;sulte que les d&eacute;finitions d'information &eacute;tendues sont maintenant analys&eacute;es et valid&eacute;es par le d&eacute;mon Nagios avant le d&eacute;marrage.
	<li><b>Nouveaux param&eacute;tres</b> - Les d&eacute;finitions d'informations &eacute;tendues <a href="xodtemplate.html#hostextinfo">d'h&ocirc;tes</a> et <a href="xodtemplate.html#serviceextinfo">de services</a> comportent maintenant deux nouveaux param&eacute;tres : <i>notes</i> et <i>action_url</i>.
	</ul>

<br />
<li><b>Changements dans l'interpr&eacute;teur Perl int&eacute;gr&eacute;</b>
	<ul>
	<li><b>Emplacement de p1.pl</b> - Vous pouvez maintenant d&eacute;finir l'emplacement du fichier d'aide de l'interpr&eacute;teur Perl int&eacute;gr&eacute; (p1.pl) gr&acirc;ce au param&eacute;tre p1_file.
	</ul>
<br />
<li><b>Changements dans les notifications</b>
	<ul>

	<li><b>Notifications d'oscillation</b> - Les notifications sont maintenant envoy&eacute;es au commencement et &agrave; la fin de l'<a href="flapping.html">oscillation</a> d'h&ocirc;tes et de services. Cette fonction est d&eacute;finie par la valeur <i>f</i> dans le param&eacute;tre <i>notification_options</i> des d&eacute;finitions de <a href="xodtemplate.html#contact">contacts</a>, d'<a href="xodtemplate.html#host">h&ocirc;tes</a> et de <a href="xodtemplate.html#service">services</a>.
	<li><b>Meilleur algorithme</b> - L'algorithme de notification a &eacute;t&eacute; l&eacute;g&egrave;rement am&eacute;lior&eacute;. Cela devrait &eacute;viter d'envoyer des notifications de r&eacute;tablissement alors qu'aucune notification de probl&egrave;me n'avait &eacute;t&eacute; pr&eacute;alablement envoy&eacute;e.
	<li><b>Notifications de services</b> - Avant que les notifications de services ne soient envoy&eacute;es, les <a href="xodtemplate.html#hostdependency">d&eacute;pendances</a> de notification pour l'h&ocirc;te sont d&eacute;sormais v&eacute;rifi&eacute;es. Si les notifications d'h&ocirc;te ne sont pas jug&eacute;es valables, les notifications pour le service ne seront pas envoy&eacute;es non plus.
	<li><b>Options d'escalade</b> - Les param&eacute;tres de p&eacute;riode et d'&eacute;tat ont &eacute;t&eacute; ajout&eacute;s aux escalades <a href="xodtemplate.html#hostescalation">d'h&ocirc;tes</a> et <a href="xodtemplate.html#serviceescalation">de services</a>.  Cela vous permet de contr&ocirc;ler plus finement l'utilisation des escalades.  Vous trouverez <a href="escalations.html">ici</a> plus d'informations sur les escalades.
	</ul>

<br />
<li><b>Ajout des groupes de services</b> - Les <a href="xodtemplate.html#servicegroup">groupes de services</a> ont &eacute;t&eacute; ajout&eacute;s. Ils vous permettent de grouper des services pour l'affichage dans les CGI et <a href="templatetricks.html">peuvent &ecirc;tre utilis&eacute;s</a> dans les d&eacute;finitions de d&eacute;pendances de services et d'escalade de services pour faciliter la configuration.<br />
<br />
<li><b>Ajout de l'arr&ecirc;t planifi&eacute; d&eacute;clench&eacute;</b> - La gestion de l'arr&ecirc;t planifi&eacute; dit "d&eacute;clench&eacute;" a &eacute;t&eacute; ajout&eacute; pour les h&ocirc;tes et les services. L'arr&ecirc;t planifi&eacute; d&eacute;clench&eacute; vous permet de d&eacute;finir un arr&ecirc;t planifi&eacute; qui commence en m&ecirc;me temps qu'un autre arr&ecirc;t planifi&eacute; (tr&egrave;s utile pour d&eacute;finir l'arr&ecirc;t planifi&eacute; des h&ocirc;tes enfants d'un h&ocirc;te dont le moment d'arr&ecirc;t planifi&eacute; est variable). Vous trouverez <a href="downtime.html">ici</a> plus d'informations sur l'arr&ecirc;t planifi&eacute;.<br />

<br />
<li><b>Nouvel outil de statistiques</b> - Un nouvel outil appel&eacute; 'nagiostats' fait maintenant partie de la distribution de Nagios. C'est un outil en ligne de commande qui vous donne les statistiques pour un processus Nagios en cours d'ex&eacute;cution. Il peut &eacute;galement produire des donn&eacute;es compatibles avec MRTG, vous permettant de repr&eacute;senter graphiquement les statistiques.  Vous trouverez <a href="nagiostats.html">ici</a> plus d'information sur l'utilisation de cet outil.<br />
<br />
<li><b>Supervision adaptative</b> - Vous pouvez maintenant changer certains param&eacute;tres propres aux contr&ocirc;les d'h&ocirc;tes et de services (commandes de contr&ocirc;les, intervalle de contr&ocirc;le, nombre maximal d'essais de contr&ocirc;le, etc.) en cours d'ex&eacute;cution en envoyant les commandes externes appropri&eacute;es. Ce type de supervision adaptative ne sera probablement pas d'un grand usage pour la majorit&eacute; des utilisateurs, mais il permet des trucs &eacute;l&eacute;gants. Vous trouverez <a href="adaptive.html">ici</a> plus d'informations sur la supervision adaptative.<br />
<br />
<li><b>Changements dans les donn&eacute;es de performance</b> - La m&eacute;thode de traitement des donn&eacute;es de performance a l&eacute;g&egrave;rement chang&eacute;. Vous pouvez maintenant traiter les donn&eacute;es de performance en ex&eacute;cutant des commandes externes et/ou en &eacute;crivant dans les fichiers sans recompiler Nagios. Lisez la documentation sur les <a href="perfdata.html">donn&eacute;es de performance</a> pour de plus amples informations.<br />

<br />
<li><b>Abandon de la gestion native des bases de donn&eacute;es</b> - La gestion native du stockage de divers types de donn&eacute;es (&eacute;tats, m&eacute;morisation, commentaires, arr&ecirc;t planifi&eacute;, etc.) dans MySQL et PostgreSQL a &eacute;t&eacute; abandonn&eacute;e. Arr&ecirc;tez de vous plaindre. J'esp&egrave;re que quelqu'un d&eacute;veloppera bient&ocirc;t une solution alternative gr&acirc;ce au nouveau gestionnaire d'&eacute;v&egrave;nements. De plus, la gestion des bases de donn&eacute;es n'&eacute;tait pas tr&egrave;s bien impl&eacute;ment&eacute;e et son abandon va rendre la t&acirc;che plus facile pour les nouveaux utilisateurs (une question de moins &agrave; se poser).<br />
<br />
<li><b>API de distribution des &eacute;v&egrave;nements [NdT : event broker]</b> - Une API [NdT : interface de programmation] a &eacute;t&eacute; cr&eacute;&eacute;e pour permettre aux d&eacute;veloppeurs ind&eacute;pendants d'&eacute;crire des greffons qui s'int&eacute;grent avec le coeur du d&eacute;mon Nagios. La documentation de l'API de distribution d'&eacute;v&egrave;nements sera cr&eacute;&eacute;e quand le code de la version 2.x sera m&ucirc;r, et elle sera disponible sur le site web de Nagios.<br />
<br />
<li><b>Changements divers</b>
	<ul>
	<li><b>Toutes les commandes peuvent avoir des param&eacute;tres</b> - Tous les types de commandes (contr&ocirc;les d'h&ocirc;tes, notifications, traitement des donn&eacute;es de performance, gestionnaires d'&eacute;v&egrave;nements, etc.) peuvent recevoir des param&eacute;tres (s&eacute;par&eacute;s du nom de la commande par le caract&egrave;re <b>!</b>). Les param&eacute;tres sont remplac&eacute;s dans la ligne de commande via les <a href="macros.html">macros</a> <b>$ARGx</b>.
	<li><b>R&eacute;cursivit&eacute; dans le r&eacute;pertoire de configuration</b> - Nagios traite maintenant de mani&egrave;re r&eacute;cursive tous les fichiers de configuration qu'il trouve dans les sous-r&eacute;pertoires des r&eacute;pertoires d&eacute;finis par le param&eacute;tre <a href="configmain.html#cfg_dir">cfg_dir</a>.
	<li><b>Abandon de l'ancien style de fichiers de configuration</b> - La gestion de l'ancien style (sans templates) de fichiers de configuration des objets et des informations &eacute;tendues a &eacute;t&eacute; abandonn&eacute;e.
	<li><b>Recherches plus rapides</b> - Les objets sont maintenant stock&eacute;s dans une table de hachage cha&icirc;n&eacute;e pour acc&eacute;l&eacute;rer les recherches. Cela devrait grandement am&eacute;liorer la performance des CGI.
	<li><b>Threads de travail</b> - Quelques threads de travail ont &eacute;t&eacute; ajout&eacute;s pour artificiellement mettre en m&eacute;moire tampon les donn&eacute;es pour le <a href="configmain.html#command_file">fichier de commandes externes</a> et le tube [NdT : pipe] interne utilis&eacute; pour traiter les r&eacute;sultats de contr&ocirc;les de services. Cela devrait significativement am&eacute;liorer les performances pour les grandes installations.
	<li><b>Changements dans la journalisation</b> - L'&eacute;tat initial des h&ocirc;tes et des services est maintenant journalis&eacute; l&eacute;g&egrave;rement diff&eacute;remment. De plus, les &eacute;tats initiaux de tous les h&ocirc;tes et services sont imm&eacute;diatement journalis&eacute;s apr&egrave;s toute <a href="configmain.html#log_rotation_method">rotation de journaux</a>. Cela devrait r&eacute;soudre les probl&egrave;mes de "undetermined time" dans les CGI de disponibilit&eacute; et de tendance.
	<li><b>Mise en cache du fichier de configuration des objets</b> - Un <a href="configmain.html#object_cache_file">fichier de cache des objets</a> est maintenant cr&eacute;&eacute; par Nagios au d&eacute;marrage.  Il permet d'acc&eacute;l&eacute;rer un peu les CGI et vous permet de modifier vos fichiers de configuration des objets alors que Nagios s'ex&eacute;cute, sans affecter l'affichage des CGI.
	<li><b>Limites initiales de contr&ocirc;le</b> - Vous pouvez d&eacute;finir des limites de temps dans lesquelles le contr&ocirc;le initial de tous les h&ocirc;tes et services doit &ecirc;tre effectu&eacute; apr&egrave;s le d&eacute;marrage de Nagios.  Ces limites de temps sont d&eacute;finie par les param&eacute;tres <a href="configmain.html#max_host_check_spread">max_host_check_spread</a> et <a href="configmain.html#max_service_check_spread">max_service_check_spread</a>.
	<li><b>Acquittements "collants"</b> - Vous pouvez maintenant d&eacute;terminer si des acquittements d'h&ocirc;tes ou de services sont "collants" [NdT : sticky] ou pas. Les acquittements collants suppriments les notifications jusqu'&agrave; ce qu'un h&ocirc;te ou un service se r&eacute;tablisse compl&eacute;tement dans l'&eacute;tat UP ou OK. Les acquittements non collants suppriment simplement les notifications jusqu'&agrave; ce qu'un h&ocirc;te ou un service change d'&eacute;tat.
	<li><b>Changements dans le contr&ocirc;le des grappes [NdT : clusters]</b> - La fa&ccedil;on de superviser des grappes de services et d'h&ocirc;tes a chang&eacute; et est plus fiable qu'elle n'&eacute;tait. Cela est d&ucirc; &agrave; l'incorporation des macros &agrave; la demande et d'un nouveau plugin (check_cluster2). Vous trouverez <a href="clusters.html">ici</a> plus d'informations sur le contr&ocirc;le des clusters.
	<li><b>Expressions r&eacute;guli&egrave;res</b> - L'utilisation d'expressions r&eacute;guli&egrave;res dans de nombreux param&eacute;tres des objets peut &ecirc;tre activ&eacute;e gr&acirc;ce aux param&eacute;tres <a href="configmain.html#use_regexp_matching">use_regexp_matching</a> et <a href="configmain.html#use_true_regexp_matching">use_true_regexp_matching</a>. Vous trouverez des informations sur quand et comment utiliser les expressions r&eacute;guli&egrave;res dans la documentation sur les <a href="templatetricks.html">trucs et astuces des mod&egrave;les</a>.
	<li><b>Pseudo-&eacute;tats des services</b> - La gestion de pseudo-&eacute;tats de services qui &eacute;taient redondants a &eacute;t&eacute; supprim&eacute;e du CGI d'&eacute;tat. Cela affectera les URL cod&eacute;es en dur qui utilisent le param&eacute;tre du CGI servicestatustypes=X. Voyez include/statusdata.h pour la nouvelle liste des &eacute;tats de service que vous pouvez utiliser.
	<li><b>Changements dans le contr&ocirc;le de la fra&icirc;cheur</b> - L'algorithme de contr&ocirc;le de la fra&icirc;cheur a l&eacute;g&egrave;rement chang&eacute;. Le contr&ocirc;le de fra&icirc;cheur ne se fera pas si l'instant pr&eacute;sent n'est pas d&eacute;finit dans le param&eacute;tre <i>check_timeperiod</i> de l'h&ocirc;te ou du service. De plus, les contr&ocirc;les de fra&icirc;cheur n'auront plus lieu si les deux param&eacute;tres <i>check_interval</i> et <i>freshness_threshold</i> pour l'h&ocirc;te ou le service valent z&eacute;ro (0).
	</ul>

<br />
</ol>
</p>

<hr>

</body>
</html> 