
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//FR">

<html>
	<head>
	<title>Compl&eacute;ments &agrave; Nagios</title>
		
	<STYLE type="text/css">
		<!--
        	.Default { font-family: verdana,arial,serif; font-size: 8pt; }
        	.PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
		-->      
	</STYLE>
	</head>

	<body bgcolor="#FFFFFF" text="black" class="Default">
	<p>

	<div align="center">
  <h2 class="PageTitle">Compl&eacute;ments &agrave; Nagios</h2>
</div>
	<p></p>
	<hr>
<p> Voici une description de certains compl&eacute;ments disponibles pour Nagios.<br />

  Ces ajouts ainsi que d'autres peuvent &ecirc;tre obtenus : </p>
<ul>
  <li>Sur la page "downloads" (t&eacute;l&eacute;chargements) du site web de Nagios : <a href="http://www.nagios.org">www.nagios.org 
    [Anglais]</a></li>
  <li>Sur le site regroupant la plupart des plugins pour Nagios : <a href="http://www.nagiosexchange.org/">Nagios 
    Exchange [Anglais]</a>. </li>
</ul>

<p>Voici un aper&ccedil;u de certains d'entre eux</p>
<p>
	<strong><u>Index</u></strong>
	</p>
	
	
<p>Plugins </p>
<p><a href="#nrpe">nrpe</a> - D&eacute;mon et plugin pour l'ex&eacute;cution de plugins sur 
  des machines distantes<br />

  <a href="#nsca">nsca</a> - D&eacute;mon et programme client pour envoyer des r&eacute;sultats 
  de contr&ocirc;les passifs via le r&eacute;seau</p>




	<p>
	<a name="nrpe"></a>
	<table border="0" width="100%">
	<tr>
	<td bgcolor="#cbcbcb">
	<strong>
	<font color="red">nrpe</font>  -  D&eacute;mon et plugin pour l'ex&eacute;cution de plugins sur des machines distantes
	</strong>

	</td>
	</tr>
	</table>

	<table border="0">
	<tr>
	<td>
	<b>Auteur:</b>
	</td>

	<td> Ethan Galstad</td>
	</tr>
	<tr>
	<td valign="top">
	<b>Aper&ccedil;u:</b>
	</td>
	<td>

	Permet d'ex&eacute;cuter des plugins sur des machines distantes de mani&egrave;re transparente et relativement ais&eacute;e
	</td>
	</tr>
	<tr>
	<td valign="top">
	<b>Fichiers:</b>
	</td>

	<td>
	<table border="0">
	<tr>
	<td>
	<font color="red">check_nrpe</font>
	</td>
	<td>
	 - Plugin utilis&eacute; pour envoyer des requ&ecirc;tes sur l'agent nrpe de la machine distante
	</td>

	</tr>
	<tr>
	<td>
	<font color="red">nrpe</font> 
	</td>
	<td> 
	- Agent qui tourne sur la machine distante et ex&eacute;cute les requ&ecirc;tes du plugin
	</td>
	</tr>

	<tr>
	<td>
	<font color="red">nrpe.cfg</font>
	</td>
	<td> 	
	- Fichier de configuration pour les agents des machines distantes
	</td>
	</tr>
	</table>

	</td>
	</tr>
	<tr>
	<td valign="top">
	<b>Description:</b>
	</td>
	<td>
	<p>

	Cet ajout est con&ccedil;u pour permettre l'ex&eacute;cution de <a href="plugins.html">plugins</a> sur une machine distante. 
	Le plugin check_nrpe tourne sur la machine Nagios et est utilis&eacute; pour envoyer les requ&ecirc;tes d'ex&eacute;cution du plugin 
	&agrave; l'agent nrpe de la machine distante. 
	L'agent nrpe ex&eacute;cutera le plugin appropri&eacute; sur la machine distante, et retournera les donn&eacute;es de sortie et le code de retour 
	au plugin check_nrpe de la machine Nagios. 
	Le plugin check_nrpe envoie la sortie du plugin distant et le code de retour &agrave; Nagios comme si c'&eacute;tait le sien. 
	Cela permet d'ex&eacute;cuter les plugins de mani&egrave;re transparente sur les machines distantes. 
	L'agent nrpe peut soit fonctionner en mode d&eacute;mon standalone, soit comme un service inetd
	</p>

	</td>
	</tr>
	<tr>
	<td valign="top">
	<b>Notes:</b>
	</td>
	<td align="left">
	<ul>

	<li>Quand il tourne en mode d&eacute;mon, l'agent nrpe identifie les requ&ecirc;tes d'ex&eacute;cution des plugins en effectuant une comparaison 		rudimentaire de l'adresse IP de la machine appelante avec une liste d'adresses IP pr&eacute;sentes dans le fichier de configuration
	    <li>Quand il tourne sous inetd, des encapsuleurs TCP [TCP wrappers] peuvent 
          &ecirc;tre utilis&eacute;s pour restreindre l'acc&egrave;s &agrave; l'agent nrpe. 
      </ul>
	</td>
	</tr>

	</table>
	<p></p>


	<p>

	<p>
	<a name="nsca"></a>
	<table border="0" width="100%">
	<tr>

	<td bgcolor="#cbcbcb">
	<strong>
	<font color="red">nsca</font> -  D&eacute;mon et programme client, pour envoyer des r&eacute;sultats de contr&ocirc;les passifs via le r&eacute;seau
	</strong>
	</td>
	</tr>

	</table>

	<table border="0">
	<tr>
	<td> <b>Autheur:</b> </td>
	<td> Ethan Galstad</td>
	</tr>

	<tr>
	<td valign="top">
	<b>Aper&ccedil;u:</b>
	</td>
	<td>
	Permet d'envoyer des r&eacute;sultats de contr&ocirc;les passifs de services &agrave; un autre serveur sur le r&eacute;seau sur lequel 
	tourne Nagios.
	</td>

	</tr>
	<tr>
	<td valign="top">
	<b>Fichiers:</b>
	</td>
	<td>
	<table border="0">
	<tr>

	<td>
	<font color="red">nsca</font>
	</td>
	<td> 
	- D&eacute;mon qui tourne sur le serveur central de Nagios et qui traite les r&eacute;sultats des contr&ocirc;les faits sur les services passifs 
	soumis par les clients.
	</td>
	</tr>
	<tr>

	<td>
	<font color="red">nsca.cfg</font>
	</td>
	<td> 
	- Fichier de Configuration pour le d&eacute;mon nsca
	</td>
	</tr>
	<tr>
	<td>

	<font color="red">send_nsca</font>
	</td>
	<td> 
	- Programme client ex&eacute;cut&eacute; &agrave; partir des machines distantes, et qui envoie des informations de contr&ocirc;les de services passifs au d&eacute;mon nsca 	sur le serveur principal Nagios.
	</td>
	</tr>

	<tr>
	<td>
	<font color="red">send_nsca.cfg</font>
	</td>
	<td> 
	- Fichier de configuration pour le client send_nsca
	</td>
	</tr>
	</table>

	</td>
	</tr>
	<tr>
	<td valign="top"><b>Description:</b></td>
	<td>
	<p>
	Cet ajout vous permet d'envoyer des r&eacute;sultats de <a href="passivechecks.html">contr&ocirc;les de services passifs</a> &agrave; partir de 
	machines distantes &agrave; une machine centrale sur laquelle Nagios tourne. 
	Le client peut &ecirc;tre utilis&eacute; comme un programme s&eacute;par&eacute;, ou peut &ecirc;tre int&eacute;gr&eacute; dans des serveurs NAGIOS distants qui ex&eacute;cutent
	la <a href="configmain.html#ocsp_command">commande ocsp</a> pour cr&eacute;er un environnement de <a href="distributed.html">

	contr&ocirc;les distribu&eacute;s</a>. 
	La communication entre le client et le d&eacute;mon peut &ecirc;tre crypt&eacute;e par diff&eacute;rents algorithmes (DES, 3DES, CAST, xTEA, Twofish, 
	LOKI97, RJINDAEL, SERPENT, GOST, SAFER/SAFER+, etc.) si les biblioth&egrave;ques mcrypt sont install&eacute;es sur vos syst&egrave;mes.
	</p>
	</td>
	</tr>
	</table>

	<p></p>

	<hr>

	</body>
</html>

