<html>
<head>
<title>Ordonnancement du contr&ocirc;le des services</title>
<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->
</STYLE>
</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
  <h2 class="PageTitle">Ordonnancement du contr&ocirc;le des services</h2>
</div>

<p></p>

<hr>


<p>
<strong><u>Index</u></strong>
</p>
<p> <a href="#introduction">Introduction</a><br />
  <a href="#configuration_options">Options de configuration</a><br />
  <a href="#initial_scheduling">Ordonnancement initial</a><br />

  <a href="#service_inter_check_delay">D&eacute;lai inter-contr&ocirc;les</a><br />
  <a href="#service_interleaving">Entrelacement des services</a><br />
  <a href="#max_concurrent_checks">Nombre maximal de contr&ocirc;le de services 
  simultan&eacute;s</a><br />
  <a href="#time_restraints">Restrictions temporelles</a><br />
  <a href="#normal_scheduling">Ordonnancement normal</a><br />

  <a href="#problem_scheduling">Ordonnancement en cas de probl&egrave;me</a><br />
  <a href="#host_checks">Contr&ocirc;les d'h&ocirc;tes</a><br />
  <a href="#scheduling_delays">D&eacute;lais d'ordonnancement</a><br />
  <a href="#scheduling_example">Exemple d'ordonnancement</a><br />
  <a href="#service_options">Options de d&eacute;finition de service affectant 
  l'ordonnancement</a><br />

</p>

<p>
<a name="introduction"></a>
<strong><u>Introduction</u></strong>
</p>

<p> J'ai re&ccedil;u de nombreuses questions concernant la fa&ccedil;on dont les 
  contr&ocirc;les de service sont ordonnanc&eacute;s dans certaines situations, 
  ainsi que la diff&eacute;rence d'ordonnancement entre l'ex&eacute;cution r&eacute;elle 
  des contr&ocirc;les et le traitement de leur r&eacute;sultat. Cette page d&eacute;taille 
  ces m&eacute;canismes particuliers.</p>

<p> <a name="configuration_options"></a> <strong><u>Options de configuration</u></strong> 
</p>

<p> Avant de commencer, il y a plusieurs options de configuration qui affectent 
  la mani&egrave;re dont les contr&ocirc;les de service sont ordonnanc&eacute;s, 
  ex&eacute;cut&eacute;s, et trait&eacute;s. Pour les d&eacute;butants, je rappelle 
  que chaque <a href="configobject.html">d&eacute;finition de service</a> contient 
  trois options qui d&eacute;terminent quand et comment chaque contr&ocirc;le 
  de service est ordonnanc&eacute; et ex&eacute;cut&eacute;. Ces trois options 
  sont : </p>

<p>
<ul>
  <li><i>intervalle de contr&ocirc;le</i> <i>[normal_check_interval ] </i> 
  <li><i>intervalle de r&eacute;essai</i> <i>[retry_check_interval]</i> 
  <li><i>p&eacute;riode de contr&ocirc;le</i> <i>[check_period] </i> 

</ul>
<p></p>

<p> Il y a &eacute;galement quatre options de configuration dans le <a href="configmain.html">fichier 
  de configuration principal</a> qui affectent les contr&ocirc;les de services. 
  Ce sont : </p>

<p>
<ul>
  <li><a href="configmain.html#service_inter_check_delay_method"><i>m&eacute;thode 
    de d&eacute;lai inter-contr&ocirc;les</i></a> [service_inter_check_delay_method] 
  <li><a href="configmain.html#service_interleave_factor"><i>facteur d'entrelacement 
    des services</i></a> [service_interleave_factor]
  <li><a href="configmain.html#max_concurrent_checks"><i>nombre maximal de contr&ocirc;les 
    simultan&eacute;s</i></a> [max_concurrent_checks]
  <li><a href="configmain.html#service_reaper_frequency"><i>fr&eacute;quence de 
    consolidation des services</i></a> [service_reaper_frequency]

</ul>
<p></p>

<p> Nous verrons plus en d&eacute;tails comment ces options affectent les contr&ocirc;les 
  de service au fur et &agrave; mesure de notre explication. Tout d'abord, voyons 
  comment les services sont ordonnanc&eacute;s lorsque Nagios d&eacute;marre 
  ou red&eacute;marre... </p>


<p> <a name="initial_scheduling"></a> <strong><u>Ordonnancement initial</u></strong> 

</p>

<p> Quand Nagios (re)d&eacute;marre, il essaie d'ordonnancer le contr&ocirc;le 
  initial de tous les services de mani&egrave;re &agrave; minimiser la charge 
  impos&eacute;e &agrave; l'h&ocirc;te local et aux h&ocirc;tes distants. Ceci 
  est fait en espa&ccedil;ant les contr&ocirc;les initiaux, et en les entrela&ccedil;ant. 
  L'espacement des contr&ocirc;les (aussi appel&eacute; le d&eacute;lai inter-contr&ocirc;les) 
  est utilis&eacute; pour minimiser/&eacute;galiser la charge sur l'h&ocirc;te 
  supportant Nagios et l'entrelacement permet de minimiser/&eacute;galiser la 
  charge impos&eacute;e aux h&ocirc;tes distants. Le d&eacute;lai inter-contr&ocirc;les 
  et l'entrelacement sont tous deux d&eacute;crits plus loin. </p>

<p> Bien que les contr&ocirc;les des services soient initialement ordonnanc&eacute;s 
  pour r&eacute;partir la charge sur les h&ocirc;tes, les choses vont &eacute;voluer 
  &agrave; terme vers le chaos et &ecirc;tre un peu faites au hasard. Cela est 
  d&ucirc; au fait que les services ne sont pas tous contr&ocirc;l&eacute;s &agrave; 
  la m&ecirc;me fr&eacute;quence, que certains services mettent plus longtemps 
  que d'autres &agrave; &ecirc;tre contr&ocirc;l&eacute;s, que des probl&egrave;mes 
  sur les h&ocirc;tes et/ou les services peuvent modifier l'ordonnancement des 
  contr&ocirc;les, etc. Au moins, nous essayons de faire partir les choses du 
  bon pied. Avec un peu de chance, l'ordonnancement initial permettra de garder 
  la charge assez &eacute;quilibr&eacute;e au fil du temps... </p>

<p> <strong>Note :</strong> si vous voulez conna&icirc;tre l'ordonnancement initial, 
  d&eacute;marrez Nagios avec l'option <b>-s</b>. Cela affichera des informations 
  sommaires sur l'ordonnancement (d&eacute;lai inter-contr&ocirc;les, facteur 
  d'entrelacement, heure du premier et du dernier contr&ocirc;le de service, etc) 
  et cr&eacute;era un nouveau journal des &eacute;tats qui montre &agrave; quelle 
  heure exactement sont ordonnanc&eacute;s les contr&ocirc;les initiaux de chaque 
  service. Comme cette option &eacute;crase le journal des &eacute;tats, vous 
  ne devez pas l'utiliser lorsqu'une autre instance de Nagios tourne. Nagios 
  <i>ne d&eacute;marre aucune supervision</i> lorsque cette option est utilis&eacute;e. 

</p>

<p> <a name="service_inter_check_delay"></a> <strong><u>D&eacute;lai inter-contr&ocirc;les</u></strong> 
</p>

<p> Comme indiqu&eacute; pr&eacute;c&eacute;demment, Nagios tente d'&eacute;quilibrer 
  la charge impos&eacute;e &agrave; la machine qui le supporte en espa&ccedil;ant 
  r&eacute;guli&egrave;rement les contr&ocirc;les de services. Le temps d'attente 
  entre deux contr&ocirc;les cons&eacute;cutifs est appel&eacute; d&eacute;lai 
  inter-contr&ocirc;les. En donnant une valeur &agrave; la variable <a href="configmain.html#service_inter_check_delay_method">m&eacute;thode 
  de d&eacute;lai inter-contr&ocirc;les</a> du fichier de configuration principal, 
  vous pouvez modifier la fa&ccedil;on dont ce d&eacute;lai est calcul&eacute;. 
  J'expliquerai comment le calcul "d&eacute;brouillard" [smart] fonctionne, car 
  c'est le param&egrave;tre que vous utiliserez normalement. </p>

<p> En utilisant la valeur "d&eacute;brouillard" [smart] pour la variable <i>service_inter_check_delay_method</i>, 
  Nagios calculera le d&eacute;lai inter-contr&ocirc;les de la mani&egrave;re 
  suivante : </p>

<p> <i>d&eacute;lai inter-contr&ocirc;les = (total des intervalles de contr&ocirc;le 
  normaux de tous les services) / (nombre total de services)</i></p>

<p> Prenons un exemple. Supposons que vous ayez 1.000 services ayant chacun un 
  intervalle normal de contr&ocirc;le de 5 minutes (normalement les services ne 
  sont pas tous contr&ocirc;l&eacute;s &agrave; la m&ecirc;me fr&eacute;quence, 
  mais prenons le cas le plus simple...). Le total des intervalles de contr&ocirc;le 
  de tous les services est de 5.000 (1.000 * 5). Ce qui signifie que le d&eacute;lai 
  moyen entre deux contr&ocirc;les de chaque service est de 5 minutes (5.000 / 
  1.000). Partant de cette information, nous r&eacute;alisons que (en moyenne) 
  il nous faut contr&ocirc;ler 1.000 services toutes les 5 minutes. Cela signifie 
  qu'il nous faut utiliser un d&eacute;lai inter-contr&ocirc;les de 0.005 minutes 
  (0.3 secondes) lors de la r&eacute;partition initiale des contr&ocirc;les de 
  services. En espa&ccedil;ant chaque contr&ocirc;le de 0.3 secondes, nous pouvons 
  plus ou moins garantir que Nagios ordonnance et/ou ex&eacute;cute 3 nouveaux 
  contr&ocirc;les de services chaque seconde. En espa&ccedil;ant r&eacute;guli&egrave;rement 
  les contr&ocirc;les dans le temps de cette mani&egrave;re, nous pouvons esp&eacute;rer 
  que la charge sur l'h&ocirc;te qui supporte Nagios reste &eacute;quilibr&eacute;e. 

</p>
<p> <a name="service_interleaving"></a> <strong><u>Entrelacement des services</u></strong> 
</p>

<p> Comme d&eacute;crit ci-dessus, le d&eacute;lai inter-contr&ocirc;les aide 
  &agrave; r&eacute;partir la charge que Nagios impose &agrave; l'h&ocirc;te local. 
  Qu'en est-il des h&ocirc;tes distants ? Est-il n&eacute;cessaire d'y r&eacute;partir 
  &eacute;galement la charge ? Pourquoi ? Oui, c'est important et oui, Nagios 
  peut y contribuer. R&eacute;partir la charge sur les h&ocirc;tes distants est 
  particuli&egrave;rement important avec la mise en place de <a href="parallelization.html">la 
  parall&eacute;lisation des contr&ocirc;les de services</a>. Si vous supervisez 
  un grand nombre de services sur un h&ocirc;te distant et que les contr&ocirc;les 
  ne sont pas r&eacute;partis, l'h&ocirc;te distant peut se croire victime d'une 
  attaque SYN s'il y a de nombreuses connexions ouvertes sur le m&ecirc;me port. 
  De plus, tenter de r&eacute;partir la charge sur les h&ocirc;tes distants est 
  une bonne chose... </p>

<p> En donnant une valeur &agrave; la variable <a href="configmain.html#service_interleave_factor">facteur 
  d'entrelacement des services</a> du fichier de configuration principal, vous 
  pouvez modifier le mode de calcul de l'entrelacement. J'expliquerai comment 
  le calcul "d&eacute;brouillard" fonctionne, comme c'est probablement le mode 
  que vous utiliserez en g&eacute;n&eacute;ral. Vous pouvez toutefois utiliser 
  un facteur d'entrelacement pr&eacute;d&eacute;fini plut&ocirc;t que de laisser 
  Nagios le calculer pour vous. Notez par ailleurs que si vous utilisez un facteur 
  d'entrelacement de 1, le contr&ocirc;le entrelac&eacute; des services est d&eacute;sactiv&eacute;. 

</p>
<p> Quand vous utilisez la valeur "d&eacute;brouillard" pour la variable <i>service_interleave_factor</i>, 
  Nagios calculera un facteur d'entrelacement selon la m&eacute;thode suivante 
  : </p>

<p> <i>facteur d'entrelacement = plafond( nombre total de services / nombre total 
  d'h&ocirc;tes )</i> </p>

<p> Prenons un exemple. Mettons que vous ayez un total de 1.000 services et 150 
  h&ocirc;tes &agrave; superviser. Nagios calculera un facteur d'entrelacement 
  de 7. Ceci signifie que quand Nagios ordonnance les contr&ocirc;les initiaux 
  des services, il ordonnancera le premier qu'il trouvera, sautera les 6 suivants, 
  ordonnancera le suivant, et ainsi de suite... Ce processus se r&eacute;p&eacute;tera 
  jusqu'&agrave; ce que tous les contr&ocirc;les de service soient ordonnanc&eacute;s. 
  Comme les services sont tri&eacute;s (et donc ordonnanc&eacute;s) selon le nom 
  de l'h&ocirc;te auquel ils sont associ&eacute;s, cela aidera &agrave; minimiser/r&eacute;partir 
  la charge sur les h&ocirc;tes distants. </p>

<p>Les deux images suivantes montrent comment les contr&ocirc;les de services 
  sont ordonnanc&eacute;s quand ils sont ne sont pas entrelac&eacute;s (<i>service_interleave_factor=1</i>) 
  et quand ils sont entrelac&eacute;s avec la variable <i>service_interleave_factor 
  </i>&eacute;gal &agrave; 4. </p>
<table border=0 width="738">
  <tr>
    <td width="363"><strong>Non-Interleaved Checks:</strong></td>

    <td width="365"><strong>Interleaved Checks:</strong></td>
  </tr>
  <tr> 
    <td width="363"><a href="images/noninterleaved1.png"><img src="images/noninterleaved1.png" border=1 alt="Non-Interleaved Checks" width=300 height=125></a></td>
    <td width="365"><a href="images/interleaved1.png"><img src="images/interleaved1.png" border=1 alt="Interleaved Checks" width=300 height=125></a></td>
  </tr>
  <tr> 
    <td width="363"><a href="images/noninterleaved2.png"><img src="images/noninterleaved2.png" border=1 alt="Non-Interleaved Checks" width=300 height=125></a></td>
    <td width="365"><a href="images/interleaved2.png"><img src="images/interleaved2.png" border=1 alt="Interleaved Checks" width=300 height=125></a></td>

  </tr>
  <tr> 
    <td width="363"></td>
    <td width="365"><a href="images/interleaved3.png"><img src="images/interleaved3.png" border=1 alt="Interleaved Checks" width=300 height=125></a></td>
  </tr>
</table>
<p> <a name="max_concurrent_checks"></a> <strong><u>Nombre maximal de contr&ocirc;les 
  de services simultan&eacute;s</u></strong></p>

<p> Pour &eacute;viter que Nagios ne consomme toute votre CPU, vous pouvez restreindre 
  le nombre maximal de contr&ocirc;les de services qui peuvent s'ex&eacute;cuter 
  &agrave; un instant donn&eacute;. Ceci est d&eacute;fini gr&acirc;ce &agrave; 
  l'option <a href="configmain.html#max_concurrent_checks">nombre maximal de contr&ocirc;les 
  de service simultan&eacute;s</a> <i>(max_concurrent_checks) </i>du fichier de 
  configuration principal. </p>

<p> Le bon c&ocirc;t&eacute; de cette option est que vous pouvez contr&ocirc;ler 
  l'usage que fait Nagios de votre CPU. Le mauvais c&ocirc;t&eacute; est que 
  des contr&ocirc;les de services peuvent ne pas pouvoir s'ex&eacute;cuter si 
  cette valeur est trop basse. Quand arrive le moment de faire un contr&ocirc;le 
  de service, Nagios s'assurera que pas plus de <i>x</i> contr&ocirc;les de 
  services ne sont en cours d'ex&eacute;cution ou en attente de r&eacute;sultat 
  (<i>x</i> &eacute;tant la valeur que vous avez donn&eacute; &agrave; l'option 
  <i>max_concurrent_checks</i>). Si cette limite est atteinte, Nagios retardera 
  l'ex&eacute;cution des contr&ocirc;les &agrave; faire jusqu'&agrave; ce que 
  les pr&eacute;c&eacute;dents contr&ocirc;les aient termin&eacute;. Dans ce cas, 
  comment d&eacute;terminer une valeur raisonnable pour l'option <i>max_concurrent_checks</i> 
  ? </p>

<p> Tout d'abord, rassemblez les informations suivantes... </p>

<p>
<ul>
  <li>Le d&eacute;lai inter-contr&ocirc;les qu'utilise Nagios pour ordonnancer 
    initialement les contr&ocirc;les de services (utilisez l'argument <b>-s</b> 
    de la ligne de commande pour le conna&icirc;tre) 
  <li>La fr&eacute;quence (en secondes) des &eacute;v&egrave;nements de consolidation 
    des services, sp&eacute;cifi&eacute;e par la variable <a href="configmain.html#service_reaper_frequency">fr&eacute;quence 
    de consolidation des services</a> du fichier de configuration principal. 
  <li>Une id&eacute;e du temps moyen d'ex&eacute;cution des contr&ocirc;les de 
    services (la plupart des plugins ont un timeout de 10 secondes, ce qui fait 
    que la moyenne est probablement plus basse) 

</ul>
<p></p>

<p> Ensuite, faites le calcul suivant pour d&eacute;terminer une valeur raisonnable 
  pour le nombre maximal de contr&ocirc;les simultan&eacute;s... </p>

<p> <i>max. contr&ocirc;les simultan&eacute;s = plafond( max( fr&eacute;quence 
  de consolidation des services, temps moyen d'ex&eacute;cution d'un contr&ocirc;le) 
  / d&eacute;lai inter-contr&ocirc;les)</i> </p>

<p> Le r&eacute;sultat devrait donner une valeur de d&eacute;part raisonnable 
  pour la variable <i>max_concurrent_checks</i>. Vous pouvez avoir &agrave; augmenter 
  un peu cette valeur si les contr&ocirc;les de services continuent &agrave; d&eacute;passer 
  l'heure ordonnanc&eacute;e ou &agrave; la r&eacute;duire si Nagios consomme 
  trop de CPU. </p>

<p> Mettons que vous supervisez 875 services, chacun avec un intervalle de contr&ocirc;le 
  de 2 minutes. Cela signifie que votre d&eacute;lai inter-contr&ocirc;les vaut 
  0,137 secondes. Si vous mettez la fr&eacute;quence de consolidation des services 
  &agrave; 10 secondes, vous pouvez calculer une valeur approximative pour le 
  nombre maximal de contr&ocirc;les simultan&eacute;s comme suit (je suppose que 
  le temps d'ex&eacute;cution moyen d'un contr&ocirc;le est de moins de 10 secondes) 
  ... </p>

<p> <i>max. contr&ocirc;les simultan&eacute;s = plafond( 10 / 0,137 )</i> </p>

<p> Dans ce cas, le r&eacute;sultat est 73. Ceci est logique, car (en moyenne) 
  Nagios ex&eacute;cutera un peu plus de 7 nouveaux contr&ocirc;les de service 
  par seconde et il traite les r&eacute;sultats des contr&ocirc;les toutes les 
  10 secondes. Ce qui veut dire qu'&agrave; n'importe quel moment, il y aura un 
  peu plus de 70 contr&ocirc;les de service en cours d'ex&eacute;cution ou en 
  attente de traitement des r&eacute;sultats. Dans ce cas, je recommanderais de 
  pousser la valeur du nombre maximal de contr&ocirc;les simultan&eacute;s jusqu'&agrave; 
  80, &eacute;tant donn&eacute; qu'il y aura de l'attente quand Nagios traite 
  les r&eacute;sultats des contr&ocirc;les et fait le reste de son travail. Visiblement, 
  vous devrez tester et r&eacute;gler les choses petit &agrave; petit pour que 
  tout tourne correctement sur votre syst&egrave;me, mais vous avez l&agrave; 
  des r&egrave;gles de configuration g&eacute;n&eacute;rales... </p>

<p> <a name="time_restraints"></a> <strong><u>Restrictions temporelles</u></strong></p>

<p> L'option <i>check_period</i> d&eacute;termine la <a href="timeperiods.html">p&eacute;riode</a> 
  durant laquelle Nagios peut ex&eacute;cuter des contr&ocirc;les de service. 
  Sans parler de l'&eacute;tat dans lequel se trouve un service, si l'heure de 
  son ex&eacute;cution r&eacute;elle n'est pas une heure valide telle que sp&eacute;cifi&eacute;e 
  dans la p&eacute;riode, le contr&ocirc;le <i>ne sera pas </i>ex&eacute;cut&eacute;. 
  Nagios r&eacute;ordonnancera alors le contr&ocirc;le &agrave; la prochaine 
  heure valide de la p&eacute;riode. Si le contr&ocirc;le peut &ecirc;tre ex&eacute;cut&eacute; 
  (e.g. l'heure est valid&eacute;e dans la p&eacute;riode), le contr&ocirc;le 
  est ex&eacute;cut&eacute;. </p>

<p> <strong>Note :</strong> m&ecirc;me si un contr&ocirc;le de service ne peut 
  pas &ecirc;tre ex&eacute;cut&eacute; &agrave; une certaine heure, Nagios peut 
  quand m&ecirc;me l'<i>ordonnancer</i> &agrave; cette heure. Ce cas de figure 
  se produira tr&egrave;s probablement durant l'ordonnancement initial des contr&ocirc;les 
  de services, mais il peut aussi se produire dans d'autre cas. Cela <i>ne signifie 
  pas</i> que Nagios ex&eacute;cutera le contr&ocirc;le ! Au moment d'<i>ex&eacute;cuter</i> 
  un contr&ocirc;le de service, Nagios v&eacute;rifiera que le contr&ocirc;le 
  peut se d&eacute;rouler &agrave; cette heure. Si ce n'est pas le cas, Nagios 
  n'ex&eacute;cutera pas le contr&ocirc;le, mais le r&eacute;ordonnancera plus 
  tard. Que cela ne vous induise pas en erreur ! L'ordonnancement et l'ex&eacute;cution 
  des contr&ocirc;les sont deux choses clairement distinctes (bien qu'en relation). 

</p>

<p> <a name="normal_scheduling"></a> <strong><u>Ordonnancement normal</u></strong> 
</p>

<p> Dans un monde parfait, vous n'aurez pas de probl&egrave;mes de r&eacute;seau. 
  Mais si cela arrivait, vous n'auriez pas besoin d'un outil de supervision r&eacute;seau. 
  Quoi qu'il en soit, quand tout tourne et que les services sont dans l'&eacute;tat 
  OK, nous appellerons cela "normal". Les contr&ocirc;les de service sont normalement 
  ordonnanc&eacute;s &agrave; la fr&eacute;quence sp&eacute;cifi&eacute;e par 
  l'option <i>check_interval</i>. C'est tout. Simple, non ? </p>


<p> <a name="problem_scheduling"></a> <strong><u>Ordonnancement en cas de probl&egrave;me</u></strong></p>

<p> Qu'arrive-t-il en cas de probl&egrave;me sur un service ? Eh bien, entre autres 
  l'ordonnancement des contr&ocirc;les est modifi&eacute;. Si vous avez configur&eacute; 
  l'option <i>max_attempts</i> de la d&eacute;finition du service &agrave; plus 
  de 1, Nagios contr&ocirc;lera le service &agrave; nouveau avant de remonter 
  le probl&egrave;me. Pendant que le service est &agrave; nouveau contr&ocirc;l&eacute; 
  (jusqu'&agrave; <i>max_attempts</i> fois), il est consid&eacute;r&eacute; comme 
  &eacute;tant dans un &eacute;tat "soft" (comme d&eacute;crit <a href="statetypes.html">ici</a>) 
  et des contr&ocirc;les du service sont r&eacute;ordonnanc&eacute;s &agrave; 
  la fr&eacute;quence d&eacute;termin&eacute;e par l'option <i>retry_interval</i>.</p>

<p> Si Nagios contr&ocirc;le le service <i>max_attempts</i> fois et qu'il le trouve 
  toujours dans un &eacute;tat non-OK, Nagios mettra le service en &eacute;tat 
  "hard", enverra des notifications aux contacts (le cas &eacute;ch&eacute;ant), 
  et commencera le r&eacute; ordonnancement des futurs contr&ocirc;les du service 
  &agrave; la fr&eacute;quence d&eacute;termin&eacute;e par l'option <i>check_interval</i>. 

</p>

<p> Comme toujours, il y a des exceptions &agrave; la r&egrave;gle. Quand un contr&ocirc;le 
  de service retourne un &eacute;tat non-OK, Nagios contr&ocirc;lera l'h&ocirc;te 
  auquel est associ&eacute; le service pour d&eacute;terminer s'il est en fonction 
  ou pas (voyez la note <a href="#host_checks">ci-dessous</a> pour savoir de quelle 
  fa&ccedil;on). Si l'h&ocirc;te n'est pas en fonction (i.e. il est soit hors 
  fonction soit inaccessible), Nagios mettra imm&eacute;diatement le service 
  dans un &eacute;tat hard non-OK et remettra le compteur d'essais &agrave; 1. 
  Comme le service est dans un &eacute;tat hard non-OK, le contr&ocirc;le de service 
  sera r&eacute;ordonnanc&eacute; &agrave; la fr&eacute;quence normale sp&eacute;cifi&eacute;e 
  par l'option <i>check_interval</i>, plut&ocirc;t que celle de l'option <i>retry_interval</i>. 

</p>

<p> <a name="host_checks"></a> <strong><u>Contr&ocirc;les d'h&ocirc;tes</u></strong> 
</p>

<p> A la diff&eacute;rence des contr&ocirc;les de services, les contr&ocirc;les 
  d'h&ocirc;tes <i>ne sont pas </i>ordonnanc&eacute;s de mani&egrave;re r&eacute;guli&egrave;re. 
  Ils sont lanc&eacute;s &agrave; la demande, quand Nagios en ressent le besoin. 
  C'est une question courante des utilisateurs, qui a donc besoin d'&ecirc;tre 
  clarifi&eacute;e. </p>

<p> Un des cas o&ugrave; Nagios contr&ocirc;le l'&eacute;tat d'un h&ocirc;te est 
  quand un contr&ocirc;le de service retourne un &eacute;tat non-OK. Nagios contr&ocirc;le 
  l'h&ocirc;te pour d&eacute;terminer s'il est en fonction, hors fonction, ou 
  inaccessible. Si le premier contr&ocirc;le d'h&ocirc;te retourne un &eacute;tat 
  non-OK, Nagios continuera &agrave; demander des contr&ocirc;les de l'h&ocirc;te 
  jusqu'&agrave; ce que (a) le nombre maximal de contr&ocirc;les d'h&ocirc;te 
  (sp&eacute;cifi&eacute; par l'option <i>max_attempts</i> de la <a href="configobject.html">d&eacute;finition 
  d'h&ocirc;te</a>) soit atteint, ou (b) un contr&ocirc;le de l'h&ocirc;te retourne 
  l'&eacute;tat OK. </p>

<p> Notez &eacute;galement - quand Nagios contr&ocirc;le l'&eacute;tat d'un 
  h&ocirc;te, il suspend tout autre action (ex&eacute;cution de nouveaux contr&ocirc;les 
  de services, traitement des r&eacute;sultats des contr&ocirc;les de services, 
  etc). Ceci peut ralentir un peu les choses et retarder les contr&ocirc;les de 
  service pendant quelques temps, mais il est indispensable de d&eacute;terminer 
  l'&eacute;tat de l'h&ocirc;te avant que Nagios puisse agir sur le(s) service(s) 
  posant probl&egrave;me. </p>

<p> <a name="scheduling_delays"></a> <strong><u>D&eacute;lais d'ordonnancement</u></strong> 
</p>

<p> Il est &agrave; noter que l'ordonnancement et l'ex&eacute;cution des contr&ocirc;les 
  de service sont faits &quot;au mieux&quot;. Les contr&ocirc;les de service individuels 
  sont consid&eacute;r&eacute;s comme &eacute;tant des &eacute;v&egrave;nements 
  de basse priorit&eacute; dans Nagios, ils peuvent donc &ecirc;tre retard&eacute;s 
  si des &eacute;v&egrave;nements de haute priorit&eacute; doivent &ecirc;tre 
  ex&eacute;cut&eacute;s. Sont par exemple des &eacute;v&egrave;nements de haute 
  priorit&eacute; les rotations de fichier journal, les commandes de contr&ocirc;le 
  externes, et les &eacute;v&egrave;nements de consolidation de service. Qui plus 
  est, les contr&ocirc;les d'h&ocirc;tes ralentissent l'ex&eacute;cution et le 
  traitement des contr&ocirc;les de services. </p>

<p> <a name="scheduling_example"></a> <strong><u>Exemple d'ordonnancement</u></strong> 
</p>

<p> L'ordonnancement de contr&ocirc;les de services, leur ex&eacute;cution, et 
  le traitement de leurs r&eacute;sultats peuvent &ecirc;tre un peu ardus &agrave; 
  comprendre, alors prenons un petit exemple. Regardez le diagramme ci-dessous 
  - je m'y r&eacute;f&eacute;rerai en expliquant comment fonctionnent ces choses. 

</p>

<p>
<table border=0 cellspacing=10>
<tr><td><strong>Image 5.</strong></td></tr>
<tr><td><img src="images/checktiming.png" border=0></td></tr>
</table>
<p></p>

<p> Tout d'abord, les &eacute;v&egrave;nements <b>X</b><sub>n</sub> sont des &eacute;v&egrave;nements 
  de consolidation de services qui sont ordonnanc&eacute;s &agrave; une fr&eacute;quence 
  sp&eacute;cifi&eacute;e par l'option <a href="configmain.html#service_reaper_frequency">fr&eacute;quence 
  de consolidation des services</a> du fichier de configuration principal. Les 
  &eacute;v&egrave;nements de consolidation des services rassemblent et traitent 
  les r&eacute;sultats des contr&ocirc;les de service. Ils sont au c&#156;ur de 
  Nagios, lan&ccedil;ant les contr&ocirc;les d'h&ocirc;te, les gestionnaires 
  d'&eacute;v&egrave;nements et les notifications si n&eacute;cessaire. </p>

<p> Dans notre exemple, un service a &eacute;t&eacute; ordonnanc&eacute; au moment 
  <b>A</b>. Toutefois, Nagios a pris du retard dans sa file d'&eacute;v&egrave;nements, 
  et donc le contr&ocirc;le n'a &eacute;t&eacute; ex&eacute;cut&eacute; qu'au 
  moment <b>B</b>. Le contr&ocirc;le de service a termin&eacute; son ex&eacute;cution 
  au moment <b>C</b>, donc la diff&eacute;rence entre les points <b>C</b> et <b>B</b> 
  est le temps pendant lequel le contr&ocirc;le a effectivement tourn&eacute;. 

</p>

<p> Les r&eacute;sultats du contr&ocirc;le de service ne sont pas trait&eacute;s 
  imm&eacute;diatement &agrave; la fin de l'ex&eacute;cution. Ils sont sauvegard&eacute;s 
  pour un traitement ult&eacute;rieur par l'&eacute;v&egrave;nement de consolidation 
  des services. Le prochain &eacute;v&egrave;nement de ce type se produit au moment 
  <b>D</b>, ce qui fait que c'est approximativement le moment auquel le r&eacute;sultat 
  est trait&eacute; (le moment r&eacute;el peut se trouver un peu plus tard que 
  <b>D</b> dans la mesure o&ugrave; d'autres r&eacute;sultats de contr&ocirc;le 
  de service peuvent &ecirc;tre trait&eacute;s avant celui-ci). </p>

<p> Au moment o&ugrave; l'&eacute;v&egrave;nement de consolidation des services 
  traite le r&eacute;sultat du contr&ocirc;le de service, il r&eacute;ordonnance 
  le prochain contr&ocirc;le de service et le place dans la file d'&eacute;v&egrave;nements 
  de Nagios. Supposons que le contr&ocirc;le de service retourne un &eacute;tat 
  OK, le prochain moment de contr&ocirc;le <b>E</b> se trouve &agrave; l'heure 
  du contr&ocirc;le original plus le temps sp&eacute;cifi&eacute; par l'option 
  <i>check_interval</i>. Notez que le service <i>n'est pas </i> r&eacute;ordonnanc&eacute; 
  selon le moment o&ugrave; il a &eacute;t&eacute; effectivement ex&eacute;cut&eacute; 
  ! Il y a &agrave; ceci une exception (n'y en a t'il pas toujours ?) - si le 
  moment ou le contr&ocirc;le de service est r&eacute;ellement ex&eacute;cut&eacute; 
  (point <b>B</b>) se trouve apr&egrave;s le prochain moment d'ex&eacute;cution 
  du contr&ocirc;le (point <b>E</b>), Nagios compensera en ajustant le prochain 
  moment de contr&ocirc;le. Ceci permet de s'assurer que Nagios ne s'emballera 
  pas &agrave; essayer de maintenir les contr&ocirc;les de service en cas de charge 
  importante. Qui plus est, quel int&eacute;r&ecirc;t d'ordonnancer quelque chose 
  dans le pass&eacute;...? </p>

<p><a name="service_options"></a> <strong><u>Options de d&eacute;finition de service 
  affectant l'ordonnancement</u></strong></p>
<p> Chaque <a href="configobject.html">d&eacute;finition de service</a> contient 
  les options <i>check_interval</i> et <i>retry_interval</i>. J'esp&egrave;re 
  ici clarifier le r&ocirc;le de ces options, leur relation avec l'option <i>max_attempts</i> 
  de la d&eacute;finition de service, et comment elles affectent l'ordonnancement 
  du service.</p>

<p> Tout d'abord, l'option <i>check_interval</i> est l'intervalle de temps entre 
  deux contr&ocirc;les de service en temps "normal". "Normal" signifie lorsque 
  le service est dans l'&eacute;tat OK ou quand il est dans un &eacute;tat <a href="statetypes.html">hard</a> 
  non-OK.</p>
<p> Quand un service passe pour la premi&egrave;re fois de l'&eacute;tat OK &agrave; 
  l'&eacute;tat non-OK, Nagios vous offre la possibilit&eacute; d'augmenter ou 
  de r&eacute;duire temporairement l'intervalle de temps dont seront espac&eacute;s 
  les prochains contr&ocirc;les de ce service. Quand un service change d'&eacute;tat 
  pour la premi&egrave;re fois, Nagios fera jusqu'&agrave; <i>max_attempts</i>-1 
  tentatives de contr&ocirc;le du service avant de d&eacute;cider que le probl&egrave;me 
  est av&eacute;r&eacute;. Pendant que le service est contr&ocirc;l&eacute; &agrave; 
  nouveau , il est ordonnanc&eacute; selon l'option <i>retry_interval</i>, qui 
  peut &ecirc;tre plus courte ou plus longue que l'option <i>check_interval</i>. 
  Pendant que le service est contr&ocirc;l&eacute; (jusqu'&agrave; <i>max_attempts</i>-1 
  fois), il est dans un &eacute;tat <a href="statetypes.html">soft</a>. Si le 
  service est contr&ocirc;l&eacute; <i>max_attempts</i>-1 fois et qu'il est encore 
  en &eacute;tat non-OK, le service passe en &eacute;tat <a href="statetypes.html">hard</a> 
  et est ensuite r&eacute; ordonnanc&eacute; &agrave; la fr&eacute;quence normale 
  sp&eacute;cifi&eacute;e dans l'option <i>check_interval</i>. </p>

<p> A ce sujet, si vous sp&eacute;cifiez une valeur de 1 pour l'option <i>max_attempts</i>, 
  le service ne sera jamais contr&ocirc;l&eacute; &agrave; l'intervalle sp&eacute;cifi&eacute; 
  par l'option <i>retry_interval</i>. Il passera imm&eacute;diatement dans un 
  &eacute;tat <a href="statetypes.html">hard</a> et sera ensuite r&eacute; ordonnanc&eacute; 
  &agrave; la fr&eacute;quence sp&eacute;cifi&eacute;e par l'option <i>check_interval</i>.</p>



<hr>

</body>
</html>
