
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Configurer Nagios</title>
<STYLE type="text/css">
<!--
        .Trademark { font-size: x-small; }
        .Disclaimer { text-align: center; font-size: xx-small; font-style: italic; }
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->
</STYLE>
</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
  <h2 class="PageTitle">Configurer Nagios</h2>

</div>
<p></p>
<hr>

<p> <strong><u>Survol de la configuration</u></strong> </p>
<p> Il va falloir cr&eacute;er et &eacute;diter plusieurs fichiers de configuration 
  avant de pouvoir surveiller quoique ce soit. Ces fichiers sont d&eacute;crits 
  ci-dessous.</p>
<p><strong><u>Fichier de configuration principal</u></strong> </p>

<p> Le fichier de configuration principal (par d&eacute;faut, <i>/usr/local/nagios/etc/nagios.cfg</i>) 
  contient un certain nombre de directives qui affectent la mani&egrave;re dont 
  Nagios fonctionne. Ce fichier est lu par le processus Nagios et par les CGIs. 
  C'est le premier fichier que vous allez cr&eacute;er et &eacute;diter.</p>
<p>La documentation du fichier de configuration principal se trouve <a href="configmain.html">ici</a>. 
</p>
<p>Un fichier de configuration principal est g&eacute;n&eacute;r&eacute; automatiquement 
  &agrave; titre d'exemple quand vous lancez le script <b>configure</b> avant 
  de compiler les programmes. Vous le trouverez soit dans la distribution, soit 
  sous le r&eacute;pertoire /etc de votre installation. Quand vous <a href="installing.html">installez</a> 
  les exemples de fichiers de configuration avec la commande <b>make install-config</b>, 
  un exemple de fichier de configuration est copi&eacute; dans votre r&eacute;pertoire 
  de param&egrave;trage (g&eacute;n&eacute;ralement /usr/local/nagios/etc). Par 
  d&eacute;faut, son nom est <b>nagios.cfg</b>. </p>

<p> <strong><u>Fichier de configuration des ressources</u></strong></p>
<p>Les fichiers des ressources sont utilis&eacute;s pour stocker les <a href="macros.html">macros</a> 
  d&eacute;finies par les utilisateurs. Ces fichiers peuvent aussi contenir d'autres 
  informations (telles que la configuration des connexions de la base de donn&eacute;es), 
  bien que ceci d&eacute;pende de la mani&egrave;re dont vous aurez compil&eacute; 
  Nagios. L'avantage de ces fichiers est de pouvoir y mettre des donn&eacute;es 
  sensibles de configuration qui ne seront pas accessibles &agrave; travers les 
  CGIs.</p>

<p>Vous pouvez d&eacute;finir un ou plusieurs fichiers de ressources avec la directive 
<a href="configmain.html#resource_file">resource_file </a>dans le fichier de <a href="configmain.html">configuration 
principal.</a> </p>
<p><strong><u>Fichier de d&eacute;finition des objets</u></strong> </p>
<p> Le fichier de d&eacute;finition des objets d&eacute;finit les h&ocirc;tes, 
  services, groupes d'h&ocirc;tes, contacts, groupes de contacts, commandes, etc 
  ... C'est l&agrave; que vous d&eacute;finissez les choses que vous souhaitez 
  surveiller et comment vous d&eacute;sirez le faire.</p>

<p>La documentation du fichier de configuration des objets se trouve <a href="configobject.html">ici</a>. 
</p>
<p><strong><u>Fichier de configuration des CGI</u></strong> </p>

<p> Le fichier de configuration des CGIs (par d&eacute;faut,<i> /usr/local/nagios/etc/cgi.cfg</i>) 
  contient un certain nombre de directives qui affectent le mode de fonctionnement 
  des CGIs. </p>
<p>La documentation du fichier de configuration des CGI se trouve <a href="configcgi.html">ici</a>. 

</p>
<p>Un fichier de configuration des CGI est g&eacute;n&eacute;r&eacute; automatiquement 
  &agrave; titre d'exemple quand vous lancez le script <b>configure</b> avant 
  de compiler les programmes. Quand vous <a href="installing.html">installez</a> 
  les exemples de fichiers de configuration avec la commande <b>make install-config</b>, 
  un exemple de fichier de configuration des CGI est copi&eacute; dans le m&ecirc;me 
  r&eacute;pertoire que les fichiers de configuration principal et des h&ocirc;tes 
  (g&eacute;n&eacute;ralement /usr/local/nagios/etc). Par d&eacute;faut, son nom 
  est <b></b> <b>cgi.cfg</b>. </p>

<p> <strong><u>Fichier de configuration des informations &eacute;tendues.</u></strong></p>

<p> Le fichier de configuration des informations &eacute;tendues est utilis&eacute; 
  pour d&eacute;finir des informations suppl&eacute;mentaires pour les h&ocirc;tes 
  et les services qui doivent &ecirc;tre utilis&eacute;es par les CGIs. C'est l&agrave; 
  que vous d&eacute;finissez, par exemple, les coordonn&eacute;es de dessin, les 
  &quot;zolies zicones&quot;, etc ...</p>

<p>La documentation pour ce fichier se trouve<a href="xodtemplate.html#hostextinfo"> ici.</a></p>
<hr>

</body>
</html>
