

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Arr&ecirc;t planifi&eacute;</title>
<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->
</STYLE>
</head>
<body bgcolor="#FFFFFF" text="black" class="Default">
<p>
<div align="center">
  <h2 class="PageTitle">Arr&ecirc;t planifi&eacute;</h2>
</div>
<p></p>
<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p> Nagios vous permet de planifier des p&eacute;riodes d'arr&ecirc;t pour les 
  h&ocirc;tes et les services que vous supervisez. Ceci est utile au cas o&ugrave; 
  vous avez pr&eacute;vu d'arr&ecirc;ter un serveur pour maintenance, etc. Quand 
  un h&ocirc;te ou un service est dans une p&eacute;riode d'arr&ecirc;t planifi&eacute;, 
  les notifications pour cet h&ocirc;te ou ce service ne sont pas envoy&eacute;es. 
</p>

<p> <strong><u>Fichier des arr&ecirc;ts planifi&eacute;s</u></strong> </p>
<p> Les arr&ecirc;ts planifi&eacute;s des h&ocirc;tes et services sont stock&eacute;s 
  dans le <a href="configmain.html#downtime_file">fichier des arr&ecirc;ts planifi&eacute;s 
  </a> d&eacute;fini par une directive dans le fichier de configuration principal. 
</p>
<p> <strong><u>M&eacute;morisation des arr&ecirc;ts planifi&eacute;s</u></strong> 
</p>
<p> Les arr&ecirc;ts planifi&eacute;s sont m&eacute;moris&eacute;s, m&ecirc;me 
  si Nagios est relanc&eacute;. Au d&eacute;marrage, Nagios va lire le <a href="configmain.html#downtime_file">fichier 
  des arr&ecirc;ts planifi&eacute;s</a>, supprimer toute entr&eacute;e ancienne 
  ou invalide, et planifier les arr&ecirc;ts pour les h&ocirc;tes et services 
  concern&eacute;s.</p>
<p><strong><u>Planifier l'arr&ecirc;t</u></strong> </p>
<p> Vous pouvez planifier l'arr&ecirc;t des h&ocirc;tes et des services &agrave; 
  travers le <a href="cgis.html#extinfo_cgi">CGI d'informations compl&eacute;mentaires</a> 
  (en visualisant les informations soit d'un h&ocirc;te soit d'un service). Cliquez 
  le lien "Schedule downtime for this host/service" pour planifier l'arr&ecirc;t. 
</p>

<p> Une fois l'arr&ecirc;t d'un h&ocirc;te ou d'un service planifi&eacute;, Nagios 
  ajoutera un commentaire &agrave; cet h&ocirc;te/service indiquant que son arr&ecirc;t 
  est pr&eacute;vu durant la p&eacute;riode que vous avez indiqu&eacute;. Quand 
  la p&eacute;riode est pass&eacute;e, Nagios supprime automatiquement le commentaire 
  ajout&eacute;. Pas mal, non ?</p>
<p><strong><u>Arr&ecirc;ts planifi&eacute;s fixes ou variables</u></strong> </p>
<p> Il y a deux types d'arr&ecirc;ts planifi&eacute;s: les &quot;fixes&quot; et 
  les &quot;variables&quot;. Quand vous positionnez un arr&ecirc;t &agrave; travers 
  l'interface web, on vous demande s'il est fixe [fixed] ou variable [flexible]. 
  Voici leur d&eacute;finition:</p>
<p>&quot;Fixe&quot; d&eacute;marre et s'arr&ecirc;te &agrave; l'heure exacte programm&eacute;e. 
  Bon, celle-l&agrave; &eacute;tait facile.</p>
<p>"Variable&quot; est adapt&eacute; &agrave; des arr&ecirc;ts dont vous savez 
  qu'ils vont durer X minutes (ou heures), mais ne savez pas exactement quand 
  cela va red&eacute;marrer. Quand vous choisissez &quot;variable&quot;, Nagios 
  va d&eacute;marrer automatiquement au bon moment, quelque part entre l'heure 
  de d&eacute;part et l'heure de fin que vous avez sp&eacute;cifi&eacute;es. L'arr&ecirc;t 
  durera aussi longtemps que la dur&eacute;e sp&eacute;cifi&eacute;e. Ceci suppose 
  que l'h&ocirc;te ou service dont vous avez programm&eacute; l'arr&ecirc;t s'arr&ecirc;te 
  (ou devienne inaccessible) ou entre dans un &eacute;tat non-OK, quelque part 
  entre votre heure de d&eacute;part et d'arr&ecirc;t. </p>
<p>L'heure &agrave; laquelle l'h&ocirc;te ou le service aura un probl&egrave;me 
  sera pour Nagios, l'heure de d&eacute;marrage de l'arr&ecirc;t planifi&eacute;. 
  Il durera ensuite aussi longtemps que vous l'avez sp&eacute;cifi&eacute;, m&ecirc;me 
  si l'h&ocirc;te ou le service revient dans un &eacute;tat normal avant la fin 
  de l'arr&ecirc;t planifi&eacute;. </p>
<p>Ceci pour bonne raison : comme nous le savons tous, vous pouvez penser qu'un 
  probl&egrave;me est r&eacute;solu compl&egrave;tement (et red&eacute;marrer 
  le serveur), au moins 10 fois avant qu'il ne se d&eacute;cide &agrave; vraiment 
  marcher. Bien pr&eacute;vu n'est-ce pas ? :-)</p>
<p><strong><u>Arr&ecirc;ts d&eacute;clench&eacute;s sur &eacute;v&egrave;nement</u></strong></p>
<p>Lorsque vous planifiez l'arr&ecirc;t d'un h&ocirc;te ou d'un service, vous 
  avez la possibilit&eacute; de d&eacute;clencher l'arr&ecirc;t sur &eacute;v&egrave;nement. 
  L'arr&ecirc;t planifi&eacute; est alors d&eacute;clench&eacute; lorsqu'un autre 
  service ou h&ocirc;te d&eacute;marre son arr&ecirc;t planifi&eacute;. Cette 
  fonctionnalit&eacute; est extr&ecirc;mement pratique lorsque l'arr&ecirc;t planifi&eacute; 
  d'un grand nombre de services ou d'h&ocirc;tes d&eacute;pend d'un h&ocirc;te 
  ou d'un services particulier.<br />
  Par exemple, si vous planifiez un arr&ecirc;t variable sur un h&ocirc;te, vous 
  voudrez certainement d&eacute;clencher l'arr&ecirc;t planifi&eacute; de tous 
  ses &quot;fils&quot;.</p>
<p><strong><u>Comment l'arr&ecirc;t planifi&eacute; affecte les notifications</u></strong> 
</p>
<p> Quand un h&ocirc;te ou un service arrive dans la p&eacute;riode d'arr&ecirc;t 
  planifi&eacute;, Nagios n'autorisera pas l'&eacute;mission des notifications 
  pour cet h&ocirc;te ou ce service. La suppression des notifications se fait 
  par l'ajout d'un filtre &agrave; la <a href="notifications.html">logique de 
  notification</a>. Vous <i>ne verrez pas</i> d'ic&ocirc;ne dans les CGI indiquant 
  la d&eacute;sactivation des notifications pour cet h&ocirc;te/service. Quand 
  la p&eacute;riode d'arr&ecirc;t planifi&eacute; sera pass&eacute;e, Nagios autorisera 
  l'&eacute;mission des notifications pour cet h&ocirc;te ou service comme il 
  le ferait normalement. </p>

<p> <strong><u>Chevauchement d'arr&ecirc;ts planifi&eacute;s</u></strong></p>

<p> J'aime appeler ceci la loi de Murphy [<b>NdT </b>: &quot;Si quelque chose 
  ne doit pas fonctionner, il ne fonctionnera pas&quot;]. Vous voyez de quoi je 
  veux parler !! Vous arr&ecirc;tez un serveur pour r&eacute;aliser une mise &agrave; 
  jour mat&eacute;rielle "de routine", pour r&eacute;aliser plus tard que les 
  drivers du S.E. ne fonctionnent pas, que le contr&ocirc;leur RAID a fondu, ou 
  que l'image disque a rat&eacute; et rend vos disques originaux inutilisables. 
  La morale de l'histoire est qu'une intervention de routine sur un serveur est 
  susceptible de prendre trois ou quatre fois plus longtemps que ce que vous aviez 
  pr&eacute;vu... </p>

<p> Prenons le scenario suivant : </p>

<p>
<ol>
  <li>Vous planifiez un arr&ecirc;t de l'h&ocirc;te A de 19h30 &agrave; 21h30 
    le lundi
  <li>Vous arr&ecirc;tez le serveur vers 19h45 lundi soir pour une mise &agrave; 
    jour des disques durs 
  <li>Apr&egrave;s avoir perdu une heure et demie &agrave; vous battre avec des 
    erreurs SCSI et des incompatibilit&eacute;s de drivers, vous arrivez finalement 
    &agrave; booter la machine
  <li>A 21h15 vous vous apercevez qu'une de vos partitions a &eacute;t&eacute; 
    cach&eacute;e ou semble n'exister nulle part sur le disque
  <li>Sachant que la nuit va &ecirc;tre longue, vous retournez planifier un arr&ecirc;t 
    suppl&eacute;mentaire pour l'h&ocirc;te A de 21h20 lundi &agrave; 1h30 mardi 
    matin.
</ol>
<p></p>

<p> Si vous planifiez des p&eacute;riodes d'arr&ecirc;t qui se chevauchent pour 
  un h&ocirc;te ou un service (dans ce ca, les p&eacute;riodes &eacute;taient 
  19h30-21h30 et 21h20-1h30), Nagios attendra que la derni&egrave;re p&eacute;riode 
  d'arr&ecirc;t planifi&eacute; soit &eacute;coul&eacute;e avant d'autoriser l'&eacute;mission 
  des notifications pour cet h&ocirc;te ou ce service. Dans cet exemple, les notifications 
  seraient supprim&eacute;es pour l'h&ocirc;te A jusqu'&agrave; 1h30 mardi matin.</p>

<hr>

</body>
</html>
