
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//FR">

<html>
<head>
<title>Commandes externes</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Commandes externes</h2>
</div>
</p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Nagios peut traiter des commandes d'applications externes (y compris les
CGIs, voir <A href="cgis.html#cmd_cgi">CGI de commande</A> &agrave; titre d'exemple)
et modifier de nombreux aspects de ses fonctions de supervision suivant les
commandes qu'il re&ccedil;oit.
</p>

<p>
<strong><u>Autoriser les commandes externes</u></strong>
</p>

<p>
Par d&eacute;faut, Nagios ne contr&ocirc;le, ni ne traite les commandes externes. Si vous
voulez autoriser le traitement des commandes externes, il faut effectuer les
actions suivantes...
</p>

<p>
<ul>
<li>Activer le contr&ocirc;le des commandes externes &agrave; l'aide de l'option <a href="configmain.html#check_external_commands">check_external_commands</a>
<li>R&eacute;gler la fr&eacute;quence des contr&ocirc;les de commande &agrave; l'aide de l'option <a href="configmain.html#command_check_interval">command_check_interval</a>
<li>Pr&eacute;ciser l'emplacement du fichier de commandes &agrave; l'aide de l'option <a href="configmain.html#command_file">command_file</a> . Il vaut mieux mettre le fichier de commandes externes dans son propre r&eacute;pertoire (i.e. <i>/usr/local/nagios/var/rw</i>).
<li>configurer les bonnes autorisations pour le r&eacute;pertoire contenant
 les fichiers de commandes. Des d&eacute;tails sur la mani&egrave;re de faire cela
 se trouvent <a href="commandfile.html">ici</a>.
</ul>
</p>

<p>
<strong><u>Quand Nagios contr&ocirc;le-t-il les commandes externes ?</u></strong>
</p>

<p>
<ul>
<li>A intervalles r&eacute;guliers pr&eacute;cis&eacute;s par l'option <a href="configmain.html#command_check_interval">command_check_interval</a> du fichier de configuration principal.
<li>Imm&eacute;diatement apr&egrave;s que les <a href="eventhandlers.html">gestionnaires d'&eacute;v&eacute;nements</a> soient ex&eacute;cut&eacute;s.
Cela s'effectue en plus du cycle r&eacute;gulier des contr&ocirc;les de
commandes externes et sert &agrave; fournir une action imm&eacute;diate si un gestionnaire d'&eacute;v&eacute;nement
soumet des commandes &agrave; Nagios.
</ul>
</p>

<p>
<strong><u>L'utilisation des commandes externes</u></strong>
</p>

<p>
Les commandes externes peuvent &ecirc;tre utilis&eacute;es pour mener &agrave; bien un certain
nombre de choses pendant que Nagios fonctionne. A titre d'exemple, ce qui peut
&ecirc;tre effectu&eacute; comprend : la d&eacute;sactivation temporaire des notifications pour
les services et les h&ocirc;tes, la d&eacute;sactivation temporaire des tests de service,
l'obligation de contr&ocirc;ler imm&eacute;diatement un service, l'ajout de commentaires
aux h&ocirc;tes et services, etc.
</p>

<p>
<strong><u>Format des commandes</u></strong>
</p>

<p>
Les commandes externes &eacute;crites pour le <a href="configmain.html#command_file">fichier
  de commande</a> suivent le format suivant :
</p>

<p>
<font color="red">
<strong>
[<i>time</i>] <i>command_id</i>;<i>command_arguments</i>
</strong>
</font>
</p>

<p>
...o&ugrave; <i>time</i> est l'heure (au format <i>time_t</i>) &agrave; laquelle l'application externe ou le CGI a envoy&eacute; la commande externe au fichier de commande. Certaines des commandes disponibles sont d&eacute;crites dans le tableau ci-dessous, ainsi que leur <i>command_id</i> et une description de leurs <i>command_arguments</i>.
</p>

<p>
<strong><u>Commandes impl&eacute;ment&eacute;es</u></strong>
</p>

<p>
Un listing complet des commandes externes qui peuvent &ecirc;tre utilis&eacute;es (ainsi que des exemples d'utilisation) sont en ligne &agrave; l'adresse suivante:
</p>
<p>
<a href="http://www.nagios.org/developerinfo/externalcommands/" target="_blank">http://www.nagios.org/developerinfo/externalcommands/</a>
</p>


<hr>

</body>
</html>
