
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html><head><title>Installer Nagios</title>

<style type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->     
</style></head><body class="Default" bgcolor="#ffffff" text="black">

<p>
</p><div align="center">
<h2 class="PageTitle">Installer Nagios</h2>
</div>
<p></p>
<hr>

<p>
<strong><font color="red">Important:</font></strong>
Installer et configurer Nagios n&eacute;cessite de s'impliquer. Vous ne pouvez pas juste
compiler les binaires, ex&eacute;cuter le programme et vous asseoir. Il y a beaucoup de choses
&agrave; configurer avant de pouvoir superviser quoique ce soit. Relaxez vous, prenez votre temps
et lisez toute la documentation - vous allez en avoir besoin. Ok ? Alors commen&ccedil;ons...
</p>

<p>
<strong><u>Devenir Root</u></strong>
</p>

<p> Vous aurez besoin d'avoir les droits d'acc&egrave;s root pour installer Nagios comme d&eacute;crit dans la documentation,
vous allez cr&eacute;er des utilisateurs et des groupes, modifier la configuration du serveur web, etc.
Utiliser la commande <i>su</i> pour vous logger en tant que root &agrave; partir d'un autre compte.
</p>

<p>
<strong><u>Obtenir la Deni&egrave;re Version</u></strong>
</p>

<p>
Vous pouvez t&eacute;l&eacute;charger la derni&egrave;re version de Nagios sur <a href="http://www.nagios.org/download">http://www.nagios.org/download</a>.
</p>

<p>
<strong><u>Extraire la Distribution</u></strong>
</p>
<p>
Pour extraire la distribution Nagios, utiliser la commande suivante :
</p>
<p>
<strong>
<font color="red">
tar xzf nagios-<i>version</i>.tar.gz
</font>
</strong>
</p>
<p>
Lorsque la commande aura &eacute;t&eacute; ex&eacute;cut&eacute;e, vous trouverez un r&eacute;pertoire <b>nagios-<i>version</i></b>
 dans votre r&eacute;pertoire courant. A l'int&eacute;rieur de celui-ci, vous trouverez tous les fichiers qui
constituent le noyau de la distribution Nagios.
</p>


<p>
<strong><u>Cr&eacute;er l'Utilisateur et le Groupe Nagios</u></strong>
</p>

<p>
Vous allez probablement vouloir faire tourner Nagios sous un utilisateur
standard, donc cr&eacute;er un nouvel utiliser (et un groupe) avec la
commande suivante (cette derni&egrave;re peut varier suivant votre syst&egrave;me d'exploitation):
</p>
<p>
<strong>
<font color="red">
adduser nagios
</font>
</strong>
</p>

<p>
<strong><u>Cr&eacute;er le R&eacute;pertoire d'Installation</u></strong>
</p>

<p>
Cr&eacute;er le r&eacute;pertoire de base o&ugrave; vous souhaitez installer Nagios...
</p>
<p>
</p><p>
<strong>
<font color="red">
mkdir /usr/local/nagios
</font>
</strong>
</p>

<p>
Changer le propri&eacute;taire du r&eacute;pertoire d'installation par l'utilisateur Nagios et le groupe
cr&eacute;&eacute;s plut&ocirc;t comme suit :
</p>
<p>
<strong>
<font color="red">
chown nagios.nagios /usr/local/nagios
</font>
</strong>
</p>


<p>
<strong><u>Identifier l'Utilisateur Web</u></strong>
</p>
<p>
Vous allez probablement vouloir utiliser les <a href="http://www.manubulon.com/nagios/traduction/docs25en/extcommands.html">commandes externes</a>
(comme les acquittements et les planifications d'arr&ecirc;ts) &agrave; partir de l'interface web.
Pour cela, vous avez besoin d'identifier l'utilisateur Web (typiquement <i>apache</i>, cependant cela peut &ecirc;tre diff&eacute;rent
pour votre syst&egrave;me).
Cette information se trouve dans les fichiers de configuration du serveur Web.
La commande suivante permet de d&eacute;terminer rapidement quel est l'utilisateur Apache (les chemins peuvent diff&eacute;rer suivant votre
syst&egrave;me) :
</p>

<p>
<strong>
<font color="red">
grep "^User" /etc/httpd/conf/httpd.conf<br />
</font>
</strong>
</p>

<p>
<strong><u>Ajouter Un Groupe pour les Commandes</u></strong>
</p>
<p>
Maintenant vous allez cr&eacute;er un nouveau groupe dont les utilisateurs Web et Nagios feront partis.
Appellons ce nouveau groupe '<b>nagcmd</b>' (vous pouvez l'appeller diff&eacute;remment si vous le souhaitez).
Sur un Linux RedHat vous pouvez utiliser la commande suivante pour cr&eacute;er un groupe (ca peut &ecirc;tre diff&eacute;rent sur d'autres syst&egrave;mes):
</p>

<p>
<font color="red">/usr/sbin/groupadd nagcmd</font>
</p>

<p>
Ensuite, on ajoute au nouveau groupe cr&eacute;&eacute; les utilisateurs Web et Nagios avec les commandes suivantes (je suppose que <i>apache</i> et <i>nagios</i> sont les utilisateurs respectifs):
</p>

<p>
<font color="red">/usr/sbin/usermod -G nagcmd apache</font><br />
<font color="red">/usr/sbin/usermod -G nagcmd nagios</font><br />
</p>

<p>
<strong><u>Ex&eacute;cuter le Script Configure</u></strong>
</p>

<p>
Lancer le script configure comme suit pour initialiser les variables et cr&eacute;er un fichier Makefile...(les deux derni&egrave;res options : --with-command-<i>xxx</i> sont optionnelles mais n&eacute;cessaires si vous voulez utiliser les <a href="http://www.manubulon.com/nagios/traduction/docs25en/extcommands.html">commandes externes</a>).
</p>

<p>
<strong>
<font color="red">
./configure --prefix=<i>prefix</i> --with-cgiurl=<i>cgiurl</i> --with-htmurl=<i>htmurl</i> --with-nagios-user=<i>someuser</i> --with-nagios-group=<i>somegroup</i> --with-command-group=<i>cmdgroup</i>
</font>
</strong>
</p>

<p>
</p><ul>
<li>Remplacez <i>prefix</i> par le r&eacute;pertoire d'installation que vous avez cr&eacute;&eacute; plus haut (par d&eacute;fault <i>/usr/local/nagios</i>).
</li><li>Remplacer <i>cgiurl</i> par l'URL que vous utiliserez pour acc&eacute;der aux scripts <a href="http://www.manubulon.com/nagios/traduction/docs25en/cgis.html">CGIs</a> (par d&eacute;fault <i>/nagios/cgi-bin</i>).  N'ajoutez PAS de slash (/) &agrave; la fin de l'URL.
</li><li>Remplacer <i>htmurl</i> par l'URL que vous utiliserez pour acc&eacute;der l'interface principale de Nagios et la documentation (par d&eacute;faut <i>/nagios/</i>).
</li><li>Remplacer <i>someuser</i> par le nom de l'utilisateur qui poss&egrave;dera les fichiers install&eacute;s(par d&eacute;fault <i>nagios</i>).
</li><li>Remplacer <i>somegroup</i> par le nom du groupe qui poss&egrave;dera les fichiers install&eacute;s (par d&eacute;fault <i>nagios</i>).
</li><li>Remplacer <i>cmdgroup</i> par le nom du groupe qui fait tourner le serveur Web (par d&eacute;fault <i>nagios</i>).
</li></ul>

<p></p>

<p>
<strong><u>Compiler les Binaires</u></strong>
</p>

<p>
Compilez Nagios et les CGIs avec la commande suivante:
</p>
<p>
<strong>
<font color="red">
make all
</font>
</strong>
</p>


<p>
<a name="installing"></a>
<strong><u>Installer les Binaires et les Fichiers HTML</u></strong>
</p>

<p>
Installez les binaires et les fichiers HTML ( documentation et page web principale) avec la commande suivante :
</p>

<p>
<strong>
<font color="red">
    make install
</font>
</strong>
</p>

<p>
<strong><u>Installation du Script d'Initialisation</u></strong>
</p>

<p>
Si vous le souhaitez, vous pouvez aussi installer le script d'initialisation <i>/etc/rc.d/init.d/nagios</i> avec la commande suivante :
</p>

<p>
<strong>
<font color="red">
    make install-init
</font>
</strong>
</p>

<p>
Vous pourrez &ecirc;tre oblig&eacute; d'&eacute;diter ce script pour l'adapter &agrave; votre syst&egrave;me d'exploitation et &agrave; Nagios en modifiant des chemins,etc.
</p>


<p>
<a name="files"></a>
<strong><u>Strcuture des r&eacute;pertoires et emplacement des fichiers</u></strong>
</p>

<p>
Placez vous &agrave; la racine du r&eacute;pertoire de base de l'installation de Nagios, avec la commande suivante :
</p>

<p>
<strong>
<font color="red">
cd /usr/local/nagios
</font>
</strong>
</p>


<p>
Vous devriez voir 5 sous r&eacute;pertoires. Une br&egrave;ve description du contenu de chacun de ces r&eacute;pertoires est donn&eacute;e dans le tableau ci-dessous.
</p>

<p>
<table class="Default" border="1">
<tbody><tr>
<td bgcolor="#cbcbcb"><strong>Sous-R&eacute;pertoire</strong></td>
<td bgcolor="#cbcbcb"><strong>Contenus</strong></td>
</tr>
<tr>
<td><strong>bin/</strong></td>
<td>Ensemble des programmes Nagios</td>
</tr>
<tr>
<td><strong>etc/</strong></td>
<td>Les fichiers de configurations <a href="http://www.manubulon.com/nagios/traduction/docs25en/configmain.html">principaux</a>, des <a href="http://www.manubulon.com/nagios/traduction/docs25en/configmain.html#resource_file">ressources</a>, des <a href="http://www.manubulon.com/nagios/traduction/docs25en/configobject.html">objets</a>, et des <a href="http://www.manubulon.com/nagios/traduction/docs25en/configcgi.html">CGI</a> doivent &ecirc;tre mis ici</td>.
</tr>
<tr>
<td><strong>sbin/</strong></td>
<td><a href="http://www.manubulon.com/nagios/traduction/docs25en/cgis.html">CGIs</a></td>
</tr>
<tr>
<td><strong>share/</strong></td>
<td>Fichiers HTML (pour l'interface web et la documentation en ligne)</td>
</tr>
<tr>
<td><strong>var/</strong></td>
<td>R&eacute;pertoire vide pour les <a href="http://www.manubulon.com/nagios/traduction/docs25en/configmain.html#log_file">fichiers de log</a>, les <a href="http://www.manubulon.com/nagios/traduction/docs25en/configmain.html#status_file">fichiers de status</a>, les <a href="http://www.manubulon.com/nagios/traduction/docs25en/configmain.html#state_retention_file">les fichiers de retention</a>, etc.</td>
</tr>
<tr>
<td><strong>var/archives</strong></td>
<td>R&eacute;pertoire vide pour les <a href="http://www.manubulon.com/nagios/traduction/docs25en/configmain.html#log_archive_path">logs archiv&eacute;s</a></td>
</tr>
<tr>
<td><strong>var/rw</strong></td>
<td>R&eacute;pertoire vide pour le <a href="http://www.manubulon.com/nagios/traduction/docs25en/configmain.html#command_file">fichier de commandes externes</a></td>
</tr>
</tbody></table>
</p>

<p>
<strong><u>Installation des Plugins</u></strong>
</p>

<p>
Pour que Nagios vous soit utile, il va falloir t&eacute;l&eacute;charger et installer quelques <a href="http://www.manubulon.com/nagios/traduction/docs25en/plugins.html">plugins</a>. Les plugins sont habituellement install&eacute;s dans le r&eacute;pertoire <b>libexec/</b> de votre installation de Nagios (i.e. <i>/usr/local/nagios/libexec</i>).
Les plugins sont des scripts ou des binaires qui r&eacute;alisent les contr&ocirc;les des services et des h&ocirc;tes pour la supervision.
Vous pouvez r&eacute;cup&eacute;rer la derni&egrave;re version des plugins sur <a href="http://www.nagios.org/download">la page de t&eacute;l&eacute;chargement de Nagios</a> ou directement sur la <a href="http://sourceforge.net/projects/nagiosplug/">la page SourceForge du projet</a>.
</p>

<p>
<strong><u>Configurer l'Interface Web</u></strong>
</p>

<p>
Vous allez probablement vouloir utiliser l'interface web, vous devrez donc lire les instructions pour <a href="http://www.manubulon.com/nagios/traduction/docs25en/installweb.html">configurer l'interface Web</a> , les acc&egrave;s, etc. Puis...
</p>

<p>
<strong><u>Configuration de Nagios</u></strong>
</p>

<p>
Maintenant, tout est compil&eacute; et install&eacute;, mais vous n'avez toujours pas configur&eacute; Nagios, ni d&eacute;fini les objets (h&ocirc;tes, services, etc..) qui doivent &ecirc;tre supervis&eacute;s.
Des informations sur la configuration de Nagios et la d&eacute;finition des objets peuvent &ecirc;tre trouv&eacute;es <a href="http://www.manubulon.com/nagios/traduction/docs25en/config.html">ici</a>. Il y a beaucoup de choses &agrave; configurer mais ne vous laissez pas d&eacute;courager - ca vaut le coup.
</p>

<hr>


</body></html>