
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Contr&ocirc;les passifs d'h&ocirc;tes et de services</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Contr&ocirc;les passifs d'h&ocirc;tes et de services</h2>

</div>
</p>

<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Une des fonctionnalit&eacute;s de Nagios est de traiter le r&eacute;sultat de contr&ocirc;les de service soumis par des applications tierces. Les contr&ocirc;les d'h&ocirc;tes et de service r&eacute;alis&eacute;s par des applications tierces et trait&eacute;s par Nagios sont appel&eacute;s contr&ocirc;les <i>passifs</i>. Ces contr&ocirc;les sont dits passifs par opposition aux contr&ocirc;les <i>actifs</i>, qui sont des contr&ocirc;les d'hotes ou de services r&eacute;alis&eacute;s &agrave; l'initiative de Nagios.
</p>

<p>
<strong><u>Des contr&ocirc;les passifs pour quoi faire?</u></strong>
</p>

<p>
Les contr&ocirc;les passifs sont utiles pour superviser des services qui sont :
</p>

<p>
<ul>
<li>situ&eacute;s derri&egrave;re un firewall, et ne peuvent donc pas &ecirc;tre contr&ocirc;l&eacute;s depuis l'h&ocirc;te supportant Nagios
<li>asynchrones par nature et ne peuvent donc pas &ecirc;tre contr&ocirc;l&eacute;s activement de mani&egrave;re fiable (p.ex. les traps SNMP, les alertes de s&eacute;curit&eacute;, etc.)
</ul>
</p>

<p>
Les contr&ocirc;les passifs d'h&ocirc;tes et de services sont &eacute;galement utiles dans le cadre d'une <a href="distributed.html">supervision r&eacute;partie</a>.
</p>

<p>
<strong><u>Contr&ocirc;les passifs de service contre contr&ocirc;les passifs d'h&ocirc;te</u></strong>
</p>

<p>
Les contr&ocirc;les passifs d'h&ocirc;te et de service fonctionnent de mani&egrave;re similaire, mais avec d'importantes limitations pour les contr&ocirc;les passifs d'h&ocirc;te. Voyez <a href="#hostchecks">ci-dessous</a> pour plus d'informations sur ces limitations.

</p>

<p>
<strong><u>Comment les contr&ocirc;les passifs de service fonctionnent-ils ?</u></strong>
</p>

<p>
La seule r&eacute;elle diff&eacute;rence entre les contr&ocirc;les actifs et passifs est que les contr&ocirc;les actifs sont initi&eacute;s par Nagios, alors que les contr&ocirc;les passifs sont r&eacute;alis&eacute;s par des applications tierces. Une fois qu'une application tierce a r&eacute;alis&eacute; un contr&ocirc;le de service (que ce soit activement ou en ayant re&ccedil;u un &eacute;v&eacute;nement asynchrone comme un trap SNMP ou une alerte de s&eacute;curit&eacute;), elle envoie le r&eacute;sultat du "contr&ocirc;le" de service &agrave; Nagios &agrave; travers le <a href="configmain.html#command_file">fichier de commande externe</a>.
</p>

<p>
Lorsque Nagios traite le contenu du fichier de commande externe, il place les r&eacute;sultats de tous les contr&ocirc;les passifs de service dans une file d'attente pour un traitement ult&eacute;rieur. C'est la m&ecirc;me file qui est utilis&eacute;e pour stocker les r&eacute;sultats des contr&ocirc;les actifs et passifs.
</p>

<p>
Nagios ex&eacute;cute r&eacute;guli&egrave;rement un <a href="configmain.html#service_reaper_frequency">&eacute;v&eacute;nement de consolidation des services</a> et lit le contenu de la file de r&eacute;sultat des contr&ocirc;les. Chaque r&eacute;sultat de contr&ocirc;le de service, qu'il soit actif ou passif, est trait&eacute; de la m&ecirc;me fa&ccedil;on. L'algorithme de contr&ocirc;le de service est exactement le m&ecirc;me pour les deux types de contr&ocirc;les. Ceci permet d'appliquer une seule m&eacute;thode pour la gestion des r&eacute;sultats de contr&ocirc;les actifs et passifs.
</p>

<p>
<strong><u>Comment les applications tierces soumettent-elles le r&eacute;sultat des contr&ocirc;les de service ?</u></strong>
</p>

<p>
Les applications tierces peuvent soumettre les r&eacute;sultats de contr&ocirc;les de service &agrave; Nagios en &eacute;crivant une <a href="extcommands.html">commande externe</a> PROCESS_SERVICE_CHECK_RESULT dans le <a href="configmain.html#command_file">fichier de commandes externes</a>.
</p>

<p>
Le format de la commande est le suivant :
</p>

<p>
<font color="red"><strong>[&lt;timestamp&gt;] PROCESS_SERVICE_CHECK_RESULT;&lt;host_name&gt;;&lt;description&gt;;&lt;return_code&gt;;&lt;plugin_output&gt;</strong></font>

</p>

<p>
o&ugrave;...
</p>

<p>
<ul>
<li><i>timestamp</i> est le moment au format time_t (secondes &eacute;coul&eacute;e depuis l'&eacute;poque UNIX) auquel le contr&ocirc;le du service a &eacute;t&eacute; r&eacute;alis&eacute; (ou envoy&eacute;). Veuillez noter l'espace n&eacute;cessaire apr&egrave;s le crochet fermant.
<li><i>host_name</i> est le nom court de l'h&ocirc;te associ&eacute; au service dans la d&eacute;finition du service
<li><i>description</i> est la description du service telle que sp&eacute;cifi&eacute;e dans la d&eacute;finition du service
<li><i>return_code</i> est le code renvoy&eacute; par le contr&ocirc;le (0=OK, 1=WARNING, 2=CRITICAL, 3=UNKNOWN)
<li><i>plugin_output</i> est le texte affich&eacute; par le contr&ocirc;le (c.-&agrave;-d. l'affichage de sortie du plugin)
</ul>
</p>

<p>
Notez que pour soumettre des contr&ocirc;les de service &agrave; Nagios, un service doit avoir &eacute;t&eacute; d&eacute;fini pr&eacute;alablement dans le <a href="configobject.html">fichier de configuration des objets</a> ! Nagios ignorera tous les r&eacute;sultats de contr&ocirc;les de service si ceux-ci n'ont pas &eacute;t&eacute; configur&eacute;s avant son dernier (re)d&eacute;marrage.
</p>

<p>
Si vous voulez que seuls des r&eacute;sultats passifs soient fournis pour un service particulier (c.-&agrave;-d. que les contr&ocirc;les actifs ne doivent pas avoir lieu), mettez simplement le param&eacute;tre <i>active_check_enabled</i> de la d&eacute;finition du service &agrave; 0. Ceci emp&ecirc;chera d&eacute;finitivement Nagios de r&eacute;aliser un contr&ocirc;le du service. Assurez vous &eacute;galement que le param&egrave;tre <i>passive_check_enabled</i> de la d&eacute;finition du service est &agrave; 1, sinon Nagios ne traitera jamais les contr&ocirc;les passifs pour ce service !
</p>

<p>
Vous pouvez trouver un exemple de script Shell sur la fa&ccedil;on de soumettre des r&eacute;sultats de contr&ocirc;les passifs de services &agrave; Nagios dans la documentation sur les <a href="volatileservices.html">services volatils</a>.
</p>

<p>
<strong><u>Soumission de r&eacute;sultats de contr&ocirc;les passifs de service depuis des h&ocirc;tes distants</u></strong>
</p>

<p>
Si l'application qui soumet les r&eacute;sultats de contr&ocirc;les passifs se trouve sur le m&ecirc;me h&ocirc;te que Nagios, elle peut directement &eacute;crire ces r&eacute;sultats dans le fichier de commandes externes comme d&eacute;crit ci-dessus. Mais les applications se trouvant sur des h&ocirc;tes distants ne peuvent pas le faire aussi simplement. Pour que des h&ocirc;tes distants puissent envoyer des r&eacute;sultats de contr&ocirc;les passifs &agrave; l'h&ocirc;te sur lequel tourne Nagios, j'ai d&eacute;velopp&eacute; l'addon <a href="addons.html#nsca">nsca</a>. Cet addon consiste en un d&eacute;mon qui tourne sur l'h&ocirc;te de Nagios et un client ex&eacute;cut&eacute; sur les h&ocirc;tes distants. Le d&eacute;mon attend les connexions des clients distants, valide sommairement les r&eacute;sultats soumis, et les &eacute;crit directement dans le fichier de commandes externe (de la mani&egrave;re d&eacute;crite ci-dessus). Vous trouverez plus d'information sur l'addon nsca <a href="addons.html#nsca">ici</a>...
</p>

<p>
<strong><u>Utilisation commune de contr&ocirc;les actifs et passifs de service</u></strong>
</p>

<p>
A moins que vous n'impl&eacute;mentiez un environnement de <a href="distributed.html">supervision r&eacute;partie</a> avec un serveur central n'acceptant que les contr&ocirc;les passifs (et ne r&eacute;alisant aucun contr&ocirc;le actif), vous utiliserez probablement les deux types de contr&ocirc;les. Comme je l'ai d&eacute;j&agrave; dit, les contr&ocirc;les actifs sont plus adapt&eacute;s aux services qui se pr&ecirc;tent au contr&ocirc;le r&eacute;gulier (disponibilit&eacute; d'un serveur FTP ou web, etc.), alors que les contr&ocirc;les passifs conviennent mieux pour g&eacute;rer des &eacute;v&eacute;nement asynchrones survenant &agrave; des fr&eacute;quences variables (alertes de s&eacute;curit&eacute;, etc.).
</p>

<p>
L'image ci-dessous donne une repr&eacute;sentation visuelle de la fa&ccedil;on dont les contr&ocirc;les actifs et passifs de service peuvent tous deux &ecirc;tre employ&eacute;s pour superviser les ressources du r&eacute;seau (cliquez sur l'image pour la voir en grand format).
</p>

<p>
Les patato&iuml;des oranges &agrave; droite de l'image sont des applications tierces qui soumettent des r&eacute;sultats de contr&ocirc;les passifs dans le fichier de commandes externes de Nagios. Une des applications se trouve sur le m&ecirc;me h&ocirc;te que Nagios, ce qui fait qu'elle peut &eacute;crire directement dans ce fichier. L'autre application se trouve sur un h&ocirc;te distant et se sert du client et du d&eacute;mon nsca pour transf&eacute;rer les r&eacute;sultats de contr&ocirc;les passifs &agrave; Nagios.
</p>

<p>
Les &eacute;l&eacute;ments &agrave; gauche de l'image repr&eacute;sentent des contr&ocirc;les actifs de services que Nagios r&eacute;alise. J'ai montr&eacute; comment les contr&ocirc;les peuvent &ecirc;tre r&eacute;alis&eacute;s pour des ressources locales (utilisation du disque, etc.), pour des ressources "publiques" sur des h&ocirc;tes distants (serveur web, serveur FTP, etc.), et pour des ressources "priv&eacute;es" sur des h&ocirc;tes distants (utilisation du disque de l'h&ocirc;te distant, charge du processeur, etc.). Dans cet exemple, les ressources priv&eacute;es des h&ocirc;tes distants sont en fait contr&ocirc;l&eacute;es gr&acirc;ce &agrave; l'addon <a href="addons.html#nrpe">nrpe</a>, qui facilite l'ex&eacute;cution de plugins sur les h&ocirc;tes distants.
</p>

<p>
<a href="images/activepassive.png"><img src="images/activepassive.png" border=1 width=200 height=250></a>
</p>

<a name="hostchecks"></a>

<p>
<strong><u>Comment les contr&ocirc;les passifs d'h&ocirc;tes fonctionnent-ils ?</u></strong>
</p>

<p>
Les contr&ocirc;les passifs d'h&ocirc;te fonctionnent de la m&ecirc;me mani&egrave;re que les contr&ocirc;les passifs de service. Quand une application tierce a r&eacute;alis&eacute; un contr&ocirc;le d'h&ocirc;te, elle envoie les r&eacute;sultats de ce "contr&ocirc;le" d'h&ocirc;te &agrave; Nagios via le <a href="configmain.html#command_file">fichier de commandes externes</a>. Quand Nagios lira le contenu du fichier de commandes externes, il traitera le r&eacute;sultat de contr&ocirc;le d'h&ocirc;te qui a &eacute;t&eacute; envoy&eacute;.
</p>

<p>
<strong>ATTENTION !</strong> Les contr&ocirc;les d'h&ocirc;tes passifs ont des limitations. A la diff&eacute;rence des contr&ocirc;les d'h&ocirc;tes actifs, Nagios ne tente pas de d&eacute;terminer si l'h&ocirc;te est dans l'&eacute;tat DOWN ou UNREACHABLE lors d'un contr&ocirc;le passif. Nagios prend plut&ocirc;t le r&eacute;sultat du contr&ocirc;le passif comme &eacute;tant l'&eacute;tat r&eacute;el de l'h&ocirc;te, sans essayer de d&eacute;terminer cet &eacute;tat r&eacute;el. Au contraire, dans le cas de contr&ocirc;le d'h&ocirc;te actif (initi&eacute; par Nagios), Nagios tente de d&eacute;terminer l'&eacute;tat correct (DOWN ou UNREACHABLE) des h&ocirc;tes qui ne sont pas dans l'&eacute;tat UP. Cela peut poser des probl&egrave;mes si vous envoyez des contr&ocirc;les passifs depuis un h&ocirc;te distant ou si vous avez une <a href="distributed.html">supervision r&eacute;partie</a> o&ugrave; les relations entre les h&ocirc;tes parent/enfant sont diff&eacute;rentes.  Voyez la documentation sur <a href="networkreachability.html">l'accessibilit&eacute; des h&ocirc;tes</a> pour de plus amples informations sur la fa&ccedil;on dont sont d&eacute;termin&eacute;s les &eacute;tats DOWN et UNREACHABLE lors de contr&ocirc;les actifs d'h&ocirc;te.
</p>

<p>
<strong><u>Comment les applications tierces soumettent-elles le r&eacute;sultat des contr&ocirc;les d'h&ocirc;te ?</u></strong>
</p>

<p>
Les applications tierces peuvent envoyer des r&eacute;sultats de contr&ocirc;les d'h&ocirc;te &agrave; Nagios en &eacute;crivant une <a href="extcommands.html">commande externe</a> PROCESS_HOST_CHECK_RESULT dans le <a href="configmain.html#command_file">fichier des commandes externes</a>.  
</p>

<p>

Le format de la commande est le suivant :
</p>

<p>
<font color="red"><strong>[&lt;timestamp&gt;]&nbsp;PROCESS_HOST_CHECK_RESULT;&lt;host_name&gt;;&lt;host_status&gt;;&lt;plugin_output&gt;</strong></font>
</p>

<p>

o&ugrave;...
</p>

<p>
<ul>
<li><i>timestamp</i> est le moment au format time_t (secondes &eacute;coul&eacute;e depuis l'&eacute;poque UNIX) auquel le contr&ocirc;le de l'h&ocirc;te a &eacute;t&eacute; r&eacute;alis&eacute; (ou envoy&eacute;). Veuillez noter l'espace n&eacute;cessaire apr&egrave;s le crochet fermant.
<li><i>host_name</i> est le nom court de l'h&ocirc;te (tel qu'il est sp&eacute;cifi&eacute; dans la d&eacute;finition de l'h&ocirc;te)
<li><i>host_status</i> est l'&eacute;tat de l'h&ocirc;te (0=UP, 1=DOWN, 2=UNREACHABLE)
<li><i>plugin_output</i> est le texte affich&eacute; par le contr&ocirc;le d'h&ocirc;te
</ul>
</p>

<p>
Notez que pour envoyer un contr&ocirc;le d'h&ocirc;te &agrave; Nagios, l'h&ocirc;te correspondant doit &ecirc;tre d&eacute;fini dans le <a href="configobject.html">fichier de configuration des objets</a> ! Nagios ignorera tous les r&eacute;sultats de contr&ocirc;les d'h&ocirc;te si ceux-ci n'ont pas &eacute;t&eacute; configur&eacute;s avant son dernier (re)d&eacute;marrage.
</p>

<p>
<strong><u>Soumission de r&eacute;sultats de contr&ocirc;les passifs d'h&ocirc;te depuis des h&ocirc;tes distants</u></strong>
</p>

<p>
Si l'application qui soumet les r&eacute;sultats de contr&ocirc;les passifs se trouve sur le m&ecirc;me h&ocirc;te que Nagios, elle peut directement &eacute;crire ces r&eacute;sultats dans le fichier de commandes externes comme d&eacute;crit ci-dessus. Mais les applications se trouvant sur des h&ocirc;tes distants ne peuvent pas le faire aussi simplement. Pour que des h&ocirc;tes distants puissent envoyer des r&eacute;sultats de contr&ocirc;les passifs &agrave; l'h&ocirc;te sur lequel tourne Nagios, vous pouvez utiliser l'addon <a href="addons.html#nsca">nsca</a>. Cet addon consiste en un d&eacute;mon qui tourne sur l'h&ocirc;te de Nagios et un client ex&eacute;cut&eacute; sur les h&ocirc;tes distants. Le d&eacute;mon attend les connexions des clients distants, valide sommairement les r&eacute;sultats soumis, et les &eacute;crit directement dans le fichier de commandes externe (de la mani&egrave;re d&eacute;crite ci-dessus). Vous trouverez plus d'information sur le addon nsca <a href="addons.html#nsca">ici</a>...
</p>


<hr>

</body>
</html>
