<html><head><title>Securis&eacute; Nagios</title>



<style type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</style></head><body class="Default" bgcolor="#ffffff" text="black">

<p>
</p><div align="center">
<h2 class="PageTitle">Securis&eacute; Nagios</h2>
</div>
<p></p>

<hr>


<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Ce paragraphe est un rapide survol des &eacute;l&eacute;ments que vous devez conserver &agrave; l'esprit au moment d'installer Nagios, afin que l'installation soit s&eacute;curis&eacute;e.
Ce document est nouveau et si quelqu'un a des  &eacute;l&eacute;ments &agrave; y ajouter, qu'il m'envoie un courrier &agrave; l'adresse <a href="mailto:nagios@nagios.org">nagios@nagios.org</a> [NdT : mail &agrave; envoyer en anglais].
</p>

<p>
<font color="red"><strong><u>Ne pas lancer Nagios en tant que Root!</u></strong></font>
</p>

<p>
Il n'est pas n&eacute;cessaire d'&ecirc;tre root pour faire lancer Nagios.
M&ecirc;me si vous lancez Nagios au d&eacute;marrage &agrave; l'aide d'un init script, vous pouvez l'obliger &agrave; abandonner des privil&egrave;ges apr&egrave;s le lancement et &agrave; fonctionner avec les droits d'un autre utilisateur/groupe en utilisant les directives <a href="configmain.html#nagios_user">nagios_user</a> et <a href="configmain.html#nagios_group">nagios_group</a> dans le fichier principal de configuration.
</p>

<p>
Si vous avez besoin d'ex&eacute;cuter le gestionnaire d'&eacute;v&egrave;nements ou des plugins en tant que root, essayez d'utiliser <a href="http://www.courtesan.com/sudo/sudo.html">sudo</a>.
</p>

<p>
<font color="red"><strong><u>Autoriser les commandes externes seulement si c'est n&eacute;cessaire</u></strong></font>
</p>

<p>
Par d&eacute;faut, les <a href="extcommands.html">commandes externes</a> sont d&eacute;sactiv&eacute;es.
Cela a pour but d'emp&ecirc;cher un administrateur de lancer Nagios et de laisser involontairement l'interface de commande ouverte &agrave; la disposition "d'autres"... 
Si vous pensez avoir besoin des gestionnaires d'&eacute;v&eacute;nements ou d'ex&eacute;cuter des commandes &agrave; partir de l'interface web, il faudra autoriser l'usage des <a href="extcommands.html">commandes externes</a>.
Si vous pensez n'&ecirc;tre dans aucun des cas pr&eacute;c&eacute;dents, je vous conseille de d&eacute;sactiver les commandes externes.
</p>

<p>
<font color="red"><strong><u>Donner les autorisations adapt&eacute;es au fichier des commandes externes</u></strong></font>
</p>

<p>
Si vous permettez l'utilisation des <a href="extcommands.html">commandes externes</a>, assurez-vous que le r&eacute;pertoire <i>/usr/local/nagios/var/rw</i> dispose des permissions ad&eacute;quates. Vous souhaitez que seulement l'utilisateur Nagios (habituellement <i>nagios</i>) et l'utilisateur du serveur web(habituellement <i>nobody</i>) aient l'autorisation d'&eacute;crire dans le fichier de commandes. Si vous avez installer Nagios sur une machine d&eacute;di&eacute;e et qu'elle n'a pas de comptes d'utilisateurs, cela doit &ecirc;tre suffisant.
</p>

<p>
Si vous avez install&eacute; Nagios sur une machine multi-utilisateur publique, permettre l'acc&egrave;s au fichier de commande via le serveur web peut causer des probl&egrave;mes de s&eacute;curit&eacute;.
Apr&egrave;s tout, je ne pense pas que vous souhaitiez permettre &agrave; tout le monde de contr&ocirc;ler nagios.
ans ce cas, je vous recommande de n'accorder l'acc&egrave;s au fichier de commande qu'&agrave; l'utilisateur nagios et d'utiliser quelque chose comme <a href="http://cgiwrap.unixtools.org/">CGIWrap</a> pour ex&eacute;cuter les CGIs comme l'utilisateur <i>nagios</i> plut&ocirc;t que l'utilisateur <i>nobody</i>.
</p>

<p>
Les instructions pour configurer les autorisations &agrave; donner au fichier de commandes externes se trouvent <a href="commandfile.html">ici</a>.
</p>

<p>
<font color="red"><strong><u>Authentification requise pour les CGIs</u></strong></font>
</p>

<p>
Je vous recommande fortement de prot&eacute;ger l'acc&egrave;s aux CGI par une authentification. 
Ceci fait, lisez la documentation sur les droits par d&eacute;faut dont disposent les contacts autoris&eacute;s et n'accordez qu'exceptionnellement une autorisation &agrave; des contacts sp&eacute;cifiques.
Les instructions pour la configuration des droits se trouvent <a href="cgiauth.html">ici</a>.
Si vous d&eacute;sactivez l'authentification pr&eacute;alable &agrave; l'acc&egrave;s aux CGI par la commande <a href="configcgi.html#use_authentication">use_authentication</a> dans le fichier de configuration des CGI, le <a href="cgis.html#cmd_cgi">CGI de commande</a> refusera d'&eacute;crire la moindre commande dans le fichier des <a href="configmain.html#command_file">commandes externes</a>. De toutes fa&ccedil;ons, vous ne souhaitez pas que tout le monde puisse contr&ocirc;ler v&ocirc;tre Nagios ? 
</p>


<p>
<font color="red"><strong><u>Utiliser les chemins complets dans la d&eacute;finition des commandes</u></strong></font>
</p>

<p>
Lorsque vous d&eacute;finissez des commandes, assurez-vous d'avoir bien pr&eacute;cis&eacute; le <i>chemin d'acc&egrave;s complet</i> de tous les scripts ou binaires que vous ex&eacute;cutez.
</p>

<p>
<font color="red"><strong><u>Cacher les informations sensibles &agrave; l'aide des macros $USERn$</u></strong></font>
</p>

<p>
Les CGI parcourent le fichier de <a href="configmain.html">configuration principal</a> et le(s) fichier(s) de <a href="http://www.manubulon.com/nagios/traduction/docs25en/configobject.html">configuration des objets</a>, n'y laissez donc pas d'informations sensibles (noms d'utilisateur, mots de passe, etc...). Si vous avez besoin de pr&eacute;ciser un mot de passe ou un nom d'utilisateur dans une d&eacute;finition de commande, utilisez une <a href="macros.html">macro</a> $USERn$ pour le cacher. Les macros $USERn$ sont d&eacute;finies dans un ou plusieurs fichiers de <a href="configmain.html#resource_file">ressources</a>. Les CGIs ne parcourant pas les fichiers de ressources, vous pouvez leur donner des permissions beaucoup plus restrictives (600 ou 660). Consultez le fichier <i>resource.cfg</i> dans la distribution de base de Nagios, il vous donnera un exemple de d?finition de la macro $USERn$.
</p>

<p>
<font color="red"><strong><u>Eliminer les caract&egrave;res dangereux des macros</u></strong></font>
</p>

<p>
Utilisez la directive <a href="configmain.html#illegal_macro_output_chars">illegal_macro_output_chars</i> pour filtrer les caract&egrave;res dangereux des cha&icirc;nes issues des macros $OUTPUT$ et $PERFDATA$ avant qu'elles ne soient utilis&eacute;es pour des notifications, etc. Des caract&egrave;res dangereux peuvent &ecirc;tre tout caract&egrave;re qui peut &ecirc;tre interpr&eacute;t&eacute; par un shell, ouvrant ainsi un trou de s&eacute;curit&eacute;. Un bon exemple est la pr&eacute;sence de la quote inverse (`) dans $OUTPUT$ et/ou $PERFDATA$, qui pourrait permettre &agrave; un attaquant d'ex&eacute;cuter un commande arbitraire comme l'utilisateur nagios (une autre bonne raison pour ne pas ex&eacute;cuter Nagios comme l'utilisateur root).
</p>

<hr>


</body></html>