<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
<title>Trucs et astuces "gain de temps" dans les d&eacute;finitions de mod&egrave;les d'objets</title>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</head>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Trucs et astuces "gain de temps" dans les d&eacute;finitions de mod&egrave;les d'objets</h2>

ou...<br />
<b>"Comment ne pas p&ecirc;ter les plombs"</b>
</div>
</p>
<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Cette documentation va essayer de vous expliquer comment vous pouvez exploiter les fonctionnalit&eacute;s (quelque peu) cach&eacute;es des <a href="xodtemplate.html">d&eacute;finitions d'objets bas&eacute;es sur des mod&egrave;les</a>, ne serait-ce que pour "ne pas p&ecirc;ter les plombs". Comment, me demanderez vous ? Plusieurs types d'objets permettent de sp&eacute;cifier de multiples noms d'h&ocirc;tes et/ou de groupes d'h&ocirc;tes dans les d&eacute;finitions, vous permettant de "copier" la d&eacute;fintion de l'objet dans de multiples h&ocirc;tes ou services. Je vais parcourir s&eacute;parement chaque type d'objet permettant cette fonctionnalit&eacute;. Pour commencer, les types d'objets concern&eacute;s sont les suivants :
</p>

<p>
<ul>
<li><a href="#service">Services</a>
<li><a href="#serviceescalation">Escalades de service</a>
<li><a href="#servicedependency">D&eacute;pendances de services</a>
<li><a href="#hostescalation">Escalades d'h&ocirc;te</a>
<li><a href="#hostdependency">D&eacute;pendances d'h&ocirc;tes</a>
<li><a href="#hostgroup">Groupes d'h&ocirc;tes</a>
</ul>

</p>

<p>
Les types d'objets qui ne sont pas list&eacute;s ci-dessus (c.-&agrave;-d. les p&eacute;riodes, les commandes) ne supportent pas les fonctionnalit&eacute;s que je vais vous d&eacute;crire maintenant.
</p>

<p>
<strong><u>Correspondance avec des expressions r&eacute;guli&egrave;res</u></strong>
</p>

<p>
Les exemples que je donne ci-dessous utilisent une correspondance "standard" avec les noms des objets. Si vous le souhaitez, vous pouvez activer la correspondance des noms d'objets avec des expressions r&eacute;guli&egrave;res gr&acirc;ce au param&eacute;tre de configuration <a href="configmain.html#use_regexp_matching">use_regexp_matching</a>. Par d&eacute;faut, les expressions r&eacute;guli&egrave;res ne sont utilis&eacute;es que dans les noms d'objets contenant les caract&egrave;res de remplacement <b>*</b> et <b>?</b>. Si vous souhaitez voir les expressions r&eacute;guli&egrave;res appliqu&eacute;es sur tous les noms d'objets (sans tenir compte du fait qu'ils contiennent ou non les caract&egrave;res de remplacement * et ?), activez le param&eacute;tre de configuration <a href="configmain.html#use_true_regexp_matching">use_true_regexp_matching</a>.

</p>

<p>
Les expressions r&eacute;guli&egrave;res peuvent &ecirc;tre utilis&eacute;es dans n'importe quel champ des exemples ci-dessous (noms d'h&ocirc;tes, noms de groupe d'h&ocirc;tes, noms de service, et noms de groupes de service).
</p>

<p>
<strong>NOTE :</strong> Attention lorsque vous activez les expressions r&eacute;guli&egrave;res - vous aurez peut-&ecirc;tre &agrave; modifier votre fichier de configuration, pour &eacute;viter que des param&eacute;tres que vous ne souhaitez pas voir interpr&eacute;t&eacute;s comme des expressions r&eacute;guli&egrave;res ne le soient ! Les probl&egrave;mes devraient &ecirc;tre mis en &eacute;vidence lorsque vous v&eacute;rifiez votre configuration.
</p>

<a name="service"></a>
<p>
<strong><u>D&eacute;finitions de service</u></strong>

</p>

<p>
<b>H&ocirc;tes multiples :</b> Si vous d&eacute;sirez cr&eacute;er des <a href="xodtemplate.html#service">services</a> identiques, assign&eacute;s &agrave; plusieurs h&ocirc;tes, vous pouvez sp&eacute;cifier des h&ocirc;tes multiples dans la directive <i>host_name</i> comme suit:
</p>

<p>
<pre>
	define <i>service</i>{
		<font color="red">host_name		<i>HOST1,HOST2,HOST3,...,HOSTN</i></font>

		<font color="red">service_description	<i>SOMESERVICE</i></font>
		<i>other service directives</i> ...
		}
</pre>
</p>

<p>
La d&eacute;finition ci-dessus va cr&eacute;er un service appell&eacute; <i>SOMESERVICE</i> sur les h&ocirc;tes <i>HOST1</i> &agrave; <i>HOSTN</i>. Toutes les instances du service <i>SOMESERVICE</i> seront identiques (c.-&agrave;-d. auront la m&ecirc;me commande de contr&ocirc;le, le m&ecirc;me nombre maximum d'essais, la m&ecirc;me p&eacute;riode de notification, etc.).
</p>

<p>
<b>Tous les h&ocirc;tes situ&eacute;s dans de multiples groupes d'h&ocirc;tes :</b> Si vous voulez cr&eacute;er des services identiques, assign&eacute;s &agrave; tous les h&ocirc;tes d'un ou de plusieurs groupes d'h&ocirc;tes, vous pouvez le faire en une seule d&eacute;finition de service. Comment ? Le param&eacute;tre <i>hostgroup_name</i> vous permet de sp&eacute;cifier un ou plusieurs groupes d'h&ocirc;tes pour lesquels le service doit &ecirc;tre cr&eacute;&eacute; :
</p>

<p>
<pre>
	define <i>service</i>{
		<font color="red">hostgroup_name		<i>HOSTGROUP1,HOSTGROUP2,...,HOSTGROUPN</i></font>

		<font color="red">service_description	<i>SOMESERVICE</i></font>
		<i>other service directives</i> ...
		}
</pre>
</p>

<p>
La d&eacute;finition ci-dessus va cr&eacute;er un service appell&eacute; <i>SOMESERVICE</i> sur tous les h&ocirc;tes membre des groupes d'h&ocirc;tes <i>HOSTGROUP1</i> &agrave; <i>HOSTGROUPN</i>. Toutes les instance du service <i>SOMESERVICE</i> seront identiques (c.-&agrave;-d. auront la m&ecirc;me commande de contr&ocirc;le, le m&ecirc;me nombre maximum d'essais, la m&ecirc;me p&eacute;riode de notification, etc.).
</p>

<p>
<b>Tous les h&ocirc;tes :</b> Si vous voulez cr&eacute;er des services identiques, assign&eacute;s &agrave; tous les h&ocirc;tes de vos fichiers de configurations, vous pouvez utiliser un caract&egrave;re de remplacement dans le param&eacute;tre <i>host_name</i> comme suit:</p>
<p>
<pre>
	define <i>service</i>{
		<font color="red">host_name		<i>*</i></font>

		<font color="red">service_description	<i>SOMESERVICE</i></font>
		<i>other service directives</i> ...
		}
</pre>
</p>

<p>
La d&eacute;finition ci-dessus va cr&eacute;er un service appell&eacute; <i>SOMESERVICE</i> sur <b>tous les h&ocirc;tes</b> d&eacute;finis dans vos fichiers de configurations. Toutes les instance du service <i>SOMESERVICE</i> seront identiques (c.-&agrave;-d. auront la m&ecirc;me commande de contr&ocirc;le, le m&ecirc;me nombre maximum d'essais, la m&ecirc;me p&eacute;riode de notification, etc.).
</p>

<a name="serviceescalation"></a>
<p>
<strong><u>D&eacute;finitions d'escalade de service</u></strong>
</p>

<p>
<b>H&ocirc;tes multiples :</b> Si vous d&eacute;sirez cr&eacute;er des <a href="xodtemplate.html#serviceescalation">escalades de service</a> pour des services portant le m&ecirc;me nom/description, et qui sont assign&eacute;s &agrave; plusieurs h&ocirc;tes, vous pouvez sp&eacute;cifier des h&ocirc;tes multiples dans le param&eacute;tre <i>host_name</i> comme suit:
</p>

<p>
<pre>
	define <i>serviceescalation</i>{
		<font color="red">host_name		<i>HOST1,HOST2,HOST3,...,HOSTN</i></font>
		<font color="red">service_description	<i>SOMESERVICE</i></font>
		<i>other escalation directives</i> ...
		}

</pre>
</p>

<p>
La d&eacute;finition ci-dessus va cr&eacute;er une escalade pour les services appel&eacute;s <i>SOMESERVICE</i> sur les h&ocirc;tes <i>HOST1</i> &agrave; <i>HOSTN</i>. Toutes les instance de l'escalade de service seront identiques (c.-&agrave;-d. auront le m&ecirc;me groupe de contact, le m&ecirc;me intervalle de notification, etc.).
</p>

<p>
<b>Tous les h&ocirc;tes de multiples groupes d'h&ocirc;tes :</b> Si vous d&eacute;sirez cr&eacute;er une escalade de service pour des services portant le m&ecirc;me nom/description, et qui sont assign&eacute;s &agrave; tous les h&ocirc;tes dans un ou plusieurs groupes d'h&ocirc;tes, vous pouvez sp&eacute;cifier dans le param&eacute;tre <i>hostgroup_name</i> :
</p>

<p>
<pre>
	define <i>serviceescalation</i>{
		<font color="red">hostgroup_name		<i>HOSTGROUP1,HOSTGROUP2,...,HOSTGROUPN</i></font>
		<font color="red">service_description	<i>SOMESERVICE</i></font>
		<i>other escalation directives</i> ...
		}

</pre>
</p>

<p>
La d&eacute;finition ci-dessus va cr&eacute;er une escalade pour les services appel&eacute;s <i>SOMESERVICE</i> sur tous les h&ocirc;tes membres des groupes <i>HOSTGROUP1</i> &agrave; <i>HOSTGROUPN</i>. Toutes les instance de l'escalade de service seront identiques (c.-&agrave;-d. auront le m&ecirc;me groupe de contact, le m&ecirc;me intervalle de notification, etc.).
</p>

<p>
<b>Tous les h&ocirc;tes :</b> Si vous d&eacute;sirez cr&eacute;er une escalade de service identique pour des services portant le m&ecirc;me nom/description, et qui sont assign&eacute;s &agrave; tous les h&ocirc;tes d&eacute;finis dans vos fichiers de configuration, vous pouvez utiliser un caract&egrave;re de remplacement dans la directive <i>host_name</i> de la mani&egrave;re suivante :
</p>

<p>
<pre>
	define <i>serviceescalation</i>{
		<font color="red">host_name		<i>*</i></font>
		<font color="red">service_description	<i>SOMESERVICE</i></font>
		<i>other escalation directives</i> ...
		}

</pre>
</p>

<p>
La d&eacute;finition ci-dessus va cr&eacute;er une escalade pour tous les services appel&eacute;s <i>SOMESERVICE</i> de <b>tous les h&ocirc;tes</b> d&eacute;finis dans vos fichiers de configuration. Toutes les instance de l'escalade de service seront identiques (c.-&agrave;-d. auront le m&ecirc;me groupe de contact, le m&ecirc;me intervalle de notification, etc.).
</p>


<p>
<b>Tous les services d'un m&ecirc;me h&ocirc;te :</b> Si vous voulez cr&eacute;er une <a href="xodtemplate.html#serviceescalation">escalade de service</a> pour tous les services assign&eacute;s &agrave; un h&ocirc;te pr&eacute;cis, vous pouvez utiliser un caract&egrave;re de remplacement dans le param&eacute;tre <i>service_description</i> de la mani&egrave;re suivante :

</p>

<p>
<pre>
	define <i>serviceescalation</i>{
		<font color="red">host_name		<i>HOST1</i></font>
		<font color="red">service_description	<i>*</i></font>
		<i>other escalation directives</i> ...
		}

</pre>
</p>

<p>
La d&eacute;finition ci-dessus va cr&eacute;er une escalade pour <b>tous</b> les services de l'h&ocirc;te <i>HOST1</i>. Toutes les instance de l'escalade de service seront identiques (c.-&agrave;-d. auront le m&ecirc;me groupe de contact, le m&ecirc;me intervalle de notification, etc.).
</p>

<p>
Si vous vous sentez l'esprit particuli&egrave;rement aventureux, vous pouvez sp&eacute;cifier un caract&egrave;re de remplacement &agrave; la fois dans les param&eacute;tres <i>host_name</i> et <i>service_description</i>. Cela cr&eacute;era une escalade de service pour <b>tous les services</b> d&eacute;finis dans vos fichiers de configuration.
</p>

<p>
<b>Services multiples du m&ecirc;me h&ocirc;te :</b> Si vous souhaitez cr&eacute;er une <a href="xodtemplate.html#serviceescalation">escalade de service</a> pour plusieurs services assign&eacute;s &agrave; un h&ocirc;te pr&eacute;cis, vous pouvez sp&eacute;cfier plusieurs descriptions de service dans le param&eacute;tre <i>service_description</i> de la mani&egrave;re suivante :
</p>

<p>
<pre>
	define <i>serviceescalation</i>{
		<font color="red">host_name		<i>HOST1</i></font>

		<font color="red">service_description	<i>SERVICE1,SERVICE2,...,SERVICEN</i></font>
		<i>other escalation directives</i> ...
		}
</pre>
</p>

<p>
La d&eacute;finition ci-dessus va cr&eacute;er une escalade pour les services <i>SERVICE1</i> &agrave; <i>SERVICEN</i> de l'h&ocirc;te <i>HOST1</i>. Toutes les instance de l'escalade de service seront identiques (c.-&agrave;-d. auront le m&ecirc;me groupe de contact, le m&ecirc;me intervalle de notification, etc.).
</p>

<p>
<b>Tous les Services de multiples groupes de services :</b> Si vous voulez cr&eacute;er des escalades de service pour tous les services appartenant &agrave; un ou plusieurs groupes de services, vous pouvez utiliser le param&eacute;tre <i>servicegroup_name</i> comme suit :
</p>

<p>
<pre>
	define <i>serviceescalation</i>{
		<font color="red">servicegroup_name		<i>SERVICEGROUP1,SERVICEGROUP2,...,SERVICEGROUPN</i></font>

		<i>other escalation directives</i> ...
		}
</pre>
</p>

<p>
La d&eacute;finition ci-dessus va cr&eacute;er une escalade pour tous les services membres des groupes de services <i>SERVICEGROUP1</i> &agrave; <i>SERVICEGROUPN</i>. Toutes les instance de l'escalade de service seront identiques (c.-&agrave;-d. auront le m&ecirc;me groupe de contact, le m&ecirc;me intervalle de notification, etc.).
</p>


<a name="servicedependency"></a>
<p>
<strong><u>D&eacute;finitions de d&eacute;pendance de service</u></strong>
</p>

<p>
<b>H&ocirc;tes multiples :</b> Si vous souhaitez cr&eacute;er des <a href="xodtemplate.html#servicedependency">d&eacute;pendances de service</a> pour des services portant le m&ecirc;me nom/description, et qui sont assign&eacute;s &agrave; plusieurs h&ocirc;tes, vous pouvez sp&eacute;cifier de multiples h&ocirc;tes dans les param&eacute;tres <i>host_name</i> et/ou <i>dependent_host_name</i> comme suit :
</p>

<p>
<pre>
	define <i>servicedependency</i>{
		<font color="red">host_name			<i>HOST1,HOST2</i></font>
		<font color="red">service_description		<i>SERVICE1</i></font>
		<font color="red">dependent_host_name		<i>HOST3,HOST4</i></font>

		<font color="red">dependent_service_description	<i>SERVICE2</i></font>
		<i>other dependency directives</i> ...
		}
</pre>
</p>

<p>
Dans l'exemple ci-dessus, le service <i>SERVICE2</i> des h&ocirc;tes <i>HOST3</i> et <i>HOST4</i> sera d&eacute;pendant du service <i>SERVICE1</i> des h&ocirc;tes <i>HOST1</i> et <i>HOST2</i>. Toutes les instances de la d&eacute;pendance de service seront identiques, mis &agrave; part les noms d'h&ocirc;tes (c.-&agrave;-d. auront le m&ecirc;me crit&egrave;re d'&eacute;chec de notification, etc.).
</p>

<p>
<b>Tous les h&ocirc;tes de multiples groupes d'h&ocirc;tes :</b> Si vous voulez cr&eacute;er des d&eacute;pendances de service pour des services portant le m&ecirc;me nom/description, et qui sont assign&eacute;s &agrave; tous les h&ocirc;tes d'un ou plusieurs groupes d'h&ocirc;tes, vous pouvez utiliser le param&eacute;tre <i>hostgroup_name</i> et/ou <i>dependent_hostgroup_name</i> comme suit :
</p>

<p>
<pre>
	define <i>servicedependency</i>{
		<font color="red">hostgroup_name			<i>HOSTGROUP1,HOSTGROUP2</i></font>

		<font color="red">service_description		<i>SERVICE1</i></font>
		<font color="red">dependent_hostgroup_name	<i>HOSTGROUP3,HOSTGROUP4</i></font>
		<font color="red">dependent_service_description	<i>SERVICE2</i></font>
		<i>other dependency directives</i> ...
		}
</pre>

</p>

<p>
Dans l'exemple ci-dessus, le service <i>SERVICE2</i> de tous les h&ocirc;tes membres des groupes d'h&ocirc;tes <i>HOSTGROUP3</i> et <i>HOSTGROUP4</i> seront d&eacute;pendant du service <i>SERVICE1</i> de tous les h&ocirc;tes membres des groupes d'h&ocirc;tes <i>HOSTGROUP1</i> et <i>HOSTGROUP2</i>. Si l'on suppose qu'il y a cinq h&ocirc;tes dans chacun des groupes d'h&ocirc;tes, cette d&eacute;finition &eacute;quivaut &agrave; cr&eacute;er 100 d&eacute;finitions simples de d&eacute;pendance de service ! Toutes les instances de la d&eacute;pendance de service seront identiques, mis &agrave; part les noms d'h&ocirc;tes (c.-&agrave;-d. auront le m&ecirc;me crit&egrave;re d'&eacute;chec de notification, etc.).
</p>

<p>
<b>Tous les services d'un m&ecirc;me h&ocirc;te :</b> Si vous voulez cr&eacute;er des d&eacute;pendances de service pour tous les services assign&eacute;s &agrave; un h&ocirc;te pr&eacute;cis, vous pouvez utiliser un caract&egrave;re de remplacement dans les param&eacute;tres <i>service_description</i> et/ou <i>dependent_service_description</i> comme suit :
</p>

<p>
<pre>
	define <i>servicedependency</i>{
		<font color="red">host_name			<i>HOST1</i></font>

		<font color="red">service_description		<i>*</i></font>
		<font color="red">dependent_host_name		<i>HOST2</i></font>
		<font color="red">dependent_service_description	<i>*</i></font>
		<i>other dependency directives</i> ...
		}
</pre>

</p>

<p>
Dans l'exemple ci-dessus, <b>tous les services</b> de l'h&ocirc;te <i>HOST2</i> seront d&eacute;pendants de <b>tous les services</b> de l'h&ocirc;te <i>HOST1</i>. Toutes les instances de la d&eacute;pendance de service seront identiques (c.-&agrave;-d. auront le m&ecirc;me crit&egrave;re d'&eacute;chec de notification, etc.).
</p>

<p>
<b>Services muiltiples d'un m&ecirc;me h&ocirc;te :</b> Si vous voulez cr&eacute;er des d&eacute;pendances de service pour plusieurs services assign&eacute;s &agrave; un h&ocirc;te pr&eacute;cis, vous pouvez sp&eacute;cifier plusieurs descriptions de service dans les param&eacute;tres <i>service_description</i> et/ou <i>dependent_service_description</i> comme suit :
</p>

<p>
<pre>
	define <i>servicedependency</i>{
		<font color="red">host_name			<i>HOST1</i></font>

		<font color="red">service_description		<i>SERVICE1,SERVICE2,...,SERVICEN</i></font>
		<font color="red">dependent_host_name		<i>HOST2</i></font>
		<font color="red">dependent_service_description	<i>SERVICE1,SERVICE2,...,SERVICEN</i></font>
		<i>other dependency directives</i> ...
		}
</pre>

</p>

<p>
<b>Tous les services de multiples groupes de service :</b> Si vous voulez cr&eacute;er des d&eacute;pendances de service pour tous les services appartenant &agrave; un ou plusieurs groupes de services, vous pouvez utiliser les param&eacute;tres <i>servicegroup_name</i> et/ou <i>dependent_servicegroup_name</i> comme suit :
</p>

<p>
<pre>
	define <i>servicedependency</i>{
		<font color="red">servicegroup_name		<i>SERVICEGROUP1,SERVICEGROUP2,...,SERVICEGROUPN</i></font>

		<font color="red">dependent_servicegroup_name	<i>SERVICEGROUP3,SERVICEGROUP4,...SERVICEGROUPN</i></font>
		<i>other escalation directives</i> ...
		}
</pre>
</p>


<a name="hostescalation"></a>
<p>
<strong><u>D&eacute;finitions d'escalade d'h&ocirc;te</u></strong>
</p>

<p>
<b>H&ocirc;tes multiples :</b> Si vous souhaitez cr&eacute;er des <a href="xodtemplate.html#hostescalation">escalades d'h&ocirc;te</a> pour plusieurs h&ocirc;tes, vos pouvez sp&eacute;cifier plusieurs h&ocirc;tes dans le param&eacute;tre <i>host_name</i> comme suit :
</p>

<p>
<pre>
	define <i>hostescalation</i>{
		<font color="red">host_name		<i>HOST1,HOST2,HOST3,...,HOSTN</i></font>

		<i>other escalation directives</i> ...
		}
</pre>
</p>

<p>
La d&eacute;finition ci-dessus cr&eacute;era une escalade d'h&ocirc;te pour les h&ocirc;tes <i>HOST1</i> &agrave; <i>HOSTN</i>. Toutes les instances de l'escalade d'h&ocirc;te seront identiques (c.-&agrave;-d. auront les m&ecirc;mes groupes de contacts, le m&ecirc;me intervalle de notification, etc.).
</p>

<p>

<b>Tous les h&ocirc;tes de multiples groupes d'h&ocirc;tes :</b> Si vous voulez cr&eacute;er des escalades d'h&ocirc;te pour tous les h&ocirc;tes d'un ou plusieurs groupes d'h&ocirc;tes, vos pouvez utiliser le param&eacute;tre <i>hostgroup_name</i> comme suit :
</p>

<p>
<pre>
	define <i>hostescalation</i>{
		<font color="red">hostgroup_name		<i>HOSTGROUP1,HOSTGROUP2,...,HOSTGROUPN</i></font>

		<i>other escalation directives</i> ...
		}
</pre>
</p>

<p>
La d&eacute;finition ci-dessus cr&eacute;era une escalade d'h&ocirc;te sur tous les h&ocirc;tes membres des groupes d'h&ocirc;tes <i>HOSTGROUP1</i> &agrave; <i>HOSTGROUPN</i>.  Toutes les instances de l'escalade d'h&ocirc;te seront identiques (c.-&agrave;-d. auront les m&ecirc;mes groupes de contacts, le m&ecirc;me intervalle de notification, etc.).
</p>

<p>

<b>Tous les h&ocirc;tes :</b> Si vous voulez cr&eacute;er des escalades d'h&ocirc;te identiques pour tous les h&ocirc;tes d&eacute;finis dans vos fichiers de configuration, vous pouvez utiliser un caract&egrave;re de remplacement dans le param&eacute;tre <i>host_name</i> comme suit :
</p>

<p>
<pre>
	define <i>hostescalation</i>{
		<font color="red">host_name		<i>*</i></font>

		<i>other escalation directives</i> ...
		}
</pre>
</p>

<p>
La d&eacute;finition ci-dessus cr&eacute;era une escalade d'h&ocirc;te sur <b>tous les h&ocirc;tes</b> d&eacute;finis dans vos fichiers de configuration. Toutes les instances de l'escalade d'h&ocirc;te seront identiques (c.-&agrave;-d. auront les m&ecirc;mes groupes de contacts, le m&ecirc;me intervalle de notification, etc.).
</p>


<a name="hostdependency"></a>
<p>

<strong><u>D&eacute;finitions de d&eacute;pendance d'h&ocirc;te</u></strong>
</p>

<p>
<b>H&ocirc;tes multiples :</b> Si vous voulez cr&eacute;er des <a href="xodtemplate.html#hostdependency">d&eacute;pendances d'h&ocirc;te</a> pour plusieurs h&ocirc;tes, vous pouvez sp&eacute;cifier plusieurs h&ocirc;tes dans les param&eacute;tres <i>host_name</i> et/ou <i>dependent_host_name</i> comme suit :
</p>

<p>
<pre>
	define <i>hostdependency</i>{
		<font color="red">host_name		<i>HOST1,HOST2</i></font>
		<font color="red">dependent_host_name	<i>HOST3,HOST4,HOST5</i></font>
		<i>other dependency directives</i> ...
		}

</pre>
</p>

<p>
La d&eacute;finition ci-dessus &eacute;quivaut &agrave; cr&eacute;er six d&eacute;pendances d'h&ocirc;te distinctes. Dans cet exemple, les h&ocirc;tes <i>HOST3</i>, <i>HOST4</i> et <i>HOST5</i> seront d&eacute;pendants &agrave; la fois d'<i>HOST1</i> et de <i>HOST2</i>. Toutes les instances de la d&eacute;pendance d'h&ocirc;te seront identiques, &agrave; l'exception des noms d'h&ocirc;tes (c.-&agrave;-d. auront le m&ecirc;me crit&egrave;re d'&eacute;chec de notification, etc.).

</p>

<p>
<b>Tous les h&ocirc;tes de multiples groupes d'h&ocirc;tes :</b> Si vous voulez cr&eacute;er des d&eacute;pendances d'h&ocirc;te pour tous les h&ocirc;tes d'un ou plusieurs groupes d'h&ocirc;tes, vous pouvez utiliser les param&eacute;tres <i>hostgroup_name</i> et/ou <i>dependent_hostgroup_name</i> comme suit :
</p>

<p>
<pre>
	define <i>hostdependency</i>{
		<font color="red">hostgroup_name			<i>HOSTGROUP1,HOSTGROUP2</i></font>

		<font color="red">dependent_hostgroup_name	<i>HOSTGROUP3,HOSTGROUP4</i></font>
		<i>other dependency directives</i> ...
		}
</pre>
</p>

<p>
Dans l'exemple ci-dessus, tous les h&ocirc;tes des groupes d'h&ocirc;tes <i>HOSTGROUP3</i> et <i>HOSTGROUP4</i> seront d&eacute;pendants de tous les h&ocirc;tes des groupes d'h&ocirc;tes <i>HOSTGROUP1</i> et <i>HOSTGROUP2</i>.  Toutes les instances de la d&eacute;pendance d'h&ocirc;te seront identiques, &agrave; l'exception des noms d'h&ocirc;tes (c.-&agrave;-d. auront le m&ecirc;me crit&egrave;re d'&eacute;chec de notification, etc.).

</p>

<a name="hostgroup"></a>
<p>
<strong><u>Groupes d'h&ocirc;tes</u></strong>
</p>

<p>
<b>Tous les h&ocirc;tes :</b> Si vous souhaitez cr&eacute;er un groupe d'h&ocirc;te contenant tous les h&ocirc;tes d&eacute;finis dans vos fichiers de configuration, vous pouvez utiliser un caract&egrave;re de remplacement dans le param&eacute;tre <i>members</i> de la mani&egrave;re suivante :
</p>

<p>
<pre>
	define <i>hostgroup</i>{
		<i>hostgroup_name</i>		<i>HOSTGROUP1</i>
		<font color="red">members			<i>*</i></font>
		<i>other hostgroup directives</i> ...
		}

</pre>
</p>

<p>
La d&eacute;finition ci-dessus cr&eacute;era un groupe d'h&ocirc;tes appel&eacute; <i>HOSTGROUP1</i> contenant <b>tous les h&ocirc;tes</b> d&eacute;finis dans vos fichiers de configuration.
</p>


<hr>

</body>

</html>
