<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<HEAD>
<TITLE>Les P&eacute;riodes</TITLE>

<STYLE type="text/css">
<!--
        .Default { font-family: verdana,arial,serif; font-size: 8pt; }
        .PageTitle { font-family: verdana,arial,serif; font-size: 12pt; font-weight: bold; }
-->      
</STYLE>

</HEAD>

<body bgcolor="#FFFFFF" text="black" class="Default">

<p>
<div align="center">
<h2 class="PageTitle">Les P&eacute;riodes</h2><br />
or...<br />
<b>"Est-ce le bon moment ?"</b>
</div>
</p>
<hr>

<p>
<strong><u>Introduction</u></strong>
</p>

<p>
Les p&eacute;riodes vous permettent une meilleure ma&icirc;trise sur le moment o&ugrave; les contr&ocirc;les de service peuvent &ecirc;tre lanc&eacute;s, celui o&ugrave; les notifications d'h&ocirc;tes et de services peuvent &ecirc;tre envoy&eacute;es, et celui o&ugrave; les contacts peuvent recevoir les notifications. 
Cette nouvelle fonctionnalit&eacute; vient avec quelques probl&egrave;mes potentiels, que je l'expliquerai plus loin.
J'ai &eacute;t&eacute; tr&egrave;s r&eacute;ticent au d&eacute;but &agrave; introduire les p&eacute;riodes &agrave; cause de ces "<i>snafus</i>" [NdT : acronyme de Situation Normal All Fucked Up, qui peut se traduire par : La situation est compl&egrave;tement normale, puisque tout le syst&egrave;me est mort ]. 
Je vous laisse d&eacute;cider de ce qui est bon dans votre propre cas...
</p>

<p>
<a name="checks"></a>
<strong><u>Comment les p&eacute;riodes fonctionnent pour les contr&ocirc;les de service</u></strong>
</p>

<p>
Sans l'impl&eacute;mentation des p&eacute;riodes, Nagios superviserait tous les services que vous auriez d&eacute;fini 24 heures sur 24, 7 jours sur 7.
Bien que cela convienne &agrave; la plupart des services &agrave; superviser, cela ne fonctionne pas si bien pour certains.
Par exemple, avez-vous r&eacute;ellement besoin de superviser les imprimantes en permanence alors qu'elles ne sont utilis&eacute;es uniquement pendant les heures de bureau ? 
Peut-&ecirc;tre avez-vous des serveurs de d&eacute;veloppement dont vous pr&eacute;f&eacute;reriez qu'ils soient en fonctionnement, mais qui ne sont pas "critiques" et qui n'ont donc pas besoin d'&ecirc;tre contr&ocirc;l&eacute;s pendant le weekend.
Les d&eacute;finitions de p&eacute;riodes vous permettent maintenant de mieux ma&icirc;triser les horaires de supervision de ces machines...
</p>
<p>
L'argument &lt;<i>check_period</i>&gt; de chaque d&eacute;finition de service vous permet de sp&eacute;cifier une p&eacute;riode qui renseigne Nagios sur le moment o&ugrave; le service doit &ecirc;tre contr&ocirc;l&eacute;. 
Quand Nagios essaie de r&eacute;ordonnancer un contr&ocirc;le de service, il s'assurera que la prochain v&eacute;rification tombe dans une plage de temps valide &agrave; l'int&eacute;rieur de la p&eacute;riode d&eacute;finie.
Dans le cas contraire, Nagios ajustera le moment du prochain contr&ocirc;le de service pour co&iuml;ncider avec le prochain moment "valide" dans la p&eacute;riode sp&eacute;cifi&eacute;e. 
Cela signifie que le service peut ne pas &ecirc;tre recontr&ocirc;l&eacute; avant une heure, un jour, ou une semaine, etc.
</p>

<p>
<a name="check_problems"></a>
<strong><u>Probl&egrave;mes potentiels li&eacute;s aux contr&ocirc;les de services</u></strong>
</p>

<p>
Si vous utilisez des p&eacute;riodes qui ne couvrent pas une plage de 24h/24, 7j/7, vous aurez des probl&egrave;mes, surtout si un service (ou l'h&ocirc;te correspondant) est hors fonction alors que le contr&ocirc;le a &eacute;t&eacute; d&eacute;cal&eacute; au prochain moment valide de la p&eacute;riode. 
Voici quelques uns de ces probl&egrave;mes...
</p>
<p>
<ol>
<li>Les contacts ne seront pas notifi&eacute; &agrave; nouveau de probl&egrave;mes sur un service jusqu'&agrave; ce que le prochain contr&ocirc;le puisse avoir lieu.
<li>Si un service se r&eacute;tablit &agrave; un moment qui a &eacute;t&eacute; exclu de la p&eacute;riode de contr&ocirc;le, les contacts ne recevront pas de notification du r&eacute;tablissement.
<li>L'&eacute;tat du service ne changera pas (dans le journal des &eacute;tats et le CGI) jusqu'&agrave; ce qu'il puisse &ecirc;tre recontr&ocirc;l&eacute;.
<li>Si tous les services associ&eacute;s avec un h&ocirc;te particulier ont la m&ecirc;me p&eacute;riode de contr&ocirc;le, les probl&egrave;mes de l'h&ocirc;te ou son r&eacute;tablissement ne seront pas d&eacute;tect&eacute;s jusqu'&agrave; ce qu'un des services puisse &ecirc;tre contr&ocirc;l&eacute; (et donc les notifications peuvent &ecirc;tre retard&eacute;es ou ne pas &ecirc;tre envoy&eacute;es du tout).
</ol>
</p>
</p>
<p>
Limiter la p&eacute;riode de contr&ocirc;le de service &agrave; autre chose que 24 heures sur 24, 7 jours sur 7 peut causer de nombreux probl&egrave;mes. 
En fait, pas tant des probl&egrave;mes que des d&eacute;sagr&eacute;ments et des inexactitudes... 
A moins que vous n'ayez une bonne raison de le faire, je vous recommande fortement de d&eacute;finir dans l'argument &lt;<i>check_period</i>&gt; de chaque service une p&eacute;riode de type "24x7".
</p>

<p>
<a name="notifications"></a>
<strong><u>Comment les p&eacute;riodes fonctionnent pour les notifications aux contacts</u></strong>
</p>

<p>
Le meilleur usage que vous puissiez probablement faire des p&eacute;riodes est de g&eacute;rer le moment auquel les notifications peuvent &ecirc;tre envoy&eacute;es aux contacts.
En utilisant les arguments &lt;<i>service_notification_period</i>&gt; et &lt;<i>host_notification_period</i>&gt; dans les d&eacute;finitions de contact, vous pouvez d&eacute;finir une p&eacute;riode de disponibilit&eacute; pour chaque contact.
Notez que vous pouvez d&eacute;finir des p&eacute;riodes diff&eacute;rentes pour les notifications d'h&ocirc;te et de service. 
Ceci peut &ecirc;tre utile si vous voulez que les notifications d'h&ocirc;tes soient envoy&eacute;es au contact n'importe quel jour de la semaine, mais que les notifications de service ne soient envoy&eacute;es que les jours ouvrables.
Il faut savoir que ces deux p&eacute;riodes de notification doivent couvrir tous les moments o&ugrave; le contact peut recevoir la notification. 
Vous pouvez d&eacute;finir les p&eacute;riodes de notification pour des services ou des h&ocirc;tes de mani&egrave;re sp&eacute;cifique de la mani&egrave;re suivante...
</p>
<p>
En d&eacute;finissant l'argument &lt;<i>notification_period</i>&gt; de la d&eacute;finition d'h&ocirc;te, vous g&eacute;rez les moments o&ugrave; Nagios est autoris&eacute; &agrave; envoyer des notifications concernant les probl&egrave;mes ou les r&eacute;tablissements de cet h&ocirc;te. 
Quand une notification d'h&ocirc;te est pr&ecirc;te &agrave; partir, Nagios s'assurera que le moment pr&eacute;sent fait partie d'une plage valide de la p&eacute;riode &lt;<i>notification_period</i>&gt;.
Si c'est un moment valide, alors Nagios tentera de notifier chaque contact du probl&egrave;me de l'h&ocirc;te. 
Certains contacts peuvent ne pas recevoir la notification d'h&ocirc;te si leur argument &lt;<i>host_notification_period</i>&gt; n'autorise pas les notifications d'h&ocirc;tes &agrave; ce moment.
Si le moment <i>n'est pas</i>  valide au sein de l'argument &lt;<i>notification_period</i>&gt; d&eacute;fini pour l'h&ocirc;te, Nagios n'enverra la notification &agrave; <i>aucun</i> contact.
</p>
<p>
Vous pouvez sp&eacute;cifier les moments de notification pour les services de la m&ecirc;me mani&egrave;re que pour les h&ocirc;tes.
En d&eacute;finissant l'argument &lt;<i>notification_period</i>&gt; vous pouvez g&eacute;rer les moments o&ugrave; Nagios est autoris&eacute; &agrave; envoyer des notifications concernant les probl&egrave;mes ou les r&eacute;tablissement de ce service.
Quand une notification de service est pr&ecirc;te &agrave; partir, Nagios s'assurera que le moment pr&eacute;sent fait partie d'une plage valide de la p&eacute;riode &lt;<i>notification_period</i>&gt;.
 Si c'est un moment valide, alors Nagios tentera de notifier chaque contact du probl&egrave;me du service.
Certains contacts peuvent ne pas recevoir la notification de service si leur argument &lt;<i>svc_notification_period</i>&gt; n'autorise pas les notifications de service &agrave; ce moment.
Si le moment <i>n'est pas</i>  valide au sein de l'argument &lt;<i>notification_period</i>&gt; d&eacute;fini pour le service, Nagios n'enverra la notification &agrave; <i>aucun</i> contact.
</p>

<p>
<a name="notification_problems"></a>
<strong><u>Probl&egrave;mes potentiels li&eacute;s aux notifications de contact</u></strong>
</p>

<p>
Il n'y a pas r&eacute;ellement de probl&egrave;mes majeurs li&eacute;s &agrave; l'utilisation de p&eacute;riodes pour la notification des contacts. 
Vous devez toutefois &ecirc;tre conscients que des contacts peuvent ne pas toujours recevoir notification de probl&egrave;mes ou de r&eacute;tablissements d'h&ocirc;tes ou de services. 
Si le moment n'est pas correct &agrave; la fois pour la p&eacute;riode de notification de l'h&ocirc;te ou du service, et la p&eacute;riode de notification du contact, la notification ne partira pas. 
Une fois que vous avez bien pes&eacute; les probl&egrave;mes potentiels qu'am&egrave;ne la restriction des moments de notification par rapport &agrave; vos besoins, vous devriez pouvoir mettre en place une configuration adapt&eacute;e &agrave; votre situation.
</p>

<p>
<a name="conclusion"></a>
<strong><u>Conclusion</u></strong>
</p>

<p>
Les p&eacute;riodes vous donnent une meilleure ma&icirc;trise de la fa&ccedil;on dont Nagios r&eacute;alise la supervision et les notifications, mais peut amener des probl&egrave;mes.
Si vous ne savez pas trop quelles p&eacute;riodes impl&eacute;menter, ou si votre impl&eacute;mentation pose des probl&egrave;mes, je vous sugg&egrave;re d'utiliser des p&eacute;riodes "24x7" (o&ugrave; toutes les heures sont valides tous les jours de la semaine).
N'h&eacute;sitez pas &agrave; me contacter si vous avez des questions ou si vous rencontrez des probl&egrave;mes.
</p>

<hr>

</body>
</html>